{"signature": ["Dx", "TURBT", "Dx", "BCG", "BCG"], "posts": [{"text": "\n\t\t\t\tThanks folks. I spoke to my doc and he said to just do some bladder excersizes and stop liquids 2 hours before bed...so far so good....but boy it really is not a fun experience thats for sure.\n\nThe doc does not want to give me any meds for it, which i like, so I will just relax and get back to a normalish life.\n\nI have been told that it could take up to a year or so to \"retrain\" the bladder......so as long as the cancer is in the background and under control, I can deal with it.\n\nI will check back in when I can, but as always, this website is awesome.\n\nalanlee\t\t\t", "date": "2011-02-18T04:41:21+00:00", "topic": "Update on me", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tthx sara.anne....I will share the report when I get it.....you folks are very supportive.\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tthx sara.anne....I will share the report when I get it.....you folks are very supportive.\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWell, finally had my second treatment and its been ok for 2 days now. No bleeding, just a bad day after having the stuff. Felt really tired, weak and achy. Next morning I felt fine, so maybe that is the pattern for me. Next Wednesday for treatment number 3 then I am off for the holiday.\n\nIf I dont get a chance, let me wish everyone a happy holiday, merry Christmas, and happy new year. I hope 2015 will be a year of health and wellness for all.\n\nalanlee\t\t\t", "date": "2014-11-22T16:20:19+00:00", "topic": "BCG Treatments Questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can relate to being scared, and to me it seems absurd that your doctor cannot answer your questions. I myself am concerned about missing ONE treatment, so I am with you.....but try to find another doctor for another opinion, even a phone call or something.\n\nWishing you well!\nalanlee\t\t\t", "date": "2014-11-22T16:20:19+00:00", "topic": "BCG Treatments Questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tyou didnt mess up Mike! I had the cancerous tumors removed the first time! Non-invasive and I guess superficial, but it is in there but not nearly as bad as many other folks. I just feel great that I can come here and vent and learn! You folks are wonderful.\t\t\t", "date": "2012-11-15T04:24:38+00:00", "topic": "Just saying hi", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi folks, no I have not had BCG, and the first operation was to remove the non invasive tumors, the second was to do the turpT, the third was that he did not like what he saw on a cysto but the biopsy came back negative (scar tissue), the fourth was the same but he had to take more of the prostate because it grew back somewhat, biopsy was negative. This would have been #5 I guess.\n\nSo, after the cysto he told me the red spots were nothing to be concerned about unless the urine test came back with something. So far it has not. So he said he could do another cysto in the office and remove or scrape or whatever the reddish spots in about 2 minutes.\n\nWhat is CIS? I need to look that up. Right now I am not freaking out, just my normal panic attacks! LOL   ", "date": "2012-11-15T04:24:38+00:00", "topic": "Just saying hi", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi everyone. It has been awhile since I checked in here, but maybe I just did not even want to talk too much about BC. Now with another fallen star I began reading again and thought I might as well crawl out from my rock to bring folks up to date. Back in April I had another round of TURBT to take some more tissue from the enlarged prostate out, and my doc thought he saw some \"redish areas\" in the bladder. Ok, so I had the damn thing done again and there were no signs of the cancer I was told, but it was not an easy recovery. My body was not responding the way I would have liked and I was much weaker as I attempted to get back to regular routines.\n\nDon't get me wrong, I was thrilled that there has been no recurrence and thus far no more cancer. The anethesia took a long time to leave my body, and I excerise was a little more difficult at 63 yrs old. I went away for the summer and was told my next visit would be in November for the cysto, etc.\n\nRight now I am feeling fine and actually able to exercise a bit more strenously without feeling like crap, but it has taken time and some fight out of me.....I hate anethesia, but hey I wanted to be knocked out and boy was I.\n\nAnyway, I hope everyone here is feeling well, and having good reports in your journeys, and I will let everyone know what is going on after my next test.\n\nAlanlee  ", "date": "2012-09-22T17:09:37+00:00", "topic": "Just checking in abcs", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tthats awesome sara.anne.......live long and prosper!  ", "date": "2011-02-26T01:58:54+00:00", "topic": "FINALLY Good News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know what you mean.....my next cysto is in MAY and I am already panicky......my Ta/G1 is always on my mind, and even though its the lowest grade of non invasive i know that it can change at any time......sort of sucks.\n\nalanlee\t\t\t", "date": "2011-02-26T00:07:19+00:00", "topic": "check up again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have a question maybe someone can shed light on.....I was diagnosed with bladder cancer, Ta/G1, papillary, non invasive non agressive......but will this really screw me up with medicare supplemental when i apply? right now I have a medicare advantage HMO while on SSDI until 65, 4 yrs from now.  ", "date": "2011-02-26T00:54:55+00:00", "topic": "cancer diagnosis and insurance", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am probably not getting enough activity. Your suggestions are spot on and I appreciate your help. I spoke to my surgeon who is considering a stent. I am just so tired of it all.\t\t\t", "date": "2016-06-02T15:02:42+00:00", "topic": "Feeling crappy", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThanks so much Cynthia. I had my bladder removed with the prostate so catheter won't help. My doc just called...confirmed the UTI and if I get worse it's back to the hospital. Tomorrow will be 2 full days on the cipro which he said is the usual amount of time for this to stabilize.\n\nHoping for the best!\t\t\t", "date": "2016-06-02T15:02:42+00:00", "topic": "Feeling crappy", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tWell it is almost 9 months since my RC and I have had several bouts of UTI through the nine months....3 to be exact.....two were hospital stays....Now after about 3 days, I feel like crap. No fever but aches and queasiness and just generally feel lousy. Went to doc, he put me on Cypro while waiting for a culture to come back.\n\nI also advised my surgeon as well...\n\nAnyone else have this issue? It is almost as debilitating as the UTI with fever etc.\n\nThanks in advance\nAlanlee\t\t\t", "date": "2016-06-02T15:02:42+00:00", "topic": "Feeling crappy", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tsorry to hear this stuff......hopefully things will turn for the better and a bit easier for him.\t\t\t", "date": "2011-03-21T07:18:41+00:00", "topic": "My husband is now in Hospital", "subforum": "6-men-and-bladder-cancer"}]}