{"signature": ["Dx", "Surgery", "Surgery"], "posts": [{"text": "\n\t\t\t\tI had my bladder removed 4 and a half years ago and I am just fine.  I also had stage 3, I now have an Ileal Conduit, that is a bag attached to my belly and I am doing everything that I did before cancer.  I for one was very happy when the Dr said that my bladder had to come out.  I just wanted the cancer gone as quick as possible.\nGood luck to your dad and keep the faith.\nBarbara\t\t\t", "date": "2012-10-18T15:32:30+00:00", "topic": "Father has Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had my surgery here in Ocala.  I wasn't offered chemo before and my nodes were clean so I didn't need it after.  I guess I was lucky or had a Dr that didn't know what he was talking about.  I also had an oncologist so I guess maybe he did the right thing.  They always tell you on this site to get a second opinion, maybe that would make you feel better.  Good luck\nBarbara\t\t\t", "date": "2012-12-24T03:25:20+00:00", "topic": "Chemo before or after RC for invasive BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\twhere in Florida are you?  I am in Ocala and had muscle invasive stage 3.  I had my rc 4 and a half years ago and did not have any chemo before or after.  I have an ileal conduit and I am very satisfied with it.  Good luck to you and have positive thoughts.\nBarbara\t\t\t", "date": "2012-12-24T03:25:20+00:00", "topic": "Chemo before or after RC for invasive BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust want to wish you luck in your bc journey.  There are a lot of us who have been through it and are still here to talk about it.  I had stage 3 muscle invasive in June of 08 and am now cancer free.  My oncologist says I am not curred for a few more years.\nMy son just moved to Fayetteville, he is a greyhound trainer and is helping to start a breeding and training farm there.  He says it is beautiful country.\nGood luck\nBarbara\t\t\t", "date": "2012-06-05T17:00:49+00:00", "topic": "Newbie, picture of health until 8 weeks ago,", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome Carol\nSorry you have to be here but as the rest of us have found out it is not impossible and your dad will come through this beast with flying colors.Once again I have to say Mike what a great guy you are and such a comforting and imformitive help you are to all of us.\nBarbara\t\t\t", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMarjorie\nI was diagnosed with invasive high grade urothelial carcinoma on April 28, 2008.\nIn June I had a radical cystectomy with an ileal conduit.\nIt was a very rough surgery and I was in the hospital for 25 days with all kinds of complications but it has been almost 4 years and I do everything now that I did before the diagnosis.  Your mate is very fortunate to have you to care for him. In time he will be back to doing his usual things.Good luck and hang in there.\nBarbara\t\t\t", "date": "2012-03-21T19:10:56+00:00", "topic": "Soul Mate has Bladder Cancer And I\\'m scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome Carol\nSorry you have to be here but as the rest of us have found out it is not impossible and your dad will come through this beast with flying colors.Once again I have to say Mike what a great guy you are and such a comforting and imformitive help you are to all of us.\nBarbara\t\t\t", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome Carol\nSorry you have to be here but as the rest of us have found out it is not impossible and your dad will come through this beast with flying colors.Once again I have to say Mike what a great guy you are and such a comforting and imformitive help you are to all of us.\nBarbara\t\t\t", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome Carol\nSorry you have to be here but as the rest of us have found out it is not impossible and your dad will come through this beast with flying colors.Once again I have to say Mike what a great guy you are and such a comforting and imformitive help you are to all of us.\nBarbara\t\t\t", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree with you GKLINE  Who would want something inside you that would kill you.  not me.\nBarbara\t\t\t", "date": "2011-12-31T05:37:26+00:00", "topic": "My Dad was just diagnosed with bladder cancer-Help", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Sandy\nWelcome to our family.  Sorry you have to be here but we are all really nice.\nI quit smoking for 22 years before I was diagnosed with t3 muscle invasive bladder cancer.  I had a Radical Cystectomy in 2008.  It was very rough but I am doing fine now.  I also had a cystoscope in the office and my ureathea was narrow and had to be dialated.  The Dr didn't give me anything either not even numbing meds and I about climbed off of the table.  It hurt really bad.  He said if he had to do it again he would do it in the hospital and give me a little something.  Under my breath I said there wouldn't be another time.\nAnyway, good luck and do get a 2nd opinion\nBarbara\t\t\t", "date": "2011-12-03T14:27:24+00:00", "topic": "Diagnosed this week", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had my surgeries 6/08 and I still take 3 stool softeners a night.  I just can't seem to go with out them.  I tried and went 4 days and had to start all over again.  Not to discourage you but that is my experience.  Glad you are home.\t\t\t", "date": "2010-11-05T16:56:46+00:00", "topic": "Im  HOME!!!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news\t\t\t", "date": "2012-09-29T00:07:49+00:00", "topic": "Good check up for Doug", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat is #6 that Dougg is talking about, I have only seen 4, you did a great job informing all of us about your journey,  It is no picnic.  Did I tell you that I have a kidney stent?  It goes from my stoma to my kidney, I have it changed every 5 weeks.  I don't mind, without it I would have lost my kidney as the ureter was blocked.  Good luck with your journey.\nBarbara\t\t\t", "date": "2011-11-19T17:31:02+00:00", "topic": "Joining The BC Club: Episode 4", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi JDON\nI get the feeling that the uro doesn't give a hoot about your problems now that they have got your money.  Not nice of me but sometimes I just feel like they blow me off.\nI change my wafer in the morning when the stoma is less active. As I said before I let the water run on the stoma and use soap to clean it.  I clean the area before with an adhesive remover pad because I also use a\nEakin Seal on my wafer.  After I get out of the shower I use the skin barrier to make a good seal and then I use a gauze pad to wipe it dry.  I feel this works good for me.  I also sit on the toilet when I am doing this.  I don't know if things are different for a man or not.  I hope this will help you.  I also feel that no one seems to help with any information, we are on our own with the help of this site.  The people here are just wonderful.  Good luck\nBabsiebob\t\t\t", "date": "2006-06-26T02:09:01+00:00", "topic": "Urostomy Bag Leakage", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tcongratulations George love to hear the good news.\nThanks for explaining the b-12 thing, I get a shot every month but didn't know the reason.  Lol,\nkeep up the good work\nBarbara\t\t\t", "date": "2012-04-13T16:55:06+00:00", "topic": "Friday the 13th", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike is absolutely right about getting up and walking.  You really do feel like you have been hit by a truck but believe me is you don't walk you will pay for it later.  I had a lot of complications and couldn't walk so therefore when I finally got out I had to have Pt for about 3 weeks after getting home.  Best of luck and my prayers are with you.  You can do it, we all did.\nBarbara\t\t\t", "date": "2012-02-06T13:18:59+00:00", "topic": "Possible neo-bladder problem", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi RBH\nI also have an ileal conduit and have the pink ring.  I think it is just from the pouch sticking to your skin.  Not a problem unless it gets sore and then you use the powder.  Wipe with the skin barrier and then add a little powder, skin barrier and then powder, my stoma nurse told me to do that 3 times.  Make sure the pwoder is rubbed in before you put the wafer back on as it will not stick where the powder has been.  I would also suggest that you use an Ekin Seal on the wafer.  They are great for sticking and preventing leaks.  Good luck.\nBarbra\t\t\t", "date": "2011-08-18T18:59:14+00:00", "topic": "Is this pink skin ring a problem?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlanjay\nWhen I told you to stretch the seal and put it on the widest part of the wafer, what I should have said is to put it on about the middle of the wafer.  There is a pard part on the outside of the wafer, put it on the outer part of that.  I hope this makes sense, sorry if I am confusing you.\nBarbara\t\t\t", "date": "2011-04-18T21:20:46+00:00", "topic": "Recent POST-OP", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi\nalanjay\n\nI am so happy that this works for you, it will get better with time.  I don't think it is any more frustrating than to go through all of the steps and then to have the wafer not stick.  Glad I could help\nBarbara\t\t\t", "date": "2011-04-18T21:20:46+00:00", "topic": "Recent POST-OP", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi alanjay\nI just carefully peel off the wafer with the seal on.  Then I use adhesive remover pad to take excess seal off,  then I take a shower.\nuse skin barrier pad all around the place where the sticky part of wafer will go.  I let it dry but I also wipe it dry with a gauze pad.  I stretch the seal till it goes on the widest part of stickey part of wafer and press it to fit in and out.  make sure you are dry and then apply it to your skin and press all around.  attach bag and good luck.  This has worked great for me, you will get better with time.  Hope it works.\nBarbara  I hope you can understand what I have written, I don't know any other way to explain it other than being there to show you.  Lol\t\t\t", "date": "2011-04-18T21:20:46+00:00", "topic": "Recent POST-OP", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Clueless\nGlad to hear things are finally going well.  I was in the hospital with my RC for 25 days and had 2 major surgeries, the second one was to fix the ureter that sprung a leak.  I didn't think I would ever get better.  I developed a fistula besides 3 spots on my incision that would not heal, I too had a wound vac which was a pain in the butt, they are heavy and when you have lost your muscle tone it is very tiring to carry them around.  After almost 3 years I am back to my normal self and feeling great.  I am sure things will be the same for you, Good luck and keep up the good work.\nBarbara\t\t\t", "date": "2011-01-26T20:15:45+00:00", "topic": "home, sweet home", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have also had several uti's and kidney infections.  I had renal failure on 7/1/09. I went in to have a nephy tube put in and my kidney was full of infection.  I crashed on the table during the process.  With the help of God and many good docs, I pulled through that.  After being in the hospital for 7 days, they took the tube and fed it through my ureter to my bag.  I have that changed every 4 to six weeks.  I have had a couple of infections since but nothing like I was having before they put the tube in.  Hope this helps you.  I was also hospitalized on and off 3 times before they found out the problem.  I had my RC in June of 08\nBarbara\t\t\t", "date": "2010-10-15T12:38:18+00:00", "topic": "recurrent uti\\'s and urostomy bag", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad you are home Pat and on the mend.  It is so scary to think what they don't know in the hospital.  Even the docs, some of them, are so dumb you wonder where they got their degrees.  Unfortunately not all of us are as educated as you are and it's a good thing you are.  Hope you are feeling better real soon.\nBarbara\t\t\t", "date": "2011-01-25T05:01:38+00:00", "topic": "I\\'m home..they tried to make me 93,000 and 1", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad you are home Pat and on the mend.  It is so scary to think what they don't know in the hospital.  Even the docs, some of them, are so dumb you wonder where they got their degrees.  Unfortunately not all of us are as educated as you are and it's a good thing you are.  Hope you are feeling better real soon.\nBarbara\t\t\t", "date": "2011-01-25T05:01:38+00:00", "topic": "I\\'m home..they tried to make me 93,000 and 1", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had an RC 2 and a half years ago.  Renal failure in July of 09, due to scar tissue.  I now have a nephy tube from my left kidney to my bag. I had a slight blockage in July of this year and I just went through another full blown blockage this past month with kidney infection.  I had severe kidney pain, similar to labor pains.  I went to my primary yesterday and he gave me Cipro to keep should I get another fever.  When they changed my tube on the 29th of Sept, they flushed it first and it had sludge [puss I think] and crystals that were blocking it.  Things are better right now, but who knows when it will happen again.  Good luck.\nBarbara\t\t\t", "date": "2010-10-11T06:22:32+00:00", "topic": "Kidney pain", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\twelcome aboard, what a story you have to tell, good luck\nBarbara\t\t\t", "date": "2010-08-05T22:57:42+00:00", "topic": "New user with bag since he was 9", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have an ileal conduit and I don't seem to have any problems with it.  Of course I don't know any other way except having a real bladder.\t\t\t", "date": "2010-08-25T20:38:22+00:00", "topic": "Studor Pouch and Ileal Conduit", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Cynthia\nWhat great news.  I am so glad they were able to repair your ureter and you didn't have to have all of the other stuff done.  Sounds like you are taking charge of things again.  Good to hear.  Get better soon.\nBarbara\t\t\t", "date": "2010-03-10T17:41:45+00:00", "topic": "Not so blue in Chicago", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tthanks for your ideas.  I think an antibiotic was in store also but they didn't give me one either time.  It took me the better part of 4 days to feel myself again.  Hopefully I won't have to have another loopogram.  I went to the uro on Thursday and he said the stone that I had on that side didn't show in the ultra sound that I had after the loopogram.  I think the tech used to much force that he blew that out too.  I guess that is a good thing.\nBarbara\t\t\t", "date": "2010-03-05T20:09:09+00:00", "topic": "Loopogram", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t** This thread discusses the content article: \n\tLoopogram\n **\n\nHi\n\nJust wondering if anyone has had a loopogram and if so did you have any side affects from it.  I had my 2nd one on Thursday due to a narrowing of the ureter.  They used a catheter to unblock it but it didn't work so the tech used a bigger one and really pushed the dye in quite fast.  It didn't hurt at the time but that same night when I was going to bed I felt like I had been hit by a truck.  I had the chills but no temp.  I still am not feeling totally normal, almost flu like but no cold or other symptoms.  I had the same thing with the first one but it didn't last as long.  Just wondering.\n\nBarbara\n\n\n\n", "date": "2010-03-05T20:09:09+00:00", "topic": "Loopogram", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Leigh  keep up the good work.\n\nBabsie\t\t\t", "date": "2010-02-04T01:30:19+00:00", "topic": "MRI scan of brain... CLEAN!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHi Flo\nI have kind of the same thing but not blood.  I did have a fistula after my surgery that after 2 weeks of IV TPN healed itself.  I too am wondering if it could be another fistula.  I had a complete hysterectomy in 77 and RC in 08.  I have not asked any doc about this but am thinking that it might be time.  It seems to be always something, why can't it be a cute on our finger or something.\nBarbara\t\t\t", "date": "2012-08-02T16:34:25+00:00", "topic": "fistula??", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tJust thought I would add to the collection.  I have an illeal conduit and I had a staple in my bag.  It was tiny and closed.  I called my uro and asked him if I was coming apart inside.  He laughed and said I could possibly pass more.  Weird.\nBarbara\t\t\t", "date": "2009-09-16T22:55:52+00:00", "topic": "OK..this is a wierd one!!", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi Dana\nI too have a stent.  I have an Ileal Conduit.  I had renal failure 2 years ago due to scar tissue on the ureter.  They put a stent from my kidney to my stoma. It drains into the pouch.  I have it changed every 5 weeks.  It did plug one time due to mucus but they just changed it and I have been fine since.  Good luck with you husband.\nBarbara\t\t\t", "date": "2011-11-13T05:58:11+00:00", "topic": "Finally taking a break", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tWhenever I go to the dr and they ask for a sample I just tell them that I have a bag and they say ok we don't need it.  Sometimes I feel like wearing a sign.\nBarbara\t\t\t", "date": "2010-07-11T13:30:57+00:00", "topic": "Neo bladder infections", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI use stoma powder when I get a rash\t\t\t", "date": "2010-08-22T22:10:50+00:00", "topic": "Cure for Rash", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI am so sorry for your loss.  Please know that you are in my thoughts and prayers.\nBarbara\t\t\t", "date": "2011-12-09T08:17:05+00:00", "topic": "Journey is over!", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tHi hwg\nI had my bladder removed in 08 and have an ileal conduit.  I wouldn't trade it for the others because I don't think I could make it through all of the training you have to do with the others.  It all depends on you and your doc.  Good luck\t\t\t", "date": "2011-01-23T17:09:58+00:00", "topic": "my husband has stage 3", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI know Mike but I was told it was normal by 2 urologists.  It sure does make me wonder.  He just had me come back every year, and the only thing he did each time was a KUB, which showed nothing.  I still say if he did a routine scope at those appointments that the bc would not have even developed.  That is hind sight\nBarbara\t\t\t", "date": "2012-07-14T21:25:45+00:00", "topic": "News Segment on Bladder Cancer.", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tVery interesting.  I had blood in my urine for years, not that I could see, and my uro said it was normal for me.  I think if I had more scopes that they would have found my cancer before it got to be muscle invasive.  That's just my thought.\nBarbara\t\t\t", "date": "2012-07-14T21:25:45+00:00", "topic": "News Segment on Bladder Cancer.", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks everyone for all of your well wishes.\nSee you soon.\nBarbara\t\t\t", "date": "2012-10-23T12:10:12+00:00", "topic": "Miss you", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Birthday Anita, hope all is well with you and Dougg too\t\t\t", "date": "2012-05-30T21:19:22+00:00", "topic": "Birthday alert!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI just wanted to add a little to this conversation.\nIn 1985 my 44 year old brother was dying from lymphoma and asked me to please stop smoking.  I did it for him and this has always been an incentive for me not to smoke again.\nWell when I was diagnosed in 08 with muscle invasive bladder cancer and the urologist said it was from smoking, I told him that I hadn't smoked in 23 years, he told me it didn't matter that the damage had already been done.  I guess if I hadn't stopped all of those years ago things could have been much worse.  I am still here and last Thursday I got a good report from my oncologist.  That is 4 years now but she said I am not cured for another few years.  I guess that is ok as long as I get the good reports.\nSo all of you who are still trying to quit, keep up the good work and you will succeed.\nHappy Memorial Day and thanks to all of our soldiers.\nBarbara\t\t\t", "date": "2012-05-26T13:09:24+00:00", "topic": "Nine months since I quit smoking!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI'm glad it wasn't just me.  I tried all day to get into the site with no luck.  Glad it is back and all is well.\nBarbara\t\t\t", "date": "2012-04-30T22:41:47+00:00", "topic": "Who shut the lights out?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI meant to say filtering through it for all of the past years, it would be a brand new bladder.\nBabsie\t\t\t", "date": "2012-03-18T15:53:45+00:00", "topic": "Growing your own bladder...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThe new bladder would not be subject to all of the bad stuff filtering through it though.  I think it is a great idea.  Wish they had it when I had my surgery.\nBarbara\t\t\t", "date": "2012-03-18T15:53:45+00:00", "topic": "Growing your own bladder...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks everybody, but I can't take the credit. I emailed the picture to Cynthia and she did the rest.  Thanks Cynthia, you are the best.\nBarbara\t\t\t", "date": "2012-01-28T01:46:22+00:00", "topic": "Babsie Love the Picture", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat news Jimswife, keep up the good work.\t\t\t", "date": "2011-07-13T21:45:59+00:00", "topic": "Jim\\'s CT results!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi\nHope you have a great time.  I am looking forward to being at your wedding.\t\t\t", "date": "2010-10-22T18:45:42+00:00", "topic": "Hi  from 31 thousand feet", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tcongratulatons sailorman, hope you have many happy years together\t\t\t", "date": "2010-09-02T00:54:57+00:00", "topic": "Sailorman gets married", "subforum": "17-chit-chat"}]}