{"signature": ["Dx", "TURBT", "BCG", "TURBT", "Surgery"], "posts": [{"text": "\n\t\t\t\tI had a radical cystectomy in Sept. and have the illeal conduit.  I am a 60 year old female who is very active.  The \"bag\" suits me just fine.  I can do everything I did before my surgery and it is very easy to take care of.  People told me that they didn't want a bag hanging on their stomach.  I actually was given no choice since I had ulcerative colitis and the neo and Indiana pouch were not options for me.  I was very diappointed at first but I have had absolutely no problems adjusting.  I walk at least 2 miles a day, do gardening, and went on a trip out of the country for 2 weeks.  If you have any questions, I will be glad to answer them.\n\nThis is a very personal decision and everyone is different.  What may suit one doesn't the other.  I tell people to make a list of the pros and cons of each diversion and match it with your lifestyle and personality.\nBalihigh\t\t\t", "date": "2009-04-04T00:56:43+00:00", "topic": "Just diagnosed with stage 3 CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou are very wise to go ahead and get that monster out of you.  I had my RC in September and have done very well.  I am female and 60 years old.  My doctor told me that they are finding that the sooner you get the bladder out, the better the long term prognosis.  I was relucant to go with the surgery but these people kicked me in the rear and I did what was necessary.  You seem to have a handle on it and I wish the best.\nBalihigh\t\t\t", "date": "2009-03-31T20:53:52+00:00", "topic": "rollercoaster", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI thank all of you for your replies.  When I was diagnosed, I really did not know much about bladder cancer and could not ask the right questions.  I have seen the doctor only once since the surgery and that was when he scheduled my treatments.  I will see him again in early May.  I am trying to learn as much as I can so I can proceed in the right direction.  I am not currently going to UNC Chapel Hill but am considering where to get a second opinion and more if necessary if my cancer has returned.  My doctor is in Greensboro at Alliance Urology.  I am reading books and websites because I don't think you can entirely rely on the doctors.  Yes, there are very good doctors out there and we need them but I feel I must be educated to guide my own treatments.  I have to think that I have some control.  The alternative and complementary medicine is very interesting to me.  I have had a positive attitude through most of my ordeal.  The hardest part was in the beginning waiting for to see the doctor and then waiting for the lab reports.  I am a believer that the mind does play an important part in our health.  Thanks again.\nBalihigh\t\t\t", "date": "2008-04-15T14:44:31+00:00", "topic": "New to Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tQuiltingnanny,\nI am happy to hear that you are doing well but sorry about you bag problems.  I have sent you a couple of hints through the personal email on this site.  If you are like me, I sometimes go several days without seeing that message.\nBalihigh\t\t\t", "date": "2009-04-30T21:58:55+00:00", "topic": "getting better", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNo, I don't know of him but I went to Sloan Kettering in NYC from North Carolina.  They are wonderful and I have no regrets in going so far.  You need someone who treats bladder cancer on a daily basis.  Patricia said she interviewed 7 doctors before deciding on one so you see how important this decision is.  I have heard of some terrible consequences of people who chose to stay close to home with local urologists.  It maybe convenient but this is a special cancer than not every urologist knows how to treat.  I can't say enough about going to a major cancer hospital that specializes in bladder cancer.\n\nBy the way, I have the illeal conduit and am perfectly satisfied with it. I had no choice either and was disappointed at first that I was not a candidate for the other diversions but this one is simple, easy to maintain, and I live a normal life. I have no complaints at all.\nBalihigh\t\t\t", "date": "2009-04-24T21:30:23+00:00", "topic": "BCG , Surgery, and Success Rates", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI actually felt fortunate that it was \"only\" my bladder that I lost.  It can be covered up no matter what diversion you have.  No one has to know and life will continue pretty much as normal.  People lose their limbs, are paralyzed, burned and maigned in all different ways that can't be hidden.  Try to point out the positive with your dad.  Tell him that there are thousands who are living normal lives after bladder cancer.  Even colon cancer and colostomies are worst than urinary diversions.  I know several people who are living with them and believe me, they are harder to deal with than my bag.  Cancer is devastating at first but you must come to terms with it. Life does go on and it can to a good life.\nBalihigh\t\t\t", "date": "2009-04-24T21:30:23+00:00", "topic": "BCG , Surgery, and Success Rates", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPeg,\nI was diagnosed with aggressive (grade 3) in the beginning.  When I first found blood in my urine in Jan. 2008, I was scoped and the doctor found 4 tumors.  I had a TURB followed by 12 BCG + interferon treatments.  In May another tumor was found followed by another TURB and I was scheduled for another 12 treatments.  However, the path report came back as suspicious for invasion.  I opted for a second opinion.\n\nI began the second round of treatments and received 3 more.  However, my new Dr. at Sloan Kettering recommended a radical cystectomy.  I had this operation in Sept. and of course stopped the treatments. I was very lucky in that I had few complications with the surgery and recovered very quickly.  I was pretty much back to normal after 6 weeks but I received an illeal conduit or bag which has less adjustment than the neo or Indiana pouch diversions.  These two diversions are more natural though.  It is a personal decision.\n\nI will be happy to answer any of your questions.\nBalihigh\t\t\t", "date": "2009-04-20T18:21:22+00:00", "topic": "BCG + Interferon", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear from you.  It sounds good to me but I understand the waiting.\nNancy\t\t\t", "date": "2009-01-11T22:27:51+00:00", "topic": "Colonoscopy Anyone?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would be very worried about the recurring tumors if you have high grade bladder cancer.  I don't think it is such an issue if it is low grade.  Yes, staging errors do occur at the labs.  It happened to me.  I was understaged.  My first uro said mine was superficial and actually ignored his own path report that said suspicious for invasion.  That is when I sought a second opinion at Sloan Kettering.\n\nDr. Bochner did another path and said that the tumors had begun invasion although I was lucky that it had not gotten into the muscle.  I opted to just have the bladder removed.  He said that I have more than a 90% chance of long term survival now but it would drop dramatically if it invaded the muscle.  I like life better than my bladder and my life really has not changed.\n\nI credit the members of this site with encouraging me to seek another opinion and then going with the cystectomy.  I was hestitant at first to have the surgery because I thought Dr. Bochner might be a bit hasty but after I read the articles that the members suggested I read, I knew that surgery was the right decision.  Waiting and taking chances with cancer doesn't make sense.\nBalihigh\t\t\t", "date": "2008-12-07T23:35:40+00:00", "topic": "2 BCG Treatments Down - 1 To Go", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI will welcome you too.  I am worried that you have had so many recurrences.  I went through agony deciding what I would do with my cancer.  My second opinion doctor at Sloan Kettering told me that if the BCG did not work and your tumors kept recurring, your best long term treatment was bladder removal.  You can read what I went through and the great advice I got from this site by going to the invasive  bladder cancer topic, go to page 3 and read \"Another Dilemma\" Balihigh.  It maybe helpful to you.  I liked my first doctor too but I found out that his pathologist had not staged me properly.  It was important that I got another opinion-sometimes 3 or 4.\n\nYou have a good team behind you here.  They certainly helped me.\nNancy\t\t\t", "date": "2008-10-30T19:04:26+00:00", "topic": "A Canadian checking in", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank all of you for your help.  Yesterday I called Sloan and my doctor's office to have my records faxed.  S/K said they would get back to me but I haven't heard anything today.  I will call tomorrow if they don't call me first.  I don't know if they have received my records yet.  I am assuming that a doctor will review them before I hear from them.  I will keep you updated on the news and will definitely seek a second opinion.  I am still trying to figure out the doctor's advice.  I can't imagine him telling me what he did.  How could he live with himself if he is wrong and my cancer spread?  Of course I am going elsewhere so it is a mute question but it is not a good commentary of our medical system.\n\nIt is so good to have all of you here supporting me.\nBalihigh\t\t\t", "date": "2008-07-09T00:20:23+00:00", "topic": "Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, Patricia, I did not realize that especially since my uro didn't think it was related.  I began the problem after my BCG treatments were complete but it makes sense that it still could be the cause.  I am going to follow through with the colonoscopy just for peace of mind but it is good to know that about BCG.\nBalihigh\t\t\t", "date": "2008-06-30T22:37:55+00:00", "topic": "digestive problems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am not on any antibiotics or new medicine although when I first went to my family doctor with the diarrhea problem, I was given a week of cipro.  She thought I might have a bacteria infection but it did not help.\nBalihigh\t\t\t", "date": "2008-06-30T22:37:55+00:00", "topic": "digestive problems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was diagnosed with bladder cancer in January, received 12 BCG + interferon treatments, and had a recurrence this month with a second surgery last Thursday.\n\nFor the last couple of months I have had diarrhea everyday.  Has anyone else experienced these problems with bladder cancer?  I saw a gastro doctor last week and am scheduled for a colonoscopy in 2 weeks.  My urologist doesn't think it is related.\n\nThanks,\nBalihigh\t\t\t", "date": "2008-06-30T22:37:55+00:00", "topic": "digestive problems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks everyone for their thoughts and prayers.  Yes, I am scheduled for another TURB in 2 weeks.  I am sure that I will have another round of BCG also.  What makes me so mad about this beast is that it seems to always come on when I am feeling really energetic.  I was set to have a great summer but we know what the BCG does to you not to mention the TURB.  My ambitious plans will be waylaid but that should be the least of my worries.\nBalihigh\t\t\t", "date": "2008-06-11T00:12:32+00:00", "topic": "New Tumor", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was diagnosed with bladder cancer in January, had a TURB (4 tumors, Stage 1 Grade 3)and 12 BCG + Interferon treatments.  I was scoped on May 11 and everything looked clean.  Now less than 4 weeks later I find blood in my urine again.  My doctor is very good at seeing me soon.  I called yesterday at 8 and got a 2:30 appointment.  He found \"a very small tumor\" on the top of my bladder in a different area from the others.\n\nMy question is:  How can a very small tumor cause so much blood? For almost 24 hours there was lots of blood every time I urinated.\n\nNeedless to say I am very discouraged and, I must admit it, frightened again.  As many of you have said, it is a real roller coaster ride.\nBalihigh\t\t\t", "date": "2008-06-11T00:12:32+00:00", "topic": "New Tumor", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI thank all of you for your suggestions.  The support we get and give to each other is essential in this fight.  As I said in my first post, this site has given we much moral support along with the knowledge to realize that we can win.  I think that just knowing that others are experiencing the same emotions that comes with a cancer diagnosis helps.\nThank you,\nBalihigh\t\t\t", "date": "2008-05-14T19:22:44+00:00", "topic": "I have good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow!!!  I really didn't mean to start such a controversial topic.  I actually was only wanting to celebrate my good news that I am cancer free on my first scope but realize that I am no way out of the woods.  I have read several books and lots on the internet but I think what I am doing is quite conservative and am not packing my bags for Mexico.  The melatonin I am taking was recommended by my doctor and the probiotics I learned about from Dr. Lamm and this website.  I haven't taken his vitamins because of some of the posts others have made about complications.  Otherwise I am just trying to eat healthier, worry less, and keep up with my exercise although the BCG treatments have caused me to tire much easier.  I only mentioned the sugar because I had gotten into the habit of eating desert after every meal. Now I am trying to limit it to once or twice a week.  When I say trying, I am oftened tempted to cheat and thinking that it will help me fight this cancer helps.  I agree with Sara Anne that moderation is best and not deny yourself of everything. I appreciate your concern and words of advice.  Yes I know people will spend their savings on pipe dreams and I have no intention of doing that but I feel better when I am taking an active role in my treatment. I am the kind of person that feels they need some control.  I can't leave it all in the hands of my doctor.  Again, I do appreciate your concern and we all need positive reenforcements in this battle.  That is why I have enjoyed reading everyone's posts.\nBalihigh\t\t\t", "date": "2008-05-14T19:22:44+00:00", "topic": "I have good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSince my RC last September, I have had swelling in my right leg, ankle, and foot.  My doctor ordered an ultrasound which showed no blockage or problem with the arteries or veins.  My problem is lymphedemia which is fairly common among people who have had their lymph nodes removed especially breast cancer.  I have gone to physical therapy to learn how to massage my leg and have a special compression stocking I now wear.  I wish I didn't need to do this but it is my side effect and it does help.  I am also going to look into a new surgery that is being done in a couple of locations, MD Anderson for one, to return the flow of lymph in my leg.\nBalihigh\t\t\t", "date": "2009-08-28T18:42:43+00:00", "topic": "Think I\\'ve got \\&amp;quot;May-Thurner Syndrome\\&amp;quot; (MTS)", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was hoping to lose quite a few pounds with my surgery but only lost about 5 pounds which is probably about what they took out of me.  I am not really overweight but always have to watch what I eat.  I always had an appetite.  I remember my husband bringing food into the room the day after my surgery and it smelled so good and I couldn't even have water!!!  I now have gained an extra 10 pounds and need it off.  I walk everyday and an trying but it is hard.  My surgery was last Sept.\nBalihigh\t\t\t", "date": "2009-06-03T13:12:08+00:00", "topic": "Weight Loss After RC and Prostate Removal", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy story is so much like Mikes except I am female and my problem was interstitial cystitis.  For as long as I can remember I had frequent urination.  I knew where every bathroom was in the county and what number the rest areas where on the interstates.  Getting up only 3 times a night was a very good night.  When my interstitial cystitis was really flaring especially after I began BCG treatments, I \"slept\" next to the toilet because I had to get up every 15-30 minutes.\n\nI have the illeal conduit and sleeping all night with the night bag makes up for all the pain and trauma of my RC.  Yes, I am CANCER FREE!!  Life is good and oh, need I mention that I appreciate each day so much more and I am living my life not sweating the small stuff any more. It is strange to say that bladder cancer was almost a blessing for me.\nBalihigh\t\t\t", "date": "2009-06-03T13:24:21+00:00", "topic": "The upside of radical cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBarbara,\nIsn't it funny how northerners move south and southerners move north when they retire. Most of the people in our neighborhood here in NC are from Florida.\n\nI went to your neck of the woods for my surgery-Sloan Kettering in NYC.  I have my 3 month appointment this month so will be returning.  Hope you have a great summer with your family and good health.\nBalihigh\t\t\t", "date": "2009-05-04T01:25:13+00:00", "topic": "I\\'m new at this nasty disease", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI do hope it works out but will understand if there are conflicts.  I just got good news from the doctor's office.  My appointment is next Wed and if everything is okay, we can head home.  It seems like forever since we have been there and I am a little homesick.\nNancy\t\t\t", "date": "2008-09-14T12:34:57+00:00", "topic": "Scarred Urethra", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was pretty much back to normal after 6 weeks with my illeal conduit.  My surgery took 10 hours too but it was done robotically.  You need to walk as much as possible to get your strength back.\nBalihigh\t\t\t", "date": "2009-05-06T23:37:59+00:00", "topic": "Had RC and Prostate Removal Surgery April 30th.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWaiting is definitely the hardest part.  I was so depressed the weeks before my surgery.  I just wanted to go ahead and get it over with.  I had to be done so let's do it. But your surgery is not that far away.  Keeping reading as much as you can and learning.  That will help you.\n\nRemember that I have the illeal conduit and if you have any questions, I will be happy to help you.\nBalihigh\t\t\t", "date": "2009-04-04T00:56:43+00:00", "topic": "Just diagnosed with stage 3 CIS", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had robotic surgery at Sloan and am very pleased with the outcome.  Yes, the surgery was long but the recovery was much faster than others, I think.  I had no staples or stitches for the incision, must be a small one to remove the bladder and it healed quickly.  I was going grocery shopping within 10 days of my surgery and pretty much back to normal after 6 weeks.  I wish you the best.  The worst part is waiting for the surgery.\nBalihigh\t\t\t", "date": "2009-04-04T00:56:43+00:00", "topic": "Just diagnosed with stage 3 CIS", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI read on this site a few months ago about a woman who had about a dozen UTI's in 4 months.  Her urologist recommended a supplement called D Mannose and it can be ordered online from a number of different companies.  I had a couple of UTI's so I ordered some and since I have been taking it, no infections.  It comes in a powder which is tasteless and capsules which I now take just because it is more convenient.\n\nThe way it works is that it prevents the bacteria from sticking to the sides of the bladder or whatever is there and just washes the bacteria away.\n\nI don't know if it will help you.\nBalihigh\t\t\t", "date": "2009-05-06T14:12:22+00:00", "topic": "infections", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust a word of caution.  Don't let the vinegar touch your stoma.  You will cry like a baby!\nBalihigh\t\t\t", "date": "2009-05-06T14:12:22+00:00", "topic": "infections", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am 60 and had my RC in Sept. with an illeal conduit.  Many people think that the bag is the worst diversion but I have been very happy with mine.  I have not experienced any problems and do not even think about the bag being there anymore.  My husband and I just returned from a 2 week trip to India and I did very well.\n\nThe only blip I had was with my first scan after surgery in Dec.  It detected a \"soft tissue prominence\" but my recent MRI last week showed that this nodule was stable and therefore not cancer.  My doctor also scoped my vagina where the nodule was and said everything was normal.  He did the scope only for my peace of mind.\n\nActually my quality of life is better after my RC.  I told my doctor this, thinking he had never heard it before, but he said he hears that all the time especially from people like me who had interstitial cystitis.\nNancy\t\t\t", "date": "2008-09-25T18:33:30+00:00", "topic": "Sister having RC, please help", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so sorry to hear of all your problems.  I certainly hope that the problems have been discovered and that you are on the road to recovery.  You helped me so much during my RC that I wish I could be of more comfort to you now.  Know that I am sending all my positive thoughts your way.\nNancy\t\t\t", "date": "2009-01-18T02:05:50+00:00", "topic": "A new issue", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my RC surgery in Sept. and I did experience blood sugar problems immediately after the surgery.  They would check me 3 times a day and I think they even gave me 2 insulin shots. ( After surgery, I didn't have sense enough to ask what they were giving me but they wanted to give them in my stomach and I protested.  I got them in my arm and I know that is how insulin is given.)\nWhen I left the hospital, my sugar was down to 120 from about 160 and was told to check with my primary care doctor.  I saw her in October and she wanted to wait until Jan for the tests.  Both my urologist and primary care said that surgery does affect sugar level much like a pregnancy can.  Since I was not having any symptoms, she said it was best to wait and I have an appointment for the first week in Jan.\n\nHowever, I have not lost weight.  I was only down about 5 pounds after surgery and that was probably due to everything they took out.  I was hoping to lose more and have fun gaining it back.  I weigh about 120 now.  Hope this helps you some.\nBalihigh\t\t\t", "date": "2008-12-11T20:05:00+00:00", "topic": "Worried about my weight", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMaria, it looks like we are dealing with similiar problems.  Since we are both put in the wait and see mode, that must be standard procedure.  Maybe I will learn some patience with this encounter with cancer.  We live in an instant society and it is hard to adjust.\n\nThanks for your kind words that you wrote in response to my question.  They gave me some peace.\nYes, let's enjoy the holidays.\nNancy\t\t\t", "date": "2008-12-23T19:27:21+00:00", "topic": "Mystery lump", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, Cynthis, for taking the time to look up his email address.  After thinking this over carefully and reading some of the posts here, I really don't think Dr. Bochner would have me wait if he thought I was in immediate danger.  When I first saw him, he had my TURB scheduled within a week and my surgery was 3 weeks later.  He does not wait around.  CT scans can show all different things and the nurse did tell me that it was probably from the surgery.\n\nMy pathology reports showed everything clean outside the bladder and even the bladder only had low grade cells, not the high grade I had in the beginning.  That amazed both me and Dr. Bochner.  I am still happy I had the surgery.  Since I had interstitial cystitis too, I can truly say that my life is better without my bladder than before.  Unless you have experienced 30-40 bathroom trips a day, you can't imagine my happy I am now.  I can even sleep through the night with my night bag!!  Something I haven't been able to do since I was a teenager.\n\nPat, I really don't know how much of the vaginal wall was taken during surgery.  He did not mention that at all so I was assuming none but I cannot be certain of that.\n\nI am coming to terms with this.  I am not going to worry and waste 2 months of my life doing that.  Thanks for all of your concerns.\nNancy\t\t\t", "date": "2008-12-24T13:42:36+00:00", "topic": "What is this?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCynthia,\nEmailing Dr. Bocnher is a great idea.  Do you know his address or how I could get it?  I often email the ostomy nurse and get immediate replies.  This seems easier than a call especially at this time of year.\nThanks, Nancy\t\t\t", "date": "2008-12-24T13:42:36+00:00", "topic": "What is this?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI did not choose the illeal conduit.  It was chosen for me since I had colitis and they could not use my colon for a neo or IP.  At first I was disappointed but I wanted to point out that there are advantages and disadvantages to all diversions.  As RAH said, most people seem very satisfied with whatever they end up with.  I think that says something about us survivors.  We are adaptable and positive and we seem to make the most of what life throws at us.  My friend has a colon bag and she too is allergic to latex but they do have adhesives for that problem.  I saw her skin around her stoma once and it was horrible-looked like raw meat but once she got the proper appliance, she doesn't have that problem. Just research and get the right one for you and if you don't have a choice like me, you will make the best of it.\nBalihigh\t\t\t", "date": "2008-11-23T16:42:31+00:00", "topic": "New to this and facing RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI too have the illeal conduit and am very happy with it.  I agree with RAH but have a couple of other advantages to add to his.  With the bag, you can empty just about anywhere.  My husband and I do a lot of hiking and outdoor activities.  I would not like to carry around the catheters needed with the Indiana pouch.  I even emptied in a NY cab on the way to the doctor's office into an empty water bottle because we were caught in traffic since it was UN day.  The \"bag\" does not limit my activities at all and sleeping through the night is a big advantage for me.\n\nMany people are completely satisfied with the neobladder and the Indiana pouch and as RAH said, most seem satisfied with whatever diversion they chose.  There is no ideal diversion but it is important to know all the advantages and disadvantages so you can make a decision that fits your life style.\n\nBy the way, I am a 60 year female and I know men and women are different.  My surgery was in Sept. and I was back to doing most everything I wanted to do 6 weeks after surgery.  Now I feel 100% and I am amazed.  I think I was in fairly good shape for my age.  I walked 2 to 3 miles a day and am back to doing that again.  In fact I feel better than I did before the surgery.  Part of that is emotional I am sure.  The anxiety of having cancer and facing surgery can deplete your energy.  My path reports were excellent and I feel everything bad is behind me now.\nGood Luck,\nBalihigh\t\t\t", "date": "2008-11-23T16:42:31+00:00", "topic": "New to this and facing RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratualations on your dad's recovery and especially the path report.  I too traveled to MSK for my surgery on Sept. 5 and Dr. Bochner was also my surgeon.  Dittos on everything you said about him and MSK.  I only came from North Carolina and not across the Big Pond but it was well worth it.  When you are considering your life, you must go to the best!!  I am amazed at the number of people that settle on a hometown surgery or hospital for cancer treatment.  So many do not have good results.\n\nAgain Congrats and kept up us to date.  I have had a couple of minor UTI's and have started taking Clear Tract which was recommended by bladder cancer survivors.  I ordered it online. I don't want to keep my urinary tract irritated as that can cause more problems.\nNancy\t\t\t", "date": "2008-10-30T12:17:58+00:00", "topic": "Eventually I\\'m on line - Our update :)", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI,too, feel for you.  It is ironic but yesterday I was thinking exactly what happened to you.  I thouhgt, \"Now what will I do if I find a lump on my breast after going through this cystectomy.\"  Wow!! I will pray for you and keep you in my thoughts.  I hope the best for you.\nBalihigh\t\t\t", "date": "2008-09-30T10:59:37+00:00", "topic": "Sometimes life just is not fair!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHere is a woman sticking her nose into a man's discussion but I can so relate to years and years of frequent urination.  In 1994 I was diagnosed with interstitial cystitis which causes the frequent urination. Like you I cannot remember sleeping all night long.  In fact if I \"only\" got up 3 or 4 times a night, I felt fortunate.  I spent so many nights \"sleeping\" right next to the toilet because of needing to get up every 15-20 minutes.  Interstitial cystitis waxes and wanes so I had some time that was better than others but my life was never anywhere near normal.  I was a school teacher and always visited the room between every single class.  I got plenty of exercise and was fortunate that my principals understood.\n\nI was diagnosed with bladder cancer in January of this year and have just received my RC.  My surgery was Sept. 5 and I am only 3 days out of the hospital so I am just reading these posts today.  I actually had no choice but an illeal conduit.  At first I was very disappointed but especially after reading all the other posts here about neobladders, I am soooo thankful that I have an illeal conduit.  I haven't slept through the night yet, still adjusting from the surgery, but I will celebrate when I can.  I made the right decision but it is a very personal one.  Good luck to you.\nNancy\t\t\t", "date": "2008-09-07T19:55:46+00:00", "topic": "To neobladder or not to neobladder, that is my ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, Sailorman I would love to meet you but you seem to be having plenty of problems yourself.  Dr. Bochner is my doctor and I would highly recommend him.\nIf you and I both feel up to it (I feel great now but this road to recovery is bumpy and you never know what is around the next turn), maybe we could get together next weekend.  I met Grampadonut in Dr. Bochner's office right before my surgery and enjoyed the visit so much.\n\nYou will certainly be in my thoughts and hope that things start coming out right. (pun intended)\nNancy\t\t\t", "date": "2008-09-12T21:26:08+00:00", "topic": "Balihigh is home", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am surprised that no one has replied to your post.  I am only 9 days out of RC so I am not strong but do have an idea for you.  Did a doctor tell you that you had an abcess?  I have a very close friend that has colon bag.  See my mind is not yet functioning as I cannot think of the word for it but she has had a couple of hernias.  I am wondering if that might be your problem.  She had to have surgery to repair them.  Her conditon was almost exactly what you are describing.  She is fine now. Hernias result when we do things we shouldn't be doing with stomas like heavy lifting.  This could be a wake up call for all of us that have them and to be more vigilant on our activites.\nNancy\t\t\t", "date": "2008-09-13T01:12:04+00:00", "topic": "Abcess in stoma- ouch!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Sandy and Rick.  As the day gets closer, I am becoming less stressed and more resolved to my destiny.  I did have some more bad news yesterday though.  Dr. Bochner found I had some sort of blood problem and referred me to a hemologist.  He called me yesterday to say that I have a condition called lupus anticoagulent.  It is not lupus but gets its name I guess from that disease because a lot of people with lupus have this.  Got that info from the internet.\nThis causes a blood clotting problem and I am at much greater risks for clots and strokes.  Therefore after the surgery they will get me up sooner than most and I must walk a lot.  They will also give me a blood thinner after the surgery.  I know everyone must walk to get their bowels moving again.  I will just need to do more than the usual.\n\nIt does scare me but there is nothing I can do but trust the doctors and hospital.\nNancy\t\t\t", "date": "2008-08-29T23:37:17+00:00", "topic": "Urostomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWill be looking for you tomorrow.  I am really stressed about the operation and will be good to meet someone who has been there and done it.  You seem to be doing very well.  As I said, my appointment is at 8:30 so will be looking for you when I am finished with the doctor. I will need to go to presurgery testing afterwards but at least we can meet and say a few words.  I will be wearing brown pants and beige shirt.  Don't know what my husband has planned.\n\nThanks for getting back to me.\nNancy\t\t\t", "date": "2008-08-16T17:39:27+00:00", "topic": "Another dilemma", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have decided for the surgery.  Just read back through my posts but thanks for the advice.  It backs up my decision and I know I have made the right one.  Not looking forward to surgery though.  It is scheduled for Sept. 5.\nBalihigh\t\t\t", "date": "2008-08-16T17:39:27+00:00", "topic": "Another dilemma", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary,\nOne other thing about IC.  My husband was urinating frequently and had pelvic pain. He went to his urologist several times but nothing helped.  I kept telling him that it might be interstitial cystitis.  Well, the uro didn't think so but my husband persisted and the doctor finally tested!!\nBalihigh\t\t\t", "date": "2008-08-03T12:46:16+00:00", "topic": "Results of Inaccurate staging", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary, I forgot to mention to you that it sounds like you have interstitial cystitis too.  Have you ever been tested?  There is medication and other things that help tremendously.\nBali\t\t\t", "date": "2008-08-03T12:46:16+00:00", "topic": "Results of Inaccurate staging", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou are right that bladder cancer seems to be at the bottom of interest list.  I live in western NC and went to Sloan Kettering because they were one of the best.  John Hopkins as mentioned is now #1.  I think you do need to go to a major facility for the second opinion.  Yes, they can work with local doctors for chemo if that is needed.  They told me at Sloan that I could have it done locally but fortunately I didn't need it.  I have 2 kitties that traveled with me and my husband to New York when I had my surgery.  We have a small motor home and stayed in it for over a month.  The point is that getting the best treatment for your husband is paramount now and the details can be worked out.  I'm a country girl and didn't like going to the Big Apple but I am so happy I did.\nTake care,\nNancy\t\t\t", "date": "2008-12-06T16:29:33+00:00", "topic": "Second Opinion - Where to Go", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHi Brooke,\nSo sorry that someone your age must deal with cancer. We will support you here.\n\nMy concern, as I read your post, is that there maybe more tumors.  I guess I really need more information from you.  Why did they do a biospy?  Did the doctor see something?  If he/she just randonly took a sample of your bladder and \"happened\" to scoop up a cancer, there is a possiblility that your might have more.  I don't mean to scare you but it sounds like you definitely need a second opinion.  It was my 3rd opinion that actually got to the root of my problems.  Not all urologists are knowledgeable about bladder cancer.  It is important that all of us who are diagnosed find the best doctor they can.  I had to travel over 500 miles but it was worth it to me.  As Cynthia said, let us know where you live and people here can advise you as to where to go.\nNancy\t\t\t", "date": "2008-12-04T05:37:50+00:00", "topic": "Hi i\\'m new...and i\\'m scared", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tBJ,\nI received my illeal conduit in Sept.  I am very satisfied with it.  I can do anything I did before and I have adjusted to having the bag.  I think it is just a frame of mind.  I have recovered quickly and have my strength back much more quickly than I thought.  If I can answer any questions about being a bag lady or the surgery, let me know.\nBalihigh\t\t\t", "date": "2008-02-29T17:47:57+00:00", "topic": "Newly Diagnosed...Bag? Pouch?, Neobladder?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tMy doctor actually diagnosed me with extremely low levels of vitamin D BEFORE I knew I had cancer. She told me that my levels were the lowest that she had ever seen.  I don't know if this is a contributing factor or not but it was with me.  I now take 2000 units everyday and try to get a llttle sunshine too.\n\nBalihigh\t\t\t", "date": "2009-05-24T18:44:33+00:00", "topic": "Low Vitamin D Levels May Initiate Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI read this article in Uro Today on April 8 and I did not like it either.  I sometimes think the insurance companies sponsor such findings since bladder cancer is very expensive to treat.\nBalihigh\t\t\t", "date": "2009-04-14T03:39:10+00:00", "topic": "Here\\'s one ambiguous article", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThere was an article in my local paper a couple of weeks ago about a 16 year old girl who had adverse reactions to her vacine.  It seems that it has brought on a terrible asthma attack.  She had asthma as a young girl but it had been years since she was bothered.  Now she is very ill and has missed lots of school.  I think there is lots to be learned about this vacine yet.\nBalihigh\t\t\t", "date": "2009-04-26T16:26:13+00:00", "topic": "Gardacil....off topic discussion", "subforum": "17-chit-chat"}]}