{"signature": ["Chemotherapy", "Surgery"], "posts": [{"text": "\n\t\t\t\t09z,\n\nThe biggest thing for now is not to panic. Once you get a handle on this you’ll need to become your own patient advocate and push for answers. Also, with this cancer, get second opinions. If it is T2, it can be very treatable. Your doc should have told you what grade the cancer is along with it being invasive T2.\n\nIf you have any questions or need opinions concerning doctors or hospitals, ask. Pat can give you information on all the experts and where to find it. All of us here have been through this. Just don’t panic.\n\nBill\t\t\t", "date": "2011-07-15T00:43:22+00:00", "topic": "Biopsy Questions-posted for o9z", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi again Bambi,\n\nUsually 2 TURBT’s are done for staging. The first one is to clean everything out and the second for tissue samples used for staging. Most imaging will only catch bigger masses, cancer cells that stray away from the main tumor are missed and they are the ones to worry about. Under staging is a big problem as TURBT’s only gives a small picture of what the cancer is doing. There will probably be another TURBT for final staging as it sounds like your husband has only had one done so far.\n\nDr Wilson’s staff is pretty efficient getting the information she will need, so don’t worry about that if you gave them all the doctors your husband has seen. Your in the same position I was in for the most part, I was looking for the best of the best. My local doctor here in Northern Colorado gave me a list of people to contact and he let them know I would be contacting them. On a positive note, the people I spoke with at USC Norris recommended Dr Wilson and thought highly of her. Either way with MD Anderson or CU/Dr Wilson is a win win with both being state of the art facilities with exceptional doctors.\n\nI think the biggest decision for you will be traveling for treatment. Stay on top of things and take notes while at the doctors. All this is very treatable if caught early so maybe push a little. Go and see Dr Wilson on Monday for sure and see what she would recommend. If you have any questions she is very good about answering them, and she keeps it at a level that you can understand.\n\nBill\t\t\t", "date": "2011-04-26T00:51:14+00:00", "topic": "Husband got not so great biopsy info back today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDon’t take any risks with the grade 3 stuff. Try to get the best of the best for treatment. MD Anderson was one of the places recommended for a second and they seemed like an appointment would be easy when I talked to them. The biggest obstacle I had with Anderson was insurance, mine wouldn’t cover anything out side of Colorado except an emergency, the plus side was I have family in the Houston area. There are some here that can tell you who’s good in your area and who to avoid. Cancer is cancer and you want the best. And as Pat said, under staging seems to be a problem.\n\nKeep us updated and keep reading. And if you have any questions, be sure to ask.\n\nBill\t\t\t", "date": "2011-02-13T23:30:01+00:00", "topic": "2nd opinions/pathology slides", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tA7wood,\n\nSounds like great news! Maybe check ups will be all you need. The noninvasive had to be a great relief. Keep us up to date for sure.\n\nBill\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Alanlee!\n\nAs you read, learn about some of the cancers pertaining to bladder cancer. Some are very manageable and the check ups are worse than the cure, really! As your reading take notes on each type of BC so when you go to the doc for the results you can have a little more focus on what lies ahead. Until you get the results back, don’t read the worst case stuff, it’ll just add to the stress. Cancer is no fun and all of are to help and answer questions, so stop stressing. Seems like when you talk to doctors and nurses, all you hear is “blah blah blah cancer blah blah cancer…..\n\nBe sure to drink plenty of liquids, helps with the healing. If you have to have another catheter, be sure to get some KY as Mike suggested or a high quality water based gel with lidocaine from the doctor. Don’t get the cheaper stuff, it dries and leaves little bits on the cath that turn into daggers of death. If sitting is troublesome, maybe a big pillow, hemorrhoid ring, or a Boppy.\n\nEveryone here has more than enough information to share. So ask away!\n\nBill\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi swag,\n\nHope things are going well. Chemo is such a mixed bag as everyone is different. Your diet for post surgey to get your bowels working againg might also help during chemo if your system fights a little. Another thing that my doctor pushed every visit was stay away from sick people, the chemo compromises your immune system. The surgery is done, so the most painful part is done. The\nchemo is not fun but it sounds like it is getting more tolerable as time moves along.\n\nKeep us up to date, and get better!\n\nBill\t\t\t", "date": "2010-12-28T01:23:27+00:00", "topic": "exercise/rehab following bladder removal surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tA7wood,\n\nSounds like great news! Maybe check ups will be all you need. The noninvasive had to be a great relief. Keep us up to date for sure.\n\nBill\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Alanlee!\n\nAs you read, learn about some of the cancers pertaining to bladder cancer. Some are very manageable and the check ups are worse than the cure, really! As your reading take notes on each type of BC so when you go to the doc for the results you can have a little more focus on what lies ahead. Until you get the results back, don’t read the worst case stuff, it’ll just add to the stress. Cancer is no fun and all of are to help and answer questions, so stop stressing. Seems like when you talk to doctors and nurses, all you hear is “blah blah blah cancer blah blah cancer…..\n\nBe sure to drink plenty of liquids, helps with the healing. If you have to have another catheter, be sure to get some KY as Mike suggested or a high quality water based gel with lidocaine from the doctor. Don’t get the cheaper stuff, it dries and leaves little bits on the cath that turn into daggers of death. If sitting is troublesome, maybe a big pillow, hemorrhoid ring, or a Boppy.\n\nEveryone here has more than enough information to share. So ask away!\n\nBill\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy very first checkup was Tuesday. Monday afternoon the stress hit and made for a very long evening. All was good, but Monday just took for ever and a day.\t\t\t", "date": "2011-02-26T00:07:19+00:00", "topic": "check up again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats on the check up! The cysto always sounds bad and the idea of it... Glad to hear that it went well for your first time being awake.\n\nBill\t\t\t", "date": "2011-01-17T13:54:04+00:00", "topic": "Everything good", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tefoster,\n\nI had the same question about the prostate. I was told grade 3 tumors like to keep releasing cells or micro mets for survival. Between age and mets, G3 statistically comes back in the prostate sooner as you get older. My doctor told me that sometimes if you’re 30ish and pushy enough, the prostate avoids the knife, but very rarely. For men they should call the surgery what it really is, radical cystoprostatectomy.\n\nI’m guessing 2/3 is T2G3?  After you have a surgeon picked out, ask about diversions. The neo was my choice and things have worked out pretty well. Because of where the tumor was, there was a chance the urethra could have been too damaged and the Indiana pouch was the second choice followed by the bag.\n\nBill\t\t\t", "date": "2011-07-27T02:05:31+00:00", "topic": "searching for the right procedure for me.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! Way to go Jim! It's good to see when people have good check ups. Shows it can be done especially where you were at in the beginning and what you had to go through.\n\nBill\t\t\t", "date": "2011-03-17T21:26:16+00:00", "topic": "Update on Jim and his BC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi hwg,\n\nFor the neo bladder I was told I would be in the hospital 10 to 14 days. It all depends on how well things are going. The biggest issue for release is getting the stomach back up and running. Passing gas and having bowel movements are what they look for. I was in for 6 days, I was determined to get out and the biggest help for the stomach was walking and chewing gum.\n\nBill\t\t\t", "date": "2011-02-26T00:14:17+00:00", "topic": "neobladder ileal conduit", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Rayn,\n\nWhat a little web you have to deal with. I don’t know whose worse, the doctor or your husband. My wife has been my biggest advocate on this journey and all my doctors respected that and made sure she was in the loop. It sounds like your holding back on your feelings for the doctor… I have talked to a few people in the past that had this cancer who were stubborn and waited to long or were under treated because it was more convenient. It tore their families apart. The end game becomes obvious after a certain point messing around.\n\nIt is hard to be on the caregiver side as you don’t have to “wear” the stress of having the cancer. That’s no excuse though to make you crazy. My wife can be pretty blunt, and when things slowed down, she spoke her mind. Your husband should be happy you want it done with now and not drag out the misery.\n\nTo bad about the cooking. Once I took control of that the world changed. Is there anyone in his family you can talk to that might get through to him and push for another doctor? The VA seems scary with simple things, this cancer and VA hospital shouldn’t be in the same sentence. Also sounds like the doctors got patients mixed up from poor communication?\n\nDon’t give up! Remember slow and steady. Something you might enjoy, my wife can be very blunt, the day before my surgery we went for a walk and got our mail. Two different funeral homes mailed info packets. My wife said she wanted them just in case I changed my mind in the morning and didn’t go through with the surgery. A couple of days later in the hospital I found them in a folder I had taken with us. I asked her why they were in there and she said if I didn’t go through with the surgery, I would have something to read living in a motel… maybe call and ask for info so when he checks the mail?\n\nKeep checking in and venting. Give us the stress! Maybe if you stay in the background listening and taking notes, they will refer him out to a good doctor to get rid of you!\n\nBill\t\t\t", "date": "2011-02-03T09:32:21+00:00", "topic": "Checking In", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi hwg,\n\nThe appetite might be the one that throws you for a loop. I craved stuff I never liked. Keep lots of different snacks around and pack some of them for when he’s at chemo.\nThe only time I needed the meds was before going in the car, easy, 20 minutes before leaving. Have him drink plenty of water, helps with the chemo drugs. Also watch for constipation, some of the drugs given with the chemo drugs will cause that. The chemo bag works very well, might throw in some light snacks and a light jacket too. Towards the end he might need/want a ride for treatment because of the fatigue. Also, glasses or contacts, the chemo could cause a shift, so tell him not to panic. The chemo can take a lot of patience for the caregiver watching the changes during treatment.\n\nBill\t\t\t", "date": "2011-01-29T19:55:00+00:00", "topic": "chemotherapy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Brett,\n\nWhen I asked my doctor about time lines for a lot of this, she said healing and learing differs from person to person. The biggest part of regaining continence is kegel exercises and a schedule to train your new bladder. This is a learned process, not healing. If your cath was pulled in the last few days, you’re just getting started. It really will get better.\n\nBe careful with your liquid intake before bed time and find ways to get rest. With the training schedule it can lead to sleep depravation pretty fast and if you get too run down, you’ll never wake up in time to make it to the bathroom. If the kegels are not working after a while, you might talk to you doctor about biofeedback therapy.\n\nI had my surgery Nov 2 2010, and towards the end of Dec turned 49. The foley’s catheter came out on Nov 18th . The out of control sprinkler at first seems to be pretty normal for everyone. The first two weeks were miserable, just blinking seemed to start the voiding… I’m just getting to where I can count a few dry days and nights in a row, but I’ll continue to wear a pad or diaper for a while. Murphy’s Law.\n\nRegaining continence is just one of the steps in the big picture for beating this cancer. Once you get a little control, things will start to fall into place and eventually normalcy will return.\n\nBill\t\t\t", "date": "2011-01-22T04:33:11+00:00", "topic": "INCONTINENCE", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFunny thing you should mention Diabetes… The morning of my RC it was like at 85. 24 hours later after the surgery it was 195 and I was started on insulin. During that week in the hospital with the insulin it stayed high. Finally it started to come down and we stopped with the shots. Day of release it was normal. What a wild ride for 6 days. Dr said surgery and chemo close together really effect internal organs and post surgery can be a mixed bag of new things. Blood work for post op appointment 2 ½ weeks later, blood sugar levels were still normal.\t\t\t", "date": "2011-01-02T01:10:13+00:00", "topic": "weight loss", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Kathleen,\n\nI was told just about all pelvic lymph nodes are removed and studied during cystectomy. It’s surprising that he didn’t recommend surgery. Definitely start getting set up for second opinions! As far as having neo-adjuvant chemo, your body might do better than waiting until after surgery, if that’s where things go.\n\nBill\t\t\t", "date": "2011-07-08T21:25:37+00:00", "topic": "2 scans later, one giant lurch into metastatic BC", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tFlyer,\nThe mucus should get better, really! Your tummy is still healing and so is the bladder. The bladder is still not sure what is going on and what it should be doing. To speed things up, pull one thing out of your diet each week. If its right after eating, try each thing on its own to see. And plenty of liquids during the day to keep it flowing.\n\nI thought it was never going to stop. In a weeks time it change to very little and if there was some, it was the egg drop variety.\n\nHows the urinal usage going, that first week or two after the cath kinda changes the aim.\nBill\t\t\t", "date": "2011-07-29T16:34:15+00:00", "topic": "What do I need?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHiya Dana,\n\nMy doc said 4 to 6 weeks. If there was a need to drive, have sombody that could take over and keep the drive short and wait for the fist post op checkup.\n\nBill\t\t\t", "date": "2011-05-22T11:59:56+00:00", "topic": "DRIVING", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi RysMomKB,\n\n\n\nI really do agree with Pat on getting the best, and travel wise USC Norris is close considering the expertise and experience they have to offer.\n\nFor questions; is nerve sparing part of the surgery, any of the pathology show the P53 gene, options once surgery is started and the chance changes have to made and what will they be, how many RC’s to date, and a willingness to let your son talk to any past patients to get an idea of the patient experience using him as a doctor. Ideally the second and third opinions let you interview to decide which one to hire for the job much like a job interview. I would put how many RC’s and testing for the P53 gene testing at the top.\n\nThis is a one shot deal, so just be sure that you do your home work.\n\nBill\t\t\t", "date": "2011-05-04T17:52:34+00:00", "topic": "questions for the doctor on Friday", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi again RysMomKB,\n\nUSC Norris is one of the top places in the country. Your son is going to want the best he can get. My urologist recommended USC Norris as one of the places to shoot for to have the best chances for outcome and survivability. He also told me you want a surgeon that does a high volume of RC’s each year, statistics prove that point. The doctors Pat has recommended at Norris are some of the best in the country and are choices you and your son would never have to second guess. The high grade bladder cancers are tough to beat in the long run, but still very treatable with the right doctors.\n\nBill\t\t\t", "date": "2011-05-02T17:19:25+00:00", "topic": "Top RC doc in San Diego?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI asked the same thing when my journey started.\n\nRadical cystectomy seems to be the gold standard for the more aggressive cancers. There are procedures that are bladder sparing but the numbers for survival and qualty of life just don't stack up to RC in the long run. If your a good candidate health and age wise for RC and neobladder it could be your best option. Going by the statistics, RC w/neo was the treatment I chose so I could watch my kids grow up.\n\nThe consensus for RC, if you go this route, is to go for a doctor that does a lot of RC's a year, the outcomes are better. Talk to your doctor and don't be afraid to ask questions and never be afraid to ask for a 2nd or 3rd opinion.\n\nBill\t\t\t", "date": "2011-01-18T00:20:25+00:00", "topic": "Treatments other than Bladder Removal Surgery", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDiesel,\n\nWithout the my kids I don't think I would have the high level motivation to beat this over the long run. I realy do plan on seeing them leaving the nest, voluntarily or involuntarily!\n\nAnd as a follow up, the Flexeril got the muscles back to a happy state until this weekend the flu hit... everything on the mend is a little more sensitive again today, but still getting better.\t\t\t", "date": "2010-12-30T06:51:08+00:00", "topic": "Some old fashioned remedies for irritated muscles?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThe Flexeril did wonders over night! The pain this morning is very tolerable finally. Now I just have to be patient and let it heal. In eight months, too many things for doing another surgery right now. Time to heal from all of it and move forward.\n\nThe two year old has been pretty keen to everything and after seeing my tummy, he never has asked to be picked up or asked for lap time, so snuggle time was sitting next to me. He figured this out on his own! He has been a great helper and distraction for all this, he keeps me motivated.\t\t\t", "date": "2010-12-30T06:51:08+00:00", "topic": "Some old fashioned remedies for irritated muscles?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tGlad to hear that Alan is past the surgery!\n\nThe hospital will pester him about pain and managing it. Be sure to go through any paper work for recovery and ask questions. Lots of gum and walking and he'll be out of there in no time. Be sure to ask about diet and eating once he goes home, it's a slippery slope finding balance for the first month.\n\nBill\t\t\t", "date": "2011-03-27T12:48:15+00:00", "topic": "not as scared", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tHi Pat,\nI remember looking at this not to long ago in the past. Another resource for help is going to a hospitials social services and get a patient navigator assigned to you. If the navigator program is good they should have a lot of resources and how to use them.\nBill\t\t\t", "date": "2011-08-10T04:02:00+00:00", "topic": "Cancer Financial Assist Program", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tNothing really new in this country treatment wise, just making what works even better. Grants, FDA approval for studies, and doctors looking at the Gold Standards we have. Every doctor seems to have differing opinions on these studies being done outside the US. It will be interesting to hear what your doc says Pat. Seems like chemo drugs/stageIV and finding the precursors the highest grades were trending last year study wise.\t\t\t", "date": "2011-07-16T18:46:22+00:00", "topic": "DYNAMIC new therapy for the elderly with invasive", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tBTW I feel blessed, mine was diagnosed spot on after the second TURBT and treated the way it was.\t\t\t", "date": "2011-02-20T00:47:02+00:00", "topic": "Difference between Clinical &amp;amp; Pathological staging", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi Pat,\nI finally got to read the article and its sad. seems like our cancer is the \"bastard child\" in the cancer world. Bad enough it gets understaged so much as in the article, but then there's the doctors that miss it and go off in a different direction and try to treat it as a bladder infection or prostate issue. All that lost valuable time that would have allowed for a sucessful outcome. And then the issues with very little funding for research! It seems like I read somewhere that invasive BC is one of the more expensive cancers to treat.\nBill\t\t\t", "date": "2011-02-20T00:47:02+00:00", "topic": "Difference between Clinical &amp;amp; Pathological staging", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\t48 for me\t\t\t", "date": "2012-03-07T00:00:23+00:00", "topic": "At What Age were you Diagnosed", "subforum": "17-chit-chat"}]}