{"signature": ["TURBT", "BCG"], "posts": [{"text": "\n One thing for sure, you'll be in our prayers, that the Lord will give both you and your Dr the wisdom to make just the right decision, at just the right time:) May you be well, my friend!\t\t\t", "date": "2009-10-20T17:54:05+00:00", "topic": "New Dilemma?", "subforum": "3-newly-diagnosed"}, {"text": "\n   OH, my!  I understand 100%.  I to am an \"AT\" hiker and have been since the mid-80's, mostly weekends as we have children and I have to work full time.  Now they are grown, with children of their own, and I am much older \n\nNow, post BC, Cysto's every 90-days and 64-yo, I doubt that I have the \"stick-with-it-ness\" to do a \"Thru-hike\"!  Always wanted to, but Cancer, time and age take it's toll.\n\nWe do not know what you found out from the Lab, but look, take care of your Health first!\n\nThe \"AT\" will always be there!  Wish you the Best!\n\nTrail name:  Cherokee Bill\t\t\t", "date": "2011-02-25T03:42:54+00:00", "topic": "cysto  today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know what you are going thru!  Almost 1-yr later, I still have prostate pain from a \"possible BCG infection\".  Was on Antibiotics for 6-mo, & Uro would never admit to a BCG infection!\n\nThe Disease Specialist here in town called my Uro, as soon as I told him why I was there.  Everything was \"brushed-off\", as the Medical Politics here is like the Mafia.  One covers for the other!\n\nIF still suffering from a BCG-infection, then avoid additional BCG like the plague!\n\nI will NEVER have BCG again!\n\nMay you heal fully & fast!\t\t\t", "date": "2011-03-15T23:55:52+00:00", "topic": "I need your help guys", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell I was supposed to re-start BCG this past Friday!  So I took a 1/2 day vacation Thursday, to get in one more day of Mtn Biking (bicycle-type), in the Mtns!\n\nWent into a 90-deg, down-hill turn a little to fast, my rear tire lost it's grip and tried to kiss the front-tire, throwing me off & backwards.\n\nI hit the ground head-first & on my R-side.  My head hit the ground so hard, both lenses of my sun-glasses popped out!  R-arm bleeding like no tomorrow and my R-hip is sore as H---!\n\nWithin minutes I had a head-ache I cannot describe!  Ended up in the \"ER\" CT-scan of the head, X-rays of hip, pelvis & femur!  Yes, I was wearing a Helmet, ER-Dr said that saved me!\n\nSevere concussion, and now a bruise from my waist to my knee, and latteraly 7 - 9 inches L/R! Walking is yes, painful!\n\n\nCannot wait till I heal so I can get back to the Mtn's on my bike.\n\nBCG restart:  next Friday (stand-by)\n\nLife is good!  63-yo, and nothing broken, PTL!\t\t\t", "date": "2010-07-18T00:04:22+00:00", "topic": "I-week delay!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell Damn!\n\nLast night, I thought that as usual, my prostate was giving me a fit, as per usual since BCG #6 out of 9, followed by 5-mo of antibiotics, w/no relief in pain!\n\nThen, last night, some \"pink-water\"!  Oh, damn!  What nexT?  One episode, then all normal???  No pain on voiding, no temp, no nothing else!\n\nHad a PSA  (been climbing over 18-mo {no BCG since 9/09}), Platelet & WBCC 2-wks ago, w/no results yet????  I have been getting more tired by the week and brusing is a real problem???\n\nWe all have limits, and our limits are different for each of us, and I am about at the limit of mine!\n\nBCG #10 is Thursday July 14th, @ 10%, if the pain & bleeding is as bad as #9, then I guit!\t\t\t", "date": "2010-07-08T21:30:51+00:00", "topic": "BCG re-start!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\n\nI have changed URO's, and he agrees with Dr. Lamm, and is why we are going to try BCG at 10%.\n\nHe also sent me to a specialist to try Pelvic PT (new on the scene, and has helped dozens of men in my area) however, after an extensive exam, I was found not to be a candidate for the Pelvic PT.\n\nI will ask for ofloxacin as you suggest.\n\nAdditionally, I just read that Dr Lamm does not recommend you as a candidate for BCG if you have bleeding after Cysto's or Cath's (which he says in not normal)which I have had every time (blood mixed with the numbing-jell used for male Pt's), or bleeding \"prior\" to leaving the office!\n\nI do believe my new URO is trying & wll work with me if I cannot tolerate the BCG at 10%.\t\t\t", "date": "2010-07-08T21:30:51+00:00", "topic": "BCG re-start!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n OH, Boy!  BCG-treatments.  I had 9, and thought I would die after each (PAIN, PAIN & bleeding).  Pain was so bad after #9 I was on antibiotics for 5-mo, with n0 relief.\n\nDr at UVA told me to not take any more BCG-treatments, that to do so I would only be asking for trouble.  However, my new Uro says that at my next 90-day Cysto, he wants to discuss starting BCG again.\n\nI have had reccurent prostate-PAIn ever since BCG #9.  NO more BCG for me!!!!!!   ", "date": "2010-03-09T18:46:18+00:00", "topic": "For Pain?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nmmc wrote:Bill,\n\nIt really sounds like you need to find another IDS.  Sure sounds like the quality of care where you are is atrocious.\nDid your town recruit docs from the bottom 10% of the class or something?\n\nI hope you can get this taken care of soon because it has certainly been going on way too long.\n\nMike\nWell Mike, I live in a small town with a little over 100,000 folks and 2-hospitals.  Both hospitals are owned by the same corporation and many of the medical practices have gone under the umbrella of this corporation.  Therefore, the medical politics here are almost mafia-like.\n\nI have found that many out-of-town Dr’s shy away from folks like me (folks that have gone Dr-to Dr attempting to find a cause/cure for a long-standing problem).\n\nI do not know if my 5+ month long problem is a prostate infection or just a horribly irritated prostate that just will not heal.  I do know that 5+ months of antibiotics did not help.\n\nIt’s been 3-months now since my last BCG, so according to Dr Lamm it’s OK to get a PSA, which I did 3-days ago, but have not heard back from my family Dr.\n\nThank the Lord; my old Uro is retiring again, so in Jan I will get my next Cysto with a new Uro and at a different office!\n\nHappy New Year all!\t\t\t", "date": "2009-12-27T18:05:06+00:00", "topic": "Is it back?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI did see an \"IDS\" and got nowhere.  This \"idiot\" called mu \"old\" Uro and asked his opinion for treament (go figure)!  I believe if my \"Old-Uro\" had done his job, I would not have needed a \"IDS\".\n\nSo thanks a million for the advice, which at this point is logical.  Let's see what the new Uro suggestes.\t\t\t", "date": "2009-12-27T18:05:06+00:00", "topic": "Is it back?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n I think in some cases, that the cure is worse than the disease.\t\t\t", "date": "2009-10-16T22:31:54+00:00", "topic": "Urethral Stricture", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nrudyskier wrote:Bill: I was totally or I thought recouperated from all those symptoms I mentioned during the BCG treatments and went for my regular PSA blood test and it was elevated so I then went in for a Prostate Biopsy in which several samples were taken. All came back negative for cancer. A week or two after the Biopsys were done, the URO doc called and said to go and get a TB test. this is a simple scratch test on the arm. I did and low and behold it came back positive. As you can imagine my reaction was What the $%@$^%@$...\n\nThen I had to see an Infectious Disease guy who put me on Isoniazid and Rifampin for 6 months. Through-out it all I had no symptoms of any thing being wrong either before, during or after the medication. Although the medications left me with a lousy taste and dry mouth as well as upset stomach unless I ate at least a little something before taking the medicine. I was told that the BCG infection manifested itself in the prostate.  Go figure...\n\nRudy\nThanks for the reply!  Whatttttttttttttt!  My Uro has told me not to get a PSA as the BC will give a \"false-high\" reading and while taking BCG a TB-test would give me a \"false\" reading.  However, I have thought since the 1st infection, that it was a TB-infection of the prostate!  He said there was NO test to confirm, so he just put me on a std-antibiotic.  I am on the same antibiotic for this 2nd infection & I am getting worse.  I know I have a \"railroad\" spike deep in my butt.  Pain during urination is horrible, and I do not have enough energy to die:woohoo:\n\nHopefully, the new Uro on the 30th at UVA will get me on the right path.  I have made the decision, that I will have NO more BCG here in town, but will continue the Cysto's.\n\nThanks folks.  Bill\t\t\t", "date": "2009-10-20T17:10:20+00:00", "topic": "Leaving town, finally!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n Anyone get prostate/bladder pain after exercise?  Went to the Mtn's today to do a 7+ mile hike while Geocaching.  There was a 2000-ft change in evevation, etc, rugged.  At about 1 1/2 hrs I felt like I had just had a BCG treatment.  Burning pain, extreme pain during voiding and I had to pee (dribble) every 30-min.  The other 3 folks woundered if I was going to make it back down the Mtn, but I fought it and here I am.  Burning has subsided a little, but voiding is PAINFUL.  No blood, yet:woohoo: This is the 2nd such occurance after heavy exercise.  I am an OUTDOORS person and LOVE the Mtns, only death will stop me from going up there:silly:\t\t\t", "date": "2009-10-18T23:12:34+00:00", "topic": "Exercise and PAIN", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBest wishes as you follow the BCG path.  I just completed my 1st 3-week maintenance schedule (for 9 total so far).  After #7 we had to cut the BCG-dose to a 1/3-dose.  The pain & bleeding was more than I could bear at a full dose  \n\nAnother Cysto in 6-weeks:S   Best wishes to all!\t\t\t", "date": "2009-08-13T18:32:19+00:00", "topic": "Re-occurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n   Red thread  and yes even Pubic hair  , can not wait to see what we fish out next \n\nThis is going to be one Grrrreat-thread!  LOL & Best Wishes?\t\t\t", "date": "2009-09-16T22:55:52+00:00", "topic": "OK..this is a wierd one!!", "subforum": "10-women-and-bladder-cancer"}, {"text": "\nmmc wrote:Bill,\n\nSure sounds like enough crap going on that you should STRONGLY consider going someplace better.  I know you mentioned politics of the doctors and your family but it is worth it?\n\nSure doesn't sound like it to me.  Also seems like if a family member is a doctor that they would advise you to do the same thing we keep advising.  Also seems like they should be able to handle themselves in a situation where crappy doctors try to cause an issue over you getting better medical treatment.\n\nIf it is a prostate infection, you should ask about Levaquin for a 30 day dose.  It takes a LONG time of antibiotics to get rid of a prostate infection.\n\nIf the prostate still causes issues with the catheter, then inquire about getting a TUIP.  They make an incision in the prostate to loosen it up in the area of you urethra.  It's a pretty common surgery for enlarged prostate, which may be a contributing factor in addition to the infection.\n\nYou REALLY, REALLY, REALLY want to continue the BCG if at all possible.  While I've got a neobladder and am doing fine with it, I can tell you without a doubt that I would have rather been able to take the BCG treatments and still have a bladder.\n\nFinally, you can even go down to a 1/10th dose.  Dr. Lamm says there is no evidence of reduced efficacy even with that dose.  Send him a note to ask on his web site.\n\nAll we can do is advise based on what we know.  It's your decision to make.\n\nI do wish you the best though!\nMike\n When I had my TUR, the Uro did perform a slice biopsy of my prostate (at least he said he did) and told me once I healed, that I should see an improvement in symptoms from BPH.  I did for about 2-months.  Now, its near impossible to get a #14-cathe thru to my bladder.  They will not use a smaller, as they say it interfers with the admin of the BCG.\n\nAnyway, to day I had my yearly with my GP.  The Uro had not notified him of my cancer.  Anyway, he did an in-office \"urine\" test, which indicated a infection.  He is going to \"culture it\" and let me know if anything turns up.\n\nAlso, my wife (OR-Mgr) crossed paths with my Uro and he finally sent me an antibiotic to take 2/day for 14-days.\n\nTwo BCG schedules ( first 6 and first 3) and a World-Class infection after each.\n\nAgain folks, my quality of life w/BCG is horrible and the recovery between is Long & Drawn-out, therefore, I am still not sure I will continue in Jan, although I will continue the Cysto's every 3-months.\n\nAnd yes, I will look for a BCG specialist in Roanoke, VA and in Charlottsville, VA (UVA).\n\nThanks for all the advice, as I do read and study all of it.\t\t\t", "date": "2009-10-08T01:08:07+00:00", "topic": "May stop all BCG\\'s.", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tSaw the Infectious Disease Specialist today, and he certainly was different from my Uro and the Dr at UVA.  Nice and detailed.\n\nHe first asked me if the Dr’s before him and run any tests at all, so as to know what to treat!  I said NO!\nHe was surprised that I had had symptoms so long, with no resolution from the other Dr’s.\n\nHe asked if either of the others had performed a “digital-exam” of my prostate, since the on-set of symptoms!  I said NO!  So he apologized for 5-min, because at this point he would have to perform one!  Fellows remember I have had all these symptoms (PAIN) for 4+ months, and 3-weeks ago I had my 2nd post-op Cysto.  I also remarked in a previous post, that if you had never had a Cysto, at the same time having the symptoms of a prostate infection, you don’t know what you missed!  Well, today’s “digital-exam” of my SORE prostate, was pure-HELL!  He agreed it was large, with no nodules?\n\nSo, he said that he did not want to treat anything till he was sure what I had, and knew the best way to treat what I have!  So he had the Lab test me for everything but “pregnancy”  and those test will not be back till around Tuesday.  He said he also wanted to do some research on BCG & prostate infections, as well as do a consultation with folks at UVA.\n\nHe is keeping me on Isoniazid for the time, as well as adding B-6 each day.  He said if it turns out to be a “TB” infection of the prostate that he would probably have to have me on a 2nd medication as well as the Isoniazid, and that it would probably take months to treat.\n\nSymptoms are slowly getting worse, so I hope we can nail a cause down next week.\n\nI also saw him note on my chart, that he wanted to rule out “Prostate Cancer” .  I do NOT believe I could handle cancer in another location this soon, I really don’t.\t\t\t", "date": "2009-11-13T00:04:45+00:00", "topic": "Saw Infectious Disease Dr today", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n Ole prostate infection is really talking to me the past few days.  So I know you want believe it, after so long (3+ months), but I have an appointment with an Infectious Disease Specialist this Thursday morning.\n\nHope this fellow can get this figured out and prove what it is or isn't!\n\nThanks folks, especially Pat   ", "date": "2009-11-04T20:29:09+00:00", "topic": "Finally on \\&amp;quot;TB\\&amp;quot; meds", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nPatricia wrote:why not stick with the Uof Va specialist?\nPat\nGood question:\n1.  He has been best friends with my Uro at home, for 15-yrs.  Boy, can I pickem?\n2.  He said it was no use in my coming to him for treatment, when I could get it at home!  In other words its the \"Old Boys Club\".\t\t\t", "date": "2009-11-04T20:29:09+00:00", "topic": "Finally on \\&amp;quot;TB\\&amp;quot; meds", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nmmc wrote:Bill,\n\nYou might want to let your uro know because of your particular circumstances.\n\nI don't recall any bleeding after a regular cysto exam.  Any cysto that involves any other procedure at the same time could cause some minor bleeding though.\n\nOf course if your uro typically does cystos with a running start from across the room, that could very well result in some bleeding.     \n\nSeriously though, even if others have had bleeding after a regular cysto exam, I'd recommend calling your uro and just letting them know.  There could be some urethral trauma depending on how good (or bad) they are at doing cystos, especially at the prostatic sphincter.  Bet you never knew you had so many dang sphincters, did you?    \n\nMike\n  Mike, if I thought the message would get to him or that he would acknowledge my message about the bleeding after Cysto, I would.  My prostate has been much more painful since this last Cysto.  The bleeding/small-clots were at the start of the stream and would clear up after a few seconds?  Since my TURBT this May, I have called the office 5-times; they returned one of the five.  But heck, what am I complaining about; other Dr’s have the same problem with this Group!\n\nTwo Dr’s in town have recommended that I should switch over to another Dr in the Group, as all Uro’s in town are in One-Big practice owned by the Corp that owns both Hospitals in town.   My next Cysto is in Feb, so I’ll switch to one of the new/younger Dr’s before then.\n\nI HATE to go to any Dr if I don’t REALLY need to, however, this prostate thing has drawn on for 3 – 4 months, so if I still have the discomfort early next week, I’ll follow Pat’s (and others) advice and contact an Infectious Disease Specialist.  Course, there are only 2 in town, so I may be on Social Security (2 ½ more yrs) before I get an appointment!\n\nWill let you folks know what happens!  ", "date": "2009-11-04T20:29:09+00:00", "topic": "Finally on \\&amp;quot;TB\\&amp;quot; meds", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nmmc wrote:Bill,\n\nYour son makes some good points.  It's applicable to you since BCG has been hell for you.  For other's it's been fine and effective.\n\nIt is the best thing out there for treating CIS and greatly reducing recurrence.\n\nIn your shoes, I'm not sure I'd jump right into the RC unless there is a recurrence.\n\nI'd ask about the mitomycin if I were you.  Lots of folks who had issues with BCG were able to get treated with it.  I had three treatments with it and only the last one was a problem.  My CIS came back in a year and half after being treated but who's to say it wouldn't have been sooner had I not.\n\nFor right now, it kind of sounds like the prostate might be the bigger issue based on your posts.\n\nMike\nMike,\n\nDon't worry, I'm not going for the RC, till the last resort, I can assure you.  The 4th I have another Cysto, and will see about the \"TB\" med's for my prostate infection, as suggested by the Uro at UVA.  At the same time, I will inquire about the mitomycin.  Thanks!\t\t\t", "date": "2009-10-30T21:51:11+00:00", "topic": "UVA &amp;amp; new Uro", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nPatricia wrote:But it is BCG resistant...you're having a horrible reaction to BCG....did you tell him that part?  Write him back in detail about whats going on.\nPatHis quote:\n\n\"i am not sure why you would come up and see me at this point\nis your cancer gone or is it resistant to bcg?\n-m\"\n\nDoesn't resistant to BCG mean that I still have the cancer & it's not responding to BCG?  My cancer is gone!\n\nTo answer part fo his question, my cancer was removed by TRUBT.  And yes, I did explain that to him, in fact I said that the Dr at UVA directed me NOT to have anymore BCG's due to extreme side-effects & resulting prostate infections!\n\nIn fact I question how critical no BCG is going to be, as far as the probability of recurance?\n\nWill my URO finally give me the TR meds for my prostate, THursday when I get another Cysto?\n\nWhat about mitomicine (Sp)?  WIll my URO consider that in place of BCG?  WIll my body tolerate it?\n\nTHe war continues.\n\nMy son a Family Practice Dr is really concerned as his g-dad and I both have had BC.  My f-in-law lost his bladder.  My son says if he contacts BC, he will not go thru the HELL of BCG & Cysto's every 3-mo, etc, etc.  He says he will immediately go for the RC and be done with the BC and the concern of the prostate, as well.\t\t\t", "date": "2009-10-30T21:51:11+00:00", "topic": "UVA &amp;amp; new Uro", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n   Not having much success with Uro's at all!  I e-mailed the Dr, Pat suggested, explaining my BC history as best as I could.  Heard back from John Hopkings:\n\n\"IF your cancer has been removed and not BCG-resistant, why would you want to come see me at this point?\"\n\nI give up!  ", "date": "2009-10-30T21:51:11+00:00", "topic": "UVA &amp;amp; new Uro", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n Theeeeeee Shot, you guys are talking about!  I am almost afraid to ask,  where exactly do you stick the needle?\t\t\t", "date": "2008-05-18T02:19:36+00:00", "topic": "Sex", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n I have an appointment with a NEW URO (Oncologist) at UVA on the 30th.\n\nAs you know after both BCG treatment series, I ended up with a massive prostate infection, in fact I am not sure I really got rid of the first.  I finish this last round of antibiotics tomorrow.  Sitting on a rusty railroad spike is not very comfortable \n\nHope the new Uro doesn't have to do a \"digital-exam\" of the prostate.  I am so sore, I may go thru the roof with pain!\n\nHow would a Uro diagnose a “TB” infection of the prostste resulting from BCG. (Prostate biopsy????)\t\t\t", "date": "2009-10-22T20:33:28+00:00", "topic": "How do they............?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n   Mike,\n\nQuestion:  I see you dropped out of BCG treatments after 2, why?\n\nBCG is killing me!  Today I phoned in and asked to go to 1/3 dose.  Waiting to hear back  ", "date": "2009-07-05T13:11:30+00:00", "topic": "How long - nerve sparing surgery to functioning?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n Called Uro's office today asking that the rest of my maintenance BCG's be cut to 1/3 dose or less (as suggested by Dr. Lamm).  Talked to what is called the \"phone-nurse\" and she said she would pass the request on to my Uro.  I also said politely, that if they would not go to 1/3, that I want to cancel all future BCG-treatments, except the every 3-mo Cysto's.\n\nIf, and I say if, I hear back I will let you folks know.\n\n_____________________________\nWife is an OR-Nurse and Mgr of OR's & PACU at one of our local hospitals.  She cornered my Uro, a while ago, and explained my request for BCG-dose reduction. He agreed to reduce the dose and said he would talk to the \"NP\" that administers BCG for his office    PTL.  It was either dose-reduction or NO more BCG!  She said I had contacted Dr Lamm about dose reduction.  My Uro said \"Yea, Don's a smart guy\"!\n\n\nIt's really tough living in a small city, where all the Uro's are out of the same office, and when the Corporation that owns our 2 hospitals, also owns the Uro's practice     Get my drift!\t\t\t", "date": "2009-09-12T13:20:20+00:00", "topic": "Started Maintenance BCG!", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n  The \"NP\"  says that bleeding is completely normal and not to be concerned.  Secondly, she said since I just came off antibiotics for 4-weeks, there could not be an infection involved, that maybe I should see my FP-Dr (go figure:S ). She in my opinion is a lost cause. In the room, dump in the BCG and out of the room in 6-min).\n\nGot the BCG Thur, today (Sun) bladder is sore (about a 3) and I feel like I have a \"nail\" stuck in my prostate (about a 3)and still burn to pee (no bleeding this AM).  The NP said the worse the side affects the better the outcome?\n\nI will check Monday, with reducing the mix to 50%, but I know they will not be receptive to it!\t\t\t", "date": "2009-09-12T13:20:20+00:00", "topic": "Started Maintenance BCG!", "subforum": "6-men-and-bladder-cancer"}]}