{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tHi again friends!\n\nIt is me with my latest question.\n\nJohn appears to be picking up a little, he is back on iv fluids, antibiotics and o2, but he has had a drop in haemogloblin from 9.6 to 7.2 from Sunday to today (Tuesday)  They were transfusing him again tonight when I visited.\n\nHas anyone else had problems with anaemia?.  He certainly did pre op, but I thought it would resolve .   This worries me.\n\nAnne Marie\t\t\t", "date": "2008-05-17T22:15:58+00:00", "topic": "seeking answers", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Patricia\n\nHe is having some bowel movements, but having spina bifida, he really does not have any control over it.\n\nHe has 2 areas of gaping wound, which are sloughy, but the underlying muscle seems to be holding ( I am a community nurse and have seen many worse wounds) but I know its going to need packing for some time.\n\nHe really is having a hard time, but we are going to get through this, he has our wedding to look forward to!!!!.   No date arranged, but we are working on it.\n\nAnne Marie\t\t\t", "date": "2008-05-17T22:15:58+00:00", "topic": "seeking answers", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi there\nI am from the UK, but hopefully things are not too different there.  I am a registered Nurse.  I work in the Community and I am involved in some Palliative Care.\n\nA basic principle of palliative care is symptom relief, pain and nausea can be and should be relieved. In my experience, even with feeding (is it parenteral nutrition?) there should still be a bowel movement and laxatives are very often required. Many types of analgesia cause constipation, and laxatives should be taken in conjunction with them.\n\nI find it horrifying you are not being given more help from the hospice, push for this, its a basic human right, there are many avenues to explore to alleviate symptoms of nausea and pain.\n\nI wish you luck\nAnne Marie\t\t\t", "date": "2008-05-28T05:24:38+00:00", "topic": "New to group - Terminally ill father w/ bladder mets", "subforum": "7-metastatic-bladder-cancer"}]}