{"signature": ["Surgery"], "posts": [{"text": "\n\t\t\t\tPosted mine!  Thanks for letting us know the review system was available!\t\t\t", "date": "2010-06-23T14:54:15+00:00", "topic": "ABLCS needs a minute of your time.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWalter,\n\nGreat to \"meet\" you although I know we all wish it were under other circumstances (OK, not with flashing lights behind us either!).\n\nOver the past 3 1/2 years, I have been on both sides of the whole cancer thing.  First, bladder cancer for me, and the following year, lung cancer for my husband.  There are numerous people on this site with similar experience, so hopefully we can help y'all both get through this.  For me, it was a whole lot harder being the caregiver than being the patient.  But, my cancer gave me some unique understanding of the treatment process and a much better ability to advocate for my husband's care.\n\nRight now, me and my husband are helping out a neighbor who is going through breast cancer.  What we have found is that her husband is having a really hard time grasping the exhaustion from chemo she is experiencing.  My husband didn't understand it when I was going through it either and was always pushing me to get up and go do stuff, while all I wanted was sleep. He learned all about it when he went through it and was VERY sorry for waking me up. Not implying that you are doing any of this, but it's something I have seen with other patients also.  So, if it applies, toss out the idea of \"get up and moving to get it off your mind\" and give her as much rest and relaxation as possible. I learned how to do a lot of new things when Scott was asleep (plumbing, carpentry, etc. - Shhh... I don't want him to know... then he'll make me start doing that stuff!).\n\nOn a side note, my husband is a former LEO, too.  And fire fighter, and paramedic.  I wonder at times if his lung cancer was at all related to all those years in the 70's & 80's fighting fires without airpacks but I guess we'll never know.\n\nHang in there... we're here for you.\n\nChristine\t\t\t", "date": "2010-04-06T00:43:32+00:00", "topic": "Thank you to all !!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPat,\n\nYou were the one person that helped me figure out my hypercontinence issue years ago, back when I was logged in as \"n3qtrtme\".  Thank you so much for making me feel normal when I clearly wasn't ever really \"normal\".  I even got them to try some stuff you recommended and they hadn't thought of yet.\n\nIt was shocking and sad to see this thread when I logged in again tonight after a long absence.   You have been in my thoughts numerous times in the past 2 years and will continue to be.  I don't much about breast cancer but am currently unemployed and have lots of time to do any kind of research necessary, or anything else that may help.  A lot of stuff is rolling through your head right now and I want to emphasize to you that you are important to a lot of people... people you may not ever even know about.  We all care about you and knowing this community and their breadth of experiences, would do anything to make this better for you.  I am sending my prayers and good karma and whatever else may help.  I'd even come do your laundry, clean your toilets and cook you casseroles if the commute wasn't so far. (Sorry, TX unemployment sucks) I know I speak for all of us... if there is anything we can do, you just say so.\n\nYou have been here for all of us... time for us to pay you back.\n\nI'll be thinking about you.\nChristine\t\t\t", "date": "2010-01-10T03:47:07+00:00", "topic": "Pat - Any new info. on test results?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'd like to 3rd the emphasis for a more thorough investigation!  I went in with UTI symptoms and we tried to treat it with antibiotics for about a month before they found the cancer via cystoscope.  Mine was BIG though and very obvious through the scope.  The scope is just a little camera that they stick up your urethra, bend around and visually look at the bladder wall.  There are a lot of reasons and ways that cancer can be missed just looking at a little eyepiece stuck down there.  PLEASE go get some additional tests done... your symptoms could be due to a number of different things, including things that are not cancer.\t\t\t", "date": "2010-01-14T19:03:37+00:00", "topic": "Pre diagnosis- recurring UTI’s need advice.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI ended up with a total of 4 TURBT's... not fun any of the times. The cheese grater sounds pleasant!  They had me on some pain pills (Vicodin) for a couple of weeks each time and a spasm reducer (Levsin, I think).  Those helped a lot.  I had a good bit of muscle wall involvement and at one point, the bladder had attached itself on the outside to the inside of my abdominal wall.  I think I was a pretty unusual case though.  I don't recall having catheters post-op...\n\nI did have major issues with the anesthesia (something about not breathing), so they kept waking me up in the recovery room with Narcan, which counteracts all the pain meds they use during the surgery.  So, you wake up with a freshly burned/scraped/cut-up bladder.  That was quite painful.  I kept telling the anesthesiologists about the problems and the kept doing it again... I was not so happy.  Maybe it was all part of their master plan to make me WANT to get that stupid bladder out of my body?\n\nChristine\t\t\t", "date": "2010-04-13T03:40:39+00:00", "topic": "An unofficial poll!  Please read!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMine \"rolls\" when it's full... kind of like when you have bad gas, but not painful.  Can't say it's vibrated though... could be kinda interesting!\t\t\t", "date": "2010-01-29T18:09:37+00:00", "topic": "Bladder VIbrations", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMine \"rolls\" when it's full... kind of like when you have bad gas, but not painful.  Can't say it's vibrated though... could be kinda interesting!\t\t\t", "date": "2010-01-29T18:09:37+00:00", "topic": "Bladder VIbrations", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou girls are just cracking me up!  Thanks so much for making my afternoon!\n\nChristine\t\t\t", "date": "2010-04-06T05:39:43+00:00", "topic": "THE INDIANA BLOG", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow... like I said, I thought it was a lot different... so glad you are happy with it and can share your story with all the newbies!\n\nI have a big scar that runs from just below my navel to the suprapubic bone, and a couple of little round scars on the sides from the JP drain and the stents.  The first year after surgery, I didn't want anyone to see that scars.  By the second year, I decided that I really didn't care anymore.\n\nOn the hospital concern, I had a fall from my horse last year and was knocked out for a bit.  Luckily, my husband was with me and was able to explain the whole catheter thing in the ER. It's pretty essential because one of the first things that happens when you go into shock is that your urinary system tries to get rid of everything possible. So, I got a new Medical ID bracelet.  After thinking about it, 90% of regular medical people will not have a clue what a Studer pouch is or what to do about it.  They need to hear it in \"layman's terms\" with specific instructions.  The new bracelet says, \"Bladder Cancer, must cath to void, ICE XXX-XXX-XXXX\" (my husband's cell #).  Something to think about...\n\nI am chuckling thinking about having you on the ambulance, unconscious, when your belly sends up a geyser... it would be really funny if nobody knew about the stoma!  I can just hear the conversation between the medics in the back...  \n\nI got mine here: n-styleid.com/ and was VERY impressed with the quality, price, shipping time, size flexibility and the styles offered.  I'd highly recommend them...\n\nChristine\t\t\t", "date": "2010-04-06T05:39:43+00:00", "topic": "THE INDIANA BLOG", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHow cool is that, Pat!  I had visions of this big, pink thing that looked like a wad of chewed gum in my belly-button or on my side... guess I had the wrong vision!  Maybe this is a bit too personal, but can you post a picture?  Or PM one to me?  I'd really like to see what one looks like!  You know, just a little shot of the new, \"useful\" belly-button... LOL  Maybe others would like to know, too? Especially the ones trying to figure out which diversion to choose.  I'll happily post the pics of most of my scars... to a point, you know... this isn't Playboy!   \n\nI'm kind of a visual person and can't say that my surgeon was much of an artist with a pen and paper, so I had to use my imagination at the time.  I may well have chosen the Indiana Pouch if I had a clearer picture of what it entailed at the time.\n\nThanks,\nChristine\t\t\t", "date": "2010-04-06T05:39:43+00:00", "topic": "THE INDIANA BLOG", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike, I copied your letter over to another thread for the benefit of another poster... I was pretty confident you would not mind.\n\nThanks,\nChristine\n\nBTW, how did your trip to Mexico go??? Did you get to go diving???  I wanna hear all about it!   ", "date": "2010-04-04T15:36:42+00:00", "topic": "My idea for letter to a local urologist....", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust wanted to thank you all for your input on this issue!\n\nI had another UTI last Thursday, so I brought this whole thread in with the referenced article and got to share it with my doctor.  He seemed to appreciate that I was doing what I could to educate him on the whole neobladder situation and he definitely has a clear understanding of what's going on in there physiologically. He still wants to do cultures when possible to make sure that there are not any \"superbugs\" causing the problems, which I am OK with now that I am back on insurance.\n\nConcerning the UTI's, I have been trying to figure out what is triggering them.  I think I have it narrowed down to spicy cajun food (not Mexican, for some reason).  Seems like the last 3 UTI's have all occurred the day after a meal involving cajun food.  My thought is that the neobladder (made from intestine) is freaking out from the spices and trying to combat them somehow.  Am I totally grasping at straws, or has anyone else experienced anything like this? It would be nice to determine the trigger and just avoid it!\n\nAlso, MAN they seem to come on FAST these days!  When I had my old \"bad\" bladder, I would get kind of warning twinges in the urethra area and I had about 3 days to get in to see a doctor for meds before it would get really uncomfortable. (Gee... wonder why it crapped out on me, right?)  Now, if my back starts hurting at 10 a.m., I am in excruciating pain by 2 p.m.  It took some real negotiating to get into the doctor's office right away this time and I knew it was going to have to be the ER if they could not see me.  What gives?\n\nWhat do y'all think?\n\nThanks,\nChristine\t\t\t", "date": "2010-02-02T02:39:23+00:00", "topic": "Neobladder and urinalysis for UTI", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo I have had my Studer pouch neobladder for about 2 1/2 years.  After the surgery, multiple urologists at M.D. Anderson emphasized that future urinalyses would be pointless because of the neobladder and the bacteria load associated with the intestinal wall construction.\n\nSince my \"installation\", I have had a few UTI's.  With the first one, it was a surprise.  Basically I felt kind of crappy, then the flank pain set in.  It felt like an elephant was kicking me in the kidneys continually.  I called my urologist at M.D. Anderson and he had me come into the ER.  At the ER, they did a very basic physical exam (vitals and tapped on my back to identify the areas that hurt, then palpated my abdomen).  There was no urinalysis, which was weird, but expected.  They told me that with neobladder UTI's, they basically confirm the symptoms and then prescribe an antibiotic, usually Leviquin.  Same thing happened for the next one, too.\n\nSo, I decided that since this seemed so routine, my normal doctor could handle it and I would save the long drive and expense of using M.D. Anderson, which is pretty much always an ER visit.\n\nI explained the process that M.D. Anderson used for UTI's when I visited my normal doctor, why they didn't do a urinalysis and he still REALLY wanted to do both a urinalysis and a urine culture.  I figured, what the hell, insurance covers it and it'll make him more comfortable.  No surprise that the UTI was confirmed by both tests.\n\nAnyway, I got the flank pain again this afternoon.  Being currently unemployed and uninsured until 3/1, I felt like doing those additional tests was just going to cost me more out-of-pocket money.  Even after talking about it, he was still pretty uncomfortable just treating with Levaquin but he did agree to it and even gave me samples for the 10 day treatment (Leviquin is expensive!).  I REALLY like this doctor, have a long history with him and can see why he has these concerns.\n\nWhat protocol do your doctors follow when they suspect a UTI?  It would be so nice to be able to present him with some documentation or a standard of care for this that we are both comfortable with.\n\nBy the way, strictures are not an issue... ruled out by all those other tests regularly done by M.D. Anderson at regular intervals.\n\nThanks for your help!\nChristine\t\t\t", "date": "2010-02-02T02:39:23+00:00", "topic": "Neobladder and urinalysis for UTI", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrom my experience working on an ambulance, here are some tips on the medication allergies you asked about...\n\n1) They ask you WHY you are allergic because there are a bunch of people who \"say\" they are allergic when they just don't really like the side effects, for example, my son thinks he's allergic to spaghetti. He's not - he just doesn't like it. I am not allergic to Cipro, but if you give it to me you will be seeing whatever I ate within the last week very quickly.  Good info to have.\n\n2) If you are really, truly allergic and will have an anaphylactic reaction, your throat will quickly swell up and if they do not treat you very quickly they will have to cut a hole in your throat and put you on a ventilator.  In that case, they have meds and tools that will counteract that reaction.  They will absolutely plan to have them ready and waiting if they may be necessary. This is life threatening and they need to know this up-front.\n\n3) A lot of people use the category \"allergic\" to entail a lot of different reactions.  Such as becoming combative (Mike!).  He's not going to have an anaphylactic allergic - he has a bad reaction - VERY bad.  Feel free... VERY, VERY free to tell them that you get combative if given a medication!  They will probably not give it to you considering the danger to themselves.\n\nGetting them to understand about our surgeries is something different.  Either me or my husband makes it very clear that I have a \"FAKE BLADDER\" that MUST be manually emptied.  That seems to cut through the fog of medical terms.  The medic alert bracelet never worked, so I stopped wearing it.  I'm thinking a tattoo might be a good investment... a big one.  Kinda like the big \"NO\" on the arm, but permanent. (Gee, won't that be sexy?) You never know when you might be brought into the ER unconcious from a car wreck and without someone to speak for you. If you have to cath and are not concious, they will NEVER suspect it.  NEVER.\n\nConcerning input/output from IV's, any nurse or doctor should understand that if it goes in, it must come out, but they don't always think about the \"out\" part immediately.  All I can recommend for that is to make sure you have someone who can track this for you if you can't do it yourself.  Make sure they understand this easy principle of in/out and have them keep tabs on the staff that does this.  Have them ask how much fluids you got in surgery or in the last 4 hours, and that what's in the foley bag is pretty close.  If it's not, you got issues and they need to fix them.  The best thing you can do for yourself is to train someone you know will be there if you are in the hospital to care for YOUR NEEDS.  They do not need to be medically inclined, just willing to question the nurses and doctors tactfully and cover your back when you are down.\n\nSorry to be so long winded, but what we have is not that common in the medical community.  We need to be our own advocate and also to train someone else to advocate for us.  When required, ganging up on them can be quite effective... just make sure you do it tactfully.  WE know what's going on and what to do and need to both educate our nurses/doctors and insist on specific procedures when necessary. WE ARE THE EXPERTS.  An ER doc or endocrinologist or even a regular urologist has no clue about our needs. Worst case, do what you can until the next shift comes in and start over with the new staff.  They usually work either 7-7, 7a-3p, 3p-11p, and 11p-7a...\n\nOK, that's my advice for what it's worth. Good luck!\n\nChristine\n(been to several ER's since RC)\t\t\t", "date": "2010-01-05T00:59:44+00:00", "topic": "Seriously Docs...how do we get your attention???", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tY'all are cracking me up!\n\nConcerning the mucous, I have figured out that diet has a lot to do with the quantity generated after about the first 6 months post-surgery.  You will figure out what the \"normal\" quantity is, then will notice it increases or decreases based on your diet.  For example, I get a LOT more mucous after a spicy dinner or any cocktails.  If you don't drink enough water, it can clog up your catheter.  That is SO not fun. If you drink lots and lots of water, you will get very little mucous.\n\nMy doctor had me drinking about 3 gallons of water a day, which caused me to have to cath every 2 hours or risk exploding. After the bladder training schedule, I went back to what I normally drank to stay hydrated and then got to a reasonable 4 - 6 hour schedule.\n\nI could really relate to your concerns about airing these types of issues online when you first started posting (different thread).  I was pretty modest, too.  I realized that all was lost when I was in the hospital recovering and I had gotten used to baring \"the goods\" for every yahoo that walked into the room to check on me.  One day, a guy walked in and I promptly pulled up my gown... only to find out it was the maintenance man there to fix the window blinds!  OOPS.\n\nGreat to see you are doing so well and are out enjoying the snow!\t\t\t", "date": "2010-01-09T01:37:19+00:00", "topic": "An update and a few questions..", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis topic peaked my interest because I guess I had a weird thought process when it came to my bladder cancer.  I figured out that my bladder was pissed off at me because I had not taken care of it (UTI's pretty much my whole life) and it got tired of dealing with me and grew cancer.  Kind of like when a kid pulls a dog's tail one too many times so it bites the kid... Anyway, I put the blame for the eventual RC on the bladder.  Yes, I could have and should have treated it better, but in the end, it was the bladder that made the decision that it needed to go away.  I don't know... like I said, weird.  But, it kept me, and still keeps me sane.\n\nWhen my husband got lung cancer 6 months after my RC, he seemed to blame himself for causing it.  I won't argue... he'd been tempting fate for a long time with his history as a firefighter (back in the days when they did not wear gear) and being a smoker.  BUT, his approach made it MUCH harder.  His treatment was harder to get through, his lows were a LOT lower, etc.  He didn't target the offending organ, but himself as a whole.\n\nAnyway, for what it's worth.. I really do believe that the approach you take to dealing with this has a huge impact.\t\t\t", "date": "2010-01-14T22:39:08+00:00", "topic": "To OWN (or NOT to own) my cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSylvia,\n\nPatricia e-mailed me and suggested that I look you up on the site. Here's the info you requested:\n\nName: Christine Springfield\n\nAge when diagnosed:38\n\nGeneral location (State/City): Houston, TX\n\nStage when diagnosed and number of years a survivor: T3/G3 - Squamous Cell/Transitional Cell Carcinomas, not sure if you are considered a \"survivor\" from the diagnosis date (12/22/06) or the date they got it all out of you (4/27/07), so I will let you figure that out!\n\nShort statement about your experience: What a wild experience it was!  I have to say, I was in shock for about the first 3 months and I'm not sure I totally grasped what was going on.  I put myself in the hands of the best medical team possible at MD Anderson and just rolled with the punches.  I took it all one day at a time and did my very best not to let the chemo and surgeries stop me from doing what I wanted to do.  Between the 2nd and 3rd rounds of chemo, I spent a week riding my horse into Houston on the annual Houston Trail Ride for the Rodeo.  Recovering from the surgery that installed the Studer Pouch was a bit more difficult, but I was recovered before too long.  I did become hypercontinent post-surgery, but that has not created any problems.  You just learn to adapt.  I still ride my horses, go SCUBA diving, fish, hunt, and do absolutely everything I did before bladder cancer.  I wrote a blog during the experience that's available at www.caringbridge.org, under \"christinespringfield\".\n\nHow you found ABLCS and what it has meant to you: I found ABLCS after I was diagnosed and have participated ever since, sometimes sporadically, as the fake bladder and bladder cancer really isn't something I spend every day mulling about.  It has provided me with a group of friends that I can use to answer questions I run into, as well as giving me a way to help others dealing with cancer.  Just because somebody says \"cancer\" does not mean that life is over!  Things may end up a little different than you expected, but heck, most of life seems to work out that way.\n\nAnyhow, you have my permission to use anything here, anything I have written on the site, and anything in my blog to assist in your awareness campaign.  I will be happy to help in any way possible, too.  Just let me know what I can do to help.\n\nReading the Vogue article on Patti Hansen was incredible!  That was a huge step in getting the word out to the rest of the world that we are not all old men!  I have made no secret about this to anyone know and encourage all their questions, no matter how personal in nature or how odd they may sound.  I am not shy and would love the opportunity to help raise awareness.\n\nThanks!\nChristine Springfield\t\t\t", "date": "2010-07-28T22:22:20+00:00", "topic": "We need your assistance! Female BLC Awareness", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tSydelle,\n\nI am coming up on the 4 year survivor mark myself and my hubby (Scott), who was diagnosed with lung cancer a year after me is coming up on his 3 year survivorship, too.  I remember that for about the first 2 years, I was incredibly stressed out about check-ups and recurrence.  Pretty much a hangnail would get me concerned and into the doctor's office I would go. I know he had to be rolling his eyes every time, but he treated me with kindness and compassion.  I think I really just needed to extra assurance that I was going to be OK.  It took about 6 months to really wear off and life has gotten back to normal.\n\nFor Scott, he just had his follow up yesterday, and I can actually feel the stress decreasing with each \"clear\" pronouncement.  It really does get better with time, and eventually you will find that you are not holding your breath quite so long or dreaming of every worst-case scenario when he sees a doctor.\n\nThere are indeed LOTS of 5+ year survivors out there, it's just that once you get through this whole messy process of dealing with cancer and you are back to living a \"regular\" life day-to-day (not thinking of cancer every waking moment), you don't really think about it very often, so visiting boards like this becomes lower priority, or even undesirable.\n\nThe first few years post cancer can be incredibly stressful. It seems like you are \"on watch\" every minute. I found that a mild anti-depressant helped for a few months.  It worked for me, but everyone has their own opinions on them, so it's just a thought.\n\nLiving each day to the fullest is a great concept, but when you are mired in the worries, that can be a tough order.  Do the best you can.  There IS a light at the end of the tunnel and this is an excellent place to connect with others who can relate.\n\nBest wishes!\nChristine\t\t\t", "date": "2010-04-01T00:37:50+00:00", "topic": "holding it together", "subforum": "20-caregivers-questions-and-comments"}]}