{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tWe all need a laugh and that is a good one.\n\nClara\t\t\t", "date": "2009-01-07T19:37:52+00:00", "topic": "another slightly-off laugh from Iowa", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tRene,\n\nI too am anxious to hear what you find out on the visit to Duke.  Both os my daughter's in-laws were treated at Duke for different cancers and my son-in-law thinks there is nothing like Duke.\nSeveral others have posted in the past that they prefer Chapel Hill for BC.\n\nBob goes to Forsyth which is a round trip of 47.4 miles for us and I have been pleased with his doctors but I never recommend them because I know that most people lean towards a teaching facility.   Every situation is different and we need to go with what is most comfortable for us.\n\nGood Luck\nClara\t\t\t", "date": "2008-06-06T20:13:57+00:00", "topic": "My mom", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTate,\nTake good care of yourself and I hope you can still get that degree in the future.\n\nKeep us posted.\nClara\t\t\t", "date": "2008-04-26T12:22:07+00:00", "topic": "Good News-well, as good as it can be ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Balihigh,\nAnother North Carolina person here, about 25 miles from Winston-Salem.\nI am the caretaker for my husband and his doctors are in WS too.\nKeep us posted.\nClara\t\t\t", "date": "2008-04-15T14:44:31+00:00", "topic": "New to Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTate,\n\nThat just makes my day!\n\nI needed to hear some good news for someone on this forum.....\n\nPrayers and Love\nClara\t\t\t", "date": "2008-07-31T20:53:29+00:00", "topic": "Just wanted to share my good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBetsy Mae,\n\nI love to hear good news and I am happy that you got that good news!\n\nClara\t\t\t", "date": "2008-09-09T14:01:56+00:00", "topic": "Good news!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI took early retirement at 55 along with a big cut to do so.  After I retired, my insurance went up so much that I went on Bob's policy at USAirways.\nWell, everyone knows what happened there so I am now on Cobra and if something happens to Bob, I will have to search again until I turn 65.  I am 62 now.\nThe doughnut hole is killing us on the pain med. and we are definitely on a fixed income.  Sometimes you just wonder if it is worth it all.   My Mom lives on her SS and gets her meds. for $2.+ and $5.+.\nI am thankful for what we do have and especially the days together but life is really tough at this time.  The economy really has hit everyone, especially those of us on those fixed incomes.\n\nIt seems that the rocking chair or glider have really grabbed Bob and I cannot get him out of the house except for dr. visits.   Everyone tries to encourage him to just take a ride and we cannot figure out if he just does not feel like it or if the depression is just that bad.\n\nClara\t\t\t", "date": "2008-08-18T22:19:43+00:00", "topic": "R/C\\'s,, for us over 60,,,what we face!!!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia,\n\nI am sure you are right about that paper work.\n\nMy husband, Bob had 5 PET scans last year.  We were told after the 3rd one that insurance would not cover but either he was put into the \"PET\" bank that you referred to or the insurance covered it.   I am not sure which one.  Each scan was over $4,300.\n\nBob's BC had metasticed so much that the PET scan is what he needs and his doctor has been so good at ordering whatever he thinks is needed.  Sometimes we are not so sure that that many scans are good for you but at this point with Bob, I do not think it would make much difference.\n\nAfter going through cancer with my younger sister and a niece, I definitely think PET scans are in order if the concerns are there.\n\nClara\t\t\t", "date": "2008-08-05T19:55:35+00:00", "topic": "PET Scans?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuch wonderful news!  We all need to hear that.\n\nClara\t\t\t", "date": "2008-07-23T17:48:37+00:00", "topic": "My choice", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tInteresting but scary pictures, especially if the diagnosis is Stage IV with met. as Bob's is.   The last PET scan showed some activity in the R pelvic area which really scares me.\nAnother PET scan will be done next week though.\n\nClara\t\t\t", "date": "2008-05-17T16:52:30+00:00", "topic": "Stages-What they look like ", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have seen Chemo Brain in my Sister, my Niece and my Husband.\n\nOn my last visit to the Dentist, the person cleaning my teeth told me that her husband actually had Chemo Depression....it was very real and he had to be committed for awhile but is fine now.\n\nBeing the Caretaker of my Husband, I sometimes wonder what kind of brain I now have, I too forget things so easily, have a hard time keeping up with everything but then I think a lot of mine is called \"overload & depression\".   A notepad is always near me to help me through what I need to do.\n\nClara \t\t\t", "date": "2008-04-04T22:45:50+00:00", "topic": "MD Andersons newest on Chemo Brain...it really exists!!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoe,\n\nIt is always good to hear some good news....good luck to you.\n\nClara\t\t\t", "date": "2008-03-14T14:46:16+00:00", "topic": "MRSA Gone", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so happy that you realize what a good caregiver you have, just show her lots of love.\n\nClara\n\n\n", "date": "2008-02-17T15:03:02+00:00", "topic": "Journey for bladder removal.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou certainly have reason to celebrate!\n\nClara\t\t\t", "date": "2007-10-30T20:39:07+00:00", "topic": "Path Report", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat ideas.\nMy husband took a cheaper version of the MP3 to chemo treatments....I think he enjoyed having some of his favorite music with him.\nClara\t\t\t", "date": "2007-09-27T01:48:53+00:00", "topic": "Going into the hospital? I have a suggestion", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI hope everyone continues to share any helpful websites.\nClara\t\t\t", "date": "2007-09-16T01:30:14+00:00", "topic": "Melodie's After Surgery Report", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is so good to read some good news....\n\nClara\t\t\t", "date": "2007-09-22T00:07:08+00:00", "topic": "Gene Beane Pathology report", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPlease do ask ALL the questions you want to...it is your right to know.\n\nRadiation seemed to help Bob more than anything else.\n\nGood Luck and know that we are all behind you and want you to keep us posted.\n\nPrayers are with you and your family.\nClara\t\t\t", "date": "2009-01-06T01:54:04+00:00", "topic": "Devastated as my cancer spreads to bones..........", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie, Stephany, Karen,\n\nI have not been on in awhile but decided to see what is going on and as I read this, realize how much I miss my friends and support group.\n\nMy heart goes out to all of you as I too continue to look after Bob.\n\nSeveral years ago, Bob enclosed our carport for a den big enough for all of our children when they come in.   We have enjoyed that room so very much so when we came home from the hospital in Sept. and Hospice came in behind us, we just had the bed set up in there for Bob and I have slept on the sofa ever since.\nBob became completely bedridden about a week after we came home so we did not have a choice of moving him anywhere else.   I have my bed rolled up like a sleeping bag every day and just put it back out at night.   Whenever I need a nap and have a chance for one, I just lay back in one of the recliners and sleep.  Bob is still sleeping all night.\n\nI do have a hard time turning Bob to change him and I have found it is much easier to just use the pads on the bed.  He wears hospital gowns and we do not even tie them, just tuck them up around his neck and under the pillow.\nA friend brought two big slanted pillows that have been a great help in supporting him on his side for me to change him.   At first, I used the pillows to hold him over when I turned him but now he cannot lay on his left side except just long enough for me to change him because it hurts his right arm and shoulder so badly.\n\nHe cannot even turn his head to the left.  His right ear stays sore because he lays on it so much but the Hospice nurse brought me something that acts as a barrier when we rub it on the ear and does help.\n\nI have no idea how much Bob weighs now but he has certainly lost a lot of weight.  Eats very little, never gets hungry.  I am starting to see a little confusion now but mostly it seems as if he has been dreaming but never remembers dreaming.\n\nI too follow the book to try to figure out what is going on.   It should not be much longer and it is so sad to see an active man laying so helpless now.\n\nMy heart goes out to all of you along with love and prayers.\nClara\t\t\t", "date": "2008-12-02T06:05:05+00:00", "topic": "Puzzled", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSorry that I did not read this message before now but the white blood ocunt was 2.9 and the hemoglobin 8.9.\n\nGood Luck\nClara\t\t\t", "date": "2008-09-29T14:07:07+00:00", "topic": "Update on Bob.....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie,\n\nI have to monitor everything for Bob now too.  Even typed up an instruction sheet, step by step for this catherization.   All of this med. he is on really fogs up his mind.\n\nWe have enough on us without aggravations when we need supplies, etc.   Just shows that we have to stay behind everything.\n\nHope Dick gets some relief soon.\n\nClara\t\t\t", "date": "2008-09-06T05:12:40+00:00", "topic": "New Pain Doc.", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tLeigh,\n\nThat is great news and we are here to cheer you on!\n\nEnjoy every day to the fullest and keep in touch.\n\nClara\t\t\t", "date": "2008-08-28T20:28:47+00:00", "topic": "Wonderful News", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThanks for the update on Zackary...he is missed.\n\nPrayers are certainly with him and his family at this time.\n\nClara\t\t\t", "date": "2008-08-27T19:48:06+00:00", "topic": "Update on Zackary", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie\nSounds like you and Dick had a fun week and made lots of memories for those granddaughters.   Please do share pictures when you get them.\n\nGlad to hear about the chair and keep Dick as active as you can.\n\nIt is so hard staying at home every day.   I am still working at getting Bob out just to ride some.\n\nHe slept almost all day yesterday and has today too but I can understand that since he had the chemo on Thurs.\n\nGood Luck with your Dr. and I know you are on top of everything.\n\nPrayers and Love\nClara\t\t\t", "date": "2008-08-31T01:16:43+00:00", "topic": "Still fighting", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie\n\nGlad to see you back online and glad to hear that Dick is taking an interest in his music.\n\nSounds like we are still kind of \"in the same boat\" but I am so thankful that we can give that support and manage all we do.\n\nGoing to see if Bob can have chemo today.\n\nLove and prayers,\nClara\t\t\t", "date": "2008-08-20T04:26:02+00:00", "topic": "Tears Today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBob was not able to have his treatment today, blood counts down too much again.  Seems like he has had so much done that his body is having a hard time rebuilding cells.  I knew he had been zapped for the last two or three days and also losing weight again.  Lost two more pounds this week.\n\n\nWe go back next week.\n\nClara\t\t\t", "date": "2008-08-16T21:19:26+00:00", "topic": "Bob is giving chemo another try....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBob is on protonix morning and night now.   Takes Reglan 30 min. before each meal and at bedtime.\nHas Zofran as needed but has not used it since he started taking the protonix twice aday.   When he left the hospital, they had told him to take it in the morning and he continued to get sick.\n\nClara\t\t\t", "date": "2008-08-05T01:19:13+00:00", "topic": "Monday results", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI will agree with you on that.\n\nOur last incident was Sat. at the ER.   Thought Bob had a blood clot or clots but after an ultrasound was done, decided it was cellulitis.   Had a shot and is on Keflex 4 times a day.   The report said it was in his R leg and shoulder..I have not figured out the shoulder deal yet but we will see our oncologist on Thurs. for a follow-up on this and other issues.\n\nYes, it is hard to sit there and wait.   Seemed like 25 people came in to do something.  Just glad we could come back home.   I am glad to get up at 1am to give a pill instead of being in the hospital.\n\nClara\t\t\t", "date": "2008-08-12T05:05:28+00:00", "topic": "Too much time spent in Medical Facilities", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tGinger,\nI think your idea is great...the only experience I have had was when the man my sister planned to marry had a stroke and was sent to Kate Reynolds Hospice in WS and also a young cousin spent time there.\n\nFrom what we observed there and from reports of other people that have used the facility, you could not ask for better care.\n\nOne night when I was there, one of the churches had sent food for the families for anyone that needed it.\n\nAlso, my cousin had a dog and they were allowed to bring it in for her.\n\nThere is a Hospice facility within two miles of our home and a friend was a nurse there but it was not being used as much for hospice as it was for rehab for patients that had broken bones and were on their way home.\nShe has gone back to Forsyth Hospital in the ER but she said she knew all the girls that worked near us and she would highly recommend it to anyone.   I am really hoping we will be able to do inhome care...but who knows.\n\nI just thank God for every day we have here.\n\nPrayers and love\nClara\t\t\t", "date": "2008-08-03T16:39:02+00:00", "topic": "HOSPICE,,  share your experience , to help others!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBob had a shot of Aranesp one week ago and is scheduled for another next Thursday.   Sometimes I think we cannot win for losing....\n\nThanks for all your helpful info that you post.\n\nClara\t\t\t", "date": "2008-07-31T03:00:21+00:00", "topic": "FDA issues warnings on Procrit and Aranesp", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie,\nI just now read your post and am so sorry that this is happening.\n\nHang in there even though I know that sometimes we feel like we get one step forward and two steps back.\n\nPlease keep us posted on what is going on.\n\nLove and prayers\nClara\t\t\t", "date": "2008-07-29T18:01:27+00:00", "topic": "This weeks issues", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThanks Ginger for your continued support....after all we Caregivers have to stick together and get through all of this.  No one understands until they go through this what it is like.\n\nToday I was talking to a Niece that is a Colon Cancer Survivor and I can remember how little she got and absolutely could not eat.   She continues to emphasize that people do not know what it is like until they go through it.  She helps me a lot too.\n\nBob has eaten a little better today even though the scales were even down more this morning and he is taking something to increase his appetite.  I am hoping I can get him out some this next week.   He just has not wanted to do anything, just content here at home.   Lots of friends have come by lately and that helps me too.\n\nGlad you were here tonight to say the words I needed to hear.  I will be signing off in a few min.\n\nLove and prayers,\nClara\t\t\t", "date": "2008-07-18T00:08:20+00:00", "topic": "Update on Bob....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tOn Thursday we went to the cancer center for lab work, to see the dr. and hoping they could get on with the chemo (gemzar and carboplatin).\nThe blood counts were up some and the PA said that with the differential??? he could have a treatment but she was concerned because he had lost 3 more pounds and just did not seem to be up to par.   She went to talk to the dr. and they both came back.   Dr. could also tell that Bob's physical condition did not seem good but let Bob make the choice of whether or not he wanted to have the chemo.   Bob asked what I thought and I told him that this was one time that I could not make that decision.\nDr. said if he did not want to go through with it, go home for 3 weeks and come back unless he gets to feeling better before then and is ready for the treatment.\nBob had a shot of avanesp to try to build him up and he will have another in two weeks.  Hopefully he can have the treatment in 3 weeks.   If they cannot give him the chemo to try to treat the cancer then probably other steps will be taken (such as Hospice being called in).\nThis has been very hard for Bob and myself.  We actually talked about it some on Thurs. night.  I may not be the patient but I sure do hurt.\n\nClara\t\t\t", "date": "2008-07-18T00:08:20+00:00", "topic": "Update on Bob....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tGeorge,\nI am a little behind on the forum but just read your posts and want to encourage you to take a day at a time.\nMy husband has had to make choices lately whether to take chemo or not and I feel that he is worth whatever it takes until he feels like he cannot do it anymore.\n\nPlease take good care of yourself and really try to check out all of your options while you are healing.   I wish you the very best.\n\nClara\t\t\t", "date": "2008-07-24T03:24:26+00:00", "topic": "wind out of my sails", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tCynthia,\n\nThank you so much for getting this up so quickly.\n\nClara\t\t\t", "date": "2008-07-21T18:01:31+00:00", "topic": "Just a thought", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tCynthia,\n\nI think that is a great idea.\n\nClara\t\t\t", "date": "2008-07-20T21:32:05+00:00", "topic": "Memorial Page", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tLorrie,\nI can really identify with you and your Bob.....mine does not look well either.  His color is just bad and he is so doped that he just sits and sleeps.  Many times things he does say are really foggy.\nWe will find out Thursday if he can have another chemo treatment or not.\n\nPrayers are with you\nClara\t\t\t", "date": "2008-07-08T11:18:48+00:00", "topic": "Just Saying Hello", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThanks so much for keeping us posted....so many prayers are going up for Susan and her family.\n\nClara\t\t\t", "date": "2008-07-07T02:53:10+00:00", "topic": "Susan  update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tGood Luck to you all.  I am really hoping and praying that the quad. will still work.   I know it is hard just seeing our men drugged up all the time.\n\nClara\t\t\t", "date": "2008-06-26T13:58:59+00:00", "topic": "Blood Transfusion Today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHolly,\nPlease keep us posted on Susan.\n\nThis all makes me so sad.  When Bob had his catheter put in we were told that he had no feeling in his bladder and I felt so badly that I had not taken him to the urologist earlier but he had continued to go to the bathroom.  Just could not ever get his bladder empty.\n\nYes, Susan is a very sweet lady and has always added to this board.\n\nClara\t\t\t", "date": "2008-06-24T14:04:05+00:00", "topic": "Susan is ok :)", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nThanks for the update....\n\nI am very anxious to see Angelo does with this.\n\nLove and prayers\nClara\t\t\t", "date": "2008-06-11T19:25:39+00:00", "topic": "&amp;amp;quot;Got The Shot&amp;amp;quot;  (for Bone Mets)", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tWe met with a new Dr. yesterday for help with the lack of bladder control.\n\nAfter sitting there for one hour we were called back but then the dr. really spent time going over Bob's records, first CT or bladder, checking him.  He made the statement that Bob's bladder was really diseased when this was found and kept referring to the \"bad prognosis\"..\nBob had an ultra sound and we found out that he has no sensation in his bladder, he has been retaining a lot of fluid because of this.   He was constantly going to the bathroom but could not empty his bladder.   The dr. catherized Bob and we go back next week on Thursday for the nurse to remove the catherer.   On Friday, we will see the Dr. and he will have another ultrasound to see if he just retains his fluids.\nThe Dr. said we would talk more then.   He did not have much of a bedside manner but he was very thorough which is important to me.  We were in there for 1 1/2 hours after he came in there to see Bob.\nThings are not looking real good here now.  Just had to tell you all the update.\nLove and prayers for you all,\nClara\t\t\t", "date": "2008-06-10T21:58:30+00:00", "topic": "Bob's visit to the urologist", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie,\n\nBob is on pain medicine and he is only taking about 3 breakthrough a day now.  The pain ususally starts late in the afternoon/early evening.   He will move from chair to chair, room to room, walk around until he can finally get settled down.  Many nights he ends up in a glider and says he is most comfortable their.   We have two different kinds of recliners but a glider seems to be his favorite.\n\nI am so glad we will be in a house at the beach so he will have several options there too, inside and outside.\n\nThanks for caring.\nClara\t\t\t", "date": "2008-06-02T23:51:11+00:00", "topic": "We received the report on Bob's last PET scan today.....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJulie,\n\nBob has had radiation to ribs 3 different times.  The first two stopped the pain but after this last one he continues to start hurting almost every late afternoon/evening.   The rib and back areas have caused most of his pain.\n\nIt is hard to deal with but we just keep praying and Bob continues to pop those pills.  He too is so emotional but tries so hard to keep me from seeing him that way which I had rather him let it go.  My zoloft controls a lot of my emotions which can be bad too.  Sometimes I feel that my heart is just breaking into when I am really crying inside.\n\nPrayers are with you.\nClara\t\t\t", "date": "2008-05-13T22:52:46+00:00", "topic": "Another punch to roll with", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSusan,  There is no place like home....hope you feel better soon and please keep us posted.\n\nLove and prayers,\nClara\t\t\t", "date": "2008-05-21T00:06:38+00:00", "topic": "I am home in Mississippi", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nI am thankful that Angelo has you to look after him and I know you really stay behind the doctors.\nHopefully, you brought him home today and he will most definitely rest better with his family by his side.\n\nSome of the posts I have been reading is exactly why I have tried to keep Bob out of the hospital and just pray that he can continue to be at home.\n\nThe medicine that he had to change to was making him a zombie last week but we have cut back this week and he is doing some better.  I took him to the beach last week and we spent a lot of time with his/our son and his family.  It was good for all of us to be together.\n\nPlease keep us posted and your family is certianly in my prayers.\nClara\t\t\t", "date": "2008-05-20T05:18:08+00:00", "topic": "List of My Husbands WRONG Discharge Medications...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nI admire your persistance and certainly hope the radiation will help get rid of the pain.\nAfter Bob had his last radiation, I talked to the Dr. about it because everyone had me scared that his bones might break more easily and she said the bones should start mending themselves.\nHang in there and keep everyone posted.\nLove and prayers,\nClara\t\t\t", "date": "2008-05-08T04:51:47+00:00", "topic": "A Perfect Example Of Why A Second Opinion Is ALWAYS NECESSARY", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tLisa,\nIt is important that you do let your BC friends know what is going on--we care and pray for you too.\nClara\t\t\t", "date": "2008-05-08T12:17:21+00:00", "topic": "my cancer has spread ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tCongratulations on your retirement!\n\nMost of all, good luck on your trip to MD Anderson and please keep us posted.\n\nLove and prayers are with you and I hope you will be feeling better soon.\t\t\t", "date": "2008-05-03T13:18:01+00:00", "topic": "Going to MD Anderson Monday, I hope for treatment", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tYes, I think we stay \"kids at heart\" and there is certainly nothing wrong with that.\n\nAt least we are all in this together, through the good times with our children and their families and the good and bad at home.   Every day is a blessing though and I am just so thankful that I can be here.\n\nClara\t\t\t", "date": "2008-04-21T16:59:15+00:00", "topic": "Where We Are Today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJoe,\nThanks for sharing your feelings, it might help some of us that are on the other side of the fence.   I know that I walked into a room today and Bob was sitting there with tears rolling down his face.  He had picked up a basket of cards that he has received since his diagnosis and had been reading them.   Emotions run so near the surface now.\nClara\t\t\t", "date": "2008-04-21T16:59:15+00:00", "topic": "Where We Are Today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBob completed the radiation on his upper spine today, brought a huge mask home!\n\nHe will complete radiation on the right rib area on Friday and then unless something else shows up, we are off until PET scan at the end of May.\n\nBiggest problems now, trouble swallowing and sore throat but has medication for both and it should go away in a couple of weeks.\n\nAlso, having to get up during the night CONSTANTLY to urinate...\n\nLooking forward to a good month off though.\n\nClara\n", "date": "2008-04-09T01:12:51+00:00", "topic": "where did everybody go?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\t   Bob and I went to the Cancer Center yesterday for his radiation treatment and also for another CT scan on a rib area that is really hurting him now.  Every time we go, I just think about ALL the people that are there for treatments and how it has affected their lives.\nThey were having \"Feel Good Friday\" and it is wonderful to see the caring people that come out to lend a hand, trying to help everyone have a chance to do something good for themselves.  I had my nails done by a young lady that is a sophomore in high school and was on spring break.  She came with her Mom that comes every month to do nails.\nThis site is certainly a support for me and my heart goes out to everyone here.\n\nClara\t\t\t", "date": "2008-04-04T00:32:13+00:00", "topic": "I'm so sorry", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\t  I was also confused about the site Virtual Memories but glad we know about it now.\nIt is a wonder memorial which I visited this morning.\n\nClara\t\t\t", "date": "2008-03-18T01:37:45+00:00", "topic": "Thank you", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI do not think I posted the results of Bob's MRI on his shoulder and neck.\n\nAfter this was done, we received a call from the Oncologist saying that the pain in Bob's arm does seem to be coming from C7 vertebra, lesions in there are eating away at the bone.  I was not really surprised after reading the results of the PET scan.\n\nWe decided to take a break and went to the coast for a week.  Have an appointment on Thursday with the Radialogist.....\n\nI am going to ask about the Quadramet.  At this point, I guess we become desperate for relief and comfort.\n\nLove and prayers\nClara\t\t\t", "date": "2008-03-03T21:49:36+00:00", "topic": "Results of Bob's PET scan......", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tOH, how I appreciate all the responses and support.\n\nMy love and prayers are with all of you and every day is a \"Blessed Day\"\n\nClara\n\n", "date": "2008-03-03T21:49:36+00:00", "topic": "Results of Bob's PET scan......", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tPlease do keep us posted on all of this, I find it very interesting and do believe in many of the remedies that people try.\n\nClara\t\t\t", "date": "2008-03-01T17:48:37+00:00", "topic": "Dr. Chang &amp;amp;amp; Meridian Medical", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSusan,\nHang in there and count every day as a blessing.  Prayers and love are with all of you....you are truly a trooper!\n\nKeep us posted and have a blessed day.\n\nClara\n\n", "date": "2008-02-28T03:27:59+00:00", "topic": "Susan -- Today is the first anniversary of my diagnosis", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tjulieann,\n\nMy husband had a series of chemo but his body did not react to it very well and I honestly do not think his heart could take it.\n\nHe did have two different rounds of radiation but even was sick after each of those.\nI do think the radiation helped in his case.\n\nI think quality is more important than quantity sometimes and Bob's doctor seems to know that quality is best for Bob at this time.   He does still have his port-a-cath in case he might need chemo in the future.\n\nHang in there and know that you are certainly not alone.\n\nLove and prayers\nClara\n", "date": "2008-02-15T00:52:25+00:00", "topic": "No chemo", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tMy husband, Bob has stage IV bladder cancer which has metasized into many other areas of his body.  He had his first before doing any treatments, had his cyles of chemo, has had radiation (10 treatments each time) 2 different times on different areas of his body.  Seeing how he felt and reacted to the chemo, I am glad his doctor is not suggesting anymore.   He has had some quality time this year.\n\nHe had five PET scans last year and will be having one on Feb. 27th (his 72nd birthday).\n\nEvidently, this is the best test for them to follow up on al lthe extensive bone lesions he has.\n\nThe PET scan did show the cancer in the bladder.\n\nClara\n", "date": "2008-01-22T00:11:45+00:00", "topic": "bad news please advise", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tAimeth,\nI cannot remember how long before Bob was in less pain but it definitely took awhile.  Yes, I do think they just tell you something.\nThe radiation does continue to work after treatments...I have been told at least 2-3 months.\n\nKeep us posted.\n\nClara\t\t\t", "date": "2007-12-06T01:15:04+00:00", "topic": "New ct scan results", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tPlease keep us in your prayers.\n\nThe last few weeks have been the best that Bob has had in 2007.  You almost forget about that big \"C\" word but now we have to face the truth.\n\nClara\t\t\t", "date": "2007-12-02T21:43:00+00:00", "topic": "Verdict from 5th PET scan this year will be given tomorrow for Bob.", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI too am so sorry to hear of your Dad's loss.\n\nPrayers are with you.\n\nClara\t\t\t", "date": "2007-11-16T02:08:05+00:00", "topic": "My Dad's Passing.....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tTeresa,\nI too am in NC.  So sorry to hear about your Mom but she was one very Lucky Lady to have a daughter like you .... I too have a Teresa and feel so blessed.\n\nPrayers are with you and your family.\n\nClara\t\t\t", "date": "2007-11-06T16:22:08+00:00", "topic": "Lucky, ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tPrayers are with you and your family.\n\nClara\t\t\t", "date": "2007-11-06T21:02:07+00:00", "topic": "Results are in...Not good.", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nSo happy to hear that you did the balloon ride!\n\nWe went to Maggie Valley and Cherokee last week; Bob made the trip good so we are leaving for Sunset Beach area on Sunday for a week.  Bob's son lives in that area.\nAnother couple is going with us and we are planning on a good time.\n\nLove You\nClara\t\t\t", "date": "2007-11-05T15:30:11+00:00", "topic": "Experience Things You Have Always Wanted To Do!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nChemo and radiation together had been mentioned before Bob had the radiation to the pelvic area but then the dr. decided to just to with the radiation.  Bob is older than your husband and did not tolerate chemo very well; also, it probably only kept his tumors from growing but did not shrink them.\n\nBoth times that Bob had radiation, it was only 10 treatments.  First to the pelvic area and a left rib.  Next 10 to lower back and a right rib.\nI think it depends on the individual whether they can handle both at one time or not.  I have know others who did have both at the same time.\n\nClara\t\t\t", "date": "2007-10-16T16:07:23+00:00", "topic": "Radiation During Chemo Treatment??", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nLove and prayers are with you and your family.\n\nPlease keep us posted.\n\nClara\t\t\t", "date": "2007-10-09T22:51:10+00:00", "topic": "Prayers Needed Tonight! CT Scan Tomorrow....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBob and I saw the radiologist today.  Dr. Evans said that she thinks Bob needs 10 treatments to his lower back and also to the R rib that had started bothering him.\nHe will be prepped on Tuesday for the treatments.\n\nWe also saw the before and after radiation CT scans of the tumor in the bladder.  It appeared to have shrunk it quite a bit which was good news for us.\nShe also said that she and the oncologist talked and there are only a couple of very small new places and the cancer Bob has does not seem to be growing fast now.\nWe took this to be good news also.\n\nEverybody hang in there and enjoy every day.\nClara\t\t\t", "date": "2007-05-15T03:41:57+00:00", "topic": "Update on husband's diagnosis", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nBob had another PET scan yesterday and we will hear the results next Monday, Aug 27th.\nHe continued to have more and new pain after radiation (on areas that were not radiated) and we had to change meds several times to get it under control.  Still has some breakthrough pain but at least it is not a number 6 now.\n\nWe need lots of prayers as we wait to hear the verdict.\n\nThis is a great website to be able to know what others are going through and share our experiences.\n\nPrayers and love to all of you.\n\nClara\n\nWell, yesterday was the day....the PET scan had not changed much at all.  \"There has been a mixture responce in the new aortocaval lymph nodes in addition to a lymh node within the inferior left paraaortic region that were not present on the previous examination.  There is mild increase within the proximal sigmoid colon and this finding accompanied by the mild thickening in this region should raise the possibility of a proximal colon malignancy.\"\n\nOh, if we only knew how to interpret all of this.\n\nThe oncologist said he did not feel any chemo would be beneficial to Bob at this time but we will see the radiologist on Thursday to talk about radiation to the R rib which has been hurting and also will talk about the lower back.\n\nHe did say that we might go to the pain clinic for the lower back pains after the radiation.  Part of the pain in the back can be coming from degeneration and other problems that are there beside the cancer.\n\nJust trying to get pain medication adjusted to control the pain at this point.\n\nAll of our family was really dreading this visit since Bob has had a lot of pain in the last two months but we all felt better when we left the office.  Looking forward to every day that God gives us together.\n\nThanks for all the support.\nClara\n ", "date": "2007-05-15T03:41:57+00:00", "topic": "Update on husband's diagnosis", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBob had another PET scan yesterday and we will hear the results next Monday, Aug 27th.\nHe continued to have more and new pain after radiation (on areas that were not radiated) and we had to change meds several times to get it under control.  Still has some breakthrough pain but at least it is not a number 6 now.\n\nWe need lots of prayers as we wait to hear the verdict.\n\nThis is a great website to be able to know what others are going through and share our experiences.\n\nPrayers and love to all of you.\nClara\n\n", "date": "2007-05-15T03:41:57+00:00", "topic": "Update on husband's diagnosis", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tMom of 4\nPlease do keep us posted about your situation.\n\nIs your husband going to the Baptist Hospital in WS, NC?\n\nWishing you the best, prayers are with you.\nClara\t\t\t", "date": "2007-08-01T03:55:52+00:00", "topic": "Oncology Visit and Bone Scan! Bladder Cancer really PISSES me off!  Literally!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tCharlie,  I am curious about the kinds of chemo your Dad has had and what medicines he has been given.\n\nMy husband, Bob will be going back to his oncologist on Thursday and I am almost positive that Dr. Wallace will want to give him more chemo.\nHe had four cycles of gemzar and taxatere.  They tried neulasta to help keep his white blood count up but he had reactions so they had to cut back on the taxatere.\nThe PET scan done after these treatments did not show much change so if they helped, it only kept things from spreading any further.  He too is a stage 4 and I have counted 9 places listed on the PET scans that are involved.\n\nJust completed 10 radiation treatments to the pelvic area and 5 to a rib about two weeks ago.\n\nThanks,\nClara\t\t\t", "date": "2007-06-24T19:42:02+00:00", "topic": "Radiation Effects -&amp;amp;gt; Long term scarring and tissue damage", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tmomof4\n\nAre there any updates on your husband?\t\t\t", "date": "2007-07-04T02:14:40+00:00", "topic": "New Diagnosis Scared Wife of 46 yr old Male", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tmomof4\n\nMy husband goes to Dr. Wallace(oncologist) at Forsyth Medical Center in Winston-Salem but I do know that Baptist is supposed to have good doctors too.  If we lived closer to Durham, we probably would have gone to Duke for an opinion.\nWe talked with another person in a similar situation as ours and he really was impressed with Duke.\n\nThis is a very scary time and I can only imagine what you are going through with small children.  Prayers are with you and please keep us posted.   I read the additions to this site every day and it has really encouraged me--there are so many people in similar situations.\n\nClara\t\t\t", "date": "2007-07-04T02:14:40+00:00", "topic": "New Diagnosis Scared Wife of 46 yr old Male", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDeb, So sorry to hear of your frustations and prayers are with you.\nI also hope your dr. returns soon.\nIt is so hard to see a loved one, especially your spouse, to be so sick and go through so much.\nWe did not make it to the beach, told our children to go on and have a wonderful time.  Since my son-in-law has to attend a seminar part of the week and the house was all ready paid for, two daughters are there.  Bob's son came here (he lives at the beach) and also a daughter will be here today.  Bob is doing better today though after a rough week and I think this following week will be better as he regains strength.\nLet us know what happens.\t\t\t", "date": "2007-06-11T22:40:57+00:00", "topic": "Radiation to Pelvic Area/Bleeding", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nHello Clara,\nI hope your husband is feeling better so this note is a few days late. My husband is having radiation to the pelvis area specifically the L4 lumbar. The radiologist and tech all talked about the possibilty of diarrea but none so far. We go today for his 13 treatment and he gets a total of 15. My husband takes alot of pain meds which keep him constipated this might be the reason for no side effects. I hope your husbands treatments have helped with the pain.   My husband is scheduled to get a Zometa injection the first of the week. This is also helpful in bone degenation. Another thought -the oncologist put my husband on Elavil last week - it works well for chronic pain by intensifing the effects of pain meds and sedation. He takes it at bedtime and can sleep on his back all night for the first time in months. Ask for a low dose if its recommended cause my husband started at 25 mg and it gave him the feeling of a hang over all day a lower dose was better. I hope this was somewhat helpful and will keep you both in my prayers.         Debbie\nI am not familiar with Elavil--would it be similar to ativan?\n", "date": "2007-06-11T22:40:57+00:00", "topic": "Radiation to Pelvic Area/Bleeding", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDeb, Thanks for the response and I hope your husband misses out on the diaherra too.\nBob's started around the 6th treatment and continually got worse.  He also is on pain medicine that cause the opposite effect before and that probably helps this from being more.\nHe has just been miserable this week and cannot leave the house.   We are trying to get him well so we can go to the beach with all our children on Saturday.\n\nKeep me posted about how your husband does.\t\t\t", "date": "2007-06-11T22:40:57+00:00", "topic": "Radiation to Pelvic Area/Bleeding", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI am not beating us up about the past, just was really curious....guess that came from when I worked in my son-in-laws law firm and he specializes in asbestosis.\n\nWe are taking a day at a time; my husband will be finished with his 10 radiation treatments to the pelvic area next Thursday (doing 5 treatments to a rib that had been getting sore).  Hoping to have a break then and some time to just have fun.\n\n", "date": "2007-05-30T00:02:28+00:00", "topic": "Causes of Bladder Cancer", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI was concerned about my husband having chemo/PET scan so close together but am okay now about it.\nHe had the last chemo that was scheduled last Fri. and is having a PET scan tomorrow.   The scheduler talked to someone that works with the PET scans and said it is okay.\nWe will hear the results on Monday and discuss what is next for his treatments.\nThis is his 3rd PET scan this year and I think the reason for so many is because the cancer is in so many places....hoping and praying that the tumors have shrunk.\t\t\t", "date": "2007-05-01T04:18:47+00:00", "topic": "Chemo/PET scan", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI am trying to catch up a little on everyone....\n\nCongratulations!  I am so happy for you and so glad your Dad could be there.\n\nClara\t\t\t", "date": "2008-11-17T16:58:11+00:00", "topic": "Wedding!", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tJulie,\n\nIt does sound like the time has come for that bed.\n\nI have a quilt, a sheet, a special hot pad my daughters bought for me and then my cover that I roll up every day and bring it all out at bedtime.  So far I am making it fine and have been doing this since Sept.\n\nYou and Dick are always in my prayers.\n\nClara\t\t\t", "date": "2008-12-15T03:23:40+00:00", "topic": "Compelling Evidence", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI am so sorry to hear that you have so much to deal with at this time and I know it has to be overwhelming.\n\nPrayers are with you and your family.\nClara\t\t\t", "date": "2008-10-05T17:52:01+00:00", "topic": "beyond words today", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tJulie,\n\nI found this after I asked how things were at your house.\n\nYou are surely a trooper!\n\nClara\t\t\t", "date": "2008-10-09T06:42:17+00:00", "topic": "Getting out", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tKaren,\nI may have told you this before but Bob's oncologist even suggested SlimFast in between meals because it does taste better but is nutricious.  Often, I just blend ice cream and half of a SlimFast, put it in a frosted glass and just set it down beside of Bob's chair.\n\nClara\t\t\t", "date": "2008-08-28T18:48:49+00:00", "topic": "Nutrition: The Struggle to Gain/Maintain Weight", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tYou are certainly right to vent here as I know what you mean that many people do not know even when they ask.  This is where I often express my concern even if no one wants to listen but there is support and care here.\n\nI truly feel that when one says \"I will pray for you and your family\" on this site, they mean it.  Some people do not even want to hear that but I think it comes from the heart here.\n\nThis is a difficult time for you and you neeed this outlet.\n\nWishing you the best,\nClara\t\t\t", "date": "2008-08-28T21:58:05+00:00", "topic": "A different parent", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tSounds like a good idea to me.\n\nOur campground used to have Thanksgiving in July and then we had Christmas in July for awhile.   Decorated our lots for Christmas and it was fun.\n\nHave a great time together.\n\nClara\t\t\t", "date": "2008-08-19T20:22:48+00:00", "topic": "Thanksgiving ,, THIS SUNDAY!!!", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\twhen you know they try so hard and are willing to go through many things that we cannot imagine how tough it is on them.\n\nI was glad though that they did not give Bob his treatment today.  If they had he would probably be in bad shape.  Thankful that his dr. strives for \"quality\" instead of quantity.\n\nJust seems that ever since June everything has gone downhill even though he is better now than a month ago except the chemo from last week has taken its toll on him too.\n\nIt is just a no win situation but we keep on trying.\n\nJust rambling because I have so much on my mind and have been back up for awhile....wondering how many more of you are going through the same things tonight.\n\nClara\t\t\t", "date": "2008-08-22T05:47:03+00:00", "topic": "Just so hard to watch your loved ones ....", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI think depression is very normal with all that is going on.   Bob is now taking zoloft and still seems depressed.  Of course I could not make it myself without something.   I have been on zoloft for a long time now and it has made life a little easier.\n\nClara\t\t\t", "date": "2008-08-20T19:57:16+00:00", "topic": "What to do...", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tJulieanne,\nSometimes I just read and do not post.\n\nI know it is hard to see both parents not doing well.  Thank God they have you there for them.\n\nPop in more often and let us know what is going on.\n\nClara\t\t\t", "date": "2008-08-22T01:33:59+00:00", "topic": "been awhile", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tBob will be seeing the urologist tomorrow and will have the cath. changed.\nWe were not real happy with the first urol. we had so when he had to go back to one about 3 mon. ago we asked for a new dr.\nThis dr. is very thorough but the bad side manner is so awful.   All he did that day was keep referring to the bad progonasis, told us the bladder has no feeling.  I finally caught him out in the hall and asked about the bad prog.--it was news that did not surprise me but not what I wanted to hear.  He said we would talk further at our next appt. which was supposed to have been the next week but during the meantime Bob ended up in the hospital and we just had the cath. changed on the last visit and have not seen this dr. again.  Bob was so depressed after our visit to him and I never told Bob about our discussion in the hall.\nWell tomorrow is the big day but I do not want him to be the bearer of bad news to us.   I know it is coming and our oncologist has all ready mentioned Hospice is in the future but I had rather for it all to come from him since he has a much better manner about him.\nI have thought about writing a note for the nurse to put in the file telling him that we will be seeing the oncologist the next day or that he can talk to me but I do not want him to discuss this bad prog. with Bob.    Any ideas or comments?\n\nClara\t\t\t", "date": "2008-08-12T20:50:32+00:00", "topic": "I need some advice/opinions.....", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tKaren,\nI can really identify with your thoughts and frustrations.  After the scan in May and then the visit to the urologist for the cath. it really hit home what is going on.  I even have started doing some things to prepare for that dreadful day because I do not think I will be able to handle everything at that time.   My daughters have been helping me with that too.\n\nMy daughters do pop in and help me some and even have offered to get someone to come in every other week to clean.   Last night I told my daughter that lives here to let the cleaner come to her house today that I might need her later.  Just felt that with my daughter's job and they moved into a house that they are remodeling, she needs it worse than me.   I can at least keep the areas we use decent.  I am sure it is even harder for you with those beautiful little ones but just enjoy them.   They grow up way too fast.\n\nSince we are having a \"bitchy\" time, maybe today will become a day of laughter.  I try to make sure I laugh at something every day and also share it with Bob.\n\nTake care of yourself.\n\nLove and prayers,\nClara\t\t\t", "date": "2008-07-21T07:24:06+00:00", "topic": "Caregivers,,,,where are you???", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tGinger,\n\nI love your story...so glad you could give support and have some laughs about the sex too.\n\nClara\t\t\t", "date": "2008-05-14T20:06:53+00:00", "topic": "&amp;amp;quot; PAY IT FORWARD&amp;amp;quot;", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tWhat great pictures...thanks for sharing.\nClara\t\t\t", "date": "2009-04-02T14:36:15+00:00", "topic": "Competition results", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tKaren\n\nI do not know where you found that but there is so much truth in it!\n\nClara\t\t\t", "date": "2009-01-17T14:49:07+00:00", "topic": "The LAWS OF ULTIMATE REALITY", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe all need a laugh and that is a good one.\n\nClara\t\t\t", "date": "2009-01-07T19:37:52+00:00", "topic": "another slightly-off laugh from Iowa", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe all need a laugh and that is a good one.\n\nClara\t\t\t", "date": "2009-01-07T19:37:52+00:00", "topic": "another slightly-off laugh from Iowa", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJulie,\n\nThat is precious...a good looking family too.\n\nThanks for sharing....what is going on at your house now?   I have not been on lately.   Takes a lot of time to keep everything going as I am sure you know.\n\nClara\t\t\t", "date": "2008-10-13T21:18:40+00:00", "topic": "Picture of Dick and our Granddaughters", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat says a lot.\n\nMany times I have said that you find out who your true friends are but then there are many days that I just do not even want to talk (I think that is called depression).\nIt is so easy to say \"I am just a phone call away\".\nOf course I am sure that many do not know what to do or say; I have been there too.  Lessons are surely learned from our experiences.\nI have been a caretaker for years before this happened to Bob and I surely hope I can always lend a helping hand in the future.  One of our daughters told me that my next job should be going on dr. visits, taking notes and setting up notebooks for the families.   If that is a job, I will do it freely for friends in need.\n\nI am so thankful for family and friends and I tell Bob many times that I come here because I am understood the most.\t\t\t", "date": "2008-08-22T14:14:40+00:00", "topic": "Who Matters and Who Doesn\\'t", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nYour grandbabies are precious!\n\nClara\t\t\t", "date": "2008-07-20T11:44:23+00:00", "topic": "My grandbabies at the Beach", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nI was just wondering about you when I came on this morning (I had forgot to sign out yesterday).  Please just be good to yourself and enjoy those grandbabies.\n\nWe have a sun that lives near Sunset Beach and have been wondering what the weather will be like this week.   It is supposed to be so hot here for the next few days.   Of course we are just staying in now anyhow except for what I have to do outside.\n\nYou are such an asset to this site.\n\nLove and prayers\nClara\t\t\t", "date": "2008-07-20T11:44:23+00:00", "topic": "My grandbabies at the Beach", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tOh, I know that chemo has saved many lives but it just puts another question out there whether you should do it or not.   There are so many different situations.  One of my Sisters and a Niece both had some chemo that probably did save their lives.  When the cancer is stage IV and metasized though and if it is just to buy a week/month or two is it worth it?\nWe asked ourselves if we were just buying time for Bob after our last visit but then I called the Dr.'s office and was told they were afraid that if he did not have chemo to try to shrink the tumors, he might become paralyzed.  So we bit the bullet while he was in the hospital last week.  I am just hoping and praying he will be strong enough to get his treatment next week.  He and I both are really trying to get him built up enough to go through it hoping that we can make many more memories.\nClara\n", "date": "2008-06-26T18:22:08+00:00", "topic": "Has anyone else seen this article on webmd?", "subforum": "17-chit-chat"}, {"text": "\nwww.webmd.com:80/cancer/news/20080610/treatment-can-make-cancer-stronger?ecd=wnl_can_062408\n\nClara\t\t\t", "date": "2008-06-26T18:22:08+00:00", "topic": "Has anyone else seen this article on webmd?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat is a good one....I will have to try to remember it.\n\nClara\t\t\t", "date": "2008-06-26T22:13:12+00:00", "topic": "Another Dr. Joke", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJoe,\nWhat is happening to your pictures?\n\nClara\t\t\t", "date": "2008-06-24T19:54:14+00:00", "topic": "Policeman's Delight", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI decided to tell one on my husband that our whole family still laughs about.\n\nBob has always been laid back and quiet.\nSeveral years ago we were in a little den watching TV when I heard a sudden loud \"pop\"...I thought a balloon had burst from a party we had earlier for a daughter.\nHowever, when Bob jumped up from the chair and took off to the kitchen, I knew something else had happened so I quickly followed.....to find Vienna Sausages all over the kitchen, on the walls, ceiling, floor, dining room table and chairs.  At first I was a little upset but then I just got tickled and will never forget it.\n\nBob had set the can of viennas on a stove burner (unopened) and thought he had turned the burner on low but instead had turned it on high (that is why we put our glasses on our face when needed).  The can exploded and I have never seen anything like it.   Luckily no one was in the kitchen at the time it happened.\n\nI know you would have to see it to realize how funny it was but I do hope that someone has enough imagination to get a good laugh today!\n\nClara\t\t\t", "date": "2008-06-25T16:01:38+00:00", "topic": "Vienna Sausage!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLeigh,\nYou are such a kind and thoughtful person.\n\nThis site has been wonderful for me, I feel that it is the only place I can go that people really understand what we are going through.\n\nClara\t\t\t", "date": "2008-05-29T09:52:37+00:00", "topic": "I say a big THANK YOU Bladder Cancer Web Café.... ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for some therapy to start my day!\n\nHope today will be a good one for you and Angelo.\n\nStarted Bob on Zoloft yesterday, he has been soooo depressed since the dr. visit on Monday.\nHeading to the beach tomorrow and we will get to see his son--I am hoping he will get him out and try to cheer him up some.   Of course when we are at the beach house, the girls and I will try to entertain him along with the son-in-law that will be there.  He is a funny guy too so I am hoping to get Bob out of this mood.\n\nLove and prayers,\nClara\t\t\t", "date": "2008-06-12T03:01:16+00:00", "topic": "20 Ways To Maintain A Healthy Level Of Insanity ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe all need some poetry in our lives....well done, Joe\n\nClara\t\t\t", "date": "2008-06-09T20:57:25+00:00", "topic": " Poems I Wrote", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for sharing the picture of a beautiful young woman!\n\nClara\t\t\t", "date": "2008-05-30T03:29:17+00:00", "topic": "Putting a Face with a name", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCongratulations on 39 years....that is something to be very proud of.\n\nTake good care of yourself.\n\nLove and prayers,\nClara\t\t\t", "date": "2008-05-25T01:08:45+00:00", "topic": "Our 39th Wedding Anniversary 05-24-2008", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat pictures and some good looking people too.\n\nClara\t\t\t", "date": "2008-05-21T01:10:47+00:00", "topic": "Grandpa's Joy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCarlie is a beautiful young lady and I know she brings you lots of joy.\nClara\t\t\t", "date": "2008-05-17T18:16:53+00:00", "topic": "My Grand Daughter", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tOh Karen, they are adorable!   Thanks so much for sharing.\n\nI think of your family so often and my heart and prayers are certainly with you.\n\nClara\t\t\t", "date": "2008-04-21T18:42:47+00:00", "topic": "Our Little Ones...Our Pride &amp;amp;amp; Joy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI will be gone for a few days but did want to wish all of you ladies a Happy Mother's Day.  One of my daughters came by today and gave me something to open on Sunday.   I will miss being here but I am taking Bob on a vacation for a few days and we will get to spend some time with our son's family and some friends too.\n\nLove and Prayers to you all.\nClara\n\n", "date": "2008-05-10T02:45:28+00:00", "topic": "Happy Mother's Day!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe all need our laughts every day!\t\t\t", "date": "2008-04-25T20:16:14+00:00", "topic": "Didn't Mean to Offend Any Burger King Fans LOL Watch This LOL", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tKaren,\nI feel sure that was one of Bob's first symptoms, also he would have pain in the pelvic area afterwards.\nWe did not pursue this enough and push for tests.\nClara\t\t\t", "date": "2008-04-22T16:41:55+00:00", "topic": "Sexual Dysfunction Prior to Diagnosis", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI can remember going to work in Winston-Salem and actually smelling the tobacco some days from the plants.\n\nAlso, I grew up working in tobacco for my uncles....my Dad smoked heavy until he was diagnosed with emphysema which got him 10 yrs. after he quit smoking.  Thankfully, I never picked the habit up but lived with second hand smoke growing up and also Bob smoked until about 16 years ago.\n\nMany of the farmers in our area that depended on tobacco for a living are now into growing grapes and making wine.  The grape vines are certainly prettier than those tobacco stawks.\n\nThere are really a lot more restrictions on smoking now than there used to be.  I read in the newspaper that the employees of Baptist Hospital have to go off the premises to smoke now.\n\nClara\n\n", "date": "2008-04-18T19:05:51+00:00", "topic": "Smoking, more prevelant  in which states??", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for the laugh.....our weight watchers meeting last week was about laughter.\n\nClara\t\t\t", "date": "2008-02-15T18:34:51+00:00", "topic": "Amazing automatic screen cleaner", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSorry that this posting is so late but my husband just brought it to my attention.\n\nThere is supposed to be a segment to focus on this product.  It is part of a two-night series on the current and future potential of regenerative medicine in the US.\n\nTengion has operations in Winston-Salem, NC and is most known for the regenerative-medicine research of its founder, Dr. Anthony Atala according to today's WS Journal.\n\nClara\t\t\t", "date": "2008-02-06T21:34:46+00:00", "topic": "CBS to air segment on Tengion Neo-Bladder product", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tKaren, I love that one....sending it to friends.\n\nThanks for sharing.\n\nClara\t\t\t", "date": "2007-12-10T21:32:14+00:00", "topic": "The Perfect Couple LOL", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tYes, the pictures are coming in and I look forward to them.\n\nI like your camoflauge outfit and do not worry about the neighbors...just enjoy what you are doing.\n\nClara\t\t\t", "date": "2007-12-05T22:49:38+00:00", "topic": "It snowed today.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for sharing this beautiful picture.\n\nIt certainly should brighten anyone's day.\n\nClara\t\t\t", "date": "2007-11-07T00:24:24+00:00", "topic": "Autumn Foliage", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI hope everyone gets to see this one....it really is awesome.\n\nClara\t\t\t", "date": "2007-10-30T00:20:57+00:00", "topic": "Fire Photo-Check It Now", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI agree with this one too....my younger Sister is a Survivor too.\nMy daughter just had additional testing after a mammogram too; they say it is okay and a cyst but we are not so sure that we are satisfied with that answer.\nA friend's daughter insisted that a cyst be removed and it was cancer instead of a cyst.  I think that does happen more than we realize.\n\nThanks for everything Wendy!\n\nClara\t\t\t", "date": "2007-09-07T13:34:07+00:00", "topic": "Pray for those with Breast Cancer--October National Month", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThis means so much to me.\nNot only am I the caregiver for my husband but we also know so many people that are going through some really tough times now...as I am sure many that visit this website do too.\nClara\n\nLet's all keep those candles burning!\n\n\n", "date": "2007-09-07T13:42:43+00:00", "topic": "Candles Burning For Bladder Cancer Victims", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Birthday Alice!\n\nHope you and everyone else have many more.\n\nMy husband I celebrated our 27th anniversary last week and I hope we have 27 more!\n\n", "date": "2007-06-28T02:49:21+00:00", "topic": "IT'S MY BIRTHDAY!", "subforum": "17-chit-chat"}]}