{"signature": ["Dx", "BCG", "BCG"], "posts": [{"text": "\n\t\t\t\tKimberly,\nI’m going through a similar situation as you, but perhaps I’m further down the road.  Over the last 14 months I have had three TURB with two diagnoses of Ta High Grade tumors.  I have had 15 treatments of BCG.  Three weeks ago with my quarterly cysto we found another suspect area.  Because of the history of high grade tumors, my Uro recommended and I have concurred that we do another TURB.  We are hoping it is just cystitis from the BCG, but I would rather have the procedure than risk on waiting another 3 months.  I have to agree with the others that once you have a final report, it will be easier to make the recommendation.  However the treatment of BCG is something I would recommend rather than risk the wait and see or the Cystectomy.  As you have probable read here that BCG is no picnic, yet unless you are one that have a severe reaction, it is easier than other treatments of cancer (e.g. chemo & radiation).  So bottom line, don’t fear it, just accept that it is goes with the territory.  Good luck with the treatment and don’t hesitate to contribute here your experiences.  We all get educated from each other and that is a good thing.\n\nChuck      ", "date": "2010-09-28T15:54:36+00:00", "topic": "BCG -- is it really an option?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMissy,\n\nI'm not sure I can add anything that hasn't been said already.  I'm glad you found our family here.  They are fantastic, a great support and a world of knowledge to be shared.  Please come here and share your feeling anytime.  There are many people that read these forums that will get educated and comfort from reading your emails but feel uncomfortable writing themselves.  It sounds like have inherited some of the strength of your father.  You situation has touched the hearts of many of us here and just know that you have our prayers.   I look forward to your future updates.\n\nChuck    ", "date": "2010-09-28T05:15:41+00:00", "topic": "Father newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Mike for posting this.  I just completed my survey.  Please let us know what else we can do to support the organization.    \n\nChuck\t\t\t", "date": "2010-06-23T14:54:15+00:00", "topic": "ABLCS needs a minute of your time.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI really feel inadequate to give advice for this post, but I will state what I would do if I was in their shoes knowing what I know now.  Before I allowed anyone to remove one of my organs, I would want at least a second opinion.  In addition, if I was being told that the tumors were invasive and also high grade, I would be contacting the nearest cancer center that deals with bladder cancer immediately.  Patricia will be able to provide a center that is close and most likely a physician’s name.  Bottom line, I would be getting a second opinion and biopsy (if necessary) ASAP.  I wish them the best and hopefully they will come back here for our support.\t\t\t", "date": "2010-05-11T14:32:42+00:00", "topic": "SC new Dx needs advice", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPat,\n\nI too echo the thoughts and prayers for your fight and quick recovery.  I have been into myself and my fight, that I forget what this site is all about (support).  I was so shocked in reading about your diagnosis.  You have provided me and so many with support and information.  Therefore I want you  to know that I am praying for you.\n\nHugs,\n\nChuck     ", "date": "2010-01-10T03:47:07+00:00", "topic": "Pat - Any new info. on test results?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey Steve...welcome to our group.  I echo the others that encourage to use this group not only as a support but to bounce questions and concerns off of the members.  Everyone here has walked in your shoes to some degree or another.  On a side note, I too am a Viet Nam vet and was in areas where defoliants were used.  I don't remember ever being directly or indirectly exposed to the spray, but were in areas after the chemicals were used.  I've had discussions with my urologist and he says there might be a correlation, but most likely the cause was from the years of smoking.  At this point it really doesn't matter what the causative agent is, it is keeping a positive attitude and following your treatment plan.  Keep that chin up and God's blessings.   Chuck   ", "date": "2009-01-20T01:27:34+00:00", "topic": "I just signed up.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLooking on the internet, I found that in extreme cases (43 out of million) there is a long term cases of osteomyelitis caused by BCG Therapy.  I see my Uro in January for a cysto.  I'll discuss it with him.  Thanks for all the advice.   \n\nMerry Christmas to all\n\nChuck\t\t\t", "date": "2012-12-17T13:41:41+00:00", "topic": "BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt has been most likely two years since I contributed my support to this site.  SORRY.      When I was diagnosed with high-grade non-invasive tumor, I was sure that I would lose my bladder.  I went to the Cleveland Clinic for a second opinion.  The recommendation was to start another round of BCG from the beginning.  I had already done a year.  Almost from the beginning, I had side effects of fever, bloody urine and of course pain.  We went to one-third dosage and I was able to tolerate the treatment.\n\nI have now been over two years without any reoccurring tumors.  If my next cysto in January is clean, then the BCG treatment in February will be my last.  My question is, is it common to have joint discomfort from the BCG.  It seems I read it once those arthritis type symptoms are common.  My joint discomfort seems to be getting worse with each treatment.\nI'm 66, now retired and play lots of golf.  Once I'm warmed up, I have no problems.  But getting the body lose enough to play takes much more effort than before.  In addition, if I'm sitting reading, watching TV, on the computer, etc, when I go to get up, I have discomfort and stiffness.  Once I move around some, the discomfort is as severe.  Getting up in the night or first thing in the morning is the worse.\n\nIs this normal reaction to the BCG or am I just walking down the road of life?  Is it something I should bring to the attention to my urologist or maybe my primary physician?  As always, any feedback is appreciated.\n\nThanks,\nChuck\t\t\t", "date": "2012-12-17T13:41:41+00:00", "topic": "BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks everyone for your words of support.  My feet haven't touched the ground in two days now.  It really appears that I could be on the positive side of the statistics and BCG is working for me.  Thank GOD!\n\nChuck      ", "date": "2010-09-16T17:57:24+00:00", "topic": "And again?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes Jack, let me echo everyone else about your success.  I hope I am following you.  My TURB in March found no new growths.  I followed it up with with my maintenance BCG and now a cysto.  It was clear along with the FISH and CT scan.  I've got a long way to go to reach your status, but I'm optimistic that I will be able to tolerate the BCG.  The maintenance dose was given at 1/2 and we are going to try 3/4 working back up to full dose if I can tolerate it without having a reaction like I had back in January.  It makes it so much better knowing there are sucessful treatments.  Thank you for sharing you status.  Chuck      ", "date": "2010-06-11T20:13:11+00:00", "topic": "All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSarah,\n\nEvery time I come back to our forum site, I learn something new and feel like I am not alone.  It seems you are going through a similar situation and treatment as me.  I had a TURB in Aug. Nov and then again in March.  The first two found TaG3 tumors (but relatively small) and the March TURB was negative and the abnormal area was found to be cystitis.  I had six weeks each of BCG after the first two.  Last week I started my three weeks maintenance doses of BCG.  He is trying me at 50% and last week went well.  I just had the normal body aches and fatigue for about 24-36 hours.  So hang in there, it appears you have company that is going through the same thing at the same time (if you find that supportive).    I’ll take Mike at his word about the six treatments and the six packs.  However it does sound far fetched. \n\nChuck\t\t\t", "date": "2010-04-14T19:55:02+00:00", "topic": "Cystocscopy time, again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVi,\nI’m like so many of the other BC warriors here, in that we have gone on that emotional rollercoaster that comes with our disease.  It seems like reoccurrences come with the disease and it is up to us on how we handle the emotional stress that comes with it.  I too echo the sentiments of the others, in that we wish you well and encourage you to keep a level head and educate yourself on our disease.  I have found that the more I understand my disease, the less stressed I am when something changes.  I’ll add you to my prayer list.  Chuck\n ", "date": "2010-03-12T00:33:40+00:00", "topic": "New growth found", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy Uro contacted Dr. Lamn when I was having some problems and he recommended 1/3 dose.  I had my last two treatments at the level.  According to Dr. Lamn, the success rate for lower dose is not compromised.  He also recommended that the treatment dose be reduced from 6 to 3.  It seems that there no benefit after 3 doses.  I'm sure Patricia or someone else has the link to Dr.Lamn site where he talks about it.  Somehow I lost the link.  Hang in there, the benefits of completing the treatments in my case was well worth it.  I finally got a clean biopsy report.       Chuck  ", "date": "2010-03-09T18:46:18+00:00", "topic": "For Pain?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI wanted to update everyone about my current situation so I will add this to this message area.  I had another TURB last week.  On awaking, my URO told me he found another suspicious area that he biopsied.  The dome area; the location of the last three tumors, appeared to be ok, but he also took a couple biopsies to be sure.  They called me before the weekend to let me know that the test came back negative.  YES!!     The suspicious area turned out to be a type of cystitis.  My feet haven’t touched the ground since.  In fact I shot five shots less than my normal round of golf over the weekend.  Things are definitely looking better.  I am assuming we will go back to the 3 month cysto’s and maintenance BCG.  I’ll gladly accept that over what I’ve been going through for the last nine month.  Thanks for all the support….Chuck  ", "date": "2010-02-20T20:50:21+00:00", "topic": "Cysto Results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm not an old pro at BCG, but I have had 9 and anticipate many more.  I too experience the flu like symptoms for a few hours after the treatment.  For me they don't get any worse.  However the fatigue seems to progress and joint discomfort seems to last longer.  I don't find it intolerable, just annoying.  Hang in there....Chuck    ", "date": "2010-02-25T22:44:16+00:00", "topic": "First BCG Yesterday", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Nancy & Joey\nYou all are real veterans at this BCG thing.    I’m complaining after nine doses and you are way ahead of me.  Am I reading you right, you are doing maintenance?  I haven’t made it that far.  Since August, I have had two reoccurrences.  Hopefully the TURBT in March will show that we have at least put the BC on hold for a while.  I’ll be happy to go for the quarterly cysto and maintenance BCG.  Nancy, are you at the end of your maintenance for the CIS?  Hopefully it is not active again.  If you can’t tolerate the BCG, are there any other treatments other than the radical cystectomy?  Hang in there and good luck to you both.\nChuck    ", "date": "2010-02-05T16:41:00+00:00", "topic": "Whew! and then Yeah!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks everyone for the advise.  I'm a little premature on getting that 2nd opinion, but I wanted to be ready (if necessary) to make the request.  I had my final BCG teatment this week.  I think we are waiting either 6 or 9 weeks and then do another TURBT.  Side effects were no worse this time than the first series.  Hopefully the BCG worked this time.  If not it will be the third reoccurence in six months.  The last two were high grade (TaG3).  I'm very much trying to keep a positive attitude, but you warriors know the helpless feeling while you wait.  Again, thanks for your advice and suport.\nChuck     ", "date": "2010-01-14T02:12:58+00:00", "topic": "Is this a BCG side effect?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Mike and Jack, you answered my questions.  My plan now is to go this one more round with the BCG and the follow up TURBT providing the report from John Hopkins comes back the same as the initial local report.  If we still have problems, then I'll be off to seek a second opinion from someone that has more expertise.  I also think that John Hopkins has a clinic in the local area, but I’m not sure what their specialty is.  My current Uro is the second one I have had since my original discovery.  I lost confidence and patience with the last doctor and especially with his staff.  The current one (L. Kaufman) has an excellent reputation and he and his staff treat me like they really care.  Again guys, thank you for your support and advice.  Chuck\t\t\t", "date": "2009-12-03T14:35:06+00:00", "topic": "BUMMER II", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you all for your response and advice.  I understand the wisdom behind obtaining a second opinion prior to having any change in treatment or a cystectomy.  But why the urgency to go to a Cancer Center at this point?   What I have read here at this site and others, the standard treatment is BCG or BCG with Interferon.  My Uro. stated depending on the report coming back from John Hopkins, he may go with the BCG with Interferon.  In addition; in my opinion, by him sending my test data (FISH, etc.) along with the biopsy it is like getting a second opinion.  Isn’t John Hopkins considered one of the better cancer centers for BC?  Please don’t take this wrong, I’m not questioning your advice or you opinion, but rather I’m trying to pick your brain as to why you feel so strongly that you would advice to urgently get to a Cancer Center.  I live in the SE Florida region and we have a branch of the Cleveland Clinic Medical System.  I know Cleveland Clinic is considered a leader in colon/rectal cancer, but I’m not sure how they rank for BC.  If I chose to go to a cancer center, would Cleveland Clinic be on your recommended list?  Like so many of us that are fighting this disease, we value the advice of those that have preceded us and have the wisdom of experience.  Thanks, Chuck    ", "date": "2009-12-03T14:35:06+00:00", "topic": "BUMMER II", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI promised a couple of my friends that I would throw out this question and see what the results were.  Are there any of the group with BC that are also Viet Nam Vets and had some type of exposure or contact with the vegetative defloration (Agent Orange) chemicals.  One of my friends filed a claim with the Veterans Administration for disability because of his resulting respiratory problems and is receiving disability payments.  He thinks that I would also be eligible due to my BC.  So the question is, is there any study or research results on Agent Orange and BC?  Again, thanks for your support.\n\nChuck   ", "date": "2009-08-28T14:03:48+00:00", "topic": "Agent Orange?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne\n\nThat is great news.  I have to agree that you must have a special doctor to make calls on Sunday.  As we all have experienced, the wait for the pathology is worse than the procedure itself.  I am in the waiting mode myself.  I will know the results of my TURBT on Wednesday.  Hang in there with the continued BCG treatments.\n\nChuck   ", "date": "2009-08-26T20:10:13+00:00", "topic": "Not what I wanted to hear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear the treatments are over and with minimal effects.  Watch for a discharge as that would also indicate prostatitis.  I've been down that road before and if left untreated can be serious.  A couple of weeks of antibiotics takes care of it.  Good luck   ", "date": "2009-06-30T22:44:49+00:00", "topic": "BCG #6 complete!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuzy,\n\nLast year at this time I was completing 8 weeks of Mitomycin C and other than some minor side effects (fatique and the normal evasive irritation)I have done OK.  A year later I have had 4 cystos and they have all been clear.  I know some have done better with BCG and some with Mitomycin.   What we all strive for are those clean cystos.  Hang in there.\n\nChuck\t\t\t", "date": "2009-04-26T21:03:44+00:00", "topic": "mytomycin c for 6 weeks", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuzy…I had 8 weeks of Mitomycin last April/May.  I had few side effects also.  The first 24 hours I had the normal evasive discomforts.  However, at about 48 to 60 hours later I would have an onslaught of fatigue.  As the weeks of treatment progressed, the fatigue became more prominent.  My Urologist at the time assured me this was normal since the drug does work on the immune system.  After approximately 9 months later, I’m doing fine and have had clean cystos.  Good luck and I’ll be praying for you.  Chuck    ", "date": "2009-02-20T19:12:11+00:00", "topic": "mytimycin c", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey everyone....this continues to be good news.  I think I added my good news from January to the first thread.  In any case I like this and the positive attitudes.  Chuck    ", "date": "2009-02-18T02:17:21+00:00", "topic": "Another happy report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRebecca,\nI’m sorry to hear the news, but as you stated, it is non-invasive.  Don’t get discouraged (it’s hard not to) because the statistics on our disease is that it is likely to reoccur.   Most of us here have experienced the roller coaster ride (emotional) and are here to support you the best we can.  I like to think about the disease as… it’s not a death warrant, but rather life time annoyance.  If we will follow the tried and true procedures (frequent checkup with cystos and chemo washes when indicated) then this disease does not have to be threatening.  Keep that positive attitude and use this site for your support system.\nGod’s blessings,\nChuck\n ", "date": "2009-02-11T14:23:22+00:00", "topic": "Annoyed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs always Patricia, your responses are helpful.  I see my Uro next week and will ask again about this laser surgery to make sure I understand in total what he is suggesting.  I hopefully will have the results back from the lab that my primary doctor requested.  With those results, perhaps I might get an answer to my chills and fatigue problem.  Neither one are severe enough that makes them intolerable, just annoying.  Again thanks for your support.\n\nChuck    ", "date": "2009-01-26T20:58:02+00:00", "topic": "Mitomycin side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Max...I echo the great news.  I got a clean report earlier this month.  Although, I'm only 9 months clean.  I was almost two years when it raised it's ugly head last Feb.  OH WELL...so far so good!! ", "date": "2009-01-18T23:14:03+00:00", "topic": "Happy note", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Max,\n\nI went through the Mohl surgery a year ago last summer.  I can appreciate the relief that it is behind you.  Did they have to do any skin grafs?  In any case, I'm glad to hear all is going well.\n\nGood Luck,\n\nChuck\t\t\t", "date": "2008-11-18T03:24:30+00:00", "topic": "Basal cell caicinoma surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMax,\nNot to be curt, “…been there done that”.  I had the MOHS surgery over a year ago.  It really is a piece of cake compared with what we go through at our Urologist.  My skin cancer (also Basal cell carcinoma) was on my ear.  In my area there is a specialist that primarily does MOHS procedures.  The surgery itself does not take very long and is done with a local anesthetic.  In my case the reconstruction (skin and tissue transplant) took almost an hour.  Bottom line, don’t worry about the procedure.  You most likely will have to tolerate the embarrassment and inconvenience of a bandage covering the area.  For me it was about a week.  However, from what we have tolerated with the procedures and mental stress of our BC, this is a cake walk.  I also echo the congratulations on your clean cysto.\nBest of luck,\nChuck\t\t\t", "date": "2008-10-20T22:29:10+00:00", "topic": "Good News &amp;amp; Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy Uro uses the voided sample for the FISH.  I've never heard of doing the cysto other than with a bladder wash.  But then I am learning new things about techniques and treatments every time I surf this site.  My Uro also gives me a choice of with or without numbing gel.  Lately it has been almost intolerable with out the numbing gel.\t\t\t", "date": "2008-10-10T19:52:31+00:00", "topic": "Squamous Cells", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks to all on your replies and links.  I knew if I asked the question that I would get some information.  However, I want reassurance that my interpretation is correct.  Squamous Cells in in the urine is an indicator of developing carcinoma.  But if I read this correctly, only in a few cases does the indicator also find later tumors.  In addition, the majority cases show an irritation in males and not a preclusion of tumors.  Am I correct?\n\nThanks again,\n\nChuck\n ", "date": "2008-10-10T19:52:31+00:00", "topic": "Squamous Cells", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCynthia,\n\nYou provided a great explanation of where and what this forum should be and for me it is.  I'm one of the guilty parties that only drop in occasionally because right now things are going well.  I found this forum back when I had my reoccurrence and required eight weeks of chemo.  By coming here, I got more questions and concerns answered than from my doctor.  When I felt my doctor and his office was not treating me in a manner that I thought they should, it was this forum that I discussed it and got the encouragement to change doctors (a great decision I might add).  So you are right, members that are not in crisis should still come by and support the members that are.  I will try to be better.  Thanks for your sensitivity and encouragement to all.\nChuck\t\t\t", "date": "2008-07-28T16:47:50+00:00", "topic": "Posting concerns", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMarne,\n\nI like your Doctor's attitude calling it a \"Happy Cancer\".  If cancer can be happy, I guess ours would be that.  Non-invasive bladder is mostly a nuisance and a life inconvenience than it is a threat.  However, if left untreated, then it would be another story.\n\nI know from experience, that it still does not minimize the emotional trauma that the individual goes through dealing with the diagnosis and treatment.  My first doctor minimized the whole treatment and made me feel like I was a baby when I got upset or overly concerned.  I understand that these doctors see our type quite often and treat patients that are far more serious.  But that does not diminish the emotional trauma we experience.\n\nSo keep you head high, knowing you have support here and hopefully family and friends.  Ensure that you are comfortable with your Urologist and his office.  Don’t be ashamed to express your feelings and ask any questions no matter how trivial they may seem.  If your doctor doesn’t seem to have time or he scoffs at your questions, then immediately change to another physician.  As I stated earlier, we that have this condition realize that in the overall scope of cancer, ours is minimal.  But the emotions we experience are no different than any cancer patient.\n\nIf you are a person of faith, I would encourage you to pray and to give those things to God that you are unable to handle.  He tells us He will lift those burdens from us.  And once you turn them over to Him, remember He does not require our assistance.  Good luck and my God bless and heal you.\n\nChuck\t\t\t", "date": "2008-07-25T13:22:24+00:00", "topic": "Recuurance after 6 Months", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBecky,\n\nI live in SE Florida and I know we have a Cleavland Clinic down in Broward or Dade County.  Is this the clinic that you are using?  If so which doctor did you go to?  I live in Palm Beach County and I'm not too thrilled with my current Urologist.  I'm happy to hear that you are getting a fresh start and new diagnosis.  Good luck\n\nChuck\t\t\t", "date": "2008-04-09T22:51:08+00:00", "topic": "found a BC specialist  at cleveland clinic", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWeek two:\n\nI went in yesterday for my second treatment of Mitomycin C.  I got a different nurse and I have to say she was more experienced and she had fewer problems inserting the catheter.  Went home and did my chicken rotisserie for about hour and a half.  The evening went well with little burning when peeing, but again had a few bladder spasm and they have continued this morning.  Hopefully week two will go as well as week one.\n\nDuring week one, two days after my treatment, I experienced what I thought was a reaction.  I’m now not sure it was.  In any case, I felt extremely tired and had minor flu like symptoms (sore throat, body aches, etc.).  This lasted less than 48 hours.  By the weekend, my energy returned to normal and I felt good.  Perhaps my reaction during week two will determine if what I felt was a reaction to the chemo.  During the week I passed a few blood clots when peeing.  I think that is also normal and to be expected.  All in all, I feel everything is going well.   \n", "date": "2008-02-26T19:49:38+00:00", "topic": "My Eight Weeks of Mitomycin Therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm sorry Rosemary...I don't know why I called you Barb    :-[\t\t\t", "date": "2008-02-26T19:49:38+00:00", "topic": "My Eight Weeks of Mitomycin Therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBarb,\n\nMy Uro did not tell me nor did I think to ask what he used with my first TURB.  On Monday he placed the Mitomycin directly in the bladder and Yes, I did the rotisserie just like I read those of you that have done the BCG treatment.  I was told to try to hold it at least an hour and preferable longer.  What I have read that some treatments of Mitomycin C can be of different strengths.  My Uro said he would be using 20mg which I understand is the lesser dose.  Perhaps your treatment at the hospital was a higher dose.  I also have read that there are several different drugs that are used for chemo wash, but the Mitomycin is the old “tried and true” drug of choice by many Urologists.  Hopefully, I have answered your questions.  Thanks for the support.\n\nChuck\n", "date": "2008-02-26T19:49:38+00:00", "topic": "My Eight Weeks of Mitomycin Therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLauren,\n\nI agree with the others here in letting your urologist do the BCG or Mitomycin therapy.  Did your Uro state why he/she is waiting for the third re-occurrence before starting some type of therapy?  Although going through the therapy is no fun, the potential for ending the re-occurrences; in my opinion, would out-weigh the potential side-effects.  At least in my case I am gambling on the odds that I can win at the merry-go-round of re-occurrence.  I started my eight week of Mitomycin C therapy this week.  But the news that your tumor was RaG1 is great news.  Good luck and keep us informed.\n\nChuck\n", "date": "2008-02-15T21:49:14+00:00", "topic": "It's back....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara,\n\nI too want to send my support and prayers.  No matter how many times I am told that the likelyhood of not surviving non-invasive BC, it still is a blow to the emotional stability.  Just like others have told you here, I would tell you to take a deep breath and then move on.  I'm lucky enough here to be close to the ocean and can go there to calm myself and pray. You might go to your favoirte place where your feel you can rejuvenate your emotional strength. Try to remember that our Heavenly Father will never give us more than we can carry.  Turn to Him when you feel the burden is more than you can handle at this time.  My prayers are with you too while you go through this difficult time.\n\nChuck\t\t\t", "date": "2008-02-21T23:49:39+00:00", "topic": "Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks kinadida...I hope I can say the same thing.  I'm scheduled for eight weeks.  Over-kill from a conservative doctor?  I was told he will use 20mg rather than the 40mg that I hear horror stories on other sites.  Again, thanks for the support\t\t\t", "date": "2008-02-21T16:19:37+00:00", "topic": "Mitomycin-C Revisited", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t am also new here...I start my first round of mitomycin next week (Monday) and also worried about the side effects.  My urologist gives the impression that it is no big deal.  I was first diagnosed in July of 2005 and just finished with my second surgery for a reoccurence.  I guess I am looking for some reasurance that this treatment is less painful thant the TOR.    \t\t\t", "date": "2008-02-21T16:19:37+00:00", "topic": "Mitomycin-C Revisited", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am also new here...I start my first round of mitomycin next week (Monday) and also worried about the side effects.  My urologist gives the impression that it is no big deal.  I was first diagnosed in July of 2005 and just finished with my second surgery for a reoccurence.  I guess I am looking for some reasurance that this treatment is less painful thant the TOR.   : ", "date": "2008-02-20T08:51:54+00:00", "topic": "Question???", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou asked how to pay it backward, in my opinion, it is simple.  Give support and your experiences to those that are newly diagnosed.  In your own words\"...what a differnece you make..\"  I know from my own experiences here, everytime I have encountered something new or I'm confused, I have received that information and advice.  I really feel blessed that I found this web site and the people here.  You are..\"in a good place..\"  Hugs Chuck\t\t\t", "date": "2010-02-04T14:32:05+00:00", "topic": "Pay it Backwards", "subforum": "17-chit-chat"}]}