{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tAwesome Joe - I personally would follow the same protocol if my tumor had been a T2 and was removable.  Keep us posted and good luck!\t\t\t", "date": "2007-03-27T16:50:15+00:00", "topic": "grade 3, t2n0m0", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLynn,\n\nHi fellow Seattlite!  If you ever need a second opinion (depending on your grade and stage), I was diagnosed with a T1G3 tumor in 2006 at the age of 35 and have seen several of the urologists at both the UW and Overlake.  I had my tumor removed by TURB and went through 6 weeks of BCG treatments at Overlake.\n\nChris\t\t\t", "date": "2008-01-21T07:28:10+00:00", "topic": "34 year old newby in Seattle", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSome interesting info to fuel the anxiety fire - but good stuff;\n\nDiagnosis\n\nThe most common sign of bladder cancer is hematuria [20]. This may be either grossly visible or only\ndetectable microscopically. There is no correlation between the amount of hematuria and the extent of cancer. Most cases of hematuria are asymptomatic or `painless'. Microhematuria is present in 9-18% of normal patients. The 95% confidence interval for microhematuria in the normal population is three red blood cells/ high-power field. Therefore, patients with more than three red blood cells/high-power field on two or more properly collected urine specimens should be evaluated.\nThe chance of finding a urothelial malignancy does vary with patient age and the presence of gross versus microscopic hematuria. Evaluation of a patient who is younger than 40 years old and has microhematuria has a yield of 1.5-6% of diagnosing a urothelial malignancy,\ncompared with 20-25% in a patient who is older than 50 years with gross hematuria [21], particularly if symptoms of irritability are present and infection has been excluded.\n\nUp to one-third of patients with bladder cancer may present with irritative voiding symptoms such as\nurgency, frequency, or dysuria [22]. These symptoms, although often misinterpreted as representing bacterial cystitis, may commonly occur in patients with CIS or with tumors at the trigone. Gross hematuria should prompt a complete evaluation of the urinary tract. This should include upper tract imaging studies, cystoscopy, and examination of urinary cytology.\n\nCurrent Opinion in Urology. 10(4):291-299, July 2000.\nHassen, Waleed; Droller, Michael J.  ", "date": "2007-04-04T18:44:42+00:00", "topic": "no dx, just symptoms", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI think you may have a brain tumor if anything.\t\t\t", "date": "2006-11-10T16:53:48+00:00", "topic": "Is pain a common symptom", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDeb,\n\nThere is a small risk of micro-metastasis with T1G3 tumors, the higher the stage (Ta, T1, T2, T3..) the higher the risk.   I asked the same questions when I was diagnosed, as I understood it I had a 5-10% chance of micro-mets occuring from my tumor.  I wanted to know whether I should go and do chemo based on that risk and was told that it would be overkill.\n\nBasically you can tell what the risk of mico-metastasis is with T1G3 tumors from the percentage of people with radical cystectomies (RC) that had their pathology confirmed at T1G3 post-op.  There are a small percentage of RC patients (with T1G3 tumors) that still end up developing mets even though the tumor (and entire bladder) were removed.  This is due to the tumor shedding cells into the bloodstream prior to removal (via RC or TURB) as I understand it.\n\nI think the numbers were 90-95% 5-year survival for RC with T1, 80-85% for RC with T2, ~65% for RC with T3, someone can correct me if I am wrong.  These figures pretty much reflect the cancer metastatisis risk after tumor removal. (Of course if you do not have an RC, you also add risk of new/recurrant tumors invading and metasitsizing)\n\nOf course these numbers are just statistics, if you have multiple large T1G3 tumors with profuse CIS you will have much higher risk than a solitary small T1G3 tumor, so it is often hard to quantify individual risk from the statistics.\n\nFeel free to send me an e-mail as it looks like your husband has a similar diagnosis to mine, I'd be happy to answer any questions or compare treatment courses.\n\n", "date": "2006-09-25T13:08:30+00:00", "topic": "How to confirm diagnosis &amp;amp; staging is accurate", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPaul,\n\nHmmm...  Sounds like they performed the TURB and are (were) going back in for a re-turb or just a cystoscopy 2 weeks later?  Also sounds like it was a single T1G3 tumor that was removed?\n\nMy non-medical opinion would be to not worry about the bladder cancer until the heart valve surgury is complete.  Talk to your doctor and figure out when treatment can begin for the bladder cancer.  Most likely they will prescribe a course of 6 BCG treatments, which are not actually invasive.. consisting of being catheterized for about 5 minutes and holding a biologic in your bladder for a couple hours.\n\nSounds to me like you have had all the necessary surgury already, they may be looking to take a biopsy of the TURB site just to make sure they got it all.. however not all doctors perform this biopsy (mine didn't), guess it all depends on how large your original tumor was and how confident they are that they removed it all (and took good margins).\n\nDon't give up hope, T1G3 is still a superficial cancer and some people are cured of the cancer after the first tumor removal.  Maybe look at the heart problem as a blessing in disguise (assuming a positive outcome), as they were able to dicover your bladder cancer before it penetrated into the muscle layer of your bladder.  This early detection may have just saved your bladder and also your life.\n\nWell, Hopefully you check back in to this site after your surgury and let us know how you are doing.\t\t\t", "date": "2006-09-02T07:54:29+00:00", "topic": "Grade 3 diagnose while waiting open heart surgery.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou need pyridium, tylenol won't cut it.\n\n\nwww.healthsquare.com/newrx/pyr1365.htm\n\n\nCall your doc first thing in the morning.\t\t\t", "date": "2006-09-12T00:36:18+00:00", "topic": "at the beginning- had surgery today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMissD,\n\nFirst off, what was your husband's tumor grade and stage?  Was it invasive or non-invasive/superficial?  What further course of treatment is his doctor recommending?\n\nA great book that I recently picked up is The Guide to Living with Bladder Cancer by Dr. Mark P. Schoenberg;\n\n\nwww.buy.com/retail/product.asp?sku=30707566&loc=106&sp=1\n\n\nGive us a few more details and I'm sure there are plenty of people on the boards that can help you gather the information you need.\t\t\t", "date": "2006-07-15T03:15:36+00:00", "topic": "Wife of a newly diagnosed male w/ bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tFrom what I understand there are several reason you can be refused a neobladder and/or pouch;  \n1. If the cancer has metastisized outside of the bladder\n2. When cancer is found in the trigonum and/or urethra\n3. If your health/age will not allow the long operation (i.e heart failure risk);\n4. If they feel you won't/can't maintain the bladder\n5. Prior radiation therapy can damage the intestinal material used to fabricate the neobladder/pouch, thus some who opt for bladder sparing can not fall back on neobladders.  \n6. Insurance coverage.\n\nMaybe someone else can elaborate further, this is just off the top of my head.\t\t\t", "date": "2006-06-13T22:40:46+00:00", "topic": "transitional cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust a note I was comparing stories with another poster here on this site the other day and we both came to the revealation that prior to diagnosis we had both been doing the Atkins high protein low sugar (and probably high sugar substitute) diet for several years, as well as going through fairly stressful periods in our lives.  Of course we both had the tobacco factor in our history as well...\n\nSo does tobacco + Atkins + stress = higher rates of bladder cancer?  Hmmm just an observation, probably just a coincidence, but who knows?\t\t\t", "date": "2006-07-12T01:12:00+00:00", "topic": "Atkins Diet", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThere are options for combined modalities (tumor removal +chemo + radiation) rather that bladder removal.  Look into it on this website:\n\nblcwebcafe.org/combinedmodalities.asp\n\nThe link shows some of the statistics and gives you some contact names...\n\nGood luck.\t\t\t", "date": "2006-06-03T19:21:09+00:00", "topic": "trying to decide what to do for Grade 3 stage 2b", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSo, my blood cultures are not finalized yet, however last time they were checked they had not cultured any TB bacteria.\n\nHowever the specialist at UCSD did diagnose me this week with Dercum's disease, basically a lymphatic dysfunction and attributed it to my BCG immunotherapy 6 years prior.  My diagnosis was;\n\n\"Mixed Dercum's disease with some hypermobile joints. Which was likely caused by my BCG immunotherapy, altering my lymphatic system, not only by the number of cells traversing the lymphatics but also by inflammatory enzymes secreted by the immune cells injuring the lymphatics slowing pumping and promoting leaking.\"\n\nSo I am a mess right now, hundreds of small fat tumors under my skin, pressing on nerves and blood vessels, causing my nerves to burn, legs to go to sleep, etc..  The tumors mostly are not noticeable thankfully.  So mystery solved (so far)..  All along I was so worried about metastatic bladder cancer, I never considered what the immunotherapy might do.\n\nNot trying to scare anyone, just reporting my bladder cancer BCG experience.  I do have a glimmer of hope that the specialist does think that the immune response/lymphatic problem may self-correct in a few years and the fatty tumors, etc.. will diminish.\t\t\t", "date": "2012-11-21T01:54:34+00:00", "topic": "BCG Immotherapy long term side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAt this point I am trying to figure out what is happening to me.. only explanations I can find online are possible BCG Tuberculosis infection from my bladder cancer treatments (Yes this does happen!) or Dercum's disease.\n\ncid.oxfordjournals.org/content/36/2/140.full.pdf+html\n\nNeedless to say I went to an infectious disease specialist and started the 2-8 week blood cultures for BCG bovine tuberculosis. I had more lipomas cut out of my chest and sent them in for culture as well.  I also made an appointment in San Diego with the specialist in Dercum's disease.\t\t\t", "date": "2012-11-21T01:54:34+00:00", "topic": "BCG Immotherapy long term side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFlash forward to December of 2010 and I started getting stabbing pains in my abdomen and electric shock like sensations through my upper chest.  Of course I got all checked out for metastatic cancer with x-rays, MRIs, CTs.. Couldn't find any cancer, no explanation.. other than a diagnosis of \"Stress\".  In fact I believe the doctor specifically suspected stress due to my cancer history.\n\nA year later in March 2012 I finally went on some drugs for this persistant \"stress\" pain that was ruining my life.  They put me on a low dose anti-depressant, Nortriptiline, which works for the neuropathic pain.\n\nFinally in June, I was sick of pain and medication and decided to get in shape and figure out what was going on.  I started working out and losing weight.  I dropped from 225 in June to 185 in September (I'm 6'2\").\n\nIn late June I noticed a tumor under the skin on my ribcage.  Needless to say I flipped out.  Got checked out by my oncologist, my GP, they said harmless lipoma (fat tumor)..  I didn't buy their explanation.  Why would I have a fat tumor right where I have had pain for 2 years?\n\nLost some more weight, discovered more fat tumors.  Had two biopsied, pathology came back \"lipoma\" (harmless fat tumors)..  Lost more weight found dozens of fat tumors.  GP has no idea why I am concerned.\t\t\t", "date": "2012-11-21T01:54:34+00:00", "topic": "BCG Immotherapy long term side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBen,\n\nI think you are absolutely nuts still smoking 2 packs of cigarettes a day.  I'm not going to go digging for the research, but I believe there have been several studies that show a more negative prognosis for continued tabacco users.  The cancer cells are linked to carcinogens from tobacco use being filtered out of the bloodstream by your kidneys and dropped into your bladder... where they sit and mutate your bladder lining.\n\nSo, if you are willing to gamble with your bladder or life, I guess it's up to you!  I was a can a day tobacco chewer for 20 years and got my wakeup call at 35YO with an agressive superficial tumor (T1G3)... I quit the day I found out I had cancer and haven't touched the stuff since (and no desire too).  Luckily I have been cancer free over 2 years.\n\nOff my high horse now - I do enjoy a few shots of whiskey every night and I don't take any Oncovite \n\n", "date": "2007-12-31T16:28:16+00:00", "topic": "Newly Diagnosed at 27! ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDouble blind randomized clinical trials?... My ass.  His Oncovite trials are an absolute joke.. Ask anyone with a scientific background to review his plots and they will laugh!  It's absolute BS.  But believe in flying pigs if you want.  Always trust the car dealer to give you a good deal right?\n\nIt's a multivitamin folks!!!.. It has never been through any valid scientific trials for bladder cancer!  Take it if you want, but really, don't expect it to be beneficial fighting bladder cancer.  I drink lots of Whiskey and diet cola and have been cancer free for 2 years, and I don't take Oncovite.\n\nBut, on the flipside.. It's mainly Canadian Whiskey that I mix with my diet Pepsi.  So.. that's a possible lead???\n\nI think some doctors will agree with patients about taking Oncovite because they know it won't hurt the patient and it makes the patient's feel like they are doing something about a disease that is probably quite out of their hands.  Nothing wrong with taking a multivitamin, just don't falsely believe it's a cure-all or cure-anything!\n\n", "date": "2008-01-09T00:08:07+00:00", "topic": "Oncovite?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIts really a crapshoot.. I was diagnosed T1G3 almost 2 years ago and have been clean since..  after a couple years the chance of progression and recurrence go way down (if you haven't had a recurrence by then).  The best statistics I have found are from the EORTC, a calculator can be found here:\n\n\nwww.eortc.be/tools/bladdercalculator/default.htm\n\n\n\n\n\n\n\n\n", "date": "2007-11-20T21:43:42+00:00", "topic": "Up Grading", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFinally, lets throw the Oncovite away!\n\nVitamins Don’t Curb Bladder Cancer Risk \nISLAMABAD: A few reports have suggested that certain vitamins protect against bladder cancer. However, new research indicates that the apparent anti-cancer effect disappears after accounting for a person’s smoking history.\n\nIn the current study, people with high levels of vitamins in their blood had a low risk of bladder cancer. As it turns out, however, these people were also the ones who rarely, if ever, smoked.\n\nBecause smoking is a well-known risk factor for bladder cancer, it was probably their lack of smoking, not the high vitamin levels, that protected these people from cancer.\n\nThe results, which are published in The Journal of Urology, are based on a study of 9345 men who had blood samples frozen when the study began and then were followed for more than 20 years to determine the rate of bladder cancer.\n\nDuring the study period, 111 men developed bladder cancer. The stored blood samples from these men and from 111 similar men without cancer were analyzed for several vitamins.\n\nDr. Abraham M. Y. Nomura, from Kuakini Medical Center in Honolulu, and colleagues found that as blood levels of alpha-carotene, beta-carotene, lutein plus zeaxanthin, beta-cryptoxanthin, and total carotenoids rose, the risk of bladder cancer decreased.\n\nHowever, after accounting for how much a person smoked, none of the vitamin levels had much of an effect on bladder cancer risk, the team found.\n\n\nwww.onlinenews.com.pk/details.php?id=119094\n\nwww.crch.org/ProfileNomura.htm ", "date": "2006-12-02T20:40:29+00:00", "topic": "Oncovite", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, I still like that one study that showed drinking beer cut the risk of bladder cancer  ;D , so.. perhaps we didn't drink enough beer in our pre-cancer days???  I think I did though??  Maybe a swimming pool full of beer?\n\nWell, just make sure to take your Oncovite Zach! LOL\t\t\t", "date": "2007-08-14T21:34:55+00:00", "topic": "Swimming Pools and BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPosting to bump the poll back to page one!\t\t\t", "date": "2006-07-12T00:54:52+00:00", "topic": "To Re-Turb or not to Re-Turb, that is the question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCurious as to the stats of people getting re-turbs after 0-3 months, which I guess usually happens prior to any BCG therapy.\t\t\t", "date": "2006-07-12T00:54:52+00:00", "topic": "To Re-Turb or not to Re-Turb, that is the question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat friggin tobacco Vin!  As you remember I dipped the bear for 20 years prior to my T1G3 diagnosis - Glad you have been clean!  Hope you can save that bladder!  I had no problems quitting... but I drink alot more now  ", "date": "2007-06-15T16:59:05+00:00", "topic": "Just an update", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've had 5 or 6 cystos as well... I dislike going to the dentist about as much!  The first time is always the worst!  Not a big deal anymore, except it is uncomfortable peeing and having sex for about 12 hours afterwards   The nurse just squirts in some numbing KY-jelly stuff about 10 minutes before the good ol' plumber's scope goes in!\n\nIt would be more exciting if the urology nurse didn't look like Selma from Nightcourt... but I guess thats the point.\t\t\t", "date": "2007-06-11T19:35:17+00:00", "topic": "Cystoscope Exam", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree with the \"no smoking\"!  However I have to differ on the \"No alchohol\"... For those of you who love these small little studies, I like this one;\n\n\nwww.urotoday.com/37/browse_categories/bladder_cancer/alcohol_consumption_does_not_raise_risk_of_bladder_cancer.html\n\n\nSo drink lots of beer..\n\n", "date": "2007-03-20T16:43:57+00:00", "topic": "Update on Steve, BCG etc", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosie,\n\nAll I am saying is that personally looking at the statistics (EORTC in particular), about 75-85% of your 5 year risk for recurrance and 50% of your 5 year risk of progression is in the first two years..  Rosie - your first recurrences happened within this 2 year time frame as well.\n\nThose who make it through the first 2 years without progression or recurrance, statistically have much better odds of never having a recurrance or progressing... Statistically your risk never actually drops to zero, but for each successive year that you have no tumor recurrence or progression, your overall long term risk (statistically) drops more and more.   I think Dr. Schoenberg in his book \"The Guide to Living with Bladder Cancer\", stated that at 5 years without a recurrance or progression that you could call yourself a \"Survivor\" and were probably cured.\n\n\"Q. Can bladder cancer survivors ever count themselves in the \"cured\" column?\n\nA. As with most cancers, the longer one goes without a recurrence the better. The majority of patients with bladder cancer are initially diagnosed with a non-muscle invasive cancer that can be managed initially with tumor resection via cystoscopy with or without intravesical therapy. These patients however, are at high risk for developing another tumor. The majority of recurrences occur within the first two years. The status of the bladder at the first three-month follow-up cystoscopy is a very important contributing factor to remaining disease free. Recurrent tumors do occur after the critical two year period, though less frequently, and patients should continue to be followed at least annually.\"\n\n\nwww.bcan.org/index.php?name=Emails&op=view&id=8\n\n\nI did talk to a gal who had superficial bladder cancer last summer who had gone 20+ years without a recurrance.. it was a one time event for her.  I think many of the long term recurrance/progression free survivors have put their cancer scare in the back of their minds and have gotten on with life and are not pouring over statistics and websites.  This website has probably only been significantly trafficked in the last 5 years or so?   Incidence of bladder cancer increases with age. People over the age of 70 develop the disease 2 to 3 times more often than those aged 55–69 and 15 to 20 times more often than those aged 30–54.   So most long term survivors who had bladder cancer 20 years ago are probably dying of something else in a nursing home or have already been planted, probably not too many 90+ year olds posting on BLC Webcafe.\n\nOK, I'm just rambling now - I'll stop  ", "date": "2007-03-05T06:24:33+00:00", "topic": "2 Years and no recurance", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHeinz,\n\nWell, I was going to say your diagnosis is similar to mine, but then I noticed you had some \"micropapillary\" urothelial carcinoma in the mix.   Did some quick checking and a few studies did say that survival rates were not significantly different between conventional urothelial carcinoma and those with your percentage of micropapillary urothelial carcinoma.\n\nI have been recurrance free for a year since my initial T1G3.  Plenty of long term survivors - you don't find many of them hanging around this message board though.  My feeling is that if I go 2 years without a recurrance/progression I'll feel pretty confident that I have this cancer beast licked!\n\nStatistically about 75-85% of your 5 year risk for recurrance and 50% of your 5 year risk of progression is in the first two years.. So yes you may always have some risk, but it is much lower after 2 years.\t\t\t", "date": "2007-03-05T06:24:33+00:00", "topic": "2 Years and no recurance", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreg,\n\nA TaG1 tumor is actually not too bad a prognosis - It might just be the wake-up call to stop using tobacco in any form.  The way I understand it is that the carcinogens from the dip smokless tobacco are absorbed into your bloodstream through the lip, your blood is then filtered by your kidneys, which remove all the bad carcinogens and dump them into your bladder via urine.  The urine sits in your bladder with all these bad carcinogens and mutates your bladder lining cells... then whalla!  You get a bladder tumor.\n\nI personally think the best thing you can do at this point is quit any form of tobacco and thank your lucky starts it wasn't an invasive tumor.  I wish mine was such a mild, non-agressive grade tumor.\n\nI think there is not a whole lot of research into how bad the smokeless tobacco is, for all I know it may have far more nasty bladder cancer causing carcinogens than cigarettes.\n\nOf course they can never tell for sure whether your chewing caused it, but I would put a high probability that my can-a-day of Kodiak snuff tobacco habit for 20 years did.\t\t\t", "date": "2007-02-21T11:53:07+00:00", "topic": "smoking", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, I didn't smoke, but did use smokeless tobacco... so I answered your poll anyway  ", "date": "2007-02-21T11:53:07+00:00", "topic": "smoking", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHmmmm, Bob I would seriously get a second opinion about not getting BCG for a T1G2.  Maybe your doc knows what he is talking about, but?\n\nI would at least look into the \"induction\" 6-weekly treatments of BCG.  Get a second and third opinion.  Generally your tumor would fall in the \"Intermediate\" risk zone, I would prefer conservative overtreatment than undertreatment.  Your doctor may be waiting for a recurrance before bumping you up to the \"High risk category\" and advising BCG.\n\n\nLow ( TaG1, T1G1 unique)\n\nIntermediate (T1G1 multiple, TaG2,T1G2 unique)\n\nHigh (T1G2 multiple, G3, +Tis)\n\n", "date": "2007-02-26T17:28:36+00:00", "topic": "Confusing statistics?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tExcellent article Wendy - Thank you! - As Bob can see for this study, the long term outcomes for T1G3 was like 80% (10 year - progression free) - probably even better long-term odds for a T1G2.\t\t\t", "date": "2007-02-26T17:28:36+00:00", "topic": "Confusing statistics?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad to read that response a couple times    I meant to say that only a percentage of those with superficial bladder cancer who progress end up dying from the bladder cancer disease.  I believe the rough statistics are something in the range of 50% (taking into account all of the invasive stages t2-t4), your odds are better with a t2 than a t4.\n\n(I'm throwing that figure out from the top of my head from memory - don't ask me to dig up the data!)\t\t\t", "date": "2006-11-15T06:37:55+00:00", "topic": "life expectancy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tReally depends on how \"superficial\" the superficial bladder cancer was?  If they were all TaG1 tumors, thats much better than a batch of \"superficial\" T1G3 tumors.  The best guide I can provide you would be the EORTC risk tables calculator, key in your dad's variables and it will give you a good statistical read of chances of recurrance and progression.\n\n\nwww.eortc.be/tools/bladdercalculator/default.htm\n\n\nOf course only a percentage of the people who progress actually die, some are cured with surgury or chemo/radiation.  However at this point it is no longer \"superficial\" bladder cancer, but invasive.\t\t\t", "date": "2006-11-15T06:37:55+00:00", "topic": "life expectancy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTheory!!???  Its a proven scientific fact, just like \"Oncovite\" vitamins, Brocolli and green tea \n\n\nwww.aim-digest.com/gateway/pages/cancer/articles/bladder.htm\n\n\nAlso remember to stay away from tap water and hot chlorinated showers.. those will give you bladder cancer every time! ;D\t\t\t", "date": "2006-11-24T22:37:46+00:00", "topic": "Newbie-34 year old malT1G3 w/cis...scared to death", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would push to get BCG treatments ASAP. Better safe then sorry.  I'm not advocating being a huge pain in the ass, but I wouldn't feel comfortable until I was treated.\t\t\t", "date": "2006-10-22T21:48:59+00:00", "topic": "Acceptable Interval Between Diagnosis and BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDidn't mean to offend any of you true believers out there, I just call them as I see them.   I am just of the opinion that these super berries are pretty much nonesense.  The website is pretty amatuerish as well, not many visitors in the last couple years, plus they are just trying to sell you the berries.\n\nBut... on the flip side, if you want to belive the berries will be beneficial against bladder cancer, they probably won't harm you at all and might be a healthy alternative to pizza and beer.  ", "date": "2006-10-18T18:07:24+00:00", "topic": "Re: super berries", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have some waterfront property in florida and a bridge to sell you as well..  \t\t\t", "date": "2006-10-18T18:07:24+00:00", "topic": "Re: super berries", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, your right Wendy.  I am not pushing to have it done, just curious as to why it does not seem to be considered.  Your explanation sounds very plausable.\t\t\t", "date": "2006-10-10T21:54:11+00:00", "topic": "Chemo for high grade superficial BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes Wendy, there might be some science to it that makes it impractical... Maybe a 5-10% statistical chance isn't enought to warrant treatment or maybe the chemo still doesn't do such a good job at killing off any microscopic cancer cells floating around in our bloodstreams.\n\nI know that chemo is common practice for many recieving neobladders/urinary diversions if any of the local lymph nodes have traces of cancer upon biopsy, but correct me if I am wrong, quite a few who don't have any infected lympth nodes don't proceed with chemo after the urinary diversion surgury.\n\nI'm not sure why there are no pre-treatments for micro-metaststasis, maybe it is just overtreatment.  \t\t\t", "date": "2006-10-10T21:54:11+00:00", "topic": "Chemo for high grade superficial BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, I was wondering if anyone has taken this topic on with their doctors?  I know that for grade 3 superficial (Stage 0 & 1) there is a slight risk of micro-metastasis.. somewhere between 0-10% (or higher?), especially for Stage T1G3 tumors.\n\nI initially asked my doctor if we should put me on some sort of chemo treatments to try and kill off any rougue cancer cells that somehow spread before my tumor was removed... he indicated that it wasn't warranted and that I had the right to find some quack doctor who would pursue it for me if I wanted.\n\nI have often wondered if a course of some type of chemo might be warranted for those at higher risk.  I'm not talking about chemo instilled in the bladder, but chemo in the blood to try and kill off any micro-metastasis.\n\nAnyone have any thoughts/experience in this matter?\t\t\t", "date": "2006-10-10T21:54:11+00:00", "topic": "Chemo for high grade superficial BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYeah, getting past the 3 month check was a real turning point for my sanity.  Don't worry about it now for another 3 months!  You can get on with life a bit.  Congrats.\t\t\t", "date": "2006-10-03T17:51:12+00:00", "topic": "3 month check up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\"The lession is noninvasive and focally has inverted growth pattern.  The histology has features of a papilloma but there are areas which raise the concern of it being a low grade papillary urothelial carcinoma.\" \n\nIt means they are not even sure it is cancerous.  Smile Alyssa, sounds like a great diagnosis.  I personally think you worry way too much about your diagnosis as your pathology statistically has a great prognosis.\t\t\t", "date": "2006-10-02T18:05:31+00:00", "topic": "question about pathology", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhit,\n\nI went through a hypochondriac stage as well, worrying about the cancer metastisizing..  I went to the doctor several times worried about aches and pains..   I was self testing my urine with strips every morning...  It is scary thinking about the possibilities, after a while, at least for me, I finally settled down (about 4 months after my surgury).  Now I don't worry about it very much.\n", "date": "2006-09-13T15:00:10+00:00", "topic": "Whats This?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSteve,\n\nWhat was your pathology?  What types of urinary diversions are they talking to you about?  Indiana pouch is just one type of internal content pouch, there are several others (Koch?) that may be more appropriate.  I think they are all roughly the same thing with minor design changes.\n\nSo, if I were in your shoes I'd go for an internal pouch or a neobladder.  The external bag does not sound too appealing to me.  But if you do get an ileal conduit, they may be able to go in after the fact and build you an internal pouch?  I'm not sure, you should ask these questions to your doctor.\n\nWhat are you docs telling you they are going to do?  Your a young guy too, you need to be asking about sparing the prostate nerves (nerve sparing), if they cut them out your not going to be able to get a natural erection afterwards...  Start getting aggressive with these docs and figure out just what their plan is.\t\t\t", "date": "2006-09-11T18:54:23+00:00", "topic": "Bad Feeling", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwesome Whit,\n\nI was diagnosed with cancer I believe on March 4th, and stopped my 20 year habit of chewing tobacco that very second.  In fact I have not even had the slightest desire to use again.\n\nI think that was about 6 months ago or ~180 days * $8.00/can/day = $1,440 saved!\n\nAgain, It took me about 4 months to get over the fact that I had a significant risk of bladder cancer progression/death, first clear cysto helped a lot.  I got cancer right in the middle of a divorce (stress related?), the divorce process was actually harder on me than the cancer. (I'm still not divorced yet).  Life can be overwhelming at times.\t\t\t", "date": "2006-07-31T13:06:24+00:00", "topic": "Living with BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tA Ta tumor is non-invasive superficial bladder cancer which is typically graded by cancer cell differentiation as either Grade 1, 2 or 3.  The least agressive and least invasive of these cancerous bladder tumors would be a TaG1. From what I understand you don't even have bladder cancer, but a no grade transitional papilloma, which has a 7% chance of recurring as a cancerous bladder tumor.  So, your not even on the scale yet!  A T1 tumor has already invaded down trhough the first membrane in the bladder, you definitely don't have that - couldn't because you don't have cancer.\n\nIf in the 7 out of 100 chance you do recurr with superficial bladder cancer, then you can worry about the stage/grade.  Sounds to me like your doctor is even overkilling your treatment by treating your papilloma like cancer.\n\nYOU DO NOT HAVE CANCER RIGHT NOW!  Beat that into your head  \n", "date": "2006-07-08T21:36:29+00:00", "topic": "34 yr old male, Can someone elaborate my tumor?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tExcellent guidelines for treatment.  The American Cancer Society has a booklett/phamplett with much of the same information thats available at most hospitals.  If you find your diagnosis on the flow charts starting at page BL-1 you can follow the same guidlines as you doctor uses for your treatment.  It will show you the possible courses of action/treatment your doctor will follow depending on your diagnosis or resulting course of disease progression.\n\nI see the urologist I had my second opinion with (Paul Lange - U.W. Medical center) and the fameous Dr. Herr were both contributing NCCN panel members (authors?).\n\nI followed my diagnosis of T1G3 and it confirmed that in my case BCG maintenance was not suggested (as my urologists have been telling me).\n\nThanks Rosemary, I am sure others will find this link helpfull.\n\n", "date": "2006-06-23T21:22:21+00:00", "topic": "Long term outcomes", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t         Very Long Term Follow of G3, T1 Bladder Cancer\nDear Chris:\nIt is good to hear that you are disease free following induction BCG for G3,T1 bladder cancer.  The size of your tumor (less than 3cm), absence of CIS, and single site are all good prognostic features. No, we don't have 30 year follow up, but I have many patients who have gone much more than 10 years without recurrence.  Because of the life long risk for tumor recurrence, I have modified my original 3 week maintenance schedule to extend the treatment.  Using reduced (1/3 or less dose) I give yearly BCG (weekly for up to 3 weeks) at years 4,5,and 6, and then every other year for years 8, 10 and 12.  For patients who present in their 70's, this is usually sufficient.  At age 35, you may need to go to every 3 years after year 12.  You will be breaking new ground! Do all you can to eliminate carcinogens, including second hand smoke, from your environment, take Oncovite 2 tablets twice a day, and keep your postitive attitude. Thanks for asking, Don Lamm, MD\n\n> Below is the result of your feedback form.  It was submitted by\n>  (This email address is being protected from spambots. You need JavaScript enabled to view it.) on Sunday, June 25, 2006 at 13:47:38\n>\n\n>\n\n>\n> question: Dr. Lamm,\n> I am a 35 year old M, unfortunately used smokless tobacco for approx\n> 20 years (since quit).  Was diagnosed in March '06 with a solitary 2\n> cm T1G3 (no evident co-CIS). Following TURB did 6X BCG Induction\n> course.  3 month check-up cystoscopy clear, Planning on following your\n> 3 year BCG maintenance schedule. I've seen the 5 year statistics, but\n> for a young guy like myself is it really possible I'll be around in 30\n> years with my bladder? Has anyone done any long-term outcome studies\n> on younger patients with T1G3 bladder cancer?\n>\n> Thanks\n> Chris Allison, Seattle, WA\t\t\t", "date": "2006-06-23T21:22:21+00:00", "topic": "Long term outcomes", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlyssa,\n\nStop worrying about your cancer matastisizing! The EORTC risk tables have your chance of progression (including metastatic cancer spread) at 0.2% (1 in 500) over 2 years and 0.8% (1 in 125) over 5 years.\n\nYour cancer grade of 2/4 is probably equivalent to 1/3, but even is it is equivalent to 2/3 it does not appear to change your risk of progression, just recurrance rate (at least according to the risk table data).\n\nReally, the EORTC statistics aren't perfect but when your looking at odds between 1 in 100 and 1 in 500, you probably have the same risk of getting killed in a car accident over 5 years.  Not enough risk to worry about and let it ruin your summer.\n\nMy understanding is they use the IVP or CT to view the upper tract because occasionally someone had a tumor in the ueretors or Kidney (since its all the same urinary system)... however in low grade tumors like yours it sounds like the standard care is to just do it once at diagnosis and not on follow ups.\n\nDoes no stromal invasion mean that the tumor is not in the lamina propria? I believe so, stroma means \"connective tissue\".\n\nIn case of a ta tumor is it biologically possible for it to spread into the blood or lymph system? Sounds like anything is possible, but statistically if you have a low grade single Ta I think your pretty safe.  It could be that the only Ta tumors that ever recorded to have metastisized were actually T1 or t2 tumors that were misdiagnosed.  Who knows the data isn't that specific or accurate.\n\nAgain (disclaimer), I am not a medical professional, so ask these questions to your doctor.\n\n\n\n\n", "date": "2006-07-11T03:59:41+00:00", "topic": "Metastatic work up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlyssa,\n\n\"To date, IVP has been the most common imaging modality used to evaluate the urothelium of the upper collecting system. More recently, a number of examiners have been using CT urography. Although some suggest an upper urinary tract imaging study such as these every one or two years, most believe that, in the absence of risk factors, urine cytologic evaluation and cystoscopy are sufficiently accurate..\"\n\n\"Routine imaging follow-up is NOT indicated for patients with superficial TCC and no invasion of the lamina propria or additional risk factors. Patients with superficial TCC require careful observation and IVP or CT urography every 1-2 years IF any of the following risk factors for recurrent tumor are present: 1) tumor size greater than 3 cm or 10 grams, 2) higher than grade I tumor, or 3) adjacent or remote bladder mucosal changes or dysplasia or CIS. Additional imaging may be necessary if there are positive urine cytologic findings, hematuria, or abnormal cystoscopy\"\n\nHere are the National Guideline Clearinghouse guidlines for follow-up imaging of bladder carcinoma, yours would fall under the first table for Variant 1: Superficial TCC - no invasion or risk factors.  The quotes above are from this link as well;\n\n\nwww.guideline.gov/summary/summary.aspx?doc_id=8310\n\n\n Enjoy your summer..\t\t\t", "date": "2006-07-11T03:59:41+00:00", "topic": "Metastatic work up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJim,\n\nHere is a tumor morphology study of G3 superficial (mostly T1), that specifically excluded co-contaminant CIS.  Over half the patients were treated by TURB only and only 10% or so were treated with BCG.\n\n\njjco.oxfordjournals.org/cgi/content/full/32/11/461#HYF103F3\n\n\nSurprisingly enough overall ~75% of the G3's were progression free out 10+ years.  A non-papillary sessile tumor seemed to be the biggest indicator of progression. Look how nice and flat these curves go after 5 years!\n\n\njjco.oxfordjournals.org/cgi/content/full/32/11/461/HYF103F1\n\n\nFor papillary tumors the progression-free rate appears to be up near 95% at 10 years.\n\n\njjco.oxfordjournals.org/cgi/content/full/32/11/461/HYF103F3\n\n\nTumor morphology is something I have not heard too much about in bladder tumor prognosis, not sure how much wieght to put on this study, but it is interesting.  It also shows how skewed the progression figures can get when the statistics include co-contaminant CIS.  Here is another reference regarding the difference in prognosis with CIS;\n\n\nwww.ncbi.nlm.nih.gov/entrez/query.fcgi?cmd=Retrieve&db=PubMed&list_uids=1933158&dopt=Citation\n\n\nAs far as I know I didn't have any CIS in my bladder, but I'll have to check and see if my tumor was papillary (I think so) or sessile.\t\t\t", "date": "2006-06-13T19:12:26+00:00", "topic": "Noninvasive Grade 3?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHuh, the guy deleted all his posts?\t\t\t", "date": "2006-07-04T01:54:34+00:00", "topic": "Re: What is 'normal' recovery - 39yr old?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nI believe less than 1% of people afflicted with bladder cancer are under 40 years old.  Lucky us huh?  Hope yours was low grade?\n\nIf your having trouble urinating (i.e pain) try some pyridium, your uro can prescribe.  It turns your piss neon orange, but really  helps with the pain.  For added affect there is another drug that tuns your urine blue, but I have no experience with that one yet.\t\t\t", "date": "2006-07-04T01:54:34+00:00", "topic": "Re: What is 'normal' recovery - 39yr old?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nNot sure 4 weeks seems a little long to have any major pain.  How big was the superficial tumor?  What stage/grade?  I did have a recurrance of henaturia (blood in urine) about 4 weeks after my TURB, however that was during BCG therapy.  You urologist should be able to address your concerns, but the contant thirst/diarrhea does not sound like a bladder cancer problem?\n\nOn the flip side I just had my 3 month checkup without a recurrance. Not a whole lot you can do to prevent a recurrance, but just remain vigilant in your checkups...  If your recurrances get real bad, they may try BCG.\t\t\t", "date": "2006-07-04T01:54:34+00:00", "topic": "Re: What is 'normal' recovery - 39yr old?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm not a doctor, but from what I understand the only exposure you need to worry about would be from the actual urine discharge for up to 8 hours after BCG instillation into the bladder.  Most seem to recommend pouring bleach into the toilet for up to 8 hours after BCG therapy and using disposable rubber gloves.  I myself (while going through BCG therapy) made sure I had a restroom I did not share with anyone else for 12 hours or so, kept it locked (so no children could be exposed or the dog couldn't drink out of the toilet), and made sure I wiped it down with clorox bleach and made sure to add bleach into the toilet for 15 minutes before flushing to kill off any residual BCG.\n\nThe guidelines I have seen also restrict sexual intercourse with someone who has had BCG therapy for 48 hours and suggest using a condom for the duration of BCG treatment and up to a month after.\n\nIts mostly all just precautionary and I do not think the risk of infecting others is too great, but better safe than sorry.   I mean us patients are being exposed by having the stuff poured and retained into our bladder for two hours and its very rare that the patient ends up getting an infection from BCG.\t\t\t", "date": "2006-06-16T08:09:26+00:00", "topic": "BCG Treatment and Risk to Caregivers", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI too have become a hypochondriac..  Since I had my T1G3 tumor removed back in March I have gone to the doctor for an x-ray for an inflammation in my right ankle, it was probably just a little tendonitis.  I spit up a little blood one night, figured it was lung mets, however I guess it was just a cold that immediately went away.  Had a headache for 2-3 days now and have wondered if I have a brain tumor...  On top of that I bought some urinalysis strips to test for blood in my urine and have had positive results twice in the last month.  My urologist told me to throw the strips away!\n\nSo, I understand what you are going through! I think you are just going a little nutty like me, however you have low grade superficial which has a very very low chance of metastisizing.\n\n", "date": "2006-05-31T20:41:47+00:00", "topic": "Health concerns after bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBob,\n\nHere is a good starting point.  If I were having the procedure I think I would choose either an internal pouch or neobladder, however a lot depends on the severeness and location of you cancer, your age and overall health. The following link is a good summary of the different urinary diversions with graphics;\n\n\nwww.clevelandclinic.org/health/health-info/docs/3900/3927.asp?index=12546&src=news\n\n\nYou also should talk to your doctor about a nerve-sparing radical prostatectomy, since usually the prostate is removed along with the bladder and permanent impotence will result unless the nerves are spared as I understand.\n\nGood luck.\t\t\t", "date": "2006-07-14T01:35:56+00:00", "topic": "Need help decide which operation to get.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJeff,\n\nTake the wife out dancing!\n\n", "date": "2006-06-17T23:25:50+00:00", "topic": "invasive bladder cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nSo the ? is how long does it take to progress into a state that it will mastise. I guess it is an unknown. Don \n\n\nI believe statistically people that have stage T1 and remove their bladder have a ~90-95% 5 year survival rate, that would translate to apporximately a ~5-10% chance of metastatic cancer after the bladder was removed.  \n\nIf the tumor progresses to a T2 the 5-year survival rate drops by another ~25% to 65% after bladder removal\n\nSince these are the statistics of survival after bladder removal, its easy to deduce that tumor metastasis has already occurred in ~5-10% of patients with a T1G3 upon bladder removal or TURB and ~35% of patients with a stage T2 muscle invasive tumor upon bladder removal , it just doesn't present until 0-3 years later.\n\nIf you wait too long and the tumor reaches stage 3+ then the 5 year survival odds drop even more significantly.  So to answer your question, the longer you have a residual or recurranct tumor in your bladder the higher your chances are of it metastisizing.\n\nAgain the statistics I quoted are just off the top of my head, verify with a real dotor.\t\t\t", "date": "2006-07-02T12:35:03+00:00", "topic": "How bad is it", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh, went back and read a few of your posts, you originally presented with multifocal T1G3, this is a recurrance after 6X BCG.  Well, hate to say it, but your urologist is probably justified recommending bladder removal.  However, it all comes down to you and how much your willing to risk.  If you do have a T1G3 and it was completely resected, you could do one more 6X BCG, and hope that they removed all of the tumor this time.  You could try with BCG + Inf. or you could do a bladder sparing protocol with radiation/chemo.\n\nThese are all choices you can make/explore if you want to save the bladder.  Your current urologist probably suspects that the T1G3 was not completely resected and may have invaded the muscle (i.e. its actually a T2G3).  You indicated that one urologist wants to do another TURB, that indicates to me that he is still looking at the possibility of saving the bladder.\n\nStatistically if you have the bladder out while the tumor is still superficial (i.e. Ta or T1) you probably have a 90-95% cure rate, if you chance it and it progress to a T2 or T3 you might only be looking at a 65% cure rate.. Either way you lose you bladder and have all the associated morbidity with that. (Those statistics were just off the top of my head, check with your urologist for the actual stats).\n\nSo you can take the safest way out and remove the bladder now or take on additional risk and keep fighting the T1G3 until it either is cured or actually does progress and then you take the bladder out anyway but have a lower survival rate.\n\nGood luck.\n", "date": "2006-07-02T12:35:03+00:00", "topic": "How bad is it", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMaybe I am reading it wrong, but sounds like you had high grade invasion of the lamina propria, which I would read as T1G3.  It sounds like a sample of the musculais mucosae was included with the TURB specimins, and was clear of cancer invasion. So I am assuming your not dealing with a T2?  Or does the Uro believe it may be a T2?\n\nAs I understand it, generally if you have a T1G3 recurrance within 6 months of BCG therapy its generally considered a BCG failure and many urologists proceed with removal of the bladder/prostate.  I'm not sure from your pathology summary if you had a single new occurance or a recurrance from the original site.  If the recurrance happened at your original TURB site, then its pretty obvious that the first tumor resection was not actually complete.\n\nIf your looking for alternatives to having the bladder removed, you might want to talk to your doctor about BCG + Inf treatments (Per Dr. Odonnell).  There are other bladder sparing protocols you can look into as well (i.e. radiation + chemo).\n", "date": "2006-07-02T12:35:03+00:00", "topic": "How bad is it", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYeah, from several studies I have read  it would appear that they can only remove certain lengths of intestines from the different areas without causing damaging long-term side effects (i.e. nutritional absorbtion imbalances).. So, I am not sure a person has enough available material to make a second neobladder?  Maybe they could replace a neobladder with a koch pouch or just a new ileal counduit/external bag.\t\t\t", "date": "2006-06-23T21:40:07+00:00", "topic": "Long term outcomes", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm wondering what the long term effects of having a urinary diversion are?   I am in my mid 30's and I am pretty sure they don't last for 50 years?\n\nI think I have read that many people develop cancer 20-30 years out in the areas where the uretuers are connected to the bladder replacement and other problems related to the age of the urinary diversion.  I understand this might not be a big concern for those of you 55+ or so, but I am interested in finding out what some of the younger crowd has been told by their doctors.\n\nIf I do end up with a bladder replacement, do you have enough spare intestines to make a second replacement sometime down the line?  If you have a neobladder or pouch and it eventually becomes diseased or fails, do they try and construct a new one or do you just end up with a new ileal conduit?\n\nMaybe these things aren't worth worrying about now, but I am curious..\t\t\t", "date": "2006-06-23T21:40:07+00:00", "topic": "Long term outcomes", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}]}