{"signature": ["Surgery", "Dx"], "posts": [{"text": "\n\t\t\t\tMy husband had his RC on 9/24/07. Everything has been going fine lately except he had pinkish unrine in his bag a couple of days ago. Only once. All other times the urine has looked fine, light yellow. Since it only happened that one time we didn't think much of it. Last night it happened again and now this morning it happened again. He is feelng fine but I am concerned something is wrong. He had several complications after surgery and then ended up with a blood infection a few weeks after leaving the hospital. He was back in the hospital on 10/24 and released again on 10/28. He was sent home with antibiotics and will take the last one tomorrow. Is it normal for him to have blood in his urine? It doesn't smell strong and is is not a dark color, but it is definatley pinkish instead of yellow.\n\nI'm sure grateful for this website. It has been such great help through this whole experience. Any help on this new issue would be very much  ??? ???appreciated.\n\nDarlene\t\t\t", "date": "2007-11-09T18:30:29+00:00", "topic": "Pinkish Urine in Urostomy bag????", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy husband Ron had his RC 9/24/07. He was in the hospital for 3 weeks due to heart problems and a bowel obstruction. After being home one week he was admitted again for a urine/blood infection and was released on Sunday. He is doing really well now. Ron has an outside bag. Although he has not had much pain (only two pain pills since leaving the hospital the first time) he is now having pain at night from his swollen scrotum. The swelling was huge right after surgery and has slowly shrunk over the weeks. The scrotum is smaller, still much larger than normal, in the mornings when he gets up. By 8:00pm it is very large/swollen again and he is in agony. The doctor said it would take awhile for it to return to normal and to keep it elevated when sitting or lying down. I would think that 5 weeks (last Monday) after surgery it would be more normal. Everything else is pretty normal now. Any thoughts??? Maybe he's trying to do too much and not resting enough??? When can he expect it to be back to normal???\n\nAppreciate any help you can give.\n\nDarlene\n\n", "date": "2007-10-31T19:36:58+00:00", "topic": "Swelling Problems 5 weeks out of RC????", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy husband just had a radical cystoscomy, removing his bladder, lymph nodes and prostate. He had Stage 1, Grade 3 cancer tumors at the time of surgery. The pathology report came back with no cancer in any of the lymph nodes and no cancer found outside the bladder or prostate. Our M D Anderson doctor told us that Ron would not need chemo or radiation because he was clear of cancer.\n\nDoes anyone know what the chances are the cancer will return at a later date? Or does this mean it's over for good???\t\t\t", "date": "2007-10-18T15:38:42+00:00", "topic": "After radical Cystoscomy, what chances of cancer returning???", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia,\n\nAfter the heart problem, Ron was moved from ICU and he tried liquids on Day #8. He had bad indigestion almost immediately and threw up all night. They took him for a CT Scan and put the Nasal Gastric tube back in. They told me there might be a bowel obstruction and were going to tube him for a few days and watch it. The Nasal Gastric tube sucked out 3 large coke bottles full of stomach fluid the first day. It was disgusting. They left the tube in for 5 more days, did another CT Scan and then told me the obstruction had cleared itself. I know the CT Scan showed an obstruction because the doctor told me they were relieved it had cleared itself, because the last thing they wanted to do was to have to operate on him again, which would have been their only other option.\n\nI'm glad they weren't difinitive with me when they did the first CT Scan because I would have been a wreck thinking they might have to operate again. It would have just increased our anxiety level, which was already very high from the heart scare.\n\nI was so glad everything started working the second time they pulled the GN tube out. It was absolutely amazing how quickly he recovered once the bowels and stomach started working. Before then he was weak, only walking once or twice a day, very lethargic, couldn't get out of bed on his own, couldn't sit up on his own, etc.\n\nNow he's just about back to normal. Not much pain, a little stiffness, walking all over the place and eating well. We are so glad things are going so well.\n\nHope this answered your questions.\n\nDarlene\t\t\t", "date": "2007-10-16T18:28:32+00:00", "topic": "Bladder/Prostate Removed 9/24/07", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy husband had Bladder and Prostate cancer, discovered almost at the same time, but thry were 2 differennt kinds of cancers. Ron was diagnosed with bladder cancer first. Our first doctor (Urologist) who did the TURB on Ron said the prostrate felt a little firm but he did not feel any nodules so he thought it was fine. We went for a second opinion on the bladder cancer treatment the new doctor (Cancer Urologist)checked the bladder and then scheduled a prostate biopsy because he thought the firmness in the prostate might be a problem. Sure enough the pathology report came back with prostate cancer. It wasn't that big of a deal because our surgeon had already said he always removes the prostate and lymph nodes whenever he removes the bladder. But I did ask him specifically if the prostate cancer had come from the bladder and he stated no, they were two different cancers.\n\nWe are so glad we went for a second opinion on the bladder cancer treatment. If we hadn't the first urologist was going to wait three months and then start the BCG treatments. Come to find out from the MD Anderson Cancer Center Urologist, Dr. Dinney, the cancer was too agressive, almost through the bladder wall and the BCG would not have gotten to the roots. They were too deep. As much as we did not want his bladder removed it was better for him to have major surgery at 66 years old than at 70 years old, especially with his heart condition. I also doubt his heart would have taken chemo treatments if the cancer escaped the bladder.\n\nDarlene\t\t\t", "date": "2007-10-07T14:12:03+00:00", "topic": "Bladder Cancer &amp;amp;amp; Prostrate Cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Ginger. Your updates help.\t\t\t", "date": "2007-10-15T23:05:52+00:00", "topic": "one month,post-op appt. here's the poop", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news. I'm so happy for you both. You couldn't ask for better results. Keep us posted. Tomorrows our day. Wish us luck.\n\nDarlene\t\t\t", "date": "2007-09-22T00:07:08+00:00", "topic": "Gene Beane Pathology report", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you so much for all your posts about Gene's recovery. They have been very helpful for me to anticipate how my Ron is going to do after surgery on Monday 9/24/07. Another friend had his postrate removed a few weeks ago and had the same problem with hiccups and nausea. Sounds very painful. Glad Gene is doing so well. I can only hope Ron does as well.\t\t\t", "date": "2007-09-19T20:29:51+00:00", "topic": "day 5 french toast, orange juice Gene Beane", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGinger,\n\nI am so glad to hear that everything is going well. I have been thinking of you guys constantly since Friday morning. I know surgery being over is such a relief. It will be for us. With Ron's surgery postponed until 9/24/07 we are now waiting longer, which is wearing on both of us. The waiting is horrible. I will give Ron your email to read. Since our husbands are both the same age and have both had major heart attacks your report will help him relax and be more confident of the future. I am also feeling better hearing your news. They did Ron's preop last week even though surgery was delayed and it's made me feel even more confident than before in choosing Dr. Dinney and MD Anderson Cancer Center. They were very thorough and helpful. I will continue to pray for Gene's quick recovery and look forward to hearing more on how is he progressing.\n\nI would also like to thank everyone on this site who helped with the many questions I've had. It was very appreciated during a time that has been so stressful.\n\nDar\t\t\t", "date": "2007-09-16T18:11:25+00:00", "topic": "day2, gene is walking the halls!!!!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLuis/Skylid,\n\nMy husband is in average physical condition. The operations is planned for 9/18. We were told 6-7 hours. Dr Dinney, the heard of MD Anderson's Cancer Institute's Urology Dept, is performing the surgery. I assume he is one of the best in the field. I work a very demanding job and although I plan to take time off while he is in the hospital I need to get back to work. The doctor said he would be ok by himself after he got home from the hospital, as long as I set things up before I left for work. How long were you in the hospital?? How bad off will he be when he gets home?? Would a walker be appropriate for awhile?? Will he be able to get out of bed by himself?? Any tips on what I can expect??\nWhy did you choose the neobladder vs the ilieal conduit?? Does it require longer surgery? I would assume it would, but how much longer?\nThanks to all who have answered my questions. It has been very helpful.\t\t\t", "date": "2007-08-22T16:10:58+00:00", "topic": "is radical cystestomy the best option?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia, Thanks for your answer. \t\t\t", "date": "2007-08-22T16:10:58+00:00", "topic": "is radical cystestomy the best option?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}]}