{"signature": ["Dx", "TURBT", "BCG", "Dx", "TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tSorry but this City of Hope link brings me to the bio of Dr. Josephson, not anything on path findings\t\t\t", "date": "2008-09-24T16:53:45+00:00", "topic": "experience with re-turbs at MSK", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMarne:\n\nWhen I was first told by my uro in early May 2008 that I had a small tumor in my bladder I had to fight freaking out.  Then came all my research (a lot of it via this great website) and then came information overload (reading stuff; getting three opinions from docs), etc.  Now I am calm and sorted out (most of the time).\n\nKaren & Rosemary are absolutely right.  Everyone should get a second opinion.  And since you are in NYC, you have access to some of the best in the country.\n\nMany people here (and elsewhere) have gone to Harry Herr at Memorial Sloan Kettering; he has written more papers and done more research on BC than anyone else and is recognized as one of top BC guys in the world.  And I have heard you can get in to see him fairly quickly.  He has a rep for no bedside manner and others have suggested two docs who work with him closely: Dr. Sagani and Dr. Rebanoi (sp?). But go get a second opinion, and then a third if the second varies greatly from the first.  But then you have to balance more info overload. Most insurance companies pay not only for a second opinion but, if it differs from first, will also pay for a third.\n\nAnd write down all your questions and bring them.  What works for me is that I type my questions, reread them and revise them, bring two copies to appointment and give one copy to the doc at the start of the visit.  I then take notes of answers on my copy cause after I leave I forget what was said.    The two docs I have done this with seem to appreciate being able to get right to my questions; saves them time.\n\nAnd if you can bring someone with you: partner, friend.  Two sets of ears are better than one.\n\nGood luck and focus on what you have control over, not what you do not.  (If only I could always take my own advice).\n\nStay on an even keel and good luck,\nDavid\t\t\t", "date": "2008-07-19T12:47:42+00:00", "topic": "In Desperate Need of Help", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMe too!  \n\nJust home from uro and cysto and all looks good.  So on to next 3 rounds of maintenance BCG, then can wait for six months until next cysto.\n\nOnly you guys understand how the anxiety builds before the cysto.  I kept really busy the past two days which helped a lot.\n\nGood luck to all you awaiting cystos soon.\n\nDavid\t\t\t", "date": "2009-02-18T02:17:21+00:00", "topic": "Another happy report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSince BC Dx in May 2008, Ihave had two rounds of BCG:  six weekly and then, 4 months  later, 3 weekly maintenance.  Only 1 treatment (#5) left me feeling \"fluish\" for 2 days.  No effects from others.  Recommend BCG for all unless contraindicated for some medical reason.  I will definately continue BCG.\n\nDavid\t\t\t", "date": "2009-01-13T15:53:06+00:00", "topic": "Would anyone refuse BCG treatments?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've mostly been \"lurking\" but keeping track of how everyone is doing since my last clean cysto in October.  I find if I log in almost every day, I am more prone to obsessing about whether next cysto will be OK so I avoid the site and have a better chance of not thinking about BC for a few days.  I mean no disrespect to anyone and it does not mean that I care less about how you all are doing.  Just seems to work for me.\n\nWife and I have been in FL now for two weeks, escaping the miserable winter in CT.  Heading home soon with next cysto set for 2 weeks from now.  So, in my admittedly selfish way, am checking in more frequently as I gear up for the appointment.\n\nI also finally figured out how to get decent medical insurance after my COBRRA coverage runs out on March 1.  Could not get individual coverage once the BC was diagnosed in May 2008.  But CT is one of the most liberal states in defining a \"group\" as any entity of 2 or more persons so wife and I incorporated a 2-member LLC as \"consultants\" and have app pending with Anthem for group coverage.  Insurance companies must write coverage for groups without medical underwriting; rates based strictly on age based underwriting - so our rates are based solely on fact that we are in the age 55-59 cohort.  It seems to be working out OK, at a cost  not that much more than what I was paying under COBRA (which is still ~ $16k per year with high deductible.\n\nAnyway, anyone who wants more info on how I got the coverage, ask away, online or off.\n\nAnd I will be around the site more for awhile now I suppose.\n\nBe well,\nDavid\t\t\t", "date": "2009-01-01T06:00:03+00:00", "topic": "Cysto Scorecard", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRo:\n\nThanks for this better link to \"abstract\" of the article. (My daughter-in-law, who is a med student, can usually get me any article via her library account but could not find the \"Journal of Drugs in Dermatology\".)\n\nI may email Dr. Sheehan, whose info is at the bottom of the link you gave, and point him to our discussions on this board.\n\nAnd thanks for doing this research to you, Pat and Slab.\n\nDavid\t\t\t", "date": "2008-11-11T03:25:43+00:00", "topic": "More on BCG-Induced Arthritis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy doc called this afternoon with the great news that the path results from last Friday's TURBT/biopsies all came back negative, as did all the other labs (FISH, cytology).\n\nWhat a relief!  Now it's on to the 3 BCG maintenance in November.\n\nI am Jewish and tomorrow night starts the holiest day of the year for us - Yom Kippur.  Last week was the new year - Rosh Hashona, and the ten days between are called the Days of Awe.  When one reflects on one's life; asks for forgiveness from any individuals we may have slighted or hurt in the past year and generally contemplate life. One of the key prayers on Yom Kippur is \"May We Be Inscribed (and Sealed) in the Book of Life\" for the coming year.\n\nI wish the same for all of you out there in BC land.  May you and yours have a healthy, happy and sweet year.  I'm going to try my best.\n\nDavid\t\t\t", "date": "2008-09-25T16:20:26+00:00", "topic": "Just back from cysto...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI guess I can understand that - from what I have read the one study (small pop) showed 21% false positives and 1% false negatives.  But it is one additional piece of info.\t\t\t", "date": "2008-09-25T16:20:26+00:00", "topic": "Just back from cysto...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood news.  I have my first 3 month followup cysto this Thursday.\n\nAm curious - did you do BCG maintenance therapy after intial 6 BCGs?\nIf not, why did your doc or you decide not to do maintenance BCG?\n\nEnjoy your news and your life.\n\nDavid\t\t\t", "date": "2008-09-19T22:43:24+00:00", "topic": "Good result just a quicky", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat is \"pos FISH\"?\n\nThanks,\nDavid\t\t\t", "date": "2008-08-17T15:14:03+00:00", "topic": "whew! finally ! and a question for all", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWe're rooting for you!\n\nDavid\t\t\t", "date": "2008-08-11T01:09:12+00:00", "topic": "3 month checkup tomorrow", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI asked my doc about the need to wear a condom and he said \"no\"; that intercourse the day after the BCG treatment was fine.  Such different answers on timing...\t\t\t", "date": "2008-08-05T20:55:48+00:00", "topic": "A Question on BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad BCG#4 this morning. So far, no reaction to any of them so asked nurse about it this morning.  She said everyone is different and that my weekly urine analyses have shown microscopic blood and \"stuff\" so \"something is being irritated in there.\"\n\nIt's weird that we actually want to feel something different/adverse because \"only then\" will we believe that it is \"working\".\n\nDavid\t\t\t", "date": "2008-07-24T14:50:23+00:00", "topic": "6 days after first BCG and some blood", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNot yet.  Had BCG #2 this past Tuesday.  Only issue is slight burning while peeing.  I'll take it.\t\t\t", "date": "2008-07-24T14:50:23+00:00", "topic": "6 days after first BCG and some blood", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAmen.\t\t\t", "date": "2008-07-25T04:51:19+00:00", "topic": "I was wondering something", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLynn:\n\nI think we all share the same anxieties to varying degrees about the quarterly cystos.  You are not whining!  Some people try to deal with it by convincing themselves that the news will be bad so that anything else is good news.  Others try other things.  Just know that every one of us worries about these cystos to some extent, usually with great anxiety.  I'm sure you will hear from others about how they try to deal with it.\n\nMy only sugggestion is to do the best you can, try different coping mechanisms and see what works best for you.  Don't assume that you will be able to eliminate the anxiety; it is a part of dealing with this disease (and life).\n\nAnd know that we are out there thinking about you.\n\nDavid\t\t\t", "date": "2008-07-25T16:24:33+00:00", "topic": "One week until next cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tA #16!  What is that - like a municipal sewer pipe?  Ask him to order some #8's and 10's!\n\nI take Oncovite - a multivitamin.  Here is info I posted on it a few days ago.\n\nRe:Vitamins and nutrition  3 Days, 19 Hours ago\nI was dx'd with BC in May 2008. Research led me to Dr. Lamm's web site and reference to Oncovite which I have taken since. My docs, when I asked and gave them formulary, said \"it could'nt hurt\". It has nothing weird in it; simplya multivitamin formulated by Lamm based on what he has learned about dosages of various vitamins.\n\nI take two per day.\n\nBest price I have found is drugstore.com.\n\nHere is formulary:\n\nSupplement Facts\nServing Size: 1 Tablet\nServings Per Container:\nAmount per Serving % Daily Value\nVitamin A 9000 IU 180\nVitamin C 500 mg 833\nVitamin D D3 400 IU 100\nVitamin E 100 IU 333\nThiamin (B1) 0.34 mg 23\nRiboflavin (B2) 0.5 mg 29\nNiacin (B3) 5 mg 25\nVitamin B6 25 mg 1250\nFolate,Folic Acid,Folacin 0.4 mcg 100\nVitamin B12 1.6 mcg 25\nPantothenic acid 2.3 mg 23\nZinc 7.5 mg 50\n* Daily Value not established.\n\nDavid\t\t\t", "date": "2008-07-21T20:37:55+00:00", "topic": "BCG and dealing with catheter pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLet us know how it goes.\t\t\t", "date": "2008-07-21T20:37:55+00:00", "topic": "BCG and dealing with catheter pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDid you have BCG before (after initial tumor two years ago).  If so, what was your BCG experience then and did doc tell you to expect same side effects (or lack thereof)?  Are you doing a series of 6 BCGs or 3?\n\nIf you are working, I would guess easiest would be to schedule at end of work day so you can go straight home, do the lie down/rotate thing and be near a toilet at as close to the 2 hour holding time as you can do.  I go first thing in morning because I can go home and I can avoid drinking the night before which leaves less in my bladder and holding the BCG in \"easier\".  BCG #1 I held for 1.5 hours; BCG#2 for 2.0 hours.\n\nGood luck and be well!\n\nDavid\t\t\t", "date": "2008-07-07T20:37:43+00:00", "topic": "Starting BCG next week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad BCG #2 yesterday.  No side effects from BCG #1 (Held 1.5 hours). Only side effect from BCG#2 (Held 2.0 hours) has been burning during urination. Expecting #3... to have more side effects as told treatments are cumulative.\t\t\t", "date": "2008-07-07T20:37:43+00:00", "topic": "Starting BCG next week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI asked my uro oncologist about this specifically a few weeks ago prior to my mid-June 2008 second TURBT w/ MMC.  He said that there was no such ban on use of MMC but that the same caution that has always been in place is still in place:  Do Not Use if Perforation or Probability of Perf of bladder exists.  Because he was familiar with my bladder (from TURBT #1 in mid-May, he had no concerns about MMC use and did use it on me.  That was three weeks ago and I had zero side effects from the MMC that I know of.\n\nDavid\t\t\t", "date": "2007-04-26T15:32:55+00:00", "topic": "Local Urologist Cautions Mitomycin C", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm following this thread with great interest because I have mild placque psoriasis and start my first series of BCG in two weeks.  I've asked my uro and my GP if they have heard anything about BCG bringing on psoriatic arthritis and both said \"no\".  I have not seen a rheumatologist in years; I see a dermatologist who specializes in psoriasis at a University Hospital/Research center twice a year.  Will give her a quick call to see if she knows anything and will post answer.\n\nDavid\n\nI've held off taking methotraxate for my psoriasis because it is mild and I have not felt a need for another drug internally.\t\t\t", "date": "2008-05-29T10:49:26+00:00", "topic": "hi, what does arthritis have to do with bcg", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWould you mind sending me off line the name of the doc at MSK you used? I may head down there for another opinion.\n\nThanks,\nDavid\t\t\t", "date": "2008-06-16T22:18:17+00:00", "topic": "Side effects from single MMC installation during TURBT?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary:\n\nIt was 4 weeks exactly from TURB#1 to TURB#2.  And thank you so much for the info about what your doc told you: that it is difficult to scrape it all out and finding more on second TURB is not unexpected.  Another reason to be ticked at my doc - he could have told me that without my having to have thought of the question.\n\nFinally a clarification in response to a couple of people who emailed me offline:\nThe cancer found in my bladder at TURB#2 was not \"new\" cancer that grew in only the four weeks between TURBs.  The doc was emphatic about that: that cancer cannot grow that fast, regardless of its being called \"aggressive\".  It was there at the time of the first TURB but the doc did not get it all at TURB#1 (and maybe not even at TURB#2).  Friends who are docs have told me most surgeons are known for their cockiness/arrogance re: \"I got it all\".  Part of the mental makeup that some of them need to be good surgeons.  But IMO better surgeons don't need that personality trait.\n\nBe well,\nDavid\t\t\t", "date": "2008-06-16T22:18:17+00:00", "topic": "Side effects from single MMC installation during TURBT?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi all:\n\nThis is my first post.  I'm 59/Male, live in CT and got the news in early May 2008 that I had a T1G3 tumor.  Had a TURBD. The doc that did the TURBD, who is well known and respected in these parts and is in a large urological surgury practice, says he got it all and wants me to start on the Lamm/SWOG BCG protocol.\n\nBut he (doc#1) did refer me to one of his practice partners who is a \"Bladder\" guy (vs. Doc#1 who acknowledges he is a kidney guy).  Doc #2 recommends re-TURBD plus MMC.  Both docs are board certified urological oncologists.\n\nQuestions:\n\n1. I am comfortable with Doc#2's rec of re-doing the TURBT plus MMC because seems like lot to gain with little to lose.  Thoughts by others faced with same choice appreciated.\n\n2. I mostly read about MMC being the one-time chemo of choice with TURBT but also have seen in the cafe lots of discussion of Interferon and others.  MMC seems to be the standard/most commonly used.  Have not found articles or personal stories of comparisons or why choose MMC vs. something else.  Again, thoughts appreciated.\n\n3. I want to get an opinion outside this practice group.  I have contacts in the oncology \"business\" and, limiting myself to referrals to NYC and within CT, have what sound like good referrals to Sloan, Yale and UConn.  Insurance will cover Yale or U\nConn but may not cover Sloan for a second opinion (something having to do with not within New England network).  Have been told by docs that Boston centers are not known for bladder cancer.  Not sure what kinds of things a second opinion (or maybe this is already the third opinion) gets me:  BCG, or reTURBY+MMC then BCG, seems to be int'l consensus for T1G3.  Am I missing something?\n\n\nThanks,\nA lurker no more (who thinks this is an incredible web site and resource),\nDavid\n\n", "date": "2008-06-10T03:17:54+00:00", "topic": "Rescraping plus MMC vs. Rescraping plus Interferon, others?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm following this thread with great interest because I have mild placque psoriasis and start my first series of BCG in two weeks.  I've asked my uro and my GP if they have heard anything about BCG bringing on psoriatic arthritis and both said \"no\".  I have not seen a rheumatologist in years; I see a dermatologist who specializes in psoriasis at a University Hospital/Research center twice a year.  Will give her a quick call to see if she knows anything and will post answer.\n\nDavid\n\nI've held off taking methotraxate for my psoriasis because it is mild and I have not felt a need for another drug internally.\t\t\t", "date": "2008-05-29T10:49:26+00:00", "topic": "hi, what does arthritis have to do with bcg", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWe offer support and someone to listen to each of us that goes through the difficult process of watching a parent age.  Each situation and relationship is unique.\n\nThis weekend is the one year anniversary of my mother's death.  She was 91 with multiple issues; she lived a mile from me and was in and out of hospitals/ICUs, nursing homes and her assisted living apt for almost 10 years and I did not have any siblings to share the experience.  I am convinced it was her time; she spent her final week on the hospice floor of our local hospital and died peacefully as she wished.  I consider myself fortunate.\n\nI have had this conversation with so many friends.  How do you care for a parent who you remember in their prime and who now often does not want to be cared for?  All others could offer me, which was of help and I offer here is:  \"You can only do what you can do\".\n\nWhile in the hospital I came across many books trying to help one deal with the aging and loss of a parent.  One of the quotes I wrote down which helped me is printed below.\n\nRegardless of its reference to ultimate death, I wish all a long, happy and healthy life.\n\n“We may have lived enough years to be an adult but we will always be a child in relation to our parents.  Even if we find ourselves “parenting our parents” before their deaths, it is the parent of our youth and childhood that we bury.”   (“Grieving the Loss of Your Parent” by Judy Ball)\n\nDavid\t\t\t", "date": "2008-09-01T22:15:40+00:00", "topic": "just a bad feeling", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSomeone sent this to me and I wanted to share it  I had a good night's sleep after TURBT #3 and awoke to a beautiful day.\n\n\nFrom the writings of Rumi-\n\n\"Our life is not a problem to be solved, it is a gift to be opened.  The color of the sky, the song of a bird, a word of kindness, a strain of music, the sun on our face, the companionship of friends, the taste of sea air, the shape of clouds in summer, the reds of maples in fall-there are so many gifts in a single life.  If we are occupied with what is missing and what is broken and what is wrong, we lose the miraculous harvest of all these tiny gifts, piled one upon the other, that accumulate without our acknowledging them.  If we listen more carefully for the infinite blessings of a single day, this will not discount or obliterate our sorrows.  But it will help us remember how strong and rich we can be, even in the midst of suffering.  A single word of gratefulness can transform a moment of sorrow into a moment of peace.  Try this, and you will see that it’s true.\"\n\nIf you are not familiar with Rumi, look him up. He is widely considered one of literature's greatest mystical poets.\t\t\t", "date": "2008-10-05T22:59:35+00:00", "topic": "Thoughts on waking this morning...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAs an alum of CMU, I followed what was going on with Randy and his life and work.  He was an amazing man, especially about his attitude of dealing with his cancer and known short life span.  One of those really inspiring people.\n\nI just received the following email from CMU:\n\nDear Alumni:\n\nIt is with great sadness that I inform you that our dear friend and colleague Randy Pausch passed away today, July 25, after a brave struggle against pancreatic cancer.\n\nRandy captured the minds and hearts of millions worldwide with his Carnegie Mellon lecture, \"Really Achieving Your Childhood Dreams,\" and his book, \"The Last Lecture.\"\n\nRandy, who earned his doctorate from Carnegie Mellon in 1988, returned to the university in 1997 as an associate professor of human-computer interaction and computer science. Along with Carnegie Mellon Professor Don Marinelli, Randy was the co-founder of the Entertainment Technology Center, a leading interactive multimedia education and entertainment center.\n\nAt Carnegie Mellon, Randy was also the director of the Alice software project, a revolutionary way to teach computer programming. The interactive Alice program teaches computer programming by having kids make animated movies and games. A fitting legacy to Randy's life and work, Alice may in the future help to reverse the dramatic drop in the number of students majoring in computer science at colleges and universities. Randy was also known as a pioneer in the development of virtual reality, and he created the popular Building Virtual Worlds class.\n\nAn award-winning teacher and researcher, Randy was also a National Science Foundation Presidential Young Investigator and a Lilly Foundation Teaching Fellow. He used sabbatical leaves to work at Walt Disney Imagineering and Electronic Arts (EA), and he consulted with Google Inc. on user interface design. He is the author or co-author of five books and more than 70 articles.\n\nPerhaps the greatest lesson, however, Randy taught us all was how to live, even in the face of great challenges, and how to follow our passion. While Randy's greatest passion was clearly his family, he did not shy from sharing his passion for his work as a professor, for his students, and for Carnegie Mellon. We will miss Randy, but we will carry the memory of him and all that he did to make Carnegie Mellon a better university and each of us who knew him a better person.\n\nA memorial service for Randy will be scheduled at a later date. For more information, visit www.cmu.edu.\n\nSincerely,\n\nJared L. Cohon\nPresident, Carnegie Mellon University\t\t\t", "date": "2008-07-25T15:15:18+00:00", "topic": "Randy Pausch Author of the \\&amp;quot;Last Lecture\\&amp;quot; Has Died", "subforum": "17-chit-chat"}]}