{"signature": ["Dx", "TURBT", "Surgery"], "posts": [{"text": "\n\t\t\t\tThanks for the link, Pat. It was excellent. It's often best to read medical explanations that are written by an expert, than to have them paraphrased.\n\nDan\t\t\t", "date": "2008-08-26T17:32:46+00:00", "topic": "Clarification please?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\n\nThis can be confusing, it's complex, not perfectly understood by urologists (nor me!). And all of us here have panicked at one time or another, so you're in good company. <g>\n\nHere's how I look at it:\n\n1) CIS is one of several forms of TCC (transitional cell carcinoma)\n\n2)\"associated with concomittant high-grade invasive TCC\" means that if CIS is found in the bladder, it is then often also found elsewhere in the urinary tract (urethra or ureters or pelvis of the kidney), and/or that it is found with papillary (not muscle-invasive) or T1 (not muscle-invasive) or T2 (muscle-invasive) cancer in the bladder. I interpret invasive CIS to be CIS that that has progressed from the lining of the bladder to the lining of the ureters or urethra or pelvis of one or both kidneys. Note that T2 cancer is invasive differently, in that it has invaded the muscle of the bladder. CIS and T2 can both become metastatic.\n\n3) \"Is it usual that it has already spread?\" I don't have the statistics on that, but there are many on this website where tests did not show CIS had spread at the time of their original diagnosis.\n\nAlso keep in mind that there are different types of CIS, one form being more aggressive than the other. There are some on this website who seem to have had the less aggressive form of CIS and have had no recurrence after many years. They may never have a recurrence.\n\n4) Many studies have shown that BCG can often delay recurrence and progression of high-grade TCC, shorter-term. But BCG has not been shown to prevent recurrence or progression, longer-term. Many doctors and patients use the word 'control' in that if the patient undergoes careful surveillance, then recurrence of CIS might be detected soon enough to allow for additional, more aggressive or definitive, therapy.\n\nCIS found with TaG3 or T1G3 is known to be more dangerous than CIS found alone, or TaG3 or T1G3 found alone.\n\nDan\n\n\n\n\n\n\nI find that I always learn new things when I re-visit things I have already read. I was perusing the section on CIS under the BLC information of this web site, and was struck by the following excerpts..\n\n\"CIS-carcinoma in situ, is relatively rare, comprising approximately 10% of cases and is also considered a superficial tumor (does not penetrate the bladder lining), and is usually associated with concomitant high grade, invasive TCC in adjacent or distant urothelium (secondary CIS).\n\nOccasionally (1% of cases or less), CIS is found without associated invasive TCC (primary CIS\"\n\n\nQUESTION: what does the part about \"usually associated with concomitant high grade invasive TCC...\" mean? I was under the impression that CIS was \"controllable\" with BCG, or, at worst, bladder removal. Is it USUAL that it has already spread? Guess I am in a bit of a panic, confused.\t\t\t", "date": "2008-08-26T17:32:46+00:00", "topic": "Clarification please?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt also makes sense to me to wait until you finish your first round of BCG treatments. At that time MD Anderson will likely want to do a cystoscopy when you visit (to see for themselves what your bladder looks like). At least that is what they did for me when I went for my 2nd opinion there - they asked me to coordinate my visits there with my local series of BCG treatments in California.\n\nDan\n\n", "date": "2008-05-06T22:25:32+00:00", "topic": "Second Opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've heard good things about Dr. Smith at Vanderbilt and Dr. Kamat at MD Anderson as well as Dr. Schoenberg.\n\nDr. Stein at USC/Norris (he did my surgery - I highly recommend him or anyone else at that cancer center). Surgeons at USC/Norris routinely remove 60 or more lymph nodes, especially important for someone with muscle-invasive blc.\n\nIf you're gonna have this surgery, you're smart to use one of the best docs at a highly rated institution. \t\t\t", "date": "2008-01-13T07:37:08+00:00", "topic": "Need a doctor for NEOBLADDER SURGERY", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Marie,\nT1G3, multiple sites, early recurrences???\n\nIf it was me (and it was), I'd yank out the bladder. I did, with no regrets.\n\nIf you want to read an excellent article that spells out the pros and cons, let me know and I'll email it to you. Title is \"Indications for Early Cystectomy\".\n\nGood luck with your upcoming RC.\nDan\t\t\t", "date": "2007-12-17T02:07:54+00:00", "topic": "T1G3 multiple sites", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've read a few posts recently from those whose high grade cancer has progressed, they are now facing either muscle-invasive or metastatic blc, so here's another article written by a USC/Norris urologist, describing their philosophy on treating high-grade cancer.\n\nMy post is not intended to cause concern (hell, everyone diagnosed with any cancer is concerned at the getgo!) or sway minds, rather, just inform.\n\nDan\n\n========================\nThe ojective of the study was to evaluate the role of initial cystectomy in the management of high-grade T1 bladder cancer.\n\nA selected review of the literature was performed to evaluate outcomes with intravesical therapy vs. initial cystectomy in this patient population, with a focus on identifying risk factors for failure of conservative therapy.\n\nMany studies in the literature fail to include central pathologic review and re-TUR clinical staging, and there are no randomized studies comparing outcomes with these two initial approaches. Retrospective studies of patients with high-grade T1 tumors treated with initial intravesical therapy suggest that approximately 30% of patients will ultimately require cystectomy, and 30% will die of their disease with or without cystectomy. The risk of progression continues for the life of the patient, and late recurrence and progression is common. Initial clinical and pathologic factors can be identified that predict a high risk of progression and are reasonable indicators for initial cystectomy.\n\nThey conclude that radical cystectomy can provide a very high cure rate for these patients and should be considered early in the treatment plan.\t\t\t", "date": "2007-12-01T22:53:58+00:00", "topic": "Evaluate the role of initial cystectomy re:high-grade T1 blc", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, very similar situations, Tim, except you had those G2 and CIS recurrences - I had none, fortunately, which I partly attribute (kinda) to a 2nd TURBT shortly after my first one (the docs thought it was recurrent blc - but it wasn't). Who knows.\n\nMy RC was one year after my initial blc diagnosis, and while on the one hand I wish I had had a cystectomy sooner, on the other hand I'm glad I had a dozen BCG treatments, even though the side effects were horrible on the last few (I did like the idea of my immune system being enhanced by BCG).\n\nMy sense is that for every cautious doc advocating aggresive treatment (RC), there are 50 docs on the other side. Why? Because there are relatively few urologic surgeons who do RC, most are only qualified to do TURBTs, prescribe BCG... It's like that old adage, if one's tool is a hammer, then every problem presents itself as a nail.\n\nI also have absolutely no regrets about my RC. It's funny, there are so many things in life that I'd like a 'do over', a chance to do something again. But not this. The thought of cancer returning somewhere in my urinary tract is still there, but the thought is quite remote. My peace of mind is an order of magnitiude greater than before my RC, when I was worrying about recurrence and progression, was my blc understaged, would I need chemo, why didn't my first urologic surgeon use mitomycin C after my TURBTs... I was driving myself crazy.\n\nI guess I believe that if one uses statistics and long-term outcomes of patient survival as a primary (though not the only) criteria to judge the 'rightness' or 'wrongness' of a decision to go the bladder-sparing or cystectomy route, then there is a right decision for those with T1G3 + CIS - and the right decision is cystectomy. But there are clearly other criteria to base this decision on, so as we all know, what is right for one of us is not necessarily right for someone else.\n\nI'm yakking too much, time to make some coffee...\n\n", "date": "2007-11-16T21:40:33+00:00", "topic": "What exactly does this mean?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\nAlso, I worry constantly from what I read here about understaging etc, but his Urologist is the 'top' guy at his hospital and their path departments are supposed to be excellent so should we just hope for the best.\n\nHi Ceri,\nUnderstaging does not result from lack of skill of the doctor or pathologist, it is not a misdiagnosis. Here is a quote from USC/Norris (and Dr. Stein is their top guy):\n\n\"Despite the best clinical efforts, even with advanced histopathologic evaluations and imaging techniques (CT, MRI), significant clinical staging errors occur. Errors ranging from 34% to 62% have been reported in several large studies.\"\n\nBCG (maintenance therapy) does reduce (not prevent) recurrence and progression rates, so I would suggest that your husband's bladder-sparing approach include:\n\n- continuing BCG maintenance\n- use FISH in addition to cytology\n- find an institution that does UV light cystoscopy as it detects cancer better than visible light cystoscopy\n\nThe reason I post this stuff is not to worry you or your husband or to say that his approach is not right (there is no right decision), it's just that your husband's diagnosis of T1G3 + CIS is a dangerous combination (one that I had). When I asked Dr. Stein what he would do if he had the same cancer as me, he said that he would undergo cystectmy before a recurrence. His recommendation (which is supported by several other papers that I had read) for patients with high grade cancer is as follows:\n\n\"It is my recommendation that patients that radical cystectomy be considered for patients with... T1 tumors associated with CIS...\". One other thing to consider is the number of lymph nodes removed, especially important is one has muscle-invasive blc (which your husband's tests indicate that he does NOT have).\n\nIt can be a difficult decision what to do for T1G3 and CIS patients, especially when tests show no evidence of disease (I don't use the phrase 'all clear' as that is misleading). Dr. Stein's recommendation is not the 'right' choice, but another alternative.\n\nGood luck!!!\n\nDan\n\n", "date": "2007-11-16T21:40:33+00:00", "topic": "What exactly does this mean?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nso this is to imply that Columbia grossly understaged their patients?\nNo implication, it's a fact. Though I wouldn't use the word 'grossly' as that implies incompetence. But assuming Columbia has their diagnostic sh** together, understaging at their cancer center would be no different than that at MD Anderson or USC/Norris...\n\nUnderstaging is the nature of the beast, so to speak. The most thorough way to stage bladder cancer is to remove the bladder (or lymph nodes...) for examination (and even this could miss microscopic traces of cancer).\n\nAll diagnostic techniques have limitations. Urine diagnostics may fail to detect high grade or low grade (depending on the test), or may fail to detect blc until it has advanced. Cystoscopy can only examine the interior surface of the bladder that is visible. Tumors can be on the interior/inside/outside of the bladder..., and can be blind to diagnostics.\n\nThat's one reason why bladder removal can be such a difficult decision for those of us with high grade cancer. Urologists/patients sometimes say 'all clear' when the more appropriate phrase is NED (no evidence of disease). 'Stealth' recurrence/progression occurs about 1/3 to 2/3 of the time for patients with high grade blc.\n\n\n\n\n\n", "date": "2007-11-15T02:40:04+00:00", "topic": "IVT Therapy &amp;amp;amp; Decreasing Survival after RC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI wonder what comparable studies are out there with places like Memorial Sloan, MD Anderson, Mayo, USC/Norris........???\nWsilberstein's explanation is likely correct. Here's what Dr. Stein from USC/Norris wrote in a 2003 paper about the incidence of clinical understaging in patients with superficial bladder cancer undergoing RC:\n\n\"Errors ranging from 34% to 62% have been reported in several large studies... Such inaccuracies lead to delays in definitive forms of therapy in time to achieve optiimal cure rates. Even if no errors in understaging occur, risks continue. Despite intravesical therapies, the potential for tumor progression, death, and treatment-related side effects remain.\"\n\nThere is much data showing that if high-grade cancer is contained in the bladder (hasn't yet progressed to the urethra or ureters or lymph nodes...), that definitive therapy has a high cure rate. \t\t\t", "date": "2007-11-15T02:40:04+00:00", "topic": "IVT Therapy &amp;amp;amp; Decreasing Survival after RC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\nMy problem now is a total lack of trust, because this has happened to me time and time again. I don't want to grow old and die alone, but I have no desire to put myself out there again, just to be kicked when I'm down. I don't have money for private therapy, and have been calling the local cancer support center, but their therapists seem to mostly work during the day, just like me.  I can't believe this has hit me as hard as it has, but it has, and I do need to do something about it.\n\nConnie\nHi Connie,\nThe trust thing is a biggie. Have you considered joining a cancer support group? They're free. If you're lucky enough to find a good one, they can be very helpful (and not just on the 'life and death' issues). People in my group (it meets twice a month but I attend once every month or two) bring up all kinds of issues, including the impact of cancer on relationships. The face-to-face conversations can be very helpful.\n\nI happened to be going thru a divorce when I was diagnosed, and I found it interesting (well, actually I was pretty disappointed and more than a bit miffed) that my -ex never made an effort to wish me well. I was lucky to get great help from my kids (and a new woman I met after my breakup), though.\n\nMy two cents worth is that while cancer might be thought to be the cause of many relationships to fail, but it instead may instead only facilitate some couple's less than ideal partnership/marriage... I'm not saying this happened in your case, but after my diagnosis and surgery and all, I've come to question some of the things that I thought I 'knew'.\n\n\n", "date": "2007-10-17T10:12:56+00:00", "topic": "Lost Relationship due to Cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Nancy,\nYou've received good info from others, here are my thoughts.\n\nBCG has been showen to reduce recurrences and progression. The key word is reduce, not prevent. With intravesical therapy (BCG), there are a number of possible outcomes. The best outcome is no recurrence. The next best outcome is recurrence that remains localized to the bladder, where intravesical therapy can be continued (perhaps with interferon) or the bladder removed. The least favorable outcome is that CIS progresses to the urethra or ureters or pelvis of the kidney.\n\nCIS is considered dangerous because it is less predictable than other types of blc. I had CIS along with T1G3; this is how I looked at the predictability aspect of CIS.\n\nLow grade cancers (such as TaG1) can progress to TaG2 or TaG3. Should this happen the cancer most likely remains localized in the bladder and other treatments can be very successful. There is some predictability here which both doctor and patient prefer, obviously.\n\nOne thing to understand is that the cells that line your bladder also are the same type of cells that line your urethrea and ureters and pelvis of the kidney, and CIS can also invade these cells. If CIS appears outside your bladder (urethra/ureter/kidney), this prognosis is less favorable.\n\nPlease get a second opinion. While there are many doctors who practice conservative treatment, be sure to get an opinion by someone who treats CIS aggressively. These doctors practice at the major cancer centers. That way, you can decide for yourself which treatment you prefer.\n\n\n\nI am so upset I did not do the history.  Last Nov I had Ta - I did 6 wks of BCG first cysto clear - second some red spots - dr did biopsy in office came back clear - dr did a fish test to be sure.  Fish test came back neg. At the same time he did one more biopsy - last week it came back very low grade cancer.  He did the next cysto a few days later in the hospital and everything came back CIS.  Even my urine tests were neg.  So when i heard CIS today - I was/am speechless.  Can anyone help me?  He is suggesting 6 wks of BCG - but I am afraid in the meantime the CIS will become invasive.  Right no it is not. ", "date": "2007-10-05T19:23:47+00:00", "topic": "Help! Shellshocked once again!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTaG1 in 1998.\nTaG2 in 2000.\nTaG3 in 2007.\n\nIf correct, it looks and sounds and smells like progression, though it's certainly good news that your high grade is apparently not CIS. High grade blc needs to be watched very carefully, whether TaG3 or T1G3 or CIS. Not to scare you, but understaging of blc can be an issue for some, so I'll suggest a couple of things.\n\nFirst, BCG induction and maintenance is definitely called for. And you might consider getting FISH and the UV cystoscopy done, also (in addition to cytology).\n\nFISH, though controversial, is considered by some to be an early indicator of recurrence. My uro at Stanford refused to do FISH, so I flew out to MD Anderson to get it done. Always had negative results, which gave me some peace of mind.\n\nVisible light cystoscopy is not the most thorough way to find cancer. You can read more at the link below about hexvix. MD Anderson had a trial unit there three years ago, maybe others can tell you who else has one.\n\nblcwebcafe.org/hexvix.asp\n\nCytology and visible light cystoscopy are the gold standards of detection for recurrent high grade cancer, but they aren't perfect. Hence my suggestions (only because I'm a bit paranoid <g>).\n\nBest wishes.\n\n", "date": "2007-09-27T02:48:27+00:00", "topic": "My Ta Grade 3 Update", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThere was a study done that compared the shapes of CIS, dysplasia, and normal urothelium cells. They concluded \"Dysplasia, which is a somewhat ambiguous lesion, overlaps in its measurements with those of benign urothelium. The most useful morphologic parameter is the mean nuclear area of the 25% largest nuclei; CIS nuclei are approximately 5 times the size of lymphocytes, whereas normal urothelial nuclei are only 2 times the size of lymphocytes.\"\n\nMy point is that the diagnosis of dysplasia can be subject to human interpretation (unless a fancy image analysis system is used). If it was me, I'd talk to the pathologist and get the details of his diagnosis. Your inclination for treatment may change depending if your dysplasia is more (or less) like normal cells.\n\nYour initial diagnosis was CIS (high grade) plus papillary (grade ?). The eventual long term outcomes (15 years) from another study (the initial treatments for these patients who had high grade cancer were BCG and/or TURBT) showed that just over 50% of cancers progressed during the follow-up period, 36% required cystectomy for progression or refractory CIS, 34% of patients were dead of blc, and 21% developed upper tract cancer.\n\nOf course, these results can't predict specific outcomes, but they are pretty good guidelines.\n\nDan\nI was dx with a TA papillary tumor & CIS back in March, had TURB in April to remove tumors, follwed by 6 BCG treatments, completing in June. I suffered extremely severe inflammation from the BCG -- bullous edema -- swelling, bleeding of the bladder. I had another TURB back on Sep 7 and the biopsy results on Sep 14 plus urine cytology showed no malignant cells but the likely presence of \"Dysplasia\" -- meaning \"abnormal cells which may or may not be pre-cancerous\". The doc feels like the good news is that the inflammation and resulting dysplasia are actually keeping new cancer from forming. He said he may treat the inflammation with INF if it's still bothersome later on.\nHas anyone else experienced this sequence of events, and if so what was the eventual outcome? ", "date": "2007-09-21T16:09:10+00:00", "topic": "Dysplasia following BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt's not unsual for recurrences to occur without visible hematuria. Once reason is that prior to our first TURBT, tumors can grow pretty large with extensive blood supply (hence visible blood). Like many, I had lots of blood initially.\n\nHowever, with ongoing surveillance (cystos and the like), tumors are usually caught at a much earlier stage (hence the prevalence of microhematuria).\n\nThat's one reason why so much research is ongoing to find the 'perfect' test for detecting recurrences (FISH and cytology for high-grade cancer...).\n\nThe downside is that for folks that are post-RC (like me), a large percentage of upper tract or urethral recurrences are missed by ongoing surveillance testing. The patients themselves come in with symptoms (pain, visible blood...)  The bad news is that early vs later detection of upper tract recurrences for post-RC folks doesn't make much of a difference in outcomes.\n\nYeah, yeah, yeah, I know I'm preaching - so stop reading if you know what's coming, but that's one reason it's so important to aggressively treat high-grade blc. The sooner 'superficial' blc is dealt with curative intent, the less likely recurrences are.\t\t\t", "date": "2007-04-30T12:58:36+00:00", "topic": "Recurrences no visible blood", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI normally post this stuff on the email discussion group, but since it applies to some of us who have/had T1..., thought I'd post it here.\n\nHere's the link:\n\ntinyurl.com/2tnknp\n\nor\n\nwww.urotoday.com/37/browse_categories/bladder_cancer/the_increasing_use_of_intravesical_therapies_for_stage_t1_bladder_cancer_coincides_with_decreasing_survival_after_cystectomy.html\n\nHere's the gist:\n\nThursday, 19 July 2007\n\nBERKELEY, CA (UroToday.com) - According to the British Journal of Urology in a recent article by Lambert and collaborators the increased use of intravesical treatments for non-muscle invasive bladder cancer is associated with worse survival in patients with T1 disease despite cystectomy for disease progression or persistent disease after intravesical therapy.\n\nThe researchers used the Urologic Oncology database at Columbia University. Out of 505 total patients who underwent a radical cystectomy from 1990-present 104 had initial T1 disease. The authors divided the group into two time periods: before1998 (early) and after 1998 (late). The mean number of intravesical treatments per patient increased from 0.53 to 1.2 in the early and late groups, respectively (p=0.016). 28 of 38 (74%) patients in the early group and 20 of 47(43%) patients in the late group underwent cystectomy without any intravesical therapy (p=0.004).\n\nThe disease-free survival for patients who had a radical cystectomy in the early vs. late group at 5 years was 70% and 40%, respectively. Additionally, the early group had a worse overall and cancer specific survival than the late group. The survival curves were statistically controlled for confounders including date of surgery, age, and gender.\n\nThe authors hypothesize that prolonged use of intravesical therapy to preserve bladder function may forestall definitive therapy and result in potentially preventable deaths. They recommend early cystectomy in those patients who have initial high risk tumor characteristics or who have early failure to intravesical therapy.\n\nLambert EH, Pierorazio PM, Olsson CA, Benson MC, McKiernan JM and Poon S\t\t\t", "date": "2007-07-20T01:41:48+00:00", "topic": "Intravesical Treatment for T1 Disease Associated with Worse Outcomes Post-RC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Vin,\nWendy sent me your way, so here's my $.02 worth. Keep in mind that I'm pretty opinionated, so don't think that I'm trying to tell you what to do. Ok? It's your (and your doc's) decision.)\n\nFirst, the other folks who posted provided good advice, IMHO.\n\nI could write ad naseum but will keep this brief. I also was diagnosed with T1G3 and CIS two and a half years ago (I was 50), underwent two TURBTs and a dozen BCG instillations, eventually opted for a radical cystectomy (RC) a year and a half ago, and am glad I did. I no longer worry much about cancer, my neobladder works great, the only downside is that sex post-RC is not quite the the same, but I do just fine without pills or shots... I'm continent both night and day. I'm very active (competitive tennis, hikes, gym...).\n\nT1G3 is high-risk cancer. CIS is high-risk cancer. Having both puts you in a higher risk group. I won't talk about low grade Ta tumors, or other extremely aggresive blc, since those are not what you appear to have, but both T1G3 and CIS can progress to become invasive, which can be very serious.\n\nIf you're considering a RC, the data shows that long-term survival (15+ years) is nearly 90% if the cancer is contained inside the bladder at the time of surgery - and the curve is bottoms out, which is great news. Pretty damn good odds, too.\n\nYou're welcome to read my Trench Tale, and I encourage you to read others as well:\n\nblcwebcafe.org/stories.asp\nblcwebcafe.org/stories/dan.asp\n\nIf you're a glutton for data, here's a bunch of articles that I read that were helpful (I'm happy to send you any of them):\nblcwebcafe.org/stories/articles.asp\n\nNeither urologists nor patients, given the same diagnosis, all agree on an ideal course of treatment. One person's carefully considered decision is considered extreme by some, another person's conservative decision may be considered crazy by others. Some folks are data driven (like yours truly), others less so. Only you can determine what is right for you.\n\nSince you're so young, I'd recommend pursuing a path that would give you the best shot at normal longevity. Read the medical literature yourself, it's very enlightening. Seek second opinions. FIND THE BEST UROLOGIST/SURGEON/INSTITUTION. Don't mess around, it's your life! I was told by one urologist that given a T1G3 + CIS diagnosis, if and when it comes to surgery, you only get one chance.\n\nCystectomy is major surgery, but very doable. The absorbent pads needed after surgery (very likely to be temporary) do NOT show through your clothes.\n\nAny questions, just holler.\nDan\n", "date": "2006-11-27T21:21:32+00:00", "topic": "CIS: What are the facts and opinions?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nDr. Kamat suggested partial cystectomy because it was a solitary tumor in the dome. He was able to remove tumor with 2cm margins and removed urachal tract and umbilicus.\nJust want to second Wendy's opinion on Dr. Kamat. I consulted with him several times, I think he's an excellent urologist.\n\n\n\n\n\n", "date": "2007-11-22T00:11:50+00:00", "topic": "anyone with adenocarcinoma having partial cystectomy?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Dan,\n\nIt doesn't make sense to cath each day to check for residual post-void urine. That can be done much less frequently. You might consider asking your doctor if it is acceptable to cath once a week this week, then every other week beginning next week, then every three weeks, then once a month...\n\nBased on my personal experience with my RC 2 1/2 years ago (and what is standard practice at  USC/Norris), regular cathing should not be necessary, assuming no problems. Mucus should exit the neobladder when you void. You seem to have minimal residual urine post-void, which is great.\n\nI cathed twice only, both times to check post-void volume - and that was over two years ago. There was a stinging sensation, pretty painful. Lube helped.\n\nWhere did you have your surgery?\n\n", "date": "2008-04-21T01:24:11+00:00", "topic": "Neobladder Self-Cath &amp;amp;amp; Irrigation - For how long?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis is an interesting thread, particularly since I've made a major (for me) change in my sleeping/voiding habits.\n\nPrevious, as Linda described, I used an alarm for the past 2 1/2 years to wake up after 3 1/2 hours after bedtime to void my neobladder. Was continent 99% of the time at night. Problem was that due to other life stresses, sometimes I had difficulty falling back to sleep after the nightly voiding. Sometimes stayed up another 2 to 3 hours, which meant that when I fell back to sleep (around 5 or 6 AM), I needed another 3 hours of sleep. I kinda sorta restricted my fluid intake at night.\n\nAfter seeing Dr. Stein recently and asking him about the advisability of taking sleeping pills, he was pretty adamant that pills were not the path to take. Rather, he told me to just go to bed and sleep through the night. So I've been dong that for the past week or so. I now restrict my fluid intake after 6 or 7 to no more than a beer or a glass of wine or two. Bedtime is 10:30 to 11:30. I've been waking up MUCH more refreshed, sleep anywhere from 5 to 6 hours before I wake up (the wake up urge seems to be precitated by an urge to urinate). I've been measuring my fluid output after I do wake up, it varies between 400cc to 500cc or so (similar to Pat). I now wake up with my underwear damp (don't wear a pad, but may start).\n\nI also have observed that sleeping on my back is much more likely to result in leakage as compared to sleeping on my side. Similarly, when lying on my back on the couch watching a movie, the urge to void (and slight leakage) is much more noticable as compared to lying on my side. When this happens, I can get up and walk around and delay voiding for quite some time. There is something about the design of the neobladder that seems to predispose it to leakage when on my back. This was confirmed to me by the x-ray technicians who performed a recent urogram. They commented that they leave neobladder/pouch patients on their side when making sure that x-rays taken are good (rather than on their back) because of the leakage issue.\n\nI've eaten foods that have acted as a diuretic. Also, I've noticed that bowel movements are related to more (or less) voiding.\n\nAn important habit, which most seem to have, is to periodically keep track of fluid output. Restricting fluid intake at night is an important technique I use to try and avoid a floppy bladder. Though as noted, I start to leak, when sleeping on my back, once my bladder reaches 400cc or so. A good thing, I think.\n\nDan\n", "date": "2008-02-11T18:54:24+00:00", "topic": "New Volume Record for Melodie - 900", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi CM,\nI just returned from my 2 1/2 year checkup after radical cystectomy, the tests that were done at USC/Norris (I imagine they are similar to tests done by other institutions) are listed below:\n\nurine\nblood\nchest x-ray\ncystogram (or urogram) of the neobladder\nCT scan of the pelvis and abdomen\n\nThese tests are done at either 6 month or 12 month intervals until five years, then x-rays and the CT scans are done every other year therafter.\n\nI've had two cystoscopies done during the previous 2 1/2 years.\n\nDan\n\n\n\n", "date": "2008-02-10T06:14:03+00:00", "topic": "Tests", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon,\nYour doc's advice is sound. While eating solids after RC usually isn't a problem for most folks, it was for me (I had two intestinal blockages - and they sucked big time!!!).\n\nSo my advice is to continue to eat soft foods for awhile (chicken noodle soup and the like) and introduce solids slowly, in small quantities - wait a day, try the same solid food again, and so forth.\n\nAvoid the temptation to eat a steak and potato and rush down to Taco Bell and Wendy's. You may be hungry and crave this stuff, but better safe than sorry.\n\nI also found that eating jello was very helpful in keeping the bowells moving. Continue eating jello after you introduce solids, for some period of time.\n\nAnd be wary (for several months) of eating hard-to-digest foods (like string beans, popcorn, nuts...). Bowell obsructions can occur months after your surgery.\n\nGood luck.\n\nDan\n\n", "date": "2007-12-27T12:59:09+00:00", "topic": "what can I eat after RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat to hear. And nice that you may dodge chemo.\n\nKeep walking, a little more each day, watch your diet (I know this sounds like a broken record...).\n\nYou'll feel better and better each day.\t\t\t", "date": "2007-11-29T15:50:01+00:00", "topic": "I am home ", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGetting rid of aggressive cancer is most important, the type of diversion is secondary. Your surgeon will ultimately make the decision during surgery, most likely.\n\nI've read many posts from folks who have external bags or neobladders... and the consensus is that you'll get used to whatever diversion you end up with. I am entirely satisfied with my neobladder, but others are just as happy with other diversions.\n\nJust be sure that an expert is doing your surgery.\n\nGlad to hear you got a 2nd opinion!!!\n\nGood luck.\n\nDan\t\t\t", "date": "2007-11-27T20:32:19+00:00", "topic": "Bladder replacement options", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\neven back then, they new that a tur alone would not help a large group, it realy makes no scense to do that, Yes it is very scarey that they would even take that approach, Go figure.\nThere is nothing scary to me about about the MD Anderson study. As we know from this website, there are tremendous differences of opinion among doctors (and patients) on the best course of treatment. Patients in the study were offered cystectomy, they knew the risks, they made what seemed like a reasonable choice to defer cystectomy because diagnostics indicated that, after their last TURBT, they were free from residual tumor (though we know that understaging occurs about 40% to 65% of the time).\n\nActually, I think this study is a great example of determining the outcomes for patients who, when informed of the same treatment options, decide on different treatments.\n\nInvasive blc is not an automatic death sentence. 12 of the patients in this study still seem to be free of cancer and I imagine they are still reasonably content with their decision. And even for those whose cancer had progressed to the lymph nodes..., chemo will work for some...\n\nThe patients had a right to choose their treatment, and the doctors were right to study the outcomes.\t\t\t", "date": "2007-11-09T20:36:03+00:00", "topic": "Bladder sparing", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClean nodes is indeed great news.\nKeep walking and watch your diet for awhile...\nKeep on keeping on!!!\t\t\t", "date": "2007-11-20T18:21:27+00:00", "topic": "PeterK update", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tInteresting article.\n\ntinyurl.com/3ahapo\n\nOrgan Preservation For Muscle Invasive Bladder Cancer By Transurethral Resection\n\n... evaluated 327 patients with muscle-invasive bladder cancer who were treated in at M.D. Anderson from 1997 to 2002.\n\n... Repeat bladder tumor resection was repeated in all patients. If the patient had no residual tumor..., ...bladder preservation was offered.\n\n...Patients who opted for bladder preservation by transurethral resection alone did not receive intravesical therapy!!!\n\n... 35 (11%) were eligible for bladder preservation\n\n... 27 elected to pursue this approach\n\n... 8 opted for immediate cystectomy (... 4 had no residual tumor and one died from metastatic disease)\n\n... Of the 27 patients who did have bladder preservation, 15 experienced subsequent tumor recurrence, 8 of whom underwent radical cystectomy. Of the 8 that had a delayed cystectomy 4 had node positive disease and 5 had extravesical disease...\n\nThey conclude \"Bladder preservation using transurethral resection is feasible in selected patients, only 11% of the eligible population. Unfortunately, despite close surveillance 30% needed a cystectomy and of these 8 patients 50% had node positive disease and 62% had extravesical disease. This highlights that our current surveillance programs are inadequate to identify recurrent bladder cancer at a curable stage.\"\t\t\t", "date": "2007-11-13T20:41:11+00:00", "topic": "Muscle-Invasive and Bladder Sparing w/ TURBT Only", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had some aches (intermittent, uncomfortable, but not terrible pain) for several months. Left testicle area only. No swelling, though. Hard to say if the swelling is unique to his body or due to his surgeon. Frequent ice packs sound like a good idea - and also not stressing the area by doing too much.\t\t\t", "date": "2007-10-31T19:36:58+00:00", "topic": "Swelling Problems 5 weeks out of RC????", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Andy,\nYep, been there, shared that same experience. It's nerve-wracking, but it is what it is.\n\nAs another T1G3+CIS alumni (2 1/2 years ago, neobladder), I've also had a couple of episodes just like you describe (some bloody mucus). First time was about 6 months after surgery and then once again about 1 1/2 years after surgery.\n\nI'm also physically active (tennis, weights...). Had all the same tests, all seemed ok. Dr. Stein told me these symptoms were not necessarily indicative of recurrence. One of my episodes occured while I was straining a bit 'on the pot', so now I'm sure to drink lots of water and eat my fruits and veggies, no problems since.\n\nHe did say that if there was any bright red blood, that that might be indicative of urethral recurrence. fyi\n\nGood luck!\nDan\t\t\t", "date": "2007-10-30T02:05:15+00:00", "topic": "Occasional hematuria 1 year after neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\nI'm glad you're in that clinical trial, Sutent sounds promising.\n\nMy two cents worth is that if either of those urinary diversions work as advertised, then it really doesn't matter as an active lifestyle can be had with either an Indiana Pouch or a neobladder.\n\nThough, Indiana pouches might be better suited for older patients or those with physical limitations.\n\nHere's something that I would consider (if I was a woman). Because more women than men with neobladders end up hypercontinent (which means that a catheter must be used to remove urine from the neobladder), I wonder what women on this website think who:\n\n1) have neobladders, and\n2) have become hypercontinent\n\nIf they could turn back the clock and had the option, would they change their diversion to something other than a neobladder?\n\nMy guess is no, but just a thought.\n\nI don't have the statistics handy, but VERY rough approximations of those who end up hypercontinent are maybe 10% of men and maybe 30% of women. Keep in mind that having to catherize is no big deal (and is easier for a woman than a man due to obvious anatomic reasons).\n\nI am not hypercontinent and I'm very happy with my neobladder (it's nearly like peeing normally!). Though, if I was, as a guy, I 'think' I might (not sure here) prefer to have an Indiana Pouch. Why? Because inserting a catheter into a stoma (which is the opening through the skin where urine is removed) SEEMS more easier and faster than than inserting a catheter through a urethra.\n\nThere is no PERFECT solution, stomas and neobladders both have their pros and cons.\n\nThis is just a small thought, nothing to lose any sleep over - removing your cancerous bladder is key.\n\nSo maybe some women will respond here???\n\n\n\n\n\n\n", "date": "2007-10-23T19:41:11+00:00", "topic": "T2G3 Female, Indiana Pouch VS. Neobladder I have to decide", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nDoes anyone know what the chances are the cancer will return at a later date? Or does this mean it's over for good???\nHi Dar,\n\nHis chances for a 'cure' (yes, a cure) are very good, about 80 to 85%. This number comes from a study from a large group of patients at USC/Norris studied over 15 years. I'll send the article to you.\n\nAs Tim pointed out, cancer can recur in the urethra or ureters or pelvis of the kidneys (or elsewhere), but is unlikely. Your husband is very, very likely one of the fortunate people who will not have to worry about this disease again.\n\nBest wishes,\n\nDan\t\t\t", "date": "2007-10-18T15:38:42+00:00", "topic": "After radical Cystoscomy, what chances of cancer returning???", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFYI, I've had two bowel obstructions since my RC and they both resolved themselves. The first one took 5 days and the second one took 1 day (both times a NG tube was used). Fortunately USC/Norris provides 7x24 access to a urologic resident who told the local ER folks what Zach said - that most times they resolve themselves and to spare the knife.\n\nSpeak of the devil, last night I really pigged out on lentils/turnips/parsnips (a really good soup) and endive and walnuts and some great seed bread - and awoke a few hours later with the same damn sensation of a bowel obstruction. First one in over a year. Still had some Ativan, popped a couple pills, whew, the pain went away. Next time I'll eat a bit less.\n\n\nDar congratulations on being home and a successful surgery.  Can you tell me some more about the bowel obstruction?  Did they put in a Nasal Gastric tube for a couple of days to see if it would correct itself?  Was the CT scan definative in any way.  Reason i ask is this appears to be a common complication and Zachary told me that his surgeon Dr. John Stein at USC/Norris feels most of these correct themselves with using the NG tube. I'm just curious as to the explanation......Thanks and i'm so glad Harry has rhythm again!!   Pat ", "date": "2007-10-16T18:28:32+00:00", "topic": "Bladder/Prostate Removed 9/24/07", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had significant pain in my left leg after my surgery; it resolved gradually over 5 to 8 months or so. I've read that others have had similar pain after abdominal surgery. The pain may be due to nerve damage due to the position of the body during surgery.\n\nMaybe others can explain this better.\n\nHis current problem is pain in his left leg and he's had MRIs, a bone scan, CT scans, blood work, X-rays, you name it. He's been to a nerve doctor who found no pinched nerves or nerve involvement that would cause his leg pain. Every doctor he sees seems to think the pain is symptomatic of an arthritic hip.\n ", "date": "2007-09-22T23:27:13+00:00", "topic": "Frustrated With Doctors!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t(Wendy Sheridan found an abstract to this recent article (2007) and posted it on the WebCafe:\n\nblcwebcafe.org/metatcc.asp\n\nI obtained a copy of the entire article - if interested, let me know.)\n\n=========================\n\nThis was a small Japanese study (48 patients) where some patients had their sites of metastasis surgically removed.\n\n15 patients were metastatic at original diagnosis and 33 developed metastasis later.\n\n37 patients had distant metastasis (lymph nodes or visceral) and 11 had local recurrence that was not resectable...\n\nPatients underwent a variety of chemo regimens.\n\n12 patients had the sites of metastasis surgically removed (metastasectomy) to render them disease-free at some point during treatment.\n\nThe criteria for metastasectomy were 1) that metastasis is at a single organ with a small number of mestastases (excluding bone) and, 2) the patient had a good performance status (able to withstand treatment) and, 3) good response to chemo.\n\nMedian survival was 42 months for those patients with metastasectomy compared to 10 months without.\n\nThere were a number of limitations with this study since it was small and retrospective in nature.\n\nThe authors conclude that \"The number of chemotherapy cycles, sites of metastasis and metastasectomy had an impact on survival. In selected patients, a multimodal approach including metastasectomy may contribute to long-term disease control.\"\t\t\t", "date": "2007-10-11T15:23:54+00:00", "topic": "Surgery for Metastatic Blc?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHey Leigh,\nWhile my nerve sparing was successful, I did have one shot and it was no big deal. If I had to have shots, I would do them, without hesitation.\n\nYou have received great advice from others here. Here's one other thought.\n\nThere is another site (specifically for sex-related issues) that I monitor (because it took about a  year for me to regain potency after my RC), it is primarily related to guys with prostate cancer but they have all the same issues as us bladder cancer dudes.  Below is a sampling of topics from two recent posts. They have LOTS of discussions on shots, bi-mix versus tri-mix, many suggest the use of caverject. You might want to take a look, both men and women participate.\n\nThe acronym PCAI stands for Prostate Cancer And Intimacy.\n\nToday's Topics:\n1. Re: self injection problems (Mary Turner)\n2. Re: self injection problems (Manny)\n3. FDA accepts NexMed's alprostadil cream for review\n(This email address is being protected from spambots. You need JavaScript enabled to view it. )\n4. On PBS stations - Charlie Rose Science Series Explores Human\nSexuality (This email address is being protected from spambots. You need JavaScript enabled to view it. )\n5. Re: T replacement (CaroleAnne Sarah)\n6. Re: ED Following Radiotherapy and Brachytherapy (Clarence Thomas)\n\nToday's Topics:\n1. Re: another study (Kathy Meade)\n2. Re: TESTOSTERONE THERAPY ! (This email address is being protected from spambots. You need JavaScript enabled to view it.)\n3. Re: Tri-mix (DB)\n4. Re: T replacement (ray duriez)\n5. Re: TESTOSTERONE THERAPY ! (CaroleAnne Sarah)\n6. Incontinence survey (Nancy Peress)\n\nHere's are some links:\n\nSend PCAI mailing list submissions to\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\n\nTo subscribe or unsubscribe via the World Wide Web, visit\nwww.prostatepointers.org/mailman/listinfo/pcai\n\nor, via email, send a message with subject or body 'help' to\nThis email address is being protected from spambots. You need JavaScript enabled to view it.\n\nWhatever you learn, be sure to share with us here.\n\nGood luck.\nDan\n", "date": "2007-11-22T11:24:45+00:00", "topic": "Intracavernous Injection", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI had some [aom along the sides and the tip, not so much the base that I recall. The pain was pretty noticeable, came and went, and has now gone (at least for the past few months). My RC was 2 1/2 years ago.\n\nThere is a lot of healing going on from the nerves after surgery, so the pain is not surprising to me. Also, I think that that foley catheter can cause injury to some guys.\n", "date": "2007-11-18T06:17:21+00:00", "topic": "Pain in the base of the penis, after R/C", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHey Irish Guy,\nGood question. There's is way too little discussion about sex after this kind of surgery.\n\nMy take on what othes have said (on this website and others) is that there is huge variation for return to potency. Pre-surgery potency is a significant predictor of potency after surgery (assuming no other issues like lasting nerve damage...).\n\nSome docs suggest that pills and/or shots can help speed things along, though I dunno, haven't seen compelling data. The latest scuttlebut is to do whatever it takes to get blood flow into your penis as soon as possible.\n\nFor me, there was no potency for several months, then maybe at month 5 or so I tried the pills (Viagra gave no response and Ciallis, while it worked, kinda, gave me a terrible headache and backache - I've not used either since). At maybe month 8 or so I received one injection in the doctors office which worked for a couple of hours (didn't have an immediate opportunity to use my new found return to potency, unfortunately, as I went to the doctor's office all by my lonesome -  though I might have imagined a couple of nurses glancing at my trousers as I left the doctor's office).      My one person's point-of-view is that the one shot might have helped 'jump started' my hydraulics.\n\nStarting at about a year or so, potency returned, no pills or shots. I wasn't terribly diligent about getting blood flow 'down there', I'm doing fine, so read up on this stuff, maybe see an ED doc, and do what makes sense...\n\nHere is an excellent website that while it focuses on prostate patients, has good info on sex issues, be they pills, shots (bi-mix, tri-mix), vacuum devices, rings, implants, emotional issues... Both men and women participate. You might find it useful to sign up for awhile, read the posts... I've learned some new lingo, like erections can be quantified as being 'stuffable' or not...\n\nwww.prostatepointers.org/mailman/listinfo/pcai\n\nAnd definitely get your wife/gf... involved and talk about this stuff. And laugh. Then talk some more. Then keep talking and laughing.\n\nThere are LOTS of post-surgery options for sex, both for you and ur honey.\n\n", "date": "2007-10-29T07:55:34+00:00", "topic": "Potency", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi There,\nIs your concern about prostate removal due to post-surgery sex...???\n\nNerve-sparing surgery is an option for some (depending on the location of cancer). There are lots of options for enhancing performance after surgery. I was fortunate to have bi-lateral nerve sparing survery and my hydraulics work fine without pills or shots - though it took almost a year to 'get it up'. (My surgery was 2 1/2 years ago).\n\nDr. Stein at USC/Norris says that some docs believe that taking pills (viagra or cialis...) on a regular basis after surgery can help speed things along. Or a bi-mix or tri-mix shot of drugs into the penis can help.\n\nI only took pills a couple of times. I also received one injection into the penis about 6 months after surgery, and that really seemed to jump-start my hydraulics.\n\nThe following link is to a very good online support group for men who have had prostate surgery - and deals specifically with sexual issues. Both men and women participate in the forum. You might want to check it out.\n\nwww.prostatepointers.org/mailman/listinfo/pcai\n\n\n\n\n\n\nBecause of the location of the reoccurring Cancer I will likely have my prostate removed as well. Freaking me out a little. I would appreciate any information that you think will help with this transition, and advice as to some questions I should be asking of the Doctor that may do the surgery.\n\nThanks in advance everyone\n ", "date": "2007-10-20T00:06:26+00:00", "topic": "About to go Neo!", "subforum": "6-men-and-bladder-cancer"}]}