{"signature": ["Dx", "TURBT", "TURBT", "Dx"], "posts": [{"text": "\n\t\t\t\tJimG4,\nYou were diagnosed that same time that I was. I have often wondered how you were doing. Since you have not been on here recently, I will assume that you are doing well. Still in my prayers.\n\nI had a recurrence and another surgery in December. It wasn't cancer this time, but it was a concern to have it return in a year.\t\t\t", "date": "2018-10-09T14:06:08+00:00", "topic": "In the process.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJim,\nI am sorry that the results were cancer. However, I would consider that diagnosis very good news. No one wants bladder cancer, but from what I have read, that was the best diagnosis if you do have it. I am sure your wife was relieved to receive the news sooner.\n\nWe can be 'scope' buddies. I will be doing mine every three months as well. My Urologist did not suggest any injections. How about yours? She said there were too many side effects to do that.\n\nI hope you have been able to get back to the treadmill without any more unpleasant reactions. I injured the knee (again) and must wait until Friday.  I am praying I will be better by then and can get back to running. I have been walking the dogs however, and that is a real blessing.\n\nPraying daily for no recurrence.\t\t\t", "date": "2018-10-09T14:06:08+00:00", "topic": "In the process.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAlan,\nShe did mention BCG, so perhaps she meant if it was muscle invasive and high grade it would be bladder removal not just if it was high grade.   This was said before the procedure and I was nervous but not drugged yet. so I actually asked again after hearing the words bladder removal. My companion was not really familiar with diagnosis, so she said she didn't remember hearing anything else except that either.\nI thought even with muscle invasive there were some options for chemo or radiation. I think there is a site here for reading the procedures for stages. She said there was a limit to how much she could really see with the naked eye and that pathology would determine the result.\t\t\t", "date": "2018-10-19T09:10:00+00:00", "topic": "Had my TURBT today.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you Sara,\n\nToday the urologist said I had the best possible scenario. I was thinking benign was, but I accept that this is the best possible scenario for bladder cancer. She said 50% have a recurrence so check-ups are a must. But she also told me if that happens, they can remove it before it grows into the bladder wall.\n\nIs this the diagnosis you had when you first discovered BC?\t\t\t", "date": "2018-10-29T04:09:56+00:00", "topic": "Results: pathology report.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAlan,\nThank you Alan. I am sorry you got a high grade after being told low grade, that must have been a deep disappointment.  I am praying that will not happen, but thank you for warning me.  Nothing can truly be known until the lab result. I already had a surprise today when the scheduler said that she always listed them as benign until the pathology was returned. So much for the happy thoughts.\nIsn't the surgeon using the same Cystoscope to do the surgery that is used on the exam? I was told she preferred anesthesia instead of a local, but it would still be outpatient. She said I would not be able to exercise for at least a week. I read somewhere about lifting heavy things ie a bag of groceries, and no normal activity for 4-6 weeks. If that is the case, I would need to have as much information as possible to prepare because I don't have anyone to help me in any way. A bag of dog food alone is 17 pounds, and kitty litter seems even heavier.  I did request the post op information well in advance for that reason. I may be able to have it done in a couple days because a patient canceled.\nThere are many people here that have experienced TURBT and I would appreciate knowing what to expect. Someone even mentioned a catheter. The doctor did not mention one.\t\t\t", "date": "2018-10-13T03:26:40+00:00", "topic": "First visit to Urologist today and Cystoscopy with TURBIT required.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy first visit with the Urologist was a surprise.  I was told she would not be doing a Cystoscopy but that is exactly what she did in a very short time. I liked her immediately, but did not have much time to ask any questions. She did squeeze me today instead of making me wait until Monday.\n\nShe showed me the scan as she was doing it and said it was a low grade papillary tumor. She did not feel that it had invaded the wall of the bladder and that it was small (her report said 1 1/2 cm), but the biopsy would tell, but I would require follow up visits.\nHer report also said \"Benign neoplasm of bladder\" and under procedure: Cystoscopy TURBT 2-5 cm -\nNotes: ASAP, outpatient, time 1 hour, diagnosis: bladder tumor.\n\nI asked about chemo and she indicated that was for something much worse. Sometimes she does an injection of chemo during the TURBIT.\n\nI hope to schedule this procedure asap, and wondered what to expect.  I read somewhere on here that there can be leaking after  this procedure and that depends might be required. Is this a very painful procedure??\t\t\t", "date": "2018-10-13T03:26:40+00:00", "topic": "First visit to Urologist today and Cystoscopy with TURBIT required.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you Jack,\nI appreciate you taking the time to read and explain this.\nIs a primary neoplasm cancer? And if there is a growth in the bladder wall, isn't that worse because it has now invaded the muscle or deeper tissue?\nTheir report said \"cystoscopic  correlation is necessary; normal upper tracts bilaterally.\"\n\nI had a pelvic ct scan, no contrast, done on Christmas Eve which showed all normal organs.  Then in January I had one incident of gross hematuria. My doctor said that was from a UTI or from  the large doses of aspirin I took for a plantar plate tear.   Then suddenly, two weeks ago, another incident of gross hematuria and then microscopic.  I have not even seen the Urologist yet. It takes a long time to get in, but they did move me up to this Friday but only for consultation.\n\nI would really like to think it isn't cancer. I live with my dogs and there is no back up for assistance. None of them can drive.\t\t\t", "date": "2018-10-11T06:48:49+00:00", "topic": "Got my scan results and don't understand them. Very confused.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCT scan with contrast and results received today.\n\"a 1.8 cm right-sided bladder filling defect or mural-based lesion seen on axial images. Primary bladder neoplasm must be considered. No obstruction or the right UVJ is identified.\"\n\" Impression: 1.8 cm bladder mural mass suggestive of either a primary neoplasm or an adherent clot\".\n\nIs all of that just another way of saying cancer??\nI have googled and searched and I am very confused.\t\t\t", "date": "2018-10-11T06:48:49+00:00", "topic": "Got my scan results and don't understand them. Very confused.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAlan,\nThank you so much. I have a CT scan tomorrow (with contrast for which I must take benadryl and steroids). The doctor agreed to fit me in this Friday because I was diagnosed with a mass.\nI am praying, and other are for me as well.\nEverything I read seemed to indicate that you have only 5 years to live when you are diagnosed. Congratulations on your ten years!  I am glad to hear that there are many here that are 10 year survivors. I had two friends who were not so fortunate.\t\t\t", "date": "2018-10-06T23:55:21+00:00", "topic": "Just diagnosed with bladder mass and very frightened.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you Alan. The report on the ultrasound said \"there is 18 x 11 mm mass in the posterior right side bladder suspicious for malignancy. \"  Why would they suggest it is malignant? There is nothing else in the report.\t\t\t", "date": "2018-10-06T23:55:21+00:00", "topic": "Just diagnosed with bladder mass and very frightened.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am still in shock. I had gross blood a week ago one time, and then an ultrasound was done. Ultrasound results were received yesterday that indicated a mass in the upper right of my bladder that were 18mm by 11mm.  Is this a very large mass, or advanced mass?\nI had a CT scan done in December that did not reveal anything in pelvic area or organs. Bladder was 'unremarkable'.  Can bladder cancer move this quickly?\nI don't even have an appointment with urologist until the 15th. Is that a long time to wait?  Would greatly appreciate any information from those who have gone through a diagnosis and treatment.\t\t\t", "date": "2018-10-06T23:55:21+00:00", "topic": "Just diagnosed with bladder mass and very frightened.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you Jack,\nIs there some a chart somewhere that describes small, med, large etc?\t\t\t", "date": "2018-10-06T23:44:09+00:00", "topic": "New to all of this diagnosed via ultrasound yesterday", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAfter blood was discovered in urine, I was given an ultrasound. The ultrasound results said a mass in the upper right part of bladder was 18mm by 11mm and suspicious for malignancy.  I had a CT scan in December that showed nothing in the bladder or surrounding area at all. Is this a very fast large growth of cancer?\t\t\t", "date": "2018-10-06T23:44:09+00:00", "topic": "New to all of this diagnosed via ultrasound yesterday", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSara.anne,\nHave you heard of them treating the cystitis with any drugs? Did yours just go away on it's own?\nI take it that 6 months is considered early for a second recurrence. I have not had any treatments following surgery.\t\t\t", "date": "2020-06-18T07:47:32+00:00", "topic": "Second recurrence of tumor with cystitis cystica", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWould appreciate any opinions or experience with multiple recurrences.\nI received a TURBT for a low grade Ta TCC in October of 2018.\nNovember of 2019  I was told I had a 1/2 cm tumor. (The first one was 1 1/2 cm) The Urologist said it was in the same general area, right lateral wall, and the office, or done in the OR. I chose OR. The diagnosis was small papillary neoplasm of low malignant potential (PUNLMP).\nA week ago at the second three month checkup following the December surgery, I was told another small tumor was found. Approx. ½ centimeter. Urologist suggested it was similar to the last one, and did not appear to be muscle invasive.\nI had the third TURBT done this week on Tuesday.\nFollowing surgery she said I had 1 cm tumor and cystitis cystica.  And wrote this note for me: Cystitis Cystica cystic mucosal inflammatory changes around the bladder tumor.\nDoctors notes after surgery:\n“Patient had one small 1 cm tumor as well as some satellite what appeared to be almost like cystic changes alongside on the bladder dome”\nHas anyone had, or know what cystitis cystica is?? Is it another form of cancer?\nIs a second recurrence within six months a very bad sign? Do frequent recurrances have a tendency to become high grade or muscle invasive?\t\t\t", "date": "2020-06-18T07:47:32+00:00", "topic": "Second recurrence of tumor with cystitis cystica", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMonday I received a call from my doctor with the results of the surgery.  She had been very optimistic before surgery assuring me that I only needed propofol because this tumor was very small.\nDiagnosis:\nPosterior wall bladder tumor biopsy:\npapillary neoplasm of low malignant potential (PUNLMP)\nShe told me it was't cancer, and this tumor does not have a tendency to return....however, I still have BC, and recurrence is still possible.  This is only one year from my first TURBT.\n\nSo I am very thankful to all of the people who prayed for me. I asked the Lord that it would be low grade, but if it could not be cancer that would be really great.\n\nDoes anyone know about scaring and incontinence following recurrent TURBT procedures?\t\t\t", "date": "2019-11-23T04:05:02+00:00", "topic": "Pathology results from Recurrence of tumor", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Knifedealer,\nI have not experienced BCG, but I have been placed in supportive contact with another patient who has. I appreciate the detailed explanation.\nDrinking that much water and dressing for the cold does present a problem. Since diagnosis, I drink more water than I used to, and I find myself having to make decisions about what I can do. I must always be able to find a restroom, so long car drives and lots of water becomes a problem. And long movies.\nI was interested in the result after the tea an honey.  I have heard that some people experience fever. Has that been an issue for you?\t\t\t", "date": "2019-11-23T04:05:02+00:00", "topic": "Pathology results from Recurrence of tumor", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKnifedealer,\nHave been praying for you. Was this your second BCG treatment? Have you had any side effects to the treatments?\n\nThe procedure today went well, only 45 minutes this time.  I had a 'twilight' anesthesia with propofol, and was given IV Gentamicin for infection.\nI was thinking of you when she told me it was a very small papillary tumor just like last time, and expected the same result. You were told that too and pathology returned with high grade.\nSo, I am anxiously awaiting results. She said it could be a few days or a week. Praying of course that it is low grade noninvasive. Very glad to went to the OR and not the office.\t\t\t", "date": "2019-11-23T04:05:02+00:00", "topic": "Pathology results from Recurrence of tumor", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJes1968,\nI just read this and wondered how you were doing.  Have you had 6 more low grade tumors develop after your initial TURBT?\nHow has the gemcitabine treatment responded?\npraying all is well with you,\n\nDoglover\t\t\t", "date": "2018-09-11T20:14:35+00:00", "topic": "low grade bladder cancer non invasive with multiple recurrences and BCG failure", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}]}