{"signature": ["Dx", "TURBT", "TURBT", "BCG", "BCG", "BCG"], "posts": [{"text": "\n\t\t\t\tSkyking (loved that show when I was a kid), it sounds like you are in good hands. I had a similar diagnosis as you including CIS at age 66. I had two TURBT with the last one being Bluelight with Cysview. That is when they found the CIS. They gave me the photos which looked very similar to yours. After the initial 6 BCGs another 18 BCGs for a total of 24 over a 4 year period. So far all is well.\n\nThe main reason I am responding is to let you know that in my case getting the BCG treatment was not that bad (everyone is different). I learned that if I coughed when they reached my prostate it would go right through without noticing much. In my case I never felt my prostate prior to this but after all of the caths (or maybe the BCG) it has never been the same. I have noticed that since I stopped the BCG I am almost back to normal now.\n\nAs of my last visit I am done with the BCG and will just go back every 6 months for another Cysto, progressing to once a year. BTW - During this same period I also was diagnosed with NHL and I can tell you that the Immunotherapy is much better than the Chemo/Rad treatments. We are lucky to have it. \n\nPeace!\t\t\t", "date": "2021-02-06T20:27:29+00:00", "topic": "Recently Diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy initial diagnosis was 8/26/2016 and now after 2 TURBT and 24 BCG treatments I had my scheduled 6mo. Cysto and was told - all clear. No more BCG necessary, another Cysto in 6 mo.\n\nI very relieved and glad to get a good report - I was sweating it. Also glad the BCG is over and hoping things stay that way for a long time.\n\nPeace and Love,\nDave\t\t\t", "date": "2020-11-20T00:53:19+00:00", "topic": "No more BCG - finally!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tChristine,\n\nHi, I noticed that I had some joint pain during my initial BCG treatments and asked my Urologist if it could be related. He didn't think but couldn't say for sure? Mine was in my right hip and I used a heating pad (of course it was in the winter, not hot Texas summer) and it seemed to help quite a bit. Over the last 4 years of maintenance treatments it seems to come and go and I'm experiencing some now.\n\nI'm not sure if it is the BCG or just age related (in my case I'll be 70 in about a month). Thankfully mine is tolerable. If you are able I hope you are able to complete your initial 6 treatment because they seem to be very important in beating this disease. In these times we are lucky to have it available, in my case I have had to wait for a couple of months for my maintenance treatments because of the ongoing shortages. It is never a pleasant experience but if we are able to keep our bladders....very worthwhile.\n\nJust an FYI - the BCG, a type of immunotherapy, has far less symptoms for most people that traditional Chemotherapy - I know, I have gone through both (Chemo not bladder related). Both seem to work pretty well and it is the first step in beating these horrendous diseases.\n\nHang in there - it will get better.\n\nPeace and Love,\nDave\t\t\t", "date": "2020-10-14T12:36:54+00:00", "topic": "BCG joint pain side effects", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis might just pertain to me but I've found that if I cough as the catheter hits my prostate it seems to go right through - the sting as it goes through the prostate seems to be normal and this seems to work well for me.\n\nIn my case the BCG treatment side effects seemed to increase until about #21 now for the last 3 they seem to have decreased. I used to have bleeding after holding for 2 hours but that hasn't happened lately. My routine is to take 2 doses (2 tabs a dose) of AZO the first day and then I'm pretty much over it.\n\nIt will be 4 years in Oct. since my diagnosis and I'm now feeling pretty good. Keeping fingers crossed.\n\nPeace and Love,\nDave\t\t\t", "date": "2020-08-07T19:31:38+00:00", "topic": "they finally got my bcg", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIt obviously depends on the individual. I live an hours drive from my Urologist and have had #21 BCG treatments and have never had a problem. I have 2 cups of coffee morning before going in and give a urine sample upon arrival. So far haven't had a problem holding it.\n\nGood luck!!\t\t\t", "date": "2020-05-03T21:37:56+00:00", "topic": "Time at hospital for treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi downeaster,\n\nOriginally I didn't have any pain just bleeding when urinating. Now after my treatment (2 turbt and now 21 BCG) things have never been the same - still some bladder pain and I don't think my prostate will ever be the same. Especially after my last 3 BCG it was dramatically worse. However, I can live with that as it is more worrisome than painful. My treatment was temporarily postponed because I was diagnosed with Non-Hodgkin's Lymphoma and I could not get my BCG maintenance because my Oncologist told my Urologist that I would need to let my immune system get back to semi-normal first. After having Chemo and radiation for the NHL, it worked out pretty well because at the time there was a BCG shortage so by the time it became available I was kind of back to normal (or at least my new normal).\n\nI always worry and dread before my Cysto and just hope things are OK. I am so tired of the Doctor treadmill but just try to \"keep hope alive\" and cherish every day now.\n\nHoping 2020 will be a positive year for all of us......F*** Cancer!!\t\t\t", "date": "2019-12-31T20:41:13+00:00", "topic": "still pain and dysuria 3 years after turbt and bcg", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI feel you, Ripme!\n\nIMO trust of your doctors is an essential factor and we all are basically in the same situation. If you happen to live in a area close to a NCI recognized medical facility it makes the choices much easier and after all ease of treatment is a major factor in our medical decisions. I have chosen to use my local facilities versus traveling to a world recognized facility simply because of the logistical and financial impact. But always have that in mind as a option just in case.\n\nIn your case I would definitely consider a \"center of excellence\" and get another opinion before accepting a terminal diagnosis.\n\nFor me the good news is that most treatment protocols are developed and established in those major research treatment facilities through actual statistical results involving large numbers.\n\nI have recently been diagnosed with non-Hodgkin lymphoma as I concurrently am fighting bladder cancer. It might or might not be a factor with my treatments going forward. The treatments I am taking for NHL do affect my bladder  and not sure how yet. From my experience a lot is just simply unknown and the focus is on treating each disease in a very specific and segregated manner.\n\nIn a perfect world I would hope their would be a round table discussion involving different specialists to come up with a plan of action going forward. Maybe that is just a TV point of view but I do think that is more likely in a major facility.\n\nBest of luck. So far I have been pleasantly surprised by my chemo treatments. Not as bad as I imagined. They have come a long way in treating and managing the side effects of cancer treatment. You might be surprised but will never know otherwise. I wish you the very best regardless.\n\nPeace and Love\t\t\t", "date": "2018-11-10T14:32:30+00:00", "topic": "Diagnosed myself", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nWelcome to the forum. After reading your multiple posts I think you are reacting like most of us after our initial visit to the Urologist and discovering that we had an issue.\n\nFrom my short experience (2 TURBT's and 15 BCG treatments) the best feedback I can offer is to relax and let the Dr. do his job. You will not have any idea what you are dealing with until your TUR and pathology report. If you have a Low Grade result then you might not have any ongoing treatment but a periodic checkup. If High Grade, then the Path report will most likely determine you future treatment. At this point everything is simply speculation.\n\nI totally understand your panic and fear but the best thing you can do at this point is try to relax. No use worrying about something that is at this point unknown. Life goes on regardless of the results.\t\t\t", "date": "2018-02-25T21:03:00+00:00", "topic": "Thank you for this site!!!! My GP said I had BPH- Now Im in Panic mode.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI also had a \"bluelight\" cystoscopy for my followup TURBT and am thankful. My first TURBT they found  papillary tumor 5% HG and on the bluelight they found CIS that was missed on the initial surgery. The hospital was just getting the equipment to do this type of surgery and the product people were there when I did my surgery. I used the Cysview product prior to surgery and the product folks were also in the OR during surgery. Afterwards my Doctor said that he was glad we did because he had missed the CIS first time and it was on the \"dome\" and had to have someone push down on my stomach in order to get at the spot to cut away. They also got some photos post surgery and the Cysview highlight my CIS just like you see on the web. I feel like without that it have been missed again. He must have gotten it \"good\" because this time I had a catheter (none first time) and a lot of bleeding and tissue for the next 2-3 days. Good luck with your surgery you will be fine.\n\nPeace and Love,\nDave\t\t\t", "date": "2017-09-29T21:06:58+00:00", "topic": "3 month check; &amp;quot;at least&amp;quot; 3 tumors.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBen,\n\nI concur with Alan's reply. You won't know much of anything until your TURBT and Path report. In my case the procedure took all of one day and the next day I was glad to be at home. However, after my second day I was feeling pretty much normal (with slight burning while urinating). I would definitely suggest that you get some AZO prior to your procedure and take ASAP - it definitely helps. Also get your doc to prescribe the antibiotics and pain pills prior so you can have them on hand after the procedure.\n\nThank goodness for everyone on the forum - they will help you get past the initial shock of diagnosis. For me that has been the biggest issue. I am scheduled for a second TURBT in Dec. which is pretty common for my DX and not at all concerned about the procedure itself - my first one though I was freaking out!\n\nAll the best,\n\nDave\t\t\t", "date": "2016-11-01T13:59:09+00:00", "topic": "Continue working or short term disability?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAlan - I contacted Dr. Svatek's office and asked about getting a second opinion. They said sure but probably would have to see his associate since Dr. Svatek is very busy doing surgeries but that he supervised all of his associates. I assume this is a non-issue? What do you think? I actually was planning doing this after my next TUR (sched. Dec. 8) and Path report. Before the proposed BCG.\t\t\t", "date": "2016-10-03T03:37:52+00:00", "topic": "Bladder tumor", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks so much, Lillian! I will call UHC and see what they say about a second opinion. I was hoping for even better news but I am very thankful that at this point it appears to be superficial.\n\nThis whole thing just came from nowhere. I feel so good and have made a concerted effect to stay as healthy as possible. Boom! You never know what's coming to get ya!\n\nI can't tell everyone how much I appreciate your feedback. Without this forum and the knowledge that everyone shares (based on personal experience) I would really be mostly in the dark about so much. It allows me to learn, plan, and prepare for my future. Very thankful!\t\t\t", "date": "2016-10-03T03:37:52+00:00", "topic": "Bladder tumor", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI feel ya....as the young folks say.  I always dread the cysto and also the maintenance treatments but in reality it is more mental for me than physical. Although I don't think my prostate will ever be the same as it was prior to diagnosis. I can honestly say that after going to the 6 month cycles vs three month my sex life has improved almost to normal (for a 70 yo).\n\nIn my case (not sure everyone has the same experience) I watch intently on the video screen as my Doc looks around my bladder making comments like \"that's scar tissue, that is the left ureter, that looks like the BCG is working, that's the right ureter, your prostate looks inflamed\", etc.\n\nMy Urologist is pretty cool. He has over 30 years experience, is calm, not the greatest bedside manner, but let's you know that you will be OK and he will make sure of it. The one thing I find semi-annoying is that the Med Techs that give me the BCG seem to change about every treatment cycle. It is embarrassing enough without seeing a new one every time (What up with that?)\n\nPeace and Love,\nDave\t\t\t", "date": "2020-09-11T11:23:59+00:00", "topic": "Poll: how long after turbt ws catheter in place?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFor my first TURBT, when I woke up I did not have a catheter and went home mucho bueno pronto!! I did have some severe bladder spasms that night and the next morning but after that nothing. On my followup TURBT (bluelight) which was on a Thursday I was discharged late that night, went home with the catheter and awoke early the next AM with an full bag of reddish urine and the urgent need to go. I emptied the bag but could not urinate (my cath was plugged) finally, from the pressure I presume, it released (the pressure) and what a relief - bloody tissue and urine but no after effects at all. At least nothing like the initial TURBT.  In my case the bluelight revealed CIS and my Doc cut and burned quite a few areas so I assume that was the reason for tissue and cath, etc. The cath was removed that following Monday - so glad......that part sucked.\n\nHowever, so far so good. I'm up to #24 BCG treatments and no reoccurance (knock wood). I am now on a 6 month cycle (first diagnosis in Oct. 2016).\n\nKeep Hope Alive!!\n\nPeace and Love,\nDave\t\t\t", "date": "2020-09-11T11:23:59+00:00", "topic": "Poll: how long after turbt ws catheter in place?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've had a total of 24 BCG treatments so far. Several times (especially after my first few treatments) I had lots of burning and also blood. I found that AZO helped me. It is OTC and causes your urine to be Red or Orange but did seem to help the burning. Now I seldom have the blood and only burning for the first day so much better. I seldom have to use anything anymore so maybe you will have the same results.\n\nVery thankful that the BCG treatment have worked for me so far (Knock Wood)  ", "date": "2020-06-01T18:28:16+00:00", "topic": "Still burning 5 weeks after BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI also heard an interview on NPR this AM concerning the testing of BCG as it is related to Cov-19. They also mentioned it in relation to diabetes, something about a genetic affect?? Testing various strains of BCG.\n\nI recently had my 6mo Cysto a couple of months ago and am still waiting on availability of BCG to get my maintenance treatments. It took about 3 months last time so fingers crossed. I have had 21 total treatments so far but my Urologists said he wanted to continue with the maintenance treatments as long as I could tolerate it. I had only a few side effects until my #21st treatment and then a lot of burning - it took me about 5 months to get over.\n\nAs I watched on the screen as he performed the Cysto and he showed me 2 small spots where the BCG had recently worked on some recurrent CIS (scar tissue).\n\nLike everyone I hope this leads to an increase in production and doesn't affect us Bladder Cancer patients who depend on it.\n\nPeace and Love! Stay Safe!\t\t\t", "date": "2020-04-11T23:27:02+00:00", "topic": "Germans Test BCG To Fight Covid-19", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the encouragement, Rockyiss!  I hoping to get through this without too many issues. I dislike the Prednisone also but I have to admit it must work pretty good. I base this on the fact that for my first 2 treatments (I've now done 2/6) the next few days after I stop the steroids (day 6&7) are my worst days and then things begin to get better. I've noticed the CHOP affect my heart somewhat the day after, that concerns me a bit, although the Doc says that is not unusual and my heart seems to be in good shape and I've have now started having to urinate very often similar to right before I was first diagnosed with Bladder Cancer, however the  [C]Cyclophosphamide -HOP is known to irritate your bladder and cause discomfort when you pass urine so I'm hoping that is the case.\n\nI 'm just hoping that the long term affects of the Chemo do not haunt me and I can return to my normal activities. The BCG treatment and maintenance was not as dramatic for me as this but so far has been successful, hoping this will as well. Just keeping my fingers crossed that things will improve in a few more months and I'll look back with much glee!!\n\nI've lost my hair now and my DW says I do have a good shaped head \n\nThanks again for your thoughtfulness!\n\nDave\t\t\t", "date": "2018-10-23T23:20:25+00:00", "topic": "Update and surprise", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have to share the good news - after my first treatment on Tuesday, by end of day Wednesday my eye pressure is gone and I can breath out of my right nostril for the first time since last March, also smell is back. Simply amazing stuff - so far no major side effects from the Chemo.\n\nI plan on making an appointment with my Urologist to discuss the plan going forward.\n\nDave\t\t\t", "date": "2018-10-23T23:20:25+00:00", "topic": "Update and surprise", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the reply - I will discuss with my Urologist, very interesting. From what I read the P is used primarily to prevent allergic reactions from the other drugs and to combat the nausea. Along with the R-CHOP I also have a lot of other drugs, mostly to combat the side effects of Chemo. I also had a port installed and it made things much better for installation. I was kind of disappointed that not everyone would use it (for IV contrast and blood draws) unless they have someone trained on staff.\n\nIt has been a flurry of tests over the last 3-4 weeks - Bone marrow biopsy, lumbar puncture, CT, MRI, PET, ECG. I will also have to have intrathecal (spine injection) Methotrexate. The Oncologist said that he would rather wait till after Chemo because after he withdraws the spinal fluid and then inserts the treatment he could hit a blood vessel and accidentally \"seed\" the lymphoma. This is being done prophylactically.  Really? My philosophy is \"if it's not broke don't fix it\" but he says that if he doesn't do it and it latter appears in my central nervous system he would regret it. I sometimes feel that I am a victim of \"standard protocol\" which I guess is statistically proven?\n\nAnyway - a new adventure! I'll lose my hair in the next few weeks (donating to \"Locks of Love\") and that will be a shock, not sure about my beard.\n\nAll the best to you and hope you have success in your treatments.\n\nDave\t\t\t", "date": "2018-10-23T23:20:25+00:00", "topic": "Update and surprise", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow,  who would have thought? I have taken this for both of my TURBTs and even a couple of times after BCG. I goggled the drug and found some interesting info. I opened a box of AZO and they don't mention it on the package but do on the insert (inside the box).\n\nFrom wiki - Phenazopyridine is an azo dye. Other azo dyes, which were previously used in textiles, printing, and plastic manufacturing, have been implicated as carcinogens that can cause bladder cancer. While phenazopyridine has never been shown to cause cancer in humans, evidence from animal models suggests that it is potentially carcinogenic.\n\nNot sure what to think. I don't like the stuff because of the orange staining - but I do think? it helped my burning.\n\nCurious what everyone has to say about the matter.\t\t\t", "date": "2018-06-13T20:58:09+00:00", "topic": "An alternative to Pyridium/Azo type bladder pain killers?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had 2 TURBTs - the first, I did not have mitomycin (although I was told that would be part of the procedure). the second (blue light) I did have mitomycin  post surgery.  First one was papillary (95% LG - 5% HG) the second was CIS (always HG). Not sure why or why not.  As far as standard protocol - I will defer to someone with more knowledge.\t\t\t", "date": "2018-04-30T23:40:36+00:00", "topic": "No mitomycin after any of TURBTs", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can only speak of my personal experience. I had #10 of my treatments yesterday (6X, 3X, and 1st of my next three maintenance) and the only side effects I have experienced during the entire process was bleeding for about 24 hrs. when I urinated after #8 & #9 and a slight burning/inflamed feeling internally. Very little blood in urine for about 3 hr. from yesterday's treatment. I was telling the wife that I actually am feeling very good today.  My Doc showed me on the monitor where the BCG was working after my initial 6X during the cystoscopy. On my cysto last week my bladder only looked inflamed. So far so good with no recurrence.\n\nGood Luck!\t\t\t", "date": "2017-09-21T21:28:08+00:00", "topic": "No side effects from BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my first BCG treatment on Wednesday and have had no symptoms at all.... yet. I think I read somewhere (probably here) that typically they begin to appear around the 3rd treatment. However, I figured that I would feel SOMETHING?? I noticed on my \"patient portal\" report that the drug used was \"TICE\" (instead of TheraCys). I wonder if that is significant? PLEASE PLEASE PLEASE....work!\n\nPeace and Love - Dave\t\t\t", "date": "2017-01-05T00:31:50+00:00", "topic": "Worried about BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations!!! Let the good times roll  ", "date": "2017-05-22T21:12:20+00:00", "topic": "Good report!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust an FYI.....I didn't have any symptoms for my first 5 BCG treatments. I had just one instance of bleeding after my 6th. Three month holiday and then started my maintenance 2 weeks ago. Nothing the first treatment but today had my 2/3 and I had bleeding for about 4 hours and now it is clearing up.\n\nI'm not sure if this was due to the catheter or the BCG but relieved to see it clearing up. \n\nPeace and Love,\nDave\t\t\t", "date": "2017-05-19T15:10:41+00:00", "topic": "BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Sean T,\n\nReading your post, it appears that we are pretty much on the same path. Started around the same time, turbt, then BL turbt, 6X BCG, and I had my first of 3 just this Wednesday. So far I haven't felt much. I did feel tired today but not sure if it was just being lazy and wanting to lay around most of the day or a result of the treatment. I was really excited to hear that my initial treatment was effective but know that it is just the beginning of the battle.\n\nI have found that just the experience of the last 9 months has made the whole issue less frightening. I have never felt sick during the process and still don't. I did have real pain after my first Turbt and I do have some burning after the second turbt (the catheter really sucked) and instillation of BCG but not much at all. Looking at the monitor as I got my last cystoscopy I noticed that my prostate was really red and also my bladder lining looked inflamed but I can't feel it. The idea that I could have such a dangerous disease and not have any physical symptoms seems almost surreal.\n\nAnyway, I will be playing close attention to your progress and of course hope that we both have much success in our fight to stay healthy. I am finally back to making plans and after my initial diagnosis it seemed to stop my normal planning for the future. So things are looking up!\n\nPeace and Love,\nDave\t\t\t", "date": "2017-02-10T00:05:36+00:00", "topic": "Cystoscopy - post initial BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYahoo!! I had my Cystoscopy after 6X BCG today and NED (No Evidence of Disease)  I start my 3X BCG next week. I had very little symptoms with the inital treatment and the Doc said to let him know if I did and he would cut the dosage. Very relieved and Thankful!\n\nPeace and Love, Dave\t\t\t", "date": "2017-02-10T00:05:36+00:00", "topic": "Cystoscopy - post initial BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm curious if anyone has changed their diet after being diagnosed? I've read a lot since my initial diagnosis and have seen a lot of people mention things like -\n\nCancer thrives in an acidic environment\nOncovite - A Dr. Lamm protocol\nTturmeric or curcumin can prevent or treat cancer\nArtificial Sweeteners\nVegetarian diet\nMarijuana suppresses cancer\n\n\nAnd several other things diet related.\n\nMy question is......Has anyone changed their diet in any way with the idea helping to stop a \"re-occurrence\"?\n\nI am a \"short timer\" diagnosed in October having had two TURBTs, finding TCC the first time and CIS this last time. If something in my diet is causing this I will really like stop doing it!\n\nPeace and Love - Dave\t\t\t", "date": "2016-12-21T18:54:33+00:00", "topic": "Dietary Considerations", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations! It's great to hear good news for a change.\n\nPeace and Love,\nDave\t\t\t", "date": "2017-01-16T00:57:16+00:00", "topic": "Good checkups!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know this probably sounds strange but \"Yahoo!\"!!! I just had my 4th BCG treatment today and I'm finally feeling some side affects......burning in my bladder and a little more burning when I urinate. I'm so hoping that means it is working. I never thought I would wish for something like that just last year. You never know what's coming to get ya!\n\nPeace and Love, Dave\t\t\t", "date": "2015-08-28T20:55:21+00:00", "topic": "Beginning BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOn Dec. 8th I had my second TURBT. This one was a blue light special! I am beginning to feel like a veteran. As mentioned in my \"Newbie post\" my Doc noticed 2-3 suspicious areas. He wanted to go back this time with the \"Blue light\" and examine. Thankfully I was able to wait 6 weeks since the last one and had fully recovered before doing it again. The first time I was nervous, scared, and not sure what to expect. This time it all started with the induction of Cysview into my bladder with a Foley Catheter. Another first for me. That went OK and I was told to hold for at least and hour and during the process to lie on my side, rotate, and also on my belly. Interestingly they had the \"product folks\" on hand and there was a discussion about the best way to mix the Cysview which seem to be a powder.\n\nDuring my wait the Anesthesiologist came by and asked the normal questions (allergies, previous stuff, etc.) and then off to the OR. Just like my first experience, a different anesthesiologist was in the OR. I asked about that and they just said we work together?? I noticed on the insurance EOB last time they both charged the same amount. Not a big deal (especially since it totally out of my control) just interesting.\n\nIn recovery the Doc came by and said getting the Blue Light was a good thing - he discovered two additional spots not noticed the first time. He showed the pic with white light and the blue light and you actually could not see these under the white light but they were clearly defined under the blue light - almost glowing. They also injected Mitomycin this time and I held for about 1.5 hour. Then I drank a lot of water and waited for most of it to drain before leaving the hospital and heading home. With the Cath still in!! This was Thursday evening and I would need to leave in until Monday morning....OK.\n\nComparing my TURBT - my first (without cath) I had pain after urination (spasm I guess) and very little bleeding and but burning when I went. I took the AZO and that helped and after a couple of days I felt pretty much normal. This time I had bleeding for 2-3 days, lots of clots and what looked like stringy tissue. NO PAIN at all. But this time I slept a lot (for hours) and didn't feel well for the first day.\n\nThe biggest difference was the CATH!!! It wasn't a big deal the first day but after that it really sucked. Carrying around that bag (I chose to use the big bag vs leg bag because I wasn't going anywhere) and constant tenderness and increasingly irritation for the next couple of days. Also the cath got clogged the first night. It felt like I had to go bad the next morning and the pressure finally pushed the clog down the line.\n\nI got the Pathology. This time it was CIS (carcinoma in situ). No invasive cancer is seen. There are items of muscularis propria and no infiltrate into muscle is present. I was hoping for nothing but very glad that it is not invasive!!!\n\nNow scheduled for 6 week BCG starting Jan. 4th - hoping that works.\n\nI am feeling very comfortable now with the Doc. At first I was concerned that maybe I should get second opinion, go to NCI hospital, etc. But from what I read on this forum he seems to being following the same protocol and everyone else. It is so much more convenient to go to Austin versus Houston or San Antonio.\n\nThanks to all the information and comments from my prior entry I was prepared for almost everything that is happening to me. I do wish it would just go away but since it isn't at least I know what I might expect.\n\nThanks to everyone for helping me through this.\n\nPeace and Love - Dave\t\t\t", "date": "2016-12-15T14:12:07+00:00", "topic": "Second TURBT- Blue Light", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLotech,\n\nSo glad to you are on the mend. I know it's been a long journey for you and your family. Hoping things get better and better as time goes on. Are you in the hospital still or at some sort of rehab center? Very good to hear from you.\n\nPeace and Love,\nDave\t\t\t", "date": "2017-03-15T14:10:27+00:00", "topic": "THE PATH TO  RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have been following you on the forum since I joined. You definitely do not sound like you are whining. You're posts have been very informative and it has been encouraging to see your tenacity in fighting this disease. I'm sure you will do well. I second Jack's suggestion to keep us informed. We are all on that slippery slope.\n\nPeace and Love, Dave\t\t\t", "date": "2017-02-12T00:52:12+00:00", "topic": "Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFunny but legitimate question.   I have noticed the same thing. I think it might be for two reasons. First of all you are not paying attention\nunder normal daily circumstances and now you are about to expose yourself in\na non-sexual manner to someone you have never seen in your life. (where\nI go it seems I get a different med tech for every treatment - they\nalso like to bring a trainee along for kicks!!!!) and the second reason is\nthat before getting BCG or Cysto you don't normally drink much fluids so\nyou have sight dehydration.\nDuring one of my BCG maintenance sessions, I said to one of the techs, \"You have seen more penises that most have in a lifetime\". She\nlaughed and said her grandmother asked what she did at work and she said\n'fool with a lot of men's penises' - they both had a good laugh!\nThe treatment anxiety will go away somewhat (you'll never get completely used to it) but know that it is just one of those necessary\nthings we have to do to get better.\t\t\t", "date": "2021-02-06T14:10:46+00:00", "topic": "Odd Question:  For Men Only", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tNadofaragene firadenovec, a novel intravesical therapy for nonmuscle-invasive bladder cancer (NMIBC) that does not respond to bacillus Calmette- Guérin (BCG) therapy shows efficacy across important patient subgroups, investigators reported at SUO 2020, the virtual annual meeting of the Society of Urologic Oncology.\n\nIn the original phase 3 trial of 157 patients with high-grade BCG-unresponsive NMIBC, clinicians delivered nadofaragene firadenovec (also known as rAd-IFNa/Syn3), a non-replicating adenovirus vector-based gene therapy containing the gene interferon alfa-2b, by catheter into the bladder epithelium once every 3 months. The 3-month complete response rate was 59.6% overall and 53.4% in patients with carcinoma in situ (CIS) with or without Ta or T1 tumors. In addition, 72.9% of patients with high-grade Ta or T1 tumors and no CIS had freedom from high-grade recurrence. At 12 months, 30.5% overall, 24.3% of patients with CIS (with or without Ta or T1 tumors), and 43.8% of patients with high-grade Ta or T1 tumors (and no CIS) were free from high-grade recurrence.\n\nFor both the CIS and high-grade Ta/T1 only cohorts, there were no significant differences in response rates at 3 and 15 months between male and female patients, patients younger and older than 70 years, BCG-refractory vs BCG-relapsed disease, patients with more or less than 3 prior lines of therapy, number of prior non-BCG regimens, and patients with more or less than 3 prior courses of BCG, Vikram Narayan, MD, of Emory University in Atlanta, Georgia, reported.\n\nDuration of response also did not differ significantly among groups, Dr Narayan reported. Only in the CIS cohort, patients who received 3 or fewer prior courses of BCG had significantly longer duration of response compared with patients who received more than 3 courses: 12.68 vs 4.96 months. A multivariable analysis confirmed that none of these baseline characteristics or prior therapy significantly influenced response rates at 3 and 15 months or duration of response.\n\nwww.renalandurologynews.com/home/conference-highlights/annual-meeting-of-the-society-of-urologic-oncology/suo-2020/intravesical-gene-therapy-efficacy-nonmuscle-invasive-bladder-cancer-patients-features/ ", "date": "2020-12-05T19:53:56+00:00", "topic": "Gene Therapy for NMIBC", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI just got the following email from my Urologist. I thought it was interesting in term of using it with a cystoscopy. I've had many in the last 4 years but I'll admit I am always nervous. Not so much from the procedure itself but more because just hoping they don't find anything. So in my mind, anything that reduces the nervousness will be welcome. -\n\nWe're now piloting the use of Nitrous Oxide at our XXXXX location. Often referred to as 'laughing gas' this mild sedative is commonly used at dentist offices to ease pain and anxiety. At Urology Austin, we'll be offering this option to patients undergoing in-office procedures such as cystoscopies, prostate biopsies, vasectomies and UroLift. More information will be coming soon. ", "date": "2020-07-30T04:24:40+00:00", "topic": "Nitrous Oxide pilot program", "subforum": "31-articles-of-interest"}, {"text": "\nKeytruda Approved for BCG-Unresponsive, High-Risk Non-Muscle Invasive Bladder Cancer\n\nwww.renalandurologynews.com/home/news/urology/bladder-cancer/keytruda-approved-for-bcg-unresponsive-high-risk-non-muscle-invasive-bladder-cancer/ ", "date": "2020-01-14T00:23:04+00:00", "topic": "Renal and Urology News (01/10/20) Keytruda", "subforum": "31-articles-of-interest"}, {"text": "\nnews4sanantonio.com/news/local/local-doctors-make-bladder-cancer-breakthrough\n\nSAN ANTONIO – Doctors from UT Health San Antonio have found a game changer to treat bladder cancer.\n\nThey published their findings, alongside partners across the country, in the Journal of the American Medical Association.\n\nDoctors found that right after a tumor is removed, injecting a common chemotherapy drug called Gemcitabine into the bladder reduces cancer from coming back by 47%.\n\n\"Gemcitabine, particularly, is very safe and inexpensive. If done correctly and the medication is in the bladder, the side effects are minimal,” says UT Health urology surgeon Dr. Robert Svatek.\t\t\t", "date": "2018-07-23T22:40:21+00:00", "topic": "Intravesical Gemcitabine", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI had a \"rigid\" BLC with Cysview for my followup TURBT and they found CIS which was missed during my previous TURBT. This might prove valuable for our regular Cysoscopies once it becomes available around the country.\n\n“This expanded approval in both rigid and flexible blue light cystoscopy (BLC) means that Cysview can now be used during transurethral resection of bladder cancer surgery for diagnosis and staging, as well as with follow-up surveillance of non-muscle invasive bladder cancer (NMIBC).\" - Gary Steinberg, MD from The University of Chicago\n\nPhotocure ASA announces the FDA approval of new indications for Blue Light Cystoscopy with Cysview®. Read more by clicking below: bit.ly/2EODua0 ", "date": "2018-02-19T01:04:18+00:00", "topic": "FDA approval for flexible blue light cystoscopy (BLC)", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tWhen it comes to end-of-life issues such as Hospice Care and nursing homes,  we need to ask ourselves ethical questions such as: What type of society do we want? What sort of social structures should supersede profit?\n\nWith laissez-faire capitalism (or Free Market, if you prefer) there is nothing sacred, there are no boundaries of transgression.  The market treats the individual as a commodity. The ideology of the market knows no values except efficiency, productivity, and profitability.\n\nHospice Care ( a relatively new business) like many other healthcare issues are not immune to lack of oversight and regulation that are so important to ensure that people are treated with dignity regardless of profit. It is just a question of our societies priorities. In my opinion Senior issues are mostly a pay-for-play situation these days.\t\t\t", "date": "2017-10-25T16:35:58+00:00", "topic": "Is nothing sacred?", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI thought this was an interesting article concerning the use of software to help Doctors analyze images captured during cystoscopy.\n\nmedicalxpress.com/news/2017-09-technique-aid-bladder-cancer-diagnosis.html\n\nA new and innovative automated computer technique has been developed by researchers that is able to significantly aid in the diagnosis of bladder cancer.\n\nThe technique—which allows suspect lesion images to be quickly and effectively analyzed and then classified for cancer risk, has been reported in the medical journal Urologic Oncology.\n\n\"What we've done is develop a computer program to carry out an automated analysis of cystoscopy images,\" says lead author of the research, Dr Martin Gosnell.\n\n\"What we've done,\" says Dr Gosnell, \"is to create an automated image analysis technique which can identify tissue and lesions as either high-risk or minimal-risk. This is beneficial on multiple levels.\"\n\n\"Following the analysis, high-risk diagnoses can be followed up more closely as a matter of urgent priority. Alternately, minimal-risk lesions can be identified early in the diagnostic process, reducing the number of referrals or biopsies that need to take place.\"\n\n\"The results from the automated system were extremely promising,\" says Prof Goldys.\n\n\"Using our innovative computer program, 100% of the cancerous images were detected. And all benign lesions were also successfully identified.\"\t\t\t", "date": "2017-10-01T03:57:23+00:00", "topic": "New technique to aid bladder cancer diagnosis", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI'm not sure if this has been discussed before (Article dated May 2016)?\n\nShould urologists rethink radical cystectomy (RC) as the best choice for most patients with muscle-invasive bladder cancer (MBIC)?\n\nYes, says radiation oncologist Timur Mitin, MD, PhD, Oregon Health and Science University, in Portland, who is a staunch proponent of bladder-preserving trimodality therapy (TMT) as an alternative to the gold-standard RC.\n\nNo, say Peter Black, MD, and Edmund Chedgy, MBBS, Vancouver Prostate Center, University of British Columbia, Canada, who argue in favor of the gold-standard RC. Both viewpoints were published online May 5 in JAMA Oncology.\n\nwww.medscape.com/viewarticle/863338#vp_1 ", "date": "2017-04-01T04:19:22+00:00", "topic": "Is Surgery Needed for Muscle-Invasive Bladder Cancer?", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThis is not a political point of view but rather one of common decency. Maybe because I am old but I have almost given up on understanding American priorities.\n\nThe entire U.S. budget for cancer research at NIH's National Cancer Institute is $4.78 billion. That’s for every type of cancer (and there are hundreds). This budget covers clinical research on new treatments, long-term research on understanding cancer, and everything in between. The budget for heart, lung and blood disease (the number 1 and 4 causes of death) is even smaller, just $2.90 billion.\n\nThese numbers are little more than round-off errors when compared to the entire U.S. budget, which for 2013 is $3,454 billion.  The NCI budget is just 0.14% of the total.\n\nHow much should we invest in cures for all disease each year? How about 5% of our budget? Or maybe just 2%? That doesn’t seem like too much. Ask anyone who has cancer, or who knows someone with cancer, if 2% of the budget is too much to invest in cures. I suspect that most of them will say it’s not nearly enough.\n\n2% of the federal budget is $69 billion.  Let's use our tax dollars to build new things and make new discoveries. Let’s invest in our future, and create new treatments that make our lives longer and healthier.\n\nIn the current issue of The Atlantic, James Fallows interviewed Eric Lander, one of the world's leading genome scientists, and asked him when genomics would lead to a cure for cancer. Lander responded:\n\n“If we invest vigorously in this and we attract the best young people into this field, we get it done in a generation. If we don’t, it takes two generations. That’s a very big difference.”\n\nThink about it. If we invest more now, you might see a cure for most forms of cancer in your lifetime. Two generations, though, will be far too late for most of us. How many more people need to die from cancers that we’ll eventually be able to cure?\n\nwww.forbes.com/sites/stevensalzberg/2013/12/29/which-is-more-important-military-drones-or-a-cure-for-cancer/#10e609d47c86 ", "date": "2017-03-16T16:01:18+00:00", "topic": "Proposed cuts to NIH budget", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi Janice,\nI go to Urology Austin, Dr. Pickett. I haven't actually seen the Dr. for my BCG treatments. The Urology Medical Assistant gives them to me. I go to the South Austin location but they have several different locations around town. I go in, give a urine sample, and then the treatment it takes about 15 mins and then I leave. It takes me about 1 hour to get home and so far I haven't had any symptoms (to speak of) or problem holding for 2 hours. Best of Luck!\nurologyaustin.com/ ", "date": "2017-02-03T00:04:04+00:00", "topic": "A new non-invasive test for bladder cancer (UroMark)", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI thought this article dated 31 Jan 2017 from University College Hospitals (NHS) sounded very positive. Not sure if this is or will be available in the US.\n\nA new non-invasive test for bladder cancer could  spare patients the discomfort of a cystoscopy in hospital by getting their urine tested at their GP surgery. The test, called UroMark, has been developed by UCL researchers and uses cutting edge genomic sequencing to detect abnormal cancer DNA in a urine sample.\n\nThe research team, led by Professor John Kelly and Dr Andy Feber, identified a panel of DNA alterations which are highly specific to bladder cancer and found that when used on DNA from urine, UroMark detected bladder cancer with a high degree of accuracy (98% of cases), equivalent to a cystoscopy, currently the clinical gold standard.\n\nwww.uclh.nhs.uk/News/Pages/urinetestforbladdercancer.aspx\n\nPeace and Love, Dave\t\t\t", "date": "2017-02-03T00:04:04+00:00", "topic": "A new non-invasive test for bladder cancer (UroMark)", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tInteresting Sean. I didn't know about either of them. I loved Jack Lemmon and had no idea about Patti Hansen. Love the Stones! Off-topic...if you haven't seen \"Keith Richards: Under the Influence\" (Netflix) it is really good.\t\t\t", "date": "2017-12-04T01:26:40+00:00", "topic": "Who knew that the Scarecrow from the Wizard of Oz died of bladder cancer?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHardly ever snows in Austin!!!\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2017-12-08T15:01:52+00:00", "topic": "HO HO HO Merry Christmas", "subforum": "17-chit-chat"}]}