{"signature": ["Dx", "TURBT", "TURBT"], "posts": [{"text": "\n\t\t\t\tIt's good to drink 1-2 glasses of it a day, based on what I know of our bodies, and even what Dr Wilson told me about her knowledge on it.  It isn't a cure all, but little things if they are correct can help.  You have to know your bodies internal pH first.  Anyways, this isn't a holistic healing lesson, I was just putting it out there.\n\nDuring my treatments so far I have drank mostly Kroger 16.8oz bottles of water I buy in 32 packs for 3/$10\nI drink 60-200oz of fluids a day (average 120oz).  I don't know what everyone elses intakes are but I'm sure they're high.  Bladder cancer sort of encourages you to consume more water IMO.\t\t\t", "date": "2018-02-03T05:56:53+00:00", "topic": "I am new here/ newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDo you have health insurance?  That is a lot to pay all at up front.  Perhaps talking to someone else could work something out.\n\nPathology takes 1-3 weeks+ depending on the complexity.  For me it's been about 2 weeks between the pathologist time and the urologists schedule.\n\nHang in there!  I had blood today after flying and swimming in the pacific for a couple hours on Saturday (I live in CO so swimming in it is not part of my daily routine).  Anyways the swimming and flying triggered new blood (pink urine).  Finally cleared up completely around noon today for me.  Hang in there!\n\nDrink lots of fluids, especially alkaline water IS KEY!\t\t\t", "date": "2018-02-03T05:56:53+00:00", "topic": "I am new here/ newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tUPDATE: The bladder pain went away with the stent removal.\n\n\nIt has, unfortunately, been replaced with ongoing ureter pain (in both ureters)\t\t\t", "date": "2017-09-30T22:47:00+00:00", "topic": "Newish Pain 18 days After TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\t29 year old male here that is having some new pains 19 days after TURBT.\nSummary:\nIs a dull pain near bladder, that starts usually by 2-3pm, normal 19 days after TURBT of 2.7x2.5cm tumor?\n_________________________________________________________\nLong version:\nI had catheter at home while healing until 13 days ago (turbt was 9/12, cath removed 9/18).\nThe time with the catheter was the worse as I felt the need to stay in the house and I only leaved 2-3 times to go on a 30-40 minute car ride.\n\nOnce catheter was removed I felt relieved, though I still have (2) ureter stents until Oct 13th.  Had itchy urethra feeling which required more AB's.\n\nAnyways instead of the mostly evening and nightly moderate stent pain that will shift from left to right side.  I am now having some dull (moderate) pain in what seems like my bladder, both while urinating and also just randomly.  I'll wake up pain free, and be without pain for 3-5 hours.  It'll start to kick in around 10:30am to noon, and start getting worse around 3-4pm where it'll fluctuate in intensity.  And then it's the absolute worst at night.\n\nI can totally tolerate it, but it worries me even though I am still healing obviously and still have two stents.  I have noticed that since I returned to physical work it gets worse if I work more (I'm not super physical at work anymore, considering, but it does require me to by moderetely physical for 2-5 hours a day, and the work day lasts 8-10 hours [self employed], but the rest of the day I spend sitting in office, working with clients, and in general not grinding, bending over or standing).\n\n\nIs this pain, particularly the dull pain in my bladder region normal?  I guess what worries me the most is even though pathology said low grade, non invasive that the surgical report said there were a couple areas of tiny, tiny growth [where it was trying to expand] near my right ureter opening, and lower down as well.  (I am not as much worried about the dull to achy to sometimes sharper pain in between kidneys where the left and right ureter lie)\t\t\t", "date": "2017-09-30T22:47:00+00:00", "topic": "Newish Pain 18 days After TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust wanted to say that L-Theanine is GREAT for anxiety.  Which I know all of us suffer from to one extent or another with this.  Get the brands with \"suntheanine\" , 200mg.\n\n\n\n\n\nI was prescribed xanax for nearly 6 years and I quit cold turkey coincidentally 3 days before the heavy blood symptoms started that lead me to eventually finding my bladder cancer tumor.\n\nAnyway started taking the L-Theanine a couple days ago after getting back from a quick trip to Miami Beach and it works GREAT!\t\t\t", "date": "2017-10-06T15:34:08+00:00", "topic": "L-Theanine for Anxiety", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks for the warm welcome, Lillian!  I was sorry to, but am adjusting to this reality, as I am sure that we all are and do adjust to this.  I will certainly remember to relax as much as possible.  Undo stress is never kind on us or our bodies.\nSo I got my pathology back Monday.  Low grade ; non invasive.  Which I am finding out is the best one could expect.  However, as much as I am satisfied with these results, I am interested in getting second opinions.\n\nWould I just call my current Urologist Office and tell them I'd like to send/pay for my slide to be sent off for a second opinion?  Where do I decide which pathology to send for a second opinion?  Do I do research, so as finding out which pathology department, say UCHealth Denver has, for example (as they are known to be the best in the state of CO).\n\nThank you again for the insight on this tough matter.\t\t\t", "date": "2017-09-09T03:11:21+00:00", "topic": "Urologist Diagnosed me with Bladder Cancer Today - 29 Year Old Male", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSeeryn69,\n\nThank you so much for sharing with me.  I really needed to read that, and find someone on here who has gone through this walk already.  Especially someone that started this walk at the same age as me.\n\nI can't tell you how much your post helped take the edge off of some of anxieties and fears towards being able to continue to live a long, healthy, normal life.\n\nYou really reinforced in my head the key to keeping on top of this, and I have every intent to keep on top of this from here forward, so thank you.\n\n\nIf you'd like someone to talk to, I could really use it.  And I'd love to know more about your experience between your first TURBT, your first pathology, and more about what lead to the cancer coming back the second time.  You really do seem to be a wealth of insight about this, especially for those of us males that are younger.  Thank you again for taking the time to post up here.\n\n-Tim\t\t\t", "date": "2017-09-09T03:11:21+00:00", "topic": "Urologist Diagnosed me with Bladder Cancer Today - 29 Year Old Male", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSara Anne,\n\nDo you know if Dr Wilson's practice is considered a treatment center?\n\nThat I can't seem to find in Colorado, if not.\nHowever from my searching, Dr. Wilson's is the best practice in the state of CO for BC.  Are there any other great ones you might know of in CO?\t\t\t", "date": "2017-09-24T18:05:29+00:00", "topic": "Wondering about new Urologist I'm looking into", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello,\n\nMy current urologist is pretty good he performed my TURBT on Tuesday September 12th.  Had Catheter removed Monday the 18th, and overall feel pretty darn good even with the weird itchiness I've had in my urethra (from catheter removal).\n\nI have two uretal stents for the next couple weeks yet (one for kidney stone ; one for where the tumor was located)  I see my urologist tomorrow for pathology.  A little nervous, but holding it down pretty well honestly.\n\nMY QUESTION:\n\nI want to switch to a top urologist depending on tomorrows pathology outcome.  The one I can find in Colorado is\nDr. Sandra Wilson.\n\nDoes anyone have any experience, insight or recommendations for this DR or any others in CO?\n\nHer link is: www.ucdenver.edu/academics/colleges/medicalschool/departments/surgery/divisions/urology/faculty-and-staff/Pages/Wilson.aspx ", "date": "2017-09-24T18:05:29+00:00", "topic": "Wondering about new Urologist I'm looking into", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had my TURB this past Tuesday and have been recovering since.\n\n\nHad two stents placed as well, one for a kidney stone on left side and one for where the tumor was growing near on right side.\n\nI have the foley cath in until this Monday morning.\n\nBlood has ranged from kool aid red to orange ; light brown to all the way as clear as yellow for me.  Thought it was c;earning up this morning, it is now bright orange.  So it goes back and forth.\n\nI learned that catheter taping is SUPER IMPORTANT to over all well being and comfort.  In post op they didn't tape cath at all, and it was awful and I was complaining a lot.  I had never had felt to pee so bad in my life, and they kept informing that it was from a number of factors and there was nothing they could do.  I found out a couple days later they were partially wrong.\n\nFinally in the room they put me in after post op, the nurse there taped the cath to my leg, which caused more general comfort (no more intense sharp pains when someone would go to lift the tube to drain, and the pee urgency went from terrible to only partially terrible).\n\nThen got home, found the two badder relaxant meds prescribed helped. along with the opiate pain killer.  But that the intense urgency would fluctuate.\n\nFINALLY, discovered that if I taped the cath tube and my (penis) more upward and to the left, as opposed to downward and to the left, that it gave me exceptionally more comfort.  I've been doing this since.  And I've gone from completely house bound to now I'm feeling up for running chores and errands and even driving.\n\nStill taking it easy until Monday when I get cath pulled.  I have both stents for another 3 weeks, and they are very painful but they are another story, and in some ways more manageable then the cath.\n\nDrinking lots of fluids, laying at the right angle with my back propped upwards, and eating reguarly has helped me a lot, too.\n\nBiggest problem I am still having is I am still unable to have a BM with this catheter in.\n\n\nBest of luck to your husband.\t\t\t", "date": "2017-09-15T11:52:16+00:00", "topic": "Husband Scheduled for 1st TURBT &amp;amp; I have Questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWow that is so awesome, Congratulations!!  Certainly a time to celebrate !  So happy to hear!!!\t\t\t", "date": "2018-04-28T00:00:46+00:00", "topic": "TIME TO CELEBRATE", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFirst cystscopy with Dr Wilson (2nd exploratory after \"original\" tumor removed).\n\nWENT FAR BETTER THEN I COULD'VE EVER IMAGINED!  Her soft \"old\" (as she says) Olympus scope was 10-20 times less painful and more pleasant then the modern (as she says \"more rigid\") modern scopes that ARE the ONLY scope available in my city of Colorado Springs, that I am aware of.\n\nHer practice received the new scopes, but since she does around 16 cyto's a day, and has a fulltime helper through the ENTIRE cytsoscopy, she decided to not use the new, more rigid scopes, and use her favorite which is a 10-12 year old, black, ultra soft, Olypmpus scope.  It was the first time I was scoped for more then 5 minutes, and also the first time I was laughing and it was absolutely pain free (except for a 2/10 for pain for passing the prostrate for a brief moment ; I compare that with a 7-8/10 for passing the prostate with the more rigid scope).\n\nAnyways she went through and didn't find anything.\n\n\nThen at the very end she finds a single .25mm or less tumor, that was VERY small and early on.  She said removing it was optional.  Then she gave me the choice of her removing it with her electo-shock machine right then and there while I was awake/  \"I thought you had to be asleep, is that even possible?\"  I replied.  She replied yes.\n\nSo we proceeded.  She asked me if she could blast it a second time, making sure it was gone but also making sure the first blast wasn't too painful.  When I informed her the first blast was barely a 1/10 on pain scale, she did second blast.  Then she told me she put a small amount of mytocin in my bladder, told me what it was.  At this time I thought I was in for pain when she removed it since it's always been painful upon removing the scopes with my other urologist/his scope.  NOPE.  She had had it removed for 2 minutes already at that point, and it was so pain free I didn't even know.\n\n\nNext explorative (check-up) cystscopy is scheduled for Oct 26 2018.  So I finally graduated from 3months to 6 months, right now.  So we will see!  All glory be to God.\n\nAlso got second opinion back on my original pathology from John Hopkins University.  They agreed that it was low grade, non muscle invading, urothelial carcinoma.\n\n\nStill get some flank pain around kidneys here and then, but I have found that breathing, well ness, lack of stress, and my anxiety medication seems to fix the pain.  Am recommended to do another full body CT in a year or so.  My last full  body US after I complained for persistent flank pain after the procedures, showed \"perfect\" results.\n\nOverall I am thanking God, this community, my fiance and family, and my wonderful doctors, along with all the great benefits I've received from 77% CBD oil, apricot seeds, alkaline water, selenium, and kelp sourced iodine.\n\nMuch love to each and every one of you, and I continue to pray and fill my spirit with the thoughts that  I and each and every one of us (Lord willing) will continue to make strides of progress towards this nasty disease, and maintain our inner health and balance as we proceed day by day, month by month and year by year.\n\nIn closing, I still hold in small part of logic, that this is still remission and things can always change for better and for worse.  But I am beyond cautiously optimistic, but one still must be cautiously optimistic to one degree, and I feel in my soul, heart and spirit that things will continue to move for the greater good, especially as I follow closely to the knowledge and advice I've learned here and from my great urologists. Again, I have love for each and every one of you going through this in whatever way shape or form.\t\t\t", "date": "2018-05-02T18:55:18+00:00", "topic": "First Cystscopy with Dr Wilson", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack!!  Good to hear from you my man!\n\nHaha..isn't it??  I think they should rename it bladder ANNOYANCE sometimes, then more then anything, lmao.\n\n\nIt really truly is annoying and (if you allow it) nerve wracking waiting for the next checkup, or to start the next treatment. Right you are!!  Sadly enough lol.\n\n\nYes, I was getting that vibe off the bat, that especially with my scenario; the decision whether to intervene with treatment like BCG or simply watch and wait; is quite simply a not very simple one.\n\nMy biggest decision im weighing right now is which Urologist to see on this next cystscopy.\n\nI have one schedule with DR shandra wilson in mid april.\n\nI have one schedule with DR roseavear in mid May (the uro i've been seeing in the springs)\n\n\nMy sister, a nurse, says \"If it's not broken don't fix it\" - meaning I should just stick with Dr rosevear because dr wilson had good things to say about him, and he's done me pretty good so far.  I mean through all this I've felt prety darn good and also had \"good\" pathology.\n\nAnnnnd a good part of my gut is telling me just to stick with him, and only switch to Dr Wilson if things get worse.\n\nBuuuut another part of my gut and heart is telling me to go see Dr Shandra Wilson for this next cystscopy, and have her do a cystscopy for me for the first time, and essentially switch entirely over to her for my care.   Most of this stems with how much more she talked with me / conversed with me / how much  more \"overall\" knowledge I got from her during out first and only meet up, which was an hour consulation, that lasted more then the full hour.\n\nI think I got more knowledge and insight from that, in that hour, then I have the entire time seeing Dr rosevear down here.\n\nSo part of my gut says, go with her, because shes the specialist's specialist, and because she handles sooo many more BC patients then Dr Rosevear (all she treats is BC - where as BC is only a smaller percentage of his overall patients).\n\nBut I just can't friggin decide.  And I know no one can decide for me, which doesn't make it any easier .\n\nBut I got to make my mind up within the next week or two, because if I go with her, my cytscopy with her will be in mid April.\n\nAgain, she says she trusts him, and trusts my care with him.  His care includes the gameplan I mentioned in this first post.  Based on what I learned from her a few months ago, she would have a similar game plan, to my current uro, I just wonder if her larger expertise would be of significant benefit to me (whether it is spotting things that dr rosevear doesn't  have the experience to notice; or whether it's a treatment method she's developed specifically for NMIBC/LG BC patients that perhaps my current uro doesn't know of or utilize.\n\nI know the consensus on here is to go to a cancer center / a specific bladder cancer  urologist.  So based on that consensus alone, I should already be switching fully over to dr wilson.\n\nPlease someone give me some insight.  This become a tough, very tough, decision for me to make.\n\nThanks all and much love\t\t\t", "date": "2018-03-29T02:58:22+00:00", "topic": "My spring update", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo I haven't been on here in a while, been busy with my mind almost entirely else where.  Work, family life (new daughter, my second, coming in August), travel (the snow storm at ameristar blackhawk the other night was incredible), and everything else.\n\nSo I got my TURB resuts back from my second TURB sometime about a month to a month and a half ago.  It came back the same as the first TURB (low grade, NMI)\n\nMy doctor talked about this probably not going to be what ends up killing me, saying that I'll very likely die of a normal person death like getting hit by a car or having a heart attack.  He said I am very lucky.  He also said that he doesn't want me to feel like he is sugarcoating things, but that just he really thinks I am fortunate and have a good scenario.\n\nHe said my biggest issue, so far, will be the annoyance of having to deal with this disease.  In may I'll have my third explorative cystcopy (and seventh time awake with scope in general; when having to remove my stents from my first TURB, my urologist had to go in three different times to fully get them both removed..  I consider that time to be three times lmao).\n\nThen if it's like last time, I'll have several little few millimeter size tumors in there, and so they will schedule a TURB a couple weeks later.  Rinse repeat.  This is me predicting the future.\n\nI am still trying to keep full hope that maybe this thing just won't come back.  My urologist talked about him not wanting to use the big guns like BCG or a bladder chemotherapy without \"getting to know the regrowth speed and size\" more thoroughly to possibly get me to just yearly TURBs, even if it comes back every 4-6 months, according to him.  Which is why he said this could be more of an annoyance then anything.  He said each time these things come back, I have, statistically, a 15% more chance of it always coming back. Each time...it sounded like.\n\nI am hopeful that it won't come back.  In less pain then ever since this began.  Plenty of energy.  Was underweight pre-cancer diagnosis.  I am 6'4\" and I got down to 138 pounds before being diagnosed.  I am not back up to not only a healthy weight, but the highest weight I've ever been, 178 pounds.  I'd still like to gain 10-20 more pounds.  But everyone has noticed that is close to me.  My face and legs have gained the most.  I have not been working out, but have been keeping my same high activity level I kept pre diagnosis.\n\nBeen eating healthier, but no where near perfect.  However I do now juice every 1-2 weeks and I'll juice raw apples, carrots, beets, cucumber, kale, and more.  It's very healthy being that it is naturally unpasteurized.\n\nI also have been taking CBD Oil (77 % purity; no THC).  orange flavor.  My friend owns a lab, and I've always thought cannabis to be beneficial to warding against tumor growth.  I think \"smoking\" it is the dilemma.  I live in CO so cannabis is completely legal here for those 21 and older.  Prior diagnosis I did smoke.  Now I do not.  I use a ceramic and glass vaprozing unit OR I use the CBD oil under the tongue.  I am still waiting to find time to make the rick simpson oil.\n\nAnyways, I want to hear from you guys.  I hope all of you are well.  I especially want to hear from someone who is dealing with a repeat occurence of a low grade, non muscle invasive bladder cancer like me, that so far, seems to come back in as soon as 3 months.  As usual, thank you for the support & insight on here.\t\t\t", "date": "2018-03-29T02:58:22+00:00", "topic": "My spring update", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrom what I've learned, you should definitely be treated with BCG with high grade / NMI by AT LEAST the second TURB.  That is just what I've learned.\n\nMine is apparently LG, and I have to kinda decide myself whether BCG is worth it, along with the uro's guidance.  Good luck.  There is plenty of hope and grace out there for us.  God bless.\t\t\t", "date": "2018-03-26T22:06:06+00:00", "topic": "Ta High Grade new and confused", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Alan and Jack R.  You two have been irreplaceable in this journey.  I really appreciate the insight and the support.  It means more then you'll ever know.\n\nYeah this was \"fresh\" blood.  The \"old\" blood came within a few days of the TURB.\n\nAnyways!  Two things.  I guess all is good.  The blood is gone and the urine is cleared up again.  It started to clear when I woke in the middle of the night, and then this morning it was completely clear again.\n\n\nI'll still, likely, let the office know.  Like you said, that's what they get paid the [big bucks] for is to take record / note of this sort of stuff, and report it to the doctor.  So for my URO to learn that I've had three-four bleeding events on this last TURB, can only help arm my doctor with the proper facts about what's going on. You are absolutely right.\n\nHappy that is has cleared up.  Again.  We just got our first proper snow in \"west side\" Colorado Springs.  Probably the biggest snow this side of town has seen all  year.  So that was exciting to wake up and see!!\t\t\t", "date": "2018-02-10T05:02:00+00:00", "topic": "Bleeding 17 days after 2nd TURB", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOk, so I had no blood on the 23rd after my TURB.  Then I had one very light pink pee the day after.\n\nWent to Encinitas this last weekend for the weekend with my fiance and 4 year old, and when I got off the return flight from LA to Denver, I pee'd pink.\n\nI pee'd pink all the way until 1pm the next day.\n\nI did have sex with fiance a couple times, was semi-active in terms of walking, and swam in the pacific for 30-60  minutes, while in CA, prior to returning to Denver.  Was only in CA for 2 nights.  Once I returned to Denver, this Monday night, it continued until mid day Tuesday,  then it cleared up all week.  Until now..\n\nThe urology Medical Assistant department said, at that time, they thought the airplane roundtrip might have caused the pink urine combined with swimming in the pacific and a couple times 'body surfing'\n__________________________\n\nNow, just now, I urinate just now tonight.  It's not pink.  It's red. Red.  Not dark, wine red, just red.  And it's been clear ALL DAY until now.\n\n\n\nWhy do you think this is happening?  I thought it may be from the light-moderate physical work I do 30-50 hours a week, picking up my 40 pound daughter, and also from my 140 pound fiance sitting on me in my office chair (before I kicked her off a couple minutes later, lol).\n\n\nAre these things causing this???  I don't like blood in my urine.  Don't like it at all.  Why is this happening to me?\n\nI didn't have blood like this during my first TURB once the catheter was removed on day 7, I never had ANY blood following that, and I had two stents for a month and everything.  NOTE: I did have heavy blood during day 1-6 after my first TURB.  It was the morning of the 7th when the catheter was pulled that the urine cleared up \"for good\" at that point.\n\n\nPlease help!\t\t\t", "date": "2018-02-10T05:02:00+00:00", "topic": "Bleeding 17 days after 2nd TURB", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have my Pathology appointment with the Doc on the 6th of Feb so please keep me in your prayers.\nPrayers for peace of my body, mind and cancer and ALSO peace for the body, minds and cancers of EACH AND EVERY ONE OF YOU HERE ON THE SUPPORT GROUP & THROUGHOUT THE REST OF THE WORLD GOD BLESS <3 .\n\nLord willing the pathology will be similar or with very little difference to the first pathology.  We will find out in ~7 days!\nStill feeling A LOT better after this TURB in terms of the recovery, pain (or lack of ), and ability to cope with life and work part BETTER.\n\nMaybe they are right when they say you \"really do get used to these things\" (refering to big, shiny scopes, and the urogential tract).\n\nEven though this is simply \"only\" my second TURB it just went a lot better and smoother then the first one.\n\n\n\nI am hoping to take the NMI/LG approach to these as possibly just keep having them removed and seeing how that goes for me a few times BEFORE trying BCG.  And that is what my current urologist is thinking as well, to see how pathology is, then discuss the timing of whens and if's of BCG during that time period.\n\n\nAlso, I switched insurance to a SILVER plan that both my current Colorado Springs Urologist accepts and also one that Dr Shandra Wilson (19th best Bladder Cancer urologist in the World according to US News & Reports) accepts.    She is in Denver and handles around 12,000 patients BC patients (her youngest patient ever was 6, where as my current URO, well I AM HIS YOUNGEST PATIENT EVER  )), where as my uro in the springs handles around 200-300 patients.\n\nI believe this puts her at the cysectomy rate (25 - 50 per year) that you recommended a URO have when performing Cystoscopy and TURBTs on me.\n\nStill love my URO in the Springs, but I gotta switch over to one in which I am NOT his youngest patient.   That should give me more of a fighting chance for WHEREVER I choose to do the fightin'\n\n\nAnyways!, hopefully this is good news, but I have my NEXT cystscopy scheduled in April with Dr Shandra Wilson, because regardless of how good or  bad my pathology is when it comes back again, I want to have a renowned bladder cancer expert looking at it, then to not.  Plus Dr Wilson works out of an actual cancer center.  My current URO in the springs does not, as there is NO cancer center in Colorado Springs.\n\n\nLet me know what you think about this, Alan.  You're always in my prayers, and your encouragement and insight does wonders for me, Alan.  I am making sure that if I have to have  THIRD TURBT (it'd be between April and May if I did) that it is (THIS TIME with a URO that sees A LOT of BC and that URO would be little \"miss\" Shandra Wilson of University of Colorado Hospital Bladder Cancer Center.\n\nAgain must prayer and love, and let me know what you think about my game plan\t\t\t", "date": "2018-01-25T17:44:14+00:00", "topic": "Had 2nd TURB on Tuesday!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI woke up laughing and feeling full of joy this time.\n\nNo stents or catheter needed this time.  Urologist originally found \"3\" \"wart like\" \"1mm or so\" tumors on my first 3 month cystoscopy, leading to a TURB I had done a coouple days ago at 630am.\n\nAnyways my urologist warned me the growths could be more multiple or numerous then the cystscopy revealed.  He was sort of right, too.  I had 4 of these small growths, instead of the 3 he had originally seen.\n\n\nAnyways, they were located in a \"easier\" to reach part of the bladder according to him, which explained why this TURB hasnt hurt or been bloody like the first one of my \"original\" near 2cm tumor.\n\n\nAnyways we wait on pathology now to say if it is still low grade.  Then it'll be a decision of letting them grow and doing a TURB every 6 months to a year instead OR trying BCG treatment on a low grade tumor(s).  That assumes it is still low grade.\n\n\nI'm trying to remain happy and at peace as usual.  I feel good, which helps.  What do you all think?  Much love to you all.\t\t\t", "date": "2018-01-25T17:44:14+00:00", "topic": "Had 2nd TURB on Tuesday!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks you two.  I'll be praying for you, too Joanne.  The only positive about us both sharing this experiences is the prayers and insight we can share.  Besides that, I am sorry we both have to share this.\n\nThis is scary because of the uncertain.  I'm not certain what their plan is, but I think future pathology dictates their path at this point.\n\nMy mind is back more at ease and at peace, just like before.  Hope you're doing well.  And thank you Alan for the solid advice, as usual.  You're right on, as usual, as well.\n\nMy TURB is on the 23rd I believe so let's see how this all goes!\t\t\t", "date": "2018-01-12T18:08:25+00:00", "topic": "First Cystoscopy after first TURPT.  Smalls tumors Back.  Need help and advice", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tALSO: Some more back history.\n\nI was prescribed mild opiod pain medication (long term) in combined with 1mg as needed of XANAX in 2013 when I had my tumor in my right femeral / right buttox.  It turned out to be benign, but it wreacked havoc on my nerves / sciatica thus why I was prescribed these drugs.\n\n\nI am still prescribed a very small dose of opiod pain medication that I take every 1-3 days.  I WAS prescribed 1mg XANAX as needed (30 of them a month) since 2014.\n\nThe xanax prescribing doctor retired July 25th 2017.  I had my first wine colored pee July 26th 2017 or July 27th 2017 (which was right after I had ran out of xanax).  At first I thought my urine had mass blood in it because I had quit xanax at that point cold turkey.\n\nLong story short, it turned out to be related to no drugs at all, and was actually a ~2.4cm Urothelial Pappilary Carcinoma.\n\n\nANYWAYS, The reason I am saying all this again to you, is that I am more and more thinking that these recent pains I've been describing here are due to my brain, and my funked up GABA receptors.  After all, I've been through a lot since July 26th when I had to stop taking XANAX \"cold turkey\" after taking it for a number of years.\n\nWhat do you think???\n\nCombine that with the fact that I found an old bottle of my old prescribed XANAX about 5 days ago, took a 1mg xanax, and the pain went away for 1-2 DAYS STRAIGHT, until it eventually began to slowly return.   Took another 1mg xanax at that point, and same deal, the pain goes away for 1-2 days straight.\n\nDoes this sound like an anxiety problem / deep seated anxiety pain?  Also, do you think clinical concern / benefit warrants getting prescribed XANAX again?  I prefer not to take drugs that I don't need to take, but this stuff helps me in ways I can't even describe.\n\nThoughts on this?\t\t\t", "date": "2017-11-16T17:13:33+00:00", "topic": "Worried that my pain is Adrenal Gland", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThey did a contrast cat scan AND non-contrast cat scan back-to-back yesterday.\n\n\nEVERYTHING looks good from the  lung bases, to adrenals, gallbladder, liver, pancreas, you name it, from everything from the Lower Pelvis to the Lung Bases looks great.  This will be my fourth WO Contrast CT, second IV Contrast cat scan, and third ultrasound that shows these good results since this all started August 5th.\n\nObviously a couple of these tests a couple months back showed the tumor in my bladder (which has \"long\" [in september] been resected).  But besides this, these tests have always showed great results.\n\n\nSO GOOD NEWS, RIGHT?\n\nOnly problem is that pain I was referring to has shifted to just under the right nipple / breast bone.  In that region.\n\nThe fact that everything is coming up fine, and that this pain has been gradually shifting in location entirely over the past couple weeks, COMBINED with the fact that XANAX removes the pain \"with the snap of a finger\" makes me more and more inclinded to think it is an entirely mental pain.  Perhaps due to stress and anxiety that I have conveniently swept under the rug.  Either that or it is a ulcer of some sort.\n\n\nWhat do you guys think?\t\t\t", "date": "2017-11-16T17:13:33+00:00", "topic": "Worried that my pain is Adrenal Gland", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad two cat scans this  morning.  One without contrast and one with iodine contrast.\n\n\nWe will wait and see for results.\n\n\nOne interesting thing.  I was prescribed xanax for 6 years, and decided to try an old one I had laying around and it CURED the pain for 1-2 days before it came back.\n\nDoes this prove is psychological?  or could it be physiological?\t\t\t", "date": "2017-11-16T17:13:33+00:00", "topic": "Worried that my pain is Adrenal Gland", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad a 1.7x2.4cm bladder cancter tumor (rated pappilary carinoma, non invasive/lowgrade) removed September 12.\n\n\nHad ureter stents in both ureter for 1 month.  Stents weren't as painful as some state, but had some pain. No blood with stents.\n\nSince stents removed I have had pain in what seems like the left and right ureter.  It'll be left side pains sometimes, right side pain other times.  Some days will have lots of pain off and on.  Some days will have none.  Anxiety drugs help the pain really well. AZO Bladder analgesic helps pain get 40% better.\n\n\nI am worried that the cancer has quickly spread to adrenal gland, or perhaps ureter/kidney.\nThe tumor was growing near opening of right ureter.  DR put stent in right side due to \"debris\" from tumor during resection.\n\n\nWorried.\n\nPlease help.\n\n\n\n\n\nPS:  Getting catscan done with IV soon.  Have had three cat scans since august, and one US.  All said my kidneys and adrenals looked good and healthy.\t\t\t", "date": "2017-11-16T17:13:33+00:00", "topic": "Worried that my pain is Adrenal Gland", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad TURPT Sept. 12th for Low grade/noninvasive tumor.  Dr placed stents in each ureter.  One on left for the \"kidney stone\" (which didn't exist) that sent me to the doctors in the first place, and one on the right for \"debris\" from the TURBT since the tumor was relatively close to the right ureter opening.\n\nStents were removed Oct 13th.\n\nHave had pain since they were removed that has equalled or exceeded the pain I had in the ureters WITH the stents.\n\nAm working with urologist on this ongoing pain, but I want some of your advice / opinions.  Tests in urine mark no blood at all, no  nitrites, and only luekocytes once.  So far nothing has cultured (no sign of infection).  Renal ultrasound has shown great and healthy results.\n\nUrologist's PA told me to take Pyridium for the pain.  It does help, but I can tell when the medicine is wearing away, and the pain can even sometimes flair up on the pyridium (it does help though).\n\nUrologist said if the pain and concern persists, that we will do a renal cat scan.\n\nAny help would he appreciated.  I feel good otherwise.\t\t\t", "date": "2017-11-13T01:21:44+00:00", "topic": "Ongoing Ureter Pain since Stent Removal", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara,\n\nThank you.  Even though, I, just as I am sure all of you, wish I didn't have to be a member of this forum/society...\nI am still feeling very blessed based on what my Dr., yourself, and some of my family have said regarding the positivity of my outcome.\n\nThank you for that explanation.  The presence of muscle in the wording of pathology and his surgical report, was a little scary to me reading it originally.  Thank you for clarifying not only what the presence of muscle signifies, but that the presence of muscle is a great sign.  I truly appreciate that insight and clarification from the bottom of my heart.\n\nAs \"fun\" as cystoscopic exams are...haha... I am making extra sure that I never skip one.  I already have my first preventive exam scheduled for January 12th.\n\nWould you think it a good idea for both reason of making extra sure and easing my mind that the results really are so good; that perhaps I should request for the results to be sent to another Pathologist company for a second opinion?\t\t\t", "date": "2017-09-25T18:38:00+00:00", "topic": "Diagnosed with Low grade / Non Invasive this Morning, questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne,\n\nI got a second opinion appointment with the other urological firm in town.  It's scheduled for the beginning of October.  I can't get into Dr. Wilson, yet, or that is where I would be going.\n\nI appreciate the insight, and even though I, personally, like the solution my current urologist is going for; that doesn't mean it will be the best solution for the cancer.\n\nI went in and got copies of the surgical report and the pathology report today.\n\nPathology report was reviewed by a second pathologist in the pathology office, as I assume is common procedure.\n\nHere's an excerpt from it, if you can give advice if you think my current urologists treatment solution seems right for this:\n\nFinal Diagnosis - Pathology Report\n\nA  \"TUMOR\" URINARY BLADDER (NOS) TRANSURETHAL RESECTION\n-[PAPILLARY UROTHELIAL CARCINOMA, LOW-GRADE\n-No invasion indentified\n-Detrusor muscle present\n\n\nGross description:\n-single formalin filled container\n-multiple tan-brown fragments weighting 3 grams and measuring 2.5x2.4x.9 cm in aggregate.\t\t\t", "date": "2017-09-25T18:38:00+00:00", "topic": "Diagnosed with Low grade / Non Invasive this Morning, questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello I am 29 years old male and got diagnosed with low grade /  non invasive this morning.\n\nI was scheduled 2 weeks out to have stents removed, and in January for the first preventive cystocopy.\n\n\nI have questions why I did not receive a pathology report?  Is it something that I am expected to specifically request, or should it be given to me?\n\nAlso I asked if it needed to be sent anywhere else, or if a second opinion was helpful, and my urologist said no.\n\nI am happy with this diagnosis, but I want to play it as safe as possible.\nWhat are your thoughts and opinions?\t\t\t", "date": "2017-09-25T18:38:00+00:00", "topic": "Diagnosed with Low grade / Non Invasive this Morning, questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}]}