{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tThanks for the encouragement and advice.  I pretty much eat anything that sounds good just to get in the calories.  I can't look at fruit juice, broth or any other clear liquids without getting queasy.\n\nI woke up this AM feeling better than ever.  I had robotic assisted; the only large incision is less than 3 inches where they put my new bladder in--scars are cool.  Most of my pain comes from my lower back, a chronic muscle condition I had before the surgery.  I surprised myself this morning and sat up using my stomach muscles without thinking--so that site is doing better than I thought.  I saw my regular doctor about the back, so am taking something for that instead of the Percocet my surgeon prescribed, but I'm weaning off of that too.\n\nI'll see my surgeon tomorrow, so I can grill him about how much activity I can have.\n\nAs far as recovery, what was it like the first time you urinated \"normally\"?  I have my Foley out in a week and a half, the 4-week mark.  As I understand this, he will cap the super pubic tube, then have me drink a lot and see if I can urinate normally at his office.  If all goes well, a week later the SP comes out, and I'm on my own--kind of like taking the training wheels off.  Woohoo!\t\t\t", "date": "2010-05-23T07:33:53+00:00", "topic": "How long ot return to normal, age 50, cystectomy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, it's going well.  I had a bad gastro day yesterday.  I hope that was the last gasp of getting the GI tract going.  I also saw my PCM for the lower back pain.  It's always been a problem with me.  In order of worst to best--back, GI, then surgery site.  Imagine that--the surgery was the easy part.  She ordered xrays and put me on Soma, a muscle relaxer and Tramadol for the pain.  I feel normal again.\n\nI don't get my foley out until the 4-week mark, another two weeks!  Then the fun starts.\n\nSo are you a doctor or simply someone with lots of experience?  I understand this site was started by patients rather then a medical association.  Quite a valuable service.  I went the Johns-Hopkins urology website but couldn't find any forum.\t\t\t", "date": "2010-05-06T03:53:54+00:00", "topic": "Surgery tomorrow for neo bladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLeeH:\n\nThat helps.  I get my Foley out in two weeks.  Can you give me your source and models/names of the pads/attends you initially used?\n\nI do lots of walking in my IT job, but can wear dockers, so I think I can work with this.\n\nI guess I'm apprehensive about balancing the need to hydrate to keep the mucus down so I d/n have to irrigate vs. the need to slow down at night.\n\nChris\t\t\t", "date": "2010-05-16T03:35:42+00:00", "topic": "Incontinence for noobs", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'll get straight to the point---what's the best diapers for men?\n\nI got a Studer neobladder May 6 and expect to be incontinent for up to six months.  I'd like to hear people's experience with this, like how they deal with this at work and nighttime.  I still have a Foley and super pubic, and these fill 1.5 to 2 liters at night--how the heck am I going to contain this after the caths are out?\n ", "date": "2010-05-16T03:35:42+00:00", "topic": "Incontinence for noobs", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tUnder 65 is only for the hospital I went to.   Your doctor is best to answer that.  I guess as long as you're in reasonable health and have the insurance.\n\nWhat you are asking about is nerve/vascular sparing.  Don't be shy about offending your doctor by inquiring about who is the best, especially when it comes to the prostate.  Ask around, patients, nurses, etc.   Ask a lot of questions about this procedure, such as if they are using robotics--I heard a report that the DaVinci may not be as great as we're told, enough that there is an ambulance chaser commercial out.   I don't know about the success rate when it comes to sex after this surgery.  It would be interesting to hear.  Let's just say I've had issues.\n\nSomething else you might ask about.  There is a \"check valve\" between the bladder and your kidneys-ever wonder why it doesn't back up?  They take it out as part of the procedure.  This means you have to be careful to urinate regularly or the back pressure can damage the kidneys.  I'd ask if taking it out is necessary.  Surgeons LOVE to cut.\t\t\t", "date": "2013-07-10T18:57:01+00:00", "topic": "Facing recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats on beating lung cancer.\n\nI suppose the first piece of advice is to make sure you get a 2nd and 3rd opinion.  I am interested that you had chemo.  That was not an option for me, unless you're referring to the TB treatment.  Anyway, neos are a minor miracle, being able to walk around with a semblance of normalcy.  But no matter how rosey the doctor may make it sound, neo-bladder management is no cakewalk.  My doctor won't even do it for patients over 65.  Half of all neo patients have to cath themselves at least once, 5-10 percent have to everyday.  Some people can do this no problem--not me.  I'm determined to be part of the One-timer Club.\n\nDay time control is usually not a problem for most.  I’ve heard of people even skydiving.  Success with nighttime incontinence varies, and can go on for several years.\n\nThat said, for my type of cancer (papillary, carcinoma insitu, and T1 High Grade), it was a no brainer--the TB treatment had a 40 percent recurrence after 5 years, 5-10 percent for the neo.  You've probably heard too many bad stories about conservative approaches to treating cancer, so opted for the neo.  It was a two-month recovery until I was able to go back to work fulltime, but others fair better.\n\nHave them check for prostate cancer now.  It comes out anyway with the bladder, but it's best to know everything going in.\n\nFinally, DEMAND the best surgeon, someone who's done the surgery for neos for many years.  With all the nerve and vascular cutting they have to do, you can end up impotent, and drugs may not help this.\t\t\t", "date": "2013-07-10T18:57:01+00:00", "topic": "Facing recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the link.  I printed out the pages.  My doc already has me doing the first one, and I'll try some of the others.  I got him to explain in detail what's going on with my plumbing, because it helps me to better do the exercises.  I'm perplexed how my old bladder retained urine, but it obviously worked well.  What a magnificent machine.\n\nSo is anyone having trouble with mucus?  This is my original scare when they first explained the whole neo-bladder thing (you want me to do WHAT to myself?!)  I'm still irrigating thru the SP tube for two weeks, and pulling a LOT of crud out, which says my urination is not up to par.  Sorry for the details.  Good incentive to practice, practice, practice.\t\t\t", "date": "2010-05-16T03:35:42+00:00", "topic": "Incontinence for noobs", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tShacky73--sorry I didn't see your post, and I imagine by now you already had to make a decision.  There are so many factors, it's difficult to make a recommendation.  In my case, I had two options, the second with three sub-options.  First TB treatment, which had a 40 percent recurrence rate--sounds bad.  The second was remove the bladder--5-10 percent chance of recurrence.  The 2nd, though safer, has several negative side effects since the also remove the prostate--incontinence and sex issues.  If you still need advice, feel free to reply back.\t\t\t", "date": "2019-09-19T11:05:51+00:00", "topic": "Follow up treatment ten years on", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThanks for the details. Neo-bladders seems to stress kidneys already for a couple reasons, so don't need more.  I saw my doc in October and we agreed to a five tear follow-up.  Frankly, with my family history, I feel I'm in the sights for any type of cancer.\t\t\t", "date": "2019-09-19T11:05:51+00:00", "topic": "Follow up treatment ten years on", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI just got back from an appt with my doctor for an annual followup for bladder cancer (I'm eight years cancer free).  He quoted a rate of only 20 percent of neo bladder patients having nighttime incontinence problems.  Eighty percent make it thru the night?  I void before going to bed and wake midway to void again, but still have problems.  I was was nearly continent three years ago, but took a marked change for the worse.  This coincided with a colonoscopy.  Maybe the doctor had fun while I was out and re-arranged things.\n\nCan anyone corroborate the statistic?\t\t\t", "date": "2018-10-10T21:04:57+00:00", "topic": "What is the incontenence rate for neobladder", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tMike is just a masochist   ", "date": "2012-01-06T11:49:21+00:00", "topic": "Neobladder Urione Retention", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tNot necessarily slanted--depends on your situation and factors that you or I may not see the significance of, such as current health, age, etc.  My doctor refuses to do a neo bladder on anyone over 65, says it is too hard on them.  This has certainly been no walk in the park.  Three months out and I'm still having issues.\t\t\t", "date": "2010-07-18T07:18:16+00:00", "topic": "What\\'s worked for night time continence", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tWe're all part of the club no one wanted to join.  Why did you opt for the conduit?\t\t\t", "date": "2010-07-18T07:18:16+00:00", "topic": "What\\'s worked for night time continence", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI guess its generic.  The pharmacist told me to take it with food.  It also seems to cause the jitters with me, so I have to take it early.  I was up until 3 last night.\t\t\t", "date": "2010-06-21T06:04:51+00:00", "topic": "I hate to ask the gross questions, but...", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tYes, they confirmed I had an infection, which I knew.  With the lab results they were able to fine tune the treatment.  I'm on Nitrofurantion for a week.  I've been off milk for a week and everything is working much better, no problem at all--urination is working better than ever.  The milk caused the backup, but perhaps the infection caused it to hurt so much.  Don't know, but I'm not experimenting with milk for a while.  I'm also off caffeine at your suggestions. I'll re-introduce that later.\n\nI feel like a two year old--I'm not afraid to go pee pee anymore. Thanks or all the help!\t\t\t", "date": "2010-06-21T06:04:51+00:00", "topic": "I hate to ask the gross questions, but...", "subforum": "6-men-and-bladder-cancer"}]}