{"signature": ["Dx", "BCG", "Dx"], "posts": [{"text": "\n\t\t\t\tHi Kurtista,\n\nWelcome to the forum, being a 26 year old male in the UK having just gone through this, I agree that doctors and nurses tend to be shocked at the age. Especially when you're not part of any risk groups!\n\nGood news that it is low grade non-invasive! Very treatable at that so fingers crossed the checks will come back clear.\n\nI agree with the peeing, definitely hurt the first few times after the turbt. Any questions please let us know!\t\t\t", "date": "2019-06-24T16:36:32+00:00", "topic": "28 Years Old (M) - Newly Diagnosed + TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Panzerfury,\n\nThere's a good number of different potential causes for blood, I would say there's no reason to worry but that will never help you to stop, it's natural for your brain to wander off in all directions.\n\nI'm 26 and had a tumour removed, I went through all the same worries... the shock, the fear, the anxiety, it all happens but it needs to for you to move on!\n\nFocus on getting the procedure completed and recovering from that, I want to hear good results from you post op!\t\t\t", "date": "2019-01-08T21:36:31+00:00", "topic": "Good news!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAlan, thank you for sharing, it is extremely helpful.\n\nKnifedealer, I hope all is going well, good luck with the Pathology results!\n\nJust had my CT Urogram so I think it's now a countdown to the pre-op after the CT results have been checked out. I'm nervous about the op but more so the catheter and peeing post-op! The flexible cystoscopy was definitely not as \"pain free\" as family members have told me!\n\nObviously still hoping for a good result on the pathology and I think a TaG1 or maybe even G2 would be a pretty good result in my head, I just want to know what it is!\t\t\t", "date": "2018-11-23T14:43:39+00:00", "topic": "Believed Non-Invasive BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBrilliant, happy to hear that.\n\nDon't answer if it's too personal but was it BC that eventually got your uncle?\n\nIt's the long term I've been worried by. Everything I have done to this moment is to ensure both stability and security on the financial, physical and safety side of my future family so when I got this DX, it suddenly felt like I may be going down the route of that being dragged away from me. (Very over dramatic I know but my brain is very analytical so it's gone overdrive here)\n\nLike many people have said, one step at a time. I've got to deal with the facts about my individual DX rather than the 'what ifs'.\t\t\t", "date": "2018-11-23T14:43:39+00:00", "topic": "Believed Non-Invasive BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm 3 weeks out from starting my 7th BCG treatment.\n\nAlthough the effects feel like they get worse each week, I can say that it was no where near as bad as I had made it out in my head.\n\nHG is definitely beatable, go at it strong and I look forward to hearing your good news.\t\t\t", "date": "2019-04-18T14:44:11+00:00", "topic": "Path Back: Good News/Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI will follow his example! Merry Christmas to yourself and your husband!\t\t\t", "date": "2018-11-22T00:01:21+00:00", "topic": "Husband has been fighting BC for almost twelve years", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi All,\n\nMe again!\n\nJust an update, the histology has come back showing the tumour to be a 6mm pTaG2. In the UK, that is classified as high grade, apparently my tumour showed some risk factors of G3 and due to my age they have given me the option of BCG treatment which I will be taking.\n\nThey also use an EORTC calculator to calculate the risk of recurrence and progression based on; number of tumours, size of tumours, stage of tumours, CIS or not and grade.\n\nThey believe the percentages on my side are;\n\nRecurrence - 1 Year: 24% - 5 Year: 46%\nProgression - 1 Year: 0.2% - 5 Year 0.8%\n\nThey also believe my age and fitness will play a big part of this.\n\nI am happy with the outcome of TaG2 as I know it is highly treatable, if it comes back, we will hit it again!\n\nMy surgeon was also very good with the quantity of bladder in the sample including a section of the Muscular Propria so they are very certain on what it is.\n\nAs always, I am very thankful to all of those that have helped out or replied on this forum as it has been very reassuring to talk to those who have/are going through this. Especially those that have been recurrence free for multiple years.\t\t\t", "date": "2018-12-27T13:47:44+00:00", "topic": "Confirmed - TaG2", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi AGM,\n\nI've recovered quickly but I think that's a combination of the base of the tumour being smaller than they thought (6mm) and my age (26).\n\nBit of pain still when urinating with some blood here and there but for the most part back to normality.\n\nI get my report next Monday so Christmas will hopefully be a little bit more cheerful, hoping for TaG1 here, maybe Punlmp if lucky! Will see what comes though.\n\nWorst parts for me were by far the catheter and the pain when urinating for the first day after.\t\t\t", "date": "2018-12-11T12:30:40+00:00", "topic": "TURBT - 13/12", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCatheter is gone now, felt as bad as I thought it would, not for me!\n\nOnly worry I have is that I wasn't told to stop drinking when they were planning to put it in, I knew from research that I shouldnt drink after but was drinking before as I didn't know what time it would be put in.\n\nThat meant that 45 mins in it had to be drained due to my bladder being full, 600ml come out with the the mitomycin being so diluted the urine all looked clear. A little worried it won't have had the chance to do it's job but will see what happens in terms of recurrence now.\n\nTime to look forward to Christmas, have a good one if we don't talk in the meantime!\t\t\t", "date": "2018-12-11T12:30:40+00:00", "topic": "TURBT - 13/12", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Jack,\n\nI keep an eye on macmillan but found more first hand experiences on here with more debate on things such as probiotics.\n\nPathology report over here will be 2 weeks so around Christmas, will hopefully be a nice Christmas present but we will see! My main focus over night has been on the impending catheter removal, safe to say that's not an experience I want again anytime soon!\n\nThe nurses have been brilliant, especially when you take into account the terrible funding the NHS has been received. Massive respect to them taking on a career to help people like myself in these situations.\n\nI work for a national UK charity in an IT dept of 2 looking after over 1.4k employees for that reason, I can assist with the staff delivering a valuable service to help those in need.\t\t\t", "date": "2018-12-11T12:30:40+00:00", "topic": "TURBT - 13/12", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just come to the forum to post this exact link.\n\nHappening at University of Surrey which is just around the corner from me.\n\nLooks like a very nice alternative to BCG if results are favourable.\n\nThe risk of the treatment getting into the blood stream is lowered as well, can't see this strain being as dangerous as BCG getting out.\t\t\t", "date": "2019-07-05T04:34:11+00:00", "topic": "An alternative to BCG?", "subforum": "31-articles-of-interest"}]}