{"signature": ["TURBT", "BCG", "TURBT", "TURBT"], "posts": [{"text": "\n\t\t\t\tThanks again Mike, your words are comforting.\n\nHope you're keeping well yourself.\t\t\t", "date": "2011-08-02T22:15:03+00:00", "topic": "urination pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tApparently it stands for CT or CAT Scan of the urinary tract.\n\nWhat you're saying makes total sense. It's a shame the blue light is not being adopted as the standard method. Time/money probably the reasons why?\n\nOur biggest wish as a family would be to convince him to go to a clinic in mainland Spain that uses it, but doctors in Canaries say they don't think blue light makes much of a difference...\n\nThanks again Mike\t\t\t", "date": "2011-08-02T22:15:03+00:00", "topic": "urination pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you again Mike\n\nDoes the Urotac catch the CIS example you mention? Blue light is not available in the Canaries...\n\nThe urologist sees hundreds of bladder cancer patients - we really trust the guy because of his experience and references.\n\nThanks again for the comments!\t\t\t", "date": "2011-08-02T22:15:03+00:00", "topic": "urination pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNews!\n\nTURB yesterday through the Spanish social security system. Biopsy was taken (results in 1-2 weeks).\n\nThe small tumour was removed; surgeon says it was superficial. He also removed my father's prostatic adenoma and took a biopsy of that too.\n\nMysterious bit:\nThe doctor noticed the right side of the prostate was too hard and pointed this out in his report: bilobate prostate with stony right lobe. \nHe then announced that he will need an extra surgery to take a biopsy of it.\nWhat do you make of this? Have you ever heard of any similar cases?\n\nThanks so much! Hugs to everyone\t\t\t", "date": "2011-02-04T16:21:48+00:00", "topic": "3 years later... it seems to be back, but?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Diane and Pat for your comments.\n\nWe've tried to hurry things, but almost two months have passed by and we're not being given a surgery date!\n\nFrustration and fear have increased at home... my father insisted he wanted to wait. Finally we've convinced him to go private with this. Another factor helped him realise the sooner the better; his brother (my uncle) was diagnosed bladder cancer too two months back and after two surgeries doctors have decided to remove his bladder.\n\nTough times for the family. We're trying to keep positive.\n\nPat, the doctor says FISH tests are not necessary.  ", "date": "2011-02-04T16:21:48+00:00", "topic": "3 years later... it seems to be back, but?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe story continues... Three months after the miniTURB with no biopsy or BCG, a new check reveals another tiny tumour next to the one that was fulgurated:\n\nwas it there before and the surgeon missed it? (could be but not likely)\nis it a new recurrence? (in such a short time span!)\n\nThe thing is there is at least a two-month waiting list for this one to be TURBed and the surgeon now suggests biopsy.\n\nI personally feel fluorescent/blue-light machinery should be a must in 2011.\t\t\t", "date": "2011-02-04T16:21:48+00:00", "topic": "3 years later... it seems to be back, but?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree Diane; our problem is we can't get a second opinion in the Canaries and the doctor insists the tumour is too small to get a biopsy...\n\nThanks for your reply\t\t\t", "date": "2011-02-04T16:21:48+00:00", "topic": "3 years later... it seems to be back, but?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHaving been researching the use of fluorescent light/dyes I've come to the conclusion that they are much more effective than white light. And it is not just the companies behind it who say this - there are numerous university studies using different solutions that confirm the effectiveness of fluorescent diagnoses: www.esru.be/sites/default/files/02_DE_WITTE_-_Photodiagnosis_and_photodynamic_therapy.pdf\n\nWhy isn't its usage more widespread?\n\n1. More expensive?\n2. It takes longer - patient turnaround in surgery?\n3. Ignorance?\n\nI can't access some of the later medical papers but would love to see some of your opinions on this. Thank you!\n\n\narticle excerpt:\n\nIn April 2011 a new publication on Hexvix® in British Journal of Urology (BJUI) was published. This study confirm the results from a large prospective international study published in the Journal of Urology in November 2010. The results of the trial demonstrate that Hexvix identified lesions, including residual tumours, that were not detected with white light alone in 49% of the patients. It also demonstrated that the improved detection of lesions resulted in a significant reduction in tumour recurrence within 12 months. [8] [9]\nOn 12th May 2011 it was announced results from a clinical study included retrospective follow up from 526 patients in a prospective randomized Phase III trial in 28 centers in EU and North America. After a follow-up period up to 5.5 years, the number of patients who have experienced recurrence of their bladder cancer is lower, and the time it takes before the recurrence occurs is longer when they had Hexvix-guided fluorescence cystoscopy. [10]\n\n8 urotoday.com/bladder-cancer-1038/fluorescence-guided-transurethral-resection-of-bladder-tumours-reduces-bladder-tumour-recurrence-due-to-less-residual-tumour-tissue-in-t-at1-patients-a-randomized-two-centre-study-abstract.html Fluorescence-guided transurethral resection of bladder tumours reduces bladder tumour recurrence due to less residual tumour tissue in Ta/T1 patients A randomized two-centre study\n9 www.newsweb.no/newsweb/search.do?messageId=278275 British Journal of Urology publishes paper on Hexvix®\n10 www.medicalnewstoday.com/releases/225061.php Hexvix(R)/Cysview™ Demonstrates Long Term Benefit: Results From 5.5 Year Follow Up Of Recurrence Of Bladder Cancer\n[edit]\t\t\t", "date": "2008-01-12T13:13:41+00:00", "topic": "Fluorescent diagnosis... and surgery?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear all,\n\nI was wondering whether you consider fluorescent surgery important or not in the US?\n\nI understand you do not use Hexvix, but do you use any alternatives to this?\nwww.hexvix.com/\n\nIs the traditional white light still standard practice? I've read fluorescent practice is normally more targeted, meaning a surgeon doesn't have to guess what to scratch.\n\nIn our case, the surgeon - who is supposed to be the best at the hospital - apologised for perforating the bladder by saying \"I know I scratched a bit too much, I just wanted to make sure it was as superficial as it seemed\"...\n\nResearch shows fluorescent surgery is more precise.\n\nAny comments or experienced views?\n\nBest wishes\n\nGabriel\n\n", "date": "2008-01-12T13:13:41+00:00", "topic": "Fluorescent diagnosis... and surgery?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Joris\n\nApparently Hexvix has been introduced in Spain during 2007. Fortunately the hospital we're going to has already incorporated it.\n\nThanks for your info\n\nGabriel\t\t\t", "date": "2008-01-12T13:13:41+00:00", "topic": "Fluorescent diagnosis... and surgery?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAdding to my latest post:\n\nWe've discovered high doses of natural antioxidants like cherries and blueberries (in capsules to avoid the high doses of fructose) can be very helpful in the healing process. Any dark fruit/veggie like beetroot, acai, goji berries, etc.\n\nAlso, try taking a higher dosis of Omega 7 (found in buckthorn oil). Excellent for the urinary track, menopause and skin in general.\t\t\t", "date": "2011-01-11T16:59:58+00:00", "topic": "BCG, supplements, nutrition and vitamins?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFollowing Patrick Holford's advice in \"Say No to Cancer (Optimum Nutrition Handbook)\" and many other nutrition books my family and I decided this would be good supplementation after BCG:\n\nA good multivitamin from natural sources (such as Nature's Plus Source of Life Gold Tablets)\nAn Omega Complex (3,5,6,7,9)\nA specially-formulated urinary tract antioxidant (there are plenty of these)\nAnd Ester C (1 gram daily)\n\nAlso, if you have any food intolerances or think you may need a digestive tract detox, I suggest taking digestive enzymes, probiotics and glutamine for a month.\n\nHope this helps!\t\t\t", "date": "2011-01-11T16:59:58+00:00", "topic": "BCG, supplements, nutrition and vitamins?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations Nancy! Your news comfort us all\t\t\t", "date": "2011-02-05T02:44:04+00:00", "topic": "3 years, 4 months clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI wish I could give you more details but this is all the doctors have said to my father.\n\nI will keep you informed as soon as I learn anything new.\n\nBest\n\nGabriel\t\t\t", "date": "2008-01-15T23:11:48+00:00", "topic": "Worried...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi!\n\nMany thanks for your responses. We're following your advice and my father will be taking Oncovite until June, at least.\n\nHe's been informed by doctors, that is when he will have a Urovysion test www.urovysion.com/ and possibly a 2nd TURB.\n\nBest wishes to all and love,\n\nGabriel\t\t\t", "date": "2008-01-15T23:11:48+00:00", "topic": "Worried...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would like to share Dr. Lamm's reply with you. Thanks Rosemary for advising me to ask him.\n\n> question: Dear Dr. Lamm,\n>\n> My father 61 has been diagnosed T1 G3 bladder cancer.\n>\n> After TURB on 01/24/08, he will start BCG for 3 months.\n>\n> We asked his urologist about the use of Oncovite and when he saw its\n> composition he thought it would be good to use it, except for its B\n> vitamins, which he believes \"could strengthen both the good and the bad\n> cells\".\n>\n> What do you have to say about this urologist's statement?\n>\n> Many thanks\n>\n> Gabriel\n\n\n\"B vitamins in Oncovite\nDear Friend\nVitamin B6 is the first of the vitamins to reduce bladder tumor recurrence\nin a randomized clinical trial.  Folic acid is increasingly prominent in\nprevention studies.  I know of no reports showing a negative effect of B\nvitamins in cancer- but that doesn't mean it can't happen.  What counts is\nthe results.  The Oncovite preparation has been confirmed to dramatically\nreduce bladder tumor recurrence in double blind randomized clinical\ntrials- the platinum standard of medical evidence.\nThanks for asking,\nDon Lamm, MD\"\t\t\t", "date": "2008-01-09T00:08:07+00:00", "topic": "Oncovite?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia,\n\nI'm afraid, being so new to all this, I might misinterpret your information, but I have noted down your comments to ask the four doctors we know.\n\nRosemary,\n\nThanks very much for all you say. I have just sent the question about B vitamins to Dr. Lamm through the link you posted. It is remarkable that my father has been diagnosed the same tumour you had. Congratulations for your progress and thank you for your constant support and care.\n\nI'd like to say to both of you that it's very comforting to read your comments in the different topics of the forum.\n\nLove,\n\nGabriel\t\t\t", "date": "2008-01-09T00:08:07+00:00", "topic": "Oncovite?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi All,\n\nDoes anyone know someone receiving treatment by Dr. John Holt in Australia?\n\nwww.radiowaveclinic.com/media_patients.html\n\nwww.the-institute.com.au/\n\nwww.holtradiowavetherapy.com.au/\n\nI wonder if there has been any further scientific evidence - after 2005 - about his controversial microwave (UHF) therapy.\n\nBest Regards\n\nGabriel\t\t\t", "date": "2008-01-25T19:40:25+00:00", "topic": "Dr. John Holt and Microwave (UHF) Cancer Therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t[file/] A vaccine developed at Middlesex University (UK) and Urocidin by Alvaro Morales. See below.\nVery interested to see what you think.\n\nwww.mdx.ac.uk/aboutus/news-events/news/bladdercancerresearch.aspx\n\nwww.termscience.com/health-medicine/new-made-canada-therapy-bladder-cancer-shows-promising-results\n\nAnd, will biopsies become non-invasive soon?\nstm.sciencemag.org/content/3/71/71ra16.abstract ", "date": "2011-06-28T13:14:33+00:00", "topic": "\\'Breakthroughs\\'? We hope", "subforum": "31-articles-of-interest"}]}