{"signature": ["Dx", "Dx", "Dx"], "posts": [{"text": "\n\t\t\t\tThank you Alan and Dave for the kind and encouraging words. Two weeks from tomorrow and all treatment will be complete and hopefully a few weeks thereafter, another all clear!!\n\nGod Bless,\n\nJoeP\t\t\t", "date": "2015-03-24T18:55:22+00:00", "topic": "Been a Long Time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've been offline for quite some time. Very long story, but I'll make it succinct.\n\nAs some of you may remember, I was cleared of TCC CIS last August, but there was suspicion of t still being present. After much testing it was determined that I had Renal Cell Carcinoma, both kidneys. Thus me being off this support group. While waiting for treatment to being, I had non elective surgery for a life threatening infection in my left knee (total knee in place for fifteen years). This deferred my treatment until the end of January.\n\nSo,, BCG every week, directly into alternating kidneys for twelve weeks. I'm now down to three, with the tenth taking place Friday. As I progress through the treatments, the side effects are much worse than when I was treat for Bladder Cancer. SO with my last coming up on 10-April, I'm looking forward to having my life back after begin cleared in May.\n\nI know this is very much off topic here, but you have all helped me so much in the past. Thanks for reading while I purge my story.\n\nGod Bless.\t\t\t", "date": "2015-03-24T18:55:22+00:00", "topic": "Been a Long Time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh, George, one other thing. Your birthday is exactly the year and day of my wife's birthday. Mine is the day before and one year earlier. Gotta love us Aries.\t\t\t", "date": "2014-08-18T17:40:20+00:00", "topic": "Here I Go Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the laugh. And no, not a poor attempt. One always needs laughter and I'm a big jokester so your humor wasn't lost on me. Thank you George.\n\nWith that said, I'm ready for this next step. This is very foreign to me and have been researching and learning. I feel out of my element after dealing with bladder cancer for two years.\n\nI did a little sailing this past weekend out of Boston Harbor and it really cleared my head. So we have a bit of a wait until the 20th of next month and I'm working to keep myself occupied during this time.\n\nI'm not sure if this new challenge is applicable to this forum but you've all helped me so much in the past. Any feedback to this thought would be greatly appreciated.\n\nJoe\n\nP.S. I've always loved Rosanne, Rosanadana.\t\t\t", "date": "2014-08-18T17:40:20+00:00", "topic": "Here I Go Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Gina. Those are very kind words.\n\nI'm doing my best and a strong loving wife is in my corner. Even with her mom passing just a few weeks ago, she's there for me. We are truly blessed and appreciate every day we have with each other.\n\nJoe\t\t\t", "date": "2014-08-18T17:40:20+00:00", "topic": "Here I Go Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRaider,\n\nI can't speak for all, but my first bout with Tis and BCG, I had minimal pain. Once recurrence came on and I went through another full treatment of BCG, the urethral pain was unbearable and pain meds were needed to mitigate.\n\nMy oncologist stated that this is not abnormal, however, does not occur with all patients.\n\nA third, short round (three instillations) were given to me in December (very long story so we won't go there now). I experienced the same pain and additional meds were provided.\n\nIt really didn't do much for my New Year's Eve celebration, I'll tell you.\n\nSo this one person, has in fact experienced this and was explained that one may experience it, but it too shall pass.\n\nHope this has provided to you some insight.\t\t\t", "date": "2014-03-16T16:34:27+00:00", "topic": "Urethral Pain w / Bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCytology results show atypical abnormal cells again. Going to meet my doctor for a consult and determine protocol for this next go around.\nSigh,, hope we can put this to bed. It's been almost two years since initial diagnosis.\t\t\t", "date": "2013-11-05T20:33:03+00:00", "topic": "2nd Screening After 2nd &amp;quot;All Clear&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello All,\n\nIt's been six months since my second time around with this. First screening was difficult in that I had much anxiety. Cystoscopy and cytology both were negative and I enjoyed the remainder of the summer.\n\nNext screening is coming up one week from tomorrow (13-Nov). Looking forward to having this behind me and will Having my Red Sox win the Series helped keep my mind off of things and now I'm just getting my head around it. Does this anxiety ever go away, or is it now simply a pert of my life? How do you deal with this? Any insight would be so much appreciated.\n\nThanks much to all,\n\nJoe\t\t\t", "date": "2013-11-05T20:33:03+00:00", "topic": "2nd Screening After 2nd &amp;quot;All Clear&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks much, Catherine,\n\nWill do. Cystoscopy isn't a concern but more results of cytology. Just a bit shell shocked as a result of earlier this year. But your positive vibes really help, as always. Will be sure to send results as soon as they're received.\n\nJoe\t\t\t", "date": "2013-01-29T17:24:24+00:00", "topic": "Deja Vu All Over Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi All,\n\nFirst screening after my last all clear in May, coming up this Wednesday. Feeling really good and feeling positive as well.\n\nRight after my all clear, my company let me go. What a coincidence. But,, having a great summer and looks like an offer is forthcoming.\n\nMike, any words of wisdom. Haven't heard from you. Let me know you're doing okay.\n\nJoeP\t\t\t", "date": "2013-01-29T17:24:24+00:00", "topic": "Deja Vu All Over Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHow are you Mike? Haven't touched base in a while and wanted to check in. Praying for you every day bud.\n\nBest,\n\nJoe\t\t\t", "date": "2013-01-29T17:24:24+00:00", "topic": "Deja Vu All Over Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAmen George,\n\nMerry Christmas.\n\nWarmest Regards,\n\nJoeP\t\t\t", "date": "2012-12-17T21:01:34+00:00", "topic": "Thank You", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Mark.\n\nI appreciate all the words of encouragement throughout this year.\n\nWishing you and your family the very best during Christmas and the new year.\n\nWarmest Regards -\n\nJoe\t\t\t", "date": "2012-12-17T21:01:34+00:00", "topic": "Thank You", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Alan,\n\nI am. Had one heck of a bleed after another TURBT last month. No fault of residual cancer though. So enjoying the Christmas season.\n\nThanks for asking.\n\nBest -\n\nJoe\t\t\t", "date": "2012-12-17T21:01:34+00:00", "topic": "Thank You", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats to you Maryland Mike. You're a vet, comapred to me. I'm sure your next will prove to be the same results.\n\nJoe\t\t\t", "date": "2012-10-09T19:13:14+00:00", "topic": "Wish Me Luck!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks much Mike. I really appreciate the guidance. Look forward to that time when I feel that way.\t\t\t", "date": "2012-10-09T19:13:14+00:00", "topic": "Wish Me Luck!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks so much. It certainly is a great relief. Now it's time to give thanks, move forward and enjoy this beautiful fall season here in Boston.\n\nI haven't written much during my journey. Trying to keep my head around things was difficult and felt all of you have your own issues and chellenges. But I have come forward for kind words and encouragement a few times and you've always provided.\n\nReading posts have also given me strength to continue on and that is so much appreciated as well.\n\nThank you all , thank God and God bless.\n\nJoeP\t\t\t", "date": "2012-10-09T19:13:14+00:00", "topic": "Wish Me Luck!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat. Thanks all. Obviously, my doctor's opinion is the most important, but it's just as important to me hearing from peers who have marched down this road prior.\n\nI appreciate the quick response from all of you and wish you a great weekend.\t\t\t", "date": "2012-06-07T16:28:08+00:00", "topic": "Wish Me Luck", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTwo weeks since my all clear. I'm feeling great and mentally, doing great as well. No anxiety and I wouldn't expect it but just wondering if may hit me in the back of the head when I least expect it.\n\nI had an \"episode\" last weekend that caused some concern. After a day on the water, came home and rushed into the bathroom. I couldn't believe what I saw. Bright red blook and lots of it. I went into panic mode and called my doctor. Unfortunately I had to wait until Monday but was told this is not unusual after a TURB procedure, even a few weeks out.\n\nHave any of you experienced this as well? It certainly scared the heck out of me. I have a lot of faith in my doctor and believe him but still can't help thinking and thinking and thinking.\t\t\t", "date": "2012-06-07T16:28:08+00:00", "topic": "Wish Me Luck", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCynthia, thanks much for reaching out and for taking it to the next level. I've arranged a meeting with my doctor, scheduled for tomorrow morning, in order for me to put a plan in place, rather than cooling my heels. Please keep me informed as to the outcome of your efforts. Thanks again - Joe\t\t\t", "date": "2012-04-21T13:55:23+00:00", "topic": "TheraCys Shortage?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell. I missed my last treatment today. There is no indication as to when Sanofi will be releasing TheraCys. There is an alternative treatment by the name of Oncotice. Both are interchangeable. I spoke with a rep at Mass General and was told Oncotice is not a solution which is viable for them. How about viable for me?\n\nSo I'm now in a holding pattern with my treatment and follow on care stalled. This is causing me lots of anxiety and am having a hard enough time dealing with cancer, let alone, being held hostage by Sanofi-Pasteur.\n\nDone with my rant for today.\t\t\t", "date": "2012-04-21T13:55:23+00:00", "topic": "TheraCys Shortage?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust got off the phone with Sanofi-Pasteur. It appears as if they will not have TheraCys availability until 07-May. I asked if there was a quality issue to which they replied, \"no issues\".\n\nI've seen a local news report here in Boston stating several pharmaceutical companies are holding back cancer treatment stock, due to decreased profit margin. I asked if this was the case. When I asked the S-P rep if the report was true, she stated that officially she could not answer that question. I asked again and received the same response. Hmmm\n\nSo no availability here at Mass General Hospital. Also, the interchangeable Oncotice, is not on MGH's protocol. And so it goes.\t\t\t", "date": "2012-04-21T13:55:23+00:00", "topic": "TheraCys Shortage?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks all. I guess I'll have to stay on top of the hospital admins and Sanofi.\n\nThis weekend was pretty tough. Ridiculous fatigue and body aches but feeling better now. One to go!!!\t\t\t", "date": "2012-04-21T13:55:23+00:00", "topic": "TheraCys Shortage?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFinally found you, Mike. You're in my prayers every day. You provided me so much encouragement and positive vibes during my two journeys, I'm glad to have found=d you and, again, let you know my prayers and positive vibes are with you.\n\nBest,\n\nJoe\t\t\t", "date": "2013-02-26T23:58:46+00:00", "topic": "Status Updated from Mike (now in the mets section)", "subforum": "7-metastatic-bladder-cancer"}]}