{"signature": ["Dx", "Surgery"], "posts": [{"text": "\n\t\t\t\tWell said, George.  We had the advantage (  ) of having gone through my wife's breast cancer together before I had bladder cancer.  Nonetheless, what you say is true for us as well ~ in spades!\n\nHugs for all,\n\nGordon\t\t\t", "date": "2009-11-09T19:12:07+00:00", "topic": "How do we care for our Caregiver?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNix,\n\nA similar thing happened to me.  It was the antibiotic.  I'd never had a reaction prior, either.  Let your Doc know what happened - for sure.  We changed antibiotic and haven't had a problem during \"procedures\" since.\n\nMy reaction occurred when the antibiotic solution was inserted into a vein.  So, not exactly the same as your situation.  But, I would tell the Doc about it.\n\nHappy New Year.\n\nGordon\t\t\t", "date": "2008-12-31T15:12:45+00:00", "topic": "Yet another BCG question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Pat,\n\n\"I will get tingly sensations in my feet (wierd huh?) and sometimes the tip of my tongue will get sore..\"  What is wierd about your comment is that I have the same symptoms.    Although it's the depression and fatigue that I am concerned about.  I actually had my right foot x-rayed yesterday to see if I had a stress fracture.\n\nThank you for your feedback.  I hope all is well in your world and that your worries become less.  Life would sure be easier if we were only fighting one battle at a time.  Be good to yourself.\n\nGordon\n\np.s. my fingers will be crossed for the next month.  ", "date": "2009-04-13T19:27:11+00:00", "topic": "Re:B12 and amount of intestine used", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat\n\nOK, so what I'm taking away from this is: given that I have been diagnosed with low B12 level and will be taking B12 shots on a regular basis, I should still have my B12 level checked on a periodic basis.  Right?  I am assuming that getting the B12 deficiency detected is the main hurdle.  After that the treatment is pretty standard.\n\nHow long does it usually take to experience some results?  I'm sure it varies, but generally speaking.\n\nSorry if I sound dense on this.  Thanks for your help/efforts.\n\nGordon\t\t\t", "date": "2009-04-13T19:27:11+00:00", "topic": "Re:B12 and amount of intestine used", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs my doctor explained to me, \"the regular blood test will not pick up the lack of B12 until you have a real problem.\"  I had a specific blood test run for B12 info.  Based on that, I would say your doctor's take on the situation is wrong.\n\nPat will be better able to answer this question.  Pat?\n\nGordon\t\t\t", "date": "2009-04-13T19:27:11+00:00", "topic": "Re:B12 and amount of intestine used", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nGK\n\nWe find ourselves in an interesting \"mindset\".  After surgery a close friend told me \"there are now three aspects of cancer that you will deal with; had cancer, have cancer, and living with cancer.\"  I now understand what he meant.  Once you have had cancer, I'm not sure we are ever once again cancer free.  We will always have to live with it.  Do I have cancer?  I really don't know.  Do I live with it?  Sure do  ~  every day.  So are you crazy?  Absolutely not.  You're just learning to live (deal) with the \"new normal\".  Time away from ground zero helps.  But, after four and one half years out from surgery, I'm still living with it. I'm doing much better.  I'm sure you will too.\n\nBest regards on your recovery,\n\nGordon\t\t\t", "date": "2009-01-06T20:24:59+00:00", "topic": "It stays with you forever", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoe, I start year five on September 4.  Congratulations.  I had a neobladder as well.  Gordon\t\t\t", "date": "2008-06-27T19:04:35+00:00", "topic": "I start year 5 today", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoe,\n\nI certainly did not mean to step on your toes. I was simply responding to a person (Mike) asking for input on his decision - an important decision that most of us have faced.  You are not the only person to have faced this decision. Nor are you the first to have \"researched the three main diversions to the T\". Please remember this is an open thread.  If my post offended you, it was inadvertent and I am truly sorry. Given that the thread was some what long and involved several posts, I am somewhat perplexed by your angry response.  In the future if you want to carry on a discussion with a poster in private, I suggest you use email.\n\nYou can be assured I will not respond further to this thread - my dog ain't big enough.  And I sure as hell don't want to get intangled in any threads within threads webs.  lol\n\nGordon\n", "date": "2007-09-04T18:13:48+00:00", "topic": "worried about neo-bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Pat,\n\nI have a call in to my clinic now for their explanation.  Seems like they would do the analysis to check for possible cancer cells from above the bladder, i.e. ureters and kidneys.  Although your explanation makes sense too.  I do recall having tests done post op re: possible infection in bladder, but not the FISH test, etc.\n\nThanks for your quick response.  I'll keep you posted.  \n\nGordon\t\t\t", "date": "2007-06-06T14:51:12+00:00", "topic": "post op exams", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a neobladder installed on September 4, 2004.  Hence, I have had several post op examinations.  I am now on six month cycles.  During these examinations I have had chest x-rays, blood work, and abdomen and pelvic CT scans.  Never have I had any urine analysis work done post op.  I am now scheduled to have my sixth month checkup next week and, once again no scheduled urine analysis.\n\nMy question, is this normal?  Or should I question why this analysis is not being done?\nSeems to me I have read in posts in the other bladder cancer café that they are still having the FISH test done post radical cystectomy / neobladder. .\n\nAny feedback would be appreciated.\n\nThank you,\n\nGordon\n", "date": "2007-06-06T14:51:12+00:00", "topic": "post op exams", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKen,\n\nNoticed that this thread hasn't \"concluded\".  How are things going?  Have you reached the\nnight time continence club?  Last post was 2/17/06.  One comment that caught my eye was\nthe statement about going 5 hours without \"going\".  Hope by now you realize its not time so\nmuch as amount that's important.  If you're going 5 hours and voiding in excess of 500cc that\nain't so good.  350cc to 500cc seems to be the standard maximum goal.\n\nLet us know how things are going.  Hopefully, the goal has been achieved.\n\nGordon\n", "date": "2006-02-25T16:27:42+00:00", "topic": "night time leakage", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\n\n\n\n\n\n\nAt 70 I guess I'm a little old fashion.  I'd want the tattoo in a little less obvious place.    And, maybe with a little more descriptive art work, like a catheter woven around a sword in place of the traditional snake.\n\nBut as you think about this tattoo idea it does have possibilities.  For those of you with stomas, you could have an arrow with a tatto saying \"cath here\".  For those of us with neos, no tattoo necessary or maybe one that says cath in normal manner!\n\nSorry I couldn't resist.  I have a grand daugther of 18 wanting a tattoo.  I keep telling her to think about what that tattoo is going to look like when she's my age and where the tattoo will have migrated to! \n\nOn a serious note, I wear a medic alert bracelet and am a wood worker.  And, the bracelet does get in the way upon occasion and present a hazard around shop tools.  I now take it off when I go into the shop.  So I would consider a tattoo given that it could be done in a tasteful manner and location - which I am sure can be done.\n\nGordon\n\np.s. Why are there two O's in tattoo?  Seems like one would be enough.  ", "date": "2009-05-13T23:57:29+00:00", "topic": "Tattoos being used for medical alerts", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi Pat,\n\nI was wondering when this article was going to hit the forum!\n\nBoy, would I love to get my hands on the orignal research write-up, i.e. sample size, definitions, what's definition of aggressive, populations from which sample was taken, was the sample random, how were the costs calculated, what stat tests were used, etc.!!  If I didn't know better I'd think you included this article to get me to \"chime in\"!  But you know what, by golly, we, now, seem to be more critical when we read these studies.  And, that's good.\n\nThank you for your contributions to the forum.\n\nGordon\n\np.s. One reason for the medicare bias is because that is one of the few good data-bases available - so it really gets \"mined\".  Unfortunately, it really isn't applicable to younger populations.  But, unfortunately, that doesn't seem to stop a lot of the young researchers who have to produce reasearch to keep their jobs.  One man's opinion. mine.  ", "date": "2009-04-14T03:39:10+00:00", "topic": "Here\\'s one ambiguous article", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI remember telling my students that good research raises as many questions as it answers.  Answering the questions leads to a deeper understanding.  Actually, I remember telling them I'm more interested in your questions than your answers because it means you've read the research and question methods, data bases, etc.  Great thread.  Once again I see that the SEER data base was used with the modifier that it was age adjusted.  Hmm I wonder what that means?  Might lead to the point Ann brings up re: age of Maine residents. SEER data base is medicare patients - us old guys & gals.\n\nPat,keep those \"cans of worms\" coming.  They are good worms!  \n\nGordon\t\t\t", "date": "2009-02-09T04:40:53+00:00", "topic": "incidence of BLC by States in 2008", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks, Pat.\n\nSo looking at the SEER data base the authors used for their study we realize the population studied was Medicare patients.  The link you provided had words to the effect and I quote, \"Overview of the SEER-Medicare data: Content, research applications, and generalizability to the United States elderly population\".  The key word being elderly.  If I read the abstract correctly, the data base pretains to the elderly population.  Not that this is not of importance in of itself, i.e. health care for the elderly (especially, since I am a member of that population of interest!!  ) but to generalize to the population as a whole is misleading.  There are bound to be some built in bias in treatment of this population, i.e. treatment of a 90 year old is different than that of a 65 year old.  I received a neobladder at age 65, not so sure I would have at age 90.  I will attempt to follow up on this observation with the authors of the study.  If I am wrong on this point I will certainly report it to the forum.  However, the abstract's statement, \"An explicit review of claims data indicated that between 31.6% and 46.8% of the 6326 bladder cancer deaths identified in the SEER-Medicare data potentially were avoidable\" would seem to support my obseration.\n\nI certainly do not mean to criticize your posting of the study.  And I don't want to make a big deal of this.  I would just like to remind us all of the \"generalizablilty\" of some of the research findings we run across.\nWe have to be careful re: the \"research conclusions\" and general applications.\n\nThank you for your efforts on our behalf. Keep those research studies coming.  I will certainly keep reading them.\n\nGordon\t\t\t", "date": "2009-02-07T17:10:42+00:00", "topic": "Why you might consider where you are treated", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi Jack,\n\nI'll give it a try.\n\nThank you.\n\nGordon\t\t\t", "date": "2009-02-07T17:10:42+00:00", "topic": "Why you might consider where you are treated", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tPat:\n\nI've surfed the UroToday web site and don't seem to be able to see a link to the orignal study.  Can you help in this regard?  Am I just not seeing the link?  This abstract has a distressing conclusion and as an academic who has a background in statistics I would like to study the orignal research report.  I would be interested in more information on the study population, i.e. the difference between \"institutional (n = 126 patients) and administrative (n = 6326 patients) data sources\". In particular does the n to which they refer represent the sample size or the population?  Can the conclusions they draw be infered to the health care of the US popluation in general or just to the specific populations from which they drew the samples?\n\nThe interesting study would be of the \"potentially avoidable deaths from bladder cancer\" group that they discovered, i.e. geographic location, types of MD's, clinics versus individual practice, involvement of bladder cancer with other types of cancer, etc.  For all we know they may have all occured in a specific well known clinic.\n\nWith the generalized conclusion that they drew it would warrant reading the orignal research study.\n\nThank you for directing our attention to research such as this and for your help.  Sorry for such a long post.\n\nGordon\t\t\t", "date": "2009-02-07T17:10:42+00:00", "topic": "Why you might consider where you are treated", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI hadn't been on the site for awhile. So when I returned, I returned to the new look.\n\nI was \"blown away\"!  Great job!  Ease of navigation and clarity are un-excelled. You have all the bells and whistles too. I don't think I have seen a better designed site.\n\nCongratulations on a job well done.\n\nGordon\t\t\t", "date": "2009-09-07T14:57:01+00:00", "topic": "New Look", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSara,\n\nIt could be worse.  You could be in Spokane.  We have over 24 inches of the white stuff on the level.  And, it's still snowing!!  And, as you said we are expecting another storm front to arrive on Saturday.  That storm will have to wait in line because this one is still here!!  \n\nGordon\n\np.s. Sorry this ain't no joke!  ", "date": "2008-12-18T17:09:05+00:00", "topic": "Arrrrrrgh", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGroannnnnnnnnnnnnnnnnnnnnnn   ", "date": "2008-08-24T23:18:41+00:00", "topic": "Tickle Me Elmo", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat \"set-up\", Karen.  Get'em with the lion story. Then, hook' em with the elephant!  The old one two punch.   \n\nHope all is well,\n\nGordon\t\t\t", "date": "2008-07-16T13:45:46+00:00", "topic": "Another Incredible Story", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGosh, do I envy those of you who are experiencing \"spring\".  We woke up to two inches of snow this morning!!  I guess \"Spring\" is relative to where you live; Cleveland, North Dakota, North Carolina, Washington, California, etc.  But I gotta tell you, \"I'm getting tired of thinking of Spring as only a concept!\"   ;D\n\nOnce again, Rosemary, your photos are beautiful.  You live in a special place.\n\nPat, our cherry tree is weeping, too - weeping because we have no spring! And our crab trees are really crabbie.  >\n\nGordon \t\t\t", "date": "2008-04-19T12:05:53+00:00", "topic": "Springtime in my Town", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat is a great joke.  I will use it in the future.  I am an accountant but have a lot of lawyer friends - so am always looking for lawyer jokes.\n\nI'll always give you credit!  \n\nBest regards,\n\nGordon\t\t\t", "date": "2008-04-14T14:42:32+00:00", "topic": "Lawyer Joke &amp;amp;quot; The Generous Lawyer&amp;amp;quot;", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThank you all.  I'm glad you enjoyed the photo as much as I did.  Tis fun to share.\n\nKaren, I use a Canon Power Shot S3IS.  I guess I'm much like a lot of politicians who figure if they talk enough they will eventually say something intelligent!  I figure if I take enough photos I will evenutally have a photo worth while.  The joy of digitual cameras!  This particular photo was shot with a pink filter.  The sun was so bright I was afraid it would \"wash out\" otherwise.  I must have taken 20 photos of that particular sunset.  What a glorious evening it was!\n\nBest regards to all,\n\nGordon\t\t\t", "date": "2008-04-12T03:17:41+00:00", "topic": "reflection", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI guess we all ask the same question, \"what does the future hold for us?\"\nLet's put aside our differences and remember we're all in this together.\n\nImmediately after I took this photo, I asked the young couple if they would like for me to take their photo with their camera.  They said yes.  I hope their photo turned out as well.\n\n\n\n\n\n\n\n\nYoung Love\nCambria\nMarch 2008\n\n\nGordon\t\t\t", "date": "2008-04-12T03:17:41+00:00", "topic": "reflection", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\thmmmmmm  Gives new meaning to the term \"gator aid\"!\n\nSorry, I just couldn't pass it up.\n\nGordon\t\t\t", "date": "2008-04-09T13:59:13+00:00", "topic": "Alligator Blood May Help Fight MRSA", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Zach and Rosemary,\n\nIf we get that far south, Zach, I will be sure to try to contact you.  We are really enjoying the last week's 60+ degree temps.  We love your part of the world.\n\nRosemary those are not bones but drift wood!  They do look like bones don't they?\nActually, I don't think he's too happy.  Rather, he's nursing wounds suffered in a fight with another dominant male.  They fight and the loser then swims off to be by himself.  He was one of two on this very large beach area.  They are very large weighing in the neighborhood of one to two ton - that's a lot of blubber.\n\nHope all is well with you.  We have wireless connection in our home so we are in contact.  All is well.  Although I am back to cathing to void.  I guess I will face the scar tissue removal procedure again upon my arrival back home.  Oh well, life goes on.  Although I wish this new \"normal\" would get more normal.   \n\nBest regards,\n\nGordon\n\n", "date": "2007-07-01T22:35:42+00:00", "topic": "Photos of Nature", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nLook at what I ran into yesterday on the beach.  Having a great time.  Temps in the 70's.  I could get used to this.\n\nBest regards to all,\n\nGordon\n\n\n\n\n\n\n\nElephant Seal\t\t\t", "date": "2007-07-01T22:35:42+00:00", "topic": "Photos of Nature", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary and Zach,\n\nRosemary, hopefully by Monday night we will be in warmer clims.  Would love to see your area of the country some day, especially the outer banks.  I had a friend who lived in your area and he often raved about the beauty of the area. What are your temps now?  Looks inviting.  I am looking forward to being next to the ocean. There is a lighthouse just up the road from Cambria.  I'll post a picture for you.\n\nZach, I've been following your weather.  I see where you got record breaking mositure a couple of days ago.  Obviously some of it was snow higher up. Very pretty - but only if viewed from afar!   We will be in Cambria on Thursday of this week for a two month visit.  Hopefully, the temperatures will be a little more moderate than what we have been experiencing the last six weeks - what a winter.  And, more snow predicted for this PM and night!  I'll have to \"do\" the sidewalks at least one more time before I leave.   >  You can blame your weather on the fact that my wife and I will be arriving in your area of the country soon!!  Gordon's law - like any line I get in, regardless of length, will be the \"slowest\".\n\nBest regards to you both and thank you for the pictures.  I feel better already! Better but not warmer. ;D\n\nGordon\n\nps Thank you both for your contributions to the forum.\t\t\t", "date": "2007-07-01T22:35:42+00:00", "topic": "Photos of Nature", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLynn,\n\nI forgot to tell you how funny I found your haiku and how it reminded me of \"past struggles\".  I had a fellow neobladder friend tell me he didn't think he would ever be able to face egg drop soup again.  It took me a while to figure out what he meant!  But I figured it out pretty fast!   Hence, my ode.  I'm about four years \"out\".  I'm still in the process of writing my book entitled \"bathrooms I have known\".  And its sequel, \"recommended bathrooms along the way\".  I've found Starbucks to be about the best.  Most are fairly new, thus clean, and single with a lock. We gotta find the humor in all this!  And, clean bathrooms!!\n\nBest regards to all,\n\nGordon \t\t\t", "date": "2008-02-09T22:33:12+00:00", "topic": "anyone for haiku?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHow about,\n\n\nSuspended droplets of egg whites\nIn Chicken broth\nI’ll never eat Egg drop soup again\n\n\n\nGordon\t\t\t", "date": "2008-02-09T22:33:12+00:00", "topic": "anyone for haiku?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMax,\n\nWhat a handsome young man!  Aren't grandkids great!!\n\nGordon\t\t\t", "date": "2008-01-24T04:19:37+00:00", "topic": "My Grandson", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nOh my gosh, she is so cute.  She is going to be loads of fun in the years to come.Great photo.  My wallet is \"stuffed\" with photos.   My younger grandaughter is into basketball now.  I enjoy watching her play more than I ever enjoyed playing myself as a youngster.  Older grandaughter is considering universities to attend.  Grandsons are being \"boys\" - a different experience from the grandaughters.\n\nHope all is going well for you.  We are anxiously awaiting departure for California.  It has been unusually cold in Spokane this year.  Night time temps routinely in the single digits.  Time to \"bail\" out!\n\nBest regards,\n\nGordon\t\t\t", "date": "2006-11-20T00:45:31+00:00", "topic": "How to upload photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nI just reread my last post.  I guess it would make better sense if I gave you some background material.  I lost both of my parents last year (2007) - my grandchildren's great grandparents.  It concerned them to see their grandpa cry.  We had to learn that it was absolutely alright to cry and that sorrow shared is sorrow diminished.  Even though the sorrow will never leave.  It is truly a gift to have the love of your grandchildren.  As it was and is to have the love of great parents!\n\nHope this makes sense,\n\nGordon\t\t\t", "date": "2006-11-20T00:45:31+00:00", "topic": "How to upload photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nTears of joy.  Remember, it's our legacy.\n\nI have two grand-daughters and two grand-sons.  Some come down on moon beams - some come down on lightning bolts!  Sex has nothing to do with it!!   My greatest challenge has been to teach them to cry \"with me\".  What a gift.\n\nMy thoughts are with you,\n\nGordon\n\n", "date": "2006-11-20T00:45:31+00:00", "topic": "How to upload photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary,\n\nThank you for your efforts on our behalf.\n\nGordon\t\t\t", "date": "2007-12-03T23:03:29+00:00", "topic": "Congratulations and thanks to Rosemary", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDavid,\n\nGreat photos.  I especially like the stone church door shot ( I'm assuming it's a church  ).  I've done a bit of stone work and really appreciate the random, but yet not, look of the stones. That building involved a lot of work - a pride of workmanship that we seem to have lost. We have a bit of that sort of cut stone brick building on the western side of our United States but not nearly as much as you on the Eastern side have.  There are a lot of beautiful places in this great country of ours - a sense of the unique to each place.\n\nThanks for sharing,\n\nGordon\t\t\t", "date": "2007-12-02T22:23:23+00:00", "topic": "some photos taken in Maryland and Eastern Shore", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tOK, guys & gals.  This is how hot it WAS in Montana this summer!\n\nPicture taken outside of Helena.  Not by me.\n\nAnd, Joe.  I'm not bust'en in on your thread! Just adding enlightenment!  ;D\n\nGordon\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2007-10-30T00:20:57+00:00", "topic": "Fire Photo-Check It Now", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI hope Alice is okay, also.  Alice, you out there?  Let us hear from you.\n\nGordon\t\t\t", "date": "2007-08-27T23:17:10+00:00", "topic": "The Moment", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRosemary - Alice - Wendy - et al,\n\nI ran across this William Stafford poem that I thought applied to us as Bladder Cancer Surviors/Fighters.  Thought you might enjoy/appreciate it.  My \"enjoy those moments in between philosphy\" obviously is not a new view on life.  \n\nHope I'm not being too liberal and \"touchie feelie\" for you all.   ;D ;D lol\n\nA good friend of mine just last week got the \"bladder cancer news\".  I referred him to the home page and forum - and did so with confidence that he would get much better advice than I could give.  Thank you all for your time and efforts on our behalf.\n\nGordon\n\n\nYou Reading This, Be Ready\n\nStarting here, what do you want to remember?\nHow sunlight creeps along a shining floor?\nWhat scent of old wood hovers, what softened\nsound from outside fills the air?\n\nWill you ever bring a better gift for the world\nthan the breathing respect that you carry\nwherever you go right now?  Are you waiting\nfor time to show you some better thoughts?\n\nWhen you turn around, starting here, lift this\nnew glimpse that you found: carry into evening\nall that you want from this day.  This interval you spent\nreading or hearing this, keep it for life—\n\nWhat can anyone give you greater than now,\nstarting here, right in this room, when you turn around?\n\n\nWilliam Stafford ", "date": "2007-08-27T23:17:10+00:00", "topic": "The Moment", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks, Rosemary.  It was really a great experience.  I've \"cropped\" another photo taken\nthe same day and will frame it and place it in our cabin on Priest Lake in Idaho.  I never realized\nhow \"human\" he looks until I posted the photo.  No wonder \"big foot\" lure exists in our area of\nthe woods.   The cropped photo shows more of his front legs.\n\nAs I tell my friends, we have to enjoy those moments in between life's trial and tribulations.\nNature is my escape/passion.  I'm seldom disappointed!\n\nGordon\n\nPS I'm still working on reducing the size of the photos.  Don't seem to be able to get my editor\nto do it - yet.    ", "date": "2007-06-28T00:58:10+00:00", "topic": "A picture that's worth 10,000 words", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSorry for large photo.  I'm obviously doing something wrong.     Darn it.\n\nI go from not being able to post a photo - to having one too large!  Go figure.  Kinda the story of my life.\n\nI'll work on it.  Any advice would be appreciated.\n\nGordon\t\t\t", "date": "2007-06-28T00:58:10+00:00", "topic": "A picture that's worth 10,000 words", "subforum": "17-chit-chat"}]}