{"signature": ["Dx", "Dx", "TURBT", "Dx", "TURBT", "BCG", "Dx", "TURBT", "BCG", "Dx"], "posts": [{"text": "\n\t\t\t\tI am so grateful it was caught as early as it was, which wasn't too too early, it was huge!  Also no muscle involvement but I did have invasion into the subepithelial connective tissue (lamina propria).\n\nI should have taken Latin in  high school....\n\n\nHeather\t\t\t", "date": "2016-07-14T20:00:57+00:00", "topic": "Pathology Report Help", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had needed a catheter for about a week after my second TURBT due to how much was resected and how deep my uro went for a good biopsy.  It wasn't pleasant, but doable. And more important short term!  (Though on the plus side, once I got comfortable on the couch, I was able to binge watch the entire Lord of the Rings trilogy in one sitting while out of work!)  Good luck.\n\nHeather\nDiagnosed 5/25/2016\nFirst cysto and TURBT 5/23/2016\nNephrostomy placement 5/24/2016\nSecond cysto and TURBT 6/20/2016\nPapillary urothelial carcinoma, mostly low grade\nNo stromal invasion, no metastasis\nOriginal tumor size (by CT): 7.3 cm x 4.8 cm x 4.8 cm\nStarting BCG 8/21/2016\t\t\t", "date": "2016-09-06T04:06:20+00:00", "topic": "Doing nothing not an option", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm halfway through my first BCG treatment (had treatment #4 on Wednesday!).  The first two weeks were fine, just some minor cramping the first day. After treatment 3, I was thrown for a loop.  Monster level fatigue, headache, achy all over.  I went to my urologist when I couldn't take it anymore (meaning I couldn't power through and go to work) and he gave me a broad spectrum antibiotic (just in case) and a day of rest. That week's treatment was cancelled due to it, but only for a week.  Urine culture came back negative for bacteria, and I did feel fine in a few days.  I think it just hits some of us harder than others at random times.  Good luck.\n\nHeather\nDiagnosed 5/25/2016\nFirst cysto and TURBT 5/23/2016\nNephrostomy placement 5/24/2016\nSecond cysto and TURBT 6/20/2016\nPapillary urothelial carcinoma, mostly low grade\nNo stromal invasion, no metastasis\nOriginal tumor size (by CT): 7.3 cm x 4.8 cm x 4.8 cm\nStarting BCG 8/21/2016\t\t\t", "date": "2016-09-29T03:14:52+00:00", "topic": "BCG side effects", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAt this point I think my guardian angel drinks heavily.  The good news is that this whole incident has given me the strength to quit smoking, after over twenty years!  3 weeks \"sober\" of nicotine.\t\t\t", "date": "2016-06-08T13:16:56+00:00", "topic": "Just diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had no symptoms, which is the scariest thing for me. No UTI symptoms, no pain, no blood, no difficulties with urinating.  Then I developed a fever I couldn't kick, finally went to urgent care who sent me to the ER with sepsis.  My mom (thank goodness) who drove me told the doctor I once had a kidney stone (years and years ago) so she did an abdominal/pelvic CT that found a huge mass in my bladder.  Thank god for fevers.\n\nHeather\nDiagnosed 5/25/2016\nFirst cysto and TURBT 5/23/2016\nNephrostomy placement 5/24/2016\nSecond cysto and TURBT 6/20/2016\nPapillary urothelial carcinoma, mostly low grade\nNo stromal invasion, no metastasis\nOriginal tumor size (by CT): 7.3x4.8x4.8\nStarting BCG 8/21/2016\t\t\t", "date": "2016-06-08T13:16:56+00:00", "topic": "Just diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had some discomfort after my TURBTs and stent removals.  I found pyridium works well when paired with Tylenol or Advil.\t\t\t", "date": "2016-10-24T19:37:58+00:00", "topic": "Urethral discomfort prolonged after cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt does seem to be a never ending battle.  I had a recurrence after my first cycle of BCG but a follow up cysto after that TURBT (and more BCG) showed no evidence of disease (April 2017).  Fingers crossed that my next cysto in July is also clean.  I think this is something we're always going to have to deal with as long as we have our bladders.  It's an anxiety filled inconvenience that sometimes ends in disappointment, fear and heartbreak but we'll just keep trucking on through.\t\t\t", "date": "2017-04-15T18:19:30+00:00", "topic": "Check up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello!  I was diagnosed last year with a pretty big tumor in my bladder that I had no idea was there.  I promptly quit smoking, changed my diet (less processed foods, more fruits and veggies), joined a gym and make sure I drink tons of water.  They unfortunately found a recurrence six months later after my first course of BCG so changing my diet and habits didn't stop recurrence. However, I feel great!  And my later cycles of BCG (that I'm still doing) have gone much easier because my baseline health is improved.\t\t\t", "date": "2016-12-21T18:54:33+00:00", "topic": "Dietary Considerations", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Donna!\n\nI'd be happy go lucky.  Our high grade cancer can be dangerous, if it invades the muscle layer.  That's why we're checked so often, because it recurs so often (I've had one recurrence so far, luckily STILL not in the muscle layer!). By staying on top of surveillance and treatment, it can be caught early before it mets.\t\t\t", "date": "2017-04-23T23:30:34+00:00", "topic": "More questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBCG is very doable. I'm starting my second cycle next week and while I can't say I'm looking forward to it, I'm not filled with dread.  I agree with the others, water and chicken soup/broth after instillation does wonders.  I always get a huge thing of wonton soup if that's your thing, works great for me.\t\t\t", "date": "2015-08-28T20:55:21+00:00", "topic": "Beginning BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGot the results from my cysto.  Last time I had low grade with focal high grade.  This time around it's classified as solely high grade but still non invasive.  The great news is it doesn't seem to have penetrated to the muscle layer.  All set to start the SWOG protocol in January and my urologist told me (while still pending this report) that we will discuss a more aggressive but bladder sparing treatment at my follow up appointment.  So I suppose it's not all bad news.  Happy holidays everyone!\t\t\t", "date": "2016-11-25T17:07:12+00:00", "topic": "First cysto post BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, that wasn't the news I expected. Or even hoped for.  One cycle of BCG in the bag, first cystoscopy after and what do we see?  Tumors.  Right before the holidays too, worst time for such news.  I guess I'm lucky in the fact that I have no symptoms (much like last time) and these tumors are comparatively small compared to my first one (which is good!), and TURBT has been scheduled.  So we have a battle plan.\n\nJust depressed that I'm not done with this, not by a long shot.\t\t\t", "date": "2016-11-25T17:07:12+00:00", "topic": "First cysto post BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a very large bladder tumor (required 2 TURBs to remove), and am half way through my first cycle of BCG (not as bad as I thought it would be).  My pathology report noted that though 95% was low grade, I had focal high grade features as well which can indicate higher chance for recurrence.  I'm also 37, there might have been the instinct to do anything so I can keep my bladder.  It's a conversation between you and your doctor because there are so many factors that go into recommending a treatment.  Good luck.\n\nHeather\nDiagnosed 5/25/2016\nFirst cysto and TURBT 5/23/2016\nNephrostomy placement 5/24/2016\nSecond cysto and TURBT 6/20/2016\nPapillary urothelial carcinoma, mostly low grade\nNo stromal invasion, no metastasis\nOriginal tumor size (by CT): 7.3 cm x 4.8 cm x 4.8 cm\nStarting BCG 8/21/2016\t\t\t", "date": "2016-09-29T18:30:48+00:00", "topic": "BCG with Low Grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi everyone!\n\nI was diagnosed with bladder cancer in May and had cysto with TURBT #1 a week later.  It was a huge huge tumor, stayed in the hospital for a few days with a foley catheter, they removed the catheter prior to discharge and I had no issues.  I had TURBT #2 on June 20 where they removed the rest of the tumor.  I did so \"well\" during the procedure and there was less tumor to take out this time, so I was discharged home that day with  the foley catheter.  I passed my voiding trial four days later, so the foley got to stay out.\n\nNow I'm having bladder spasms if I don't immediately go when I have the urge (and sometimes it's not an option, meeting at work, driving, etc) but luckily no incontinence.  The spasm persist for an hour or two after.  It's not painful, just annoying, especially when I try to go to sleep.  Pyridium helps to a certain extent and my urologist says my bladder is still healing.\n\nAny tips for bladder spasms?  Dealing with them or avoiding them? (Other than pulling over to the side of the road and just going whenever the urge hits!) I'm scheduled for BCG x 6 weeks starting next month and I've read spasms can be a side effect of that too!\n\nThanks!\n\nHeather\nCysto # 1 May 23 2016: Lowgrade papillary urothelial carcinoma 9cm x 8 cm x 2 cm\nCysto #2 June 20 2016: Low grade papillary urothelial carcinoma 3.5cm x 3.5cm x 0.4 cm, no muscularis propria invasion, no lymphatic vascular invasion, focal high grade nuclear feature which account for less than 5% of the tumor\t\t\t", "date": "2016-07-15T20:31:11+00:00", "topic": "Spasm?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI started attending a support group facilitated by The American Cancer Society/Hope Club (used to be known as Gilda's Club).  First  few weeks were great, met a nice group of people at different stages, all but me were breast cancer.\n\nThen last week we had a \"new\" member (she comes on and off apparently, none of us there remembered her) so she asked the ice breaker question \"What brings you here?\"  I'm sure she's a nice person outside of cancer, and might be coming from a place of anger (just ended chemo for breast cancer, cue ball bald, and all sorts of side effects), she still went out of her way to make me feel \"not cancerous\" enough!  Like it's my fault that I won't have systemic chemo. It's my fault my tumor was smaller than hers and in a different place.\n\nDoes anyone else ever get that static?  That because we might not look \"cancer sick\" as soon as they do, somehow we're a lesser cancer?\n\nHeather\nDiagnosed 5/25/2016\nFirst cysto and TURBT 5/23/2016\nNephrostomy placement 5/24/2016\nSecond cysto and TURBT 6/20/2016\nPapillary urothelial carcinoma, mostly low grade\nNo stromal invasion, no metastasis\nOriginal tumor size (by CT): 7.3 cm x 4.8 cm x 4.8 cm\nStarting BCG 8/21/2016\t\t\t", "date": "2016-09-30T17:14:33+00:00", "topic": "Pet Peeves on Support Group", "subforum": "17-chit-chat"}]}