{"signature": ["Dx", "TURBT", "Dx"], "posts": [{"text": "\n\t\t\t\tI received my first surgery in February 2019. I received my second muscle biopsy in March 2019. The diagnosis is that I am high-grade, minimally muscle invasive. That was followed by six weeks of BCG. Three months later I receive three rounds of BCG. After that the shortage resulted in not receiving additional BCG treatments.\n\nI am on a regimen where I receive a cystoscopy every three months. The last one was inconclusive. Unless something shows up in my system allergy, or cytology, there is no plan for additional BCG treatments. My next one is in April.\n\nI find that I live pretty easy until about two weeks prior to the\nnext cystoscopy at which time I get anxious about the next one.\n\nFor me, it’s an ongoing wait and see.\n\nGiven the circumstances, I think the best that we can do is learn to be emotionally/mentally healthy, and  try to live and eat healthy, and carry-on with our lives.\t\t\t", "date": "2020-01-31T03:23:34+00:00", "topic": "Question Re BCG shortage", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tjchammond,\n\nIf lack of control is an issue-I would suggest that you consider listening to or reading a book on mindfulness.   Quite by accident, not understanding what mindfulness was, I found a book entitled “the untethered soul“ thinking it was a mindset book. Five minutes in I realized that it was anything but, however subject matter has changed my life in those around me. What I learned from this book, and other readings and listenings on mindfulness has enabled me to live in the now  instead of the past that I cannot change or the future that may never arrive in the same fashion that my mind makes it out to be.\n\nThis allows me to always be in control.   It was my mind that was out of control, not the circumstances around me. Now that my mind has been subordinated to me-I am very very free. Go to Audible, get the book, and give it a listen. I hope that it is as life-changing for you as for me.\t\t\t", "date": "2019-02-10T18:01:29+00:00", "topic": "Low Grade First Diagnosis - Second Found after 15 months", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJchammond,\n\nYou are in our thoughts and prayers.  We are with you in this.  Be blessed and be strong.  This may be inconvenient but it does not have to be life threatening -  I have to reassure  my wife and kids frequently.  It’s hard being the strong one when you don’t feel strong - but you can do it.  Be strong for yourself and the family will follow.\t\t\t", "date": "2019-02-10T18:01:29+00:00", "topic": "Low Grade First Diagnosis - Second Found after 15 months", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWOJOS,\n\nI agree with Jack, that until the tests are complete, and the results are in ( and sometimes even then) spending too much energy on what ifs are unhelpful.  A little over a year ago, I stumbled across a book titled “The unteathered soul”.  I’m in the sales business, and was looking for books on mindset and ended up on this title which is about mindfulness. Curious about what mindfulness once I Purchased the book and begin reading. It has changed my life, and the lives of several around me.   In a nutshell, and in a way that this book is masterful at explaining, mindfulness is about living in the now. Doing so frees you from the pain and agony of living in the past which cannot be changed, for the future that is not here and may not arrive.  I highly recommend a book, and I actually believe the audible version might be more impactful than their written version. I’ve went through both.\n\nSo, armed with the prospect of mindfulness, I did spend a lot of time researching bladder cancer. I did it in a detached manner, Like any other research project I might undertake, without forecasting any particular experience that I may or may not actually experience.  Mindfulness,keeps me calm and whole.  The research allowed me to follow along in the tests, and conversations without asking some questions ( because I really did understand) and asking detailed, 2 and 3 level deep questions in other areas.\n\nIf you can live in the moment - you might similarly benefit from taking this on as a research project.  If it gets to you, I would look for someone to study and advocate for you, or just wait it out. I can say for sure, there is no benefit owning an outcome that isn’t here now.\t\t\t", "date": "2019-02-10T20:22:38+00:00", "topic": "questions about my wife please help", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJjbrown,\n\nI think I would if I were you.  Start with a robust internet study.  You can find information on various reputable cancer sites - and lots of additional info on dietary sites.  I suspect there is lots of misinformation out there - so be super critical anywhere you find info.  Most dieticians still adhere to the FDA food chart which I’m convinced is responsible for the rise in diabetes and obesity in the nation.  Whether or not the heavy intake of starches and sugars actually feed cancer is something I’m still researching.\n\nI learned in the preop work up that my blood glucose level is a couple points away from being labeled pre-diabetic, and slightly elevated blood pressure.  So while I’m focused on health and longevity - I’m including diet to fight all three symptoms.  I’m reasonably set on a ketogenic diet for sugar, weight and blood pressure - still researching its effects on cancer.\n\nOnce I am a little more informed, I’ll ask for a referral to a dietician that is not overly conditioned by traditional fda diet guidelines\t\t\t", "date": "2019-02-11T05:58:35+00:00", "topic": "Recently diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPoptime,\n\nI am sorry about your recent diagnosis and experience .  I am in the earliest stages of walking this out as well.  I was/am oddly calm about the long term treatment plans and longevity prospects.  But I still have a fair amount on anxiety over all the procedures that take place in urethra .  I had convinced myself that I would consume a Cannabis edible or bowel prior to any non hospital visit if I knew they were going up there.  I just returned home from spending a week in the hospital having my bladder continuously irrigated.  This is done via a very large catheter that contains three tubes,  one to pump fluids in, one to drain fluids out, and one ti inflate/deflate the retaining balloon.  This was placed after a shot of morphine which didn’t seem to help at all.  I am still very sensitive there.  So my anxiety remains pretty high.  My plan is to self medicate as mentioned above if I can pull it off.  I’m not real experienced with pharmaceuticals - but if you are, and think a Xanax will calm you down iwould pursue it.\n\nGood luck, get a plan in place with goals, then work the plan.  Don’t ignore diets role in this - lots of dietary things can promote or retard cancer cells.  I just hit Ketosis and am bringing my blood glucose and sugar level way down to attempt to starve the cancer.  I let the docs do their bit with poison and scalpel while I work on diet and a positive outlook.\t\t\t", "date": "2019-02-11T05:58:35+00:00", "topic": "Recently diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\t2/8. I’m home!  We timed the removal of the cbi cath around my morphine.  I urinated within the first 30 min and there was zero pain,\n\nThe rest of the day was one of watching news and frequent urinations while waiting for the urologist rounds. I passed a  few clots and had some pink bowls, but otherwise healthy urine.\n\nThe urologist that specializes in cancer visited me.  The plan is another TURBT in 4 weeks to confirm the stage and rule out stage 2.  Stage 1 treatment plan calls for multiple rounds of bcg, an induction round and maintenance rounds with frequent cystoscopies to catch reoccurrences early.  Stage 2 is more radical - a course of chemo (i didn’t write down how long) followed by bladder and prostrate removal.  I do t need further details on stage 2 - I’ll cross that bridge when and if I get there.\n\nOnly real downer was learning that there isn’t enough bcg to go around right now (2/2019). i hope the supply chain rights itself quickly.\t\t\t", "date": "2019-01-07T15:46:33+00:00", "topic": "New - blood in urine - waiting for more diagnostics - love some guidence", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey everyone,\n\nThis is a continuation of my journey  that begin on January 1, 2019.  after three full days of laying around recovering, I went to work the day after my last post (2/5).  That morning I noticed an ache in my lower right back. It reminded me of the same ache I had on January 1 when this whole saga begins. At this point I was peeing very light pink to clear and felt that my healing is progressing well.\n\nMidway through the day  my frequency and urgency increased and around noon I filled the bowl with bright red urine. That continued for about an hour and a half so I called my urologist and spoke with the physicians assistant. I was told that the urgency, the frequency, and the color we’re all consistent with the recovery, and that I could pick up an over-the-counter medicine (AZO)  that would help with the urgency and frequency.\n\nReassured, I worked another couple hours, rushing back-and-forth to the bathroom when on my last visit before deciding to go home I noticed that my output had reduced to a trickle.   On the way home (a 20 minute drive) about halfway there, I had a sudden urge and decided to just wet myself and clean up when I got home. And so it felt like I Peed and Peed and Peed. When I got home I rushed into the bathroom only to find that my underwear was dry save a few drops of blood. The next two hours  were agony as I tried unsuccessfully to void. At My wife’s suggestion I got in a warm bath but that didn’t help either. Afterr waiting an hour for the emergency standby doctor to give me a call, I was instructed to go to the ER where I remain still.\n\nWhat I’ve learned is that my bladder had likely shed a scab or produced enough blood to clot my urethra. At the ER  I received a catheter where they drained over 1000 mL of urine. I cannot tell you the relief I had once my bladder begin to empty. My urologist instructed the hospital to admit me and keep on a constant bladder irrigation to help heal the surgery wounds and to ensure that I did not clot again. I went in  on a Tuesday evening about 10:00 o’clock, and it’s now Thursday at 11 o’clock where I’m recovering nicely. Tomorrow the foley will be removed and once my bladder wakes up and demonstrates that I can void I’ll be able to go home.\n\nWhile here, I met another physician in the urology group that told me that my pathology results were in.\n\nHigh-grade papillary urothelial carcinoma, superficially  invasive.\nMuscular areas propria not present.\nTumor staging: pT1.\n\nThe pathology department remarked that there was not sufficient muscle to test. The urologist explained that there’s a fine line between risking a perforation and collecting enough tissue and that it was a judgment call. They would often error on going back for a subsequent trip rather than risking opening up the bladder in the event that it’s full of cancer cells.\n\nI will be assigned to a new urologist in the group, one that specializes in the oncology side of things that will be my partner for the next several years depending upon the length of the treatment plan.\n\nI am already greatly encouraged at a level of communication that I receive every day from their visits. I know that I’ll go back in  six weeks to do another biopsy. The plan this time is to send me home with the Foley to avoid ending back up in the ER due to a clot.\n\nAt this stage of my journey-the  anxiety, and drama are over. I’ve done sufficient research to feel reasonably confident that I still have a long life ahead of me even if it’s perhaps going to be less convenient than before.\n\nA lot will depend on the biopsy in six weeks-but I’m not going to own an outcome that is six weeks away. I’m going to deal with what I have now.   My next appointment will be with the urologist that specializes in the treatment of bladder cancer, I’m confident that we will work out a plan that will give me a high quality of life. I will trust his poison and scalpel and my focus on diet to reduce either the reoccurrence, or the severity of a reoccurrence. I’ve learned that bladder cancer, like skin cancer, has a better than 50% chance of reoccurrence.   but I’ve also learned, that with diligence and catching it early that is highly treatable with side effects that are reasonably manageable.\n\nI will come back and clean this post up with an edit later. At the moment I’m still at the hospital, doing this on my iPhone, unable to sleep.\n\nTomorrow I go home-it’s going to be a great day.\t\t\t", "date": "2019-01-07T15:46:33+00:00", "topic": "New - blood in urine - waiting for more diagnostics - love some guidence", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tjigStep,\n\nThanks for the update.  Misery loves company.  Today is my 3rd full day out of surgery.  I put underwear on to see if I can tolerate it - I'll work from home today, and if I tolerate the clothing head to the office tomorrow.   ITs good to know that the initial experiences aren't a 100% forecast of future experiences.\t\t\t", "date": "2019-01-07T15:46:33+00:00", "topic": "New - blood in urine - waiting for more diagnostics - love some guidence", "subforum": "3-newly-diagnosed"}]}