{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tHi Shacky73\n\nI opted for the illegal conduit and bag as the operation time is way less, the recovery is quicker and there is no issues with leaks or training the new internal bladder. I'm 70, my surgery took 4 hours, was in hospital 12 days due to a bit of infection associated with urethra removal so could have been out sooner. I have a fantastic Stoma therapist; it's the nurses and Stoma therapist who are key to recovery. Getting back on my feet and walking ASAP was the best thing to do from day 4 after the epidural was removed. I only needed opioids for a few days and then Panadol handled the discomfort/ pain after that. The bag is fine, belonging to a Stoma group helps with tips and plenty of people play golf with a bag no problem.\n\nJacko\t\t\t", "date": "2020-04-22T18:21:18+00:00", "topic": "Urethra Discharge 6 weeks post BCG Induction", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Shacky73\n\nI was diagnosed with CIS (T1), had 6 plus 3 BCGs, no discharge but recovery became increasingly tough. 6 months later the CIS was back. An RC was a no brainer. The silver lining was that post op pathology revealed extensive prostate cancer. All was contained within the removed bits and pieces ( including my urethra, ouch!) and so no need for chemo. So glad I had it done. 6 months out and I'm back to normal apart from peeing through a piece of intestine into a plastic bag. That's a dream compared to living with a hand grenade for a bladder.\n\nJacko\t\t\t", "date": "2020-04-22T18:21:18+00:00", "topic": "Urethra Discharge 6 weeks post BCG Induction", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Stephanie\n\nI had my bladder, prostrate and urethra removed at the end of Oct 2019. I am 70. I chose to have the conduit and external pouch solution to minimise time under anaesthetic, complications and speed up recovery. Wasn't a hard decision; all the above are more important to me than body image. I was in hospital 12 days which contributed to a speedy recovery and easy transition to home life. My surgery took only 4 hours. In hospital I developed a good relationship with my stoma therapist. She helped me develop confidence in changing my pouch and learning night bag skills ( important for a good sleep). I saw her every week for a few weeks until my the size of my stoma reduced to its normal size and I had confidence to change my pouch and order supplies without any issues. My wife is not a nurse but she took care of my needs and made sure I was comfortable. I could shower myself and went walking everyday, building up my distance over a few weeks to about 5km a day. I took Panadol for about six weeks for pain medication with a few opioids early on. Didn't drive for 6 weeks. Didn't want to. One month out I reckon I would have been OK on my own, perhaps sooner. Biggest issue health wise after pain control was getting the bowels working. That took a lot of care but with the right preparations I got there after about six weeks.\n\nOf course I had no chemo thankfully.\n\nHe will go well especially if he is stubborn! It's a tough gig, not for the faint hearted but now 6 months out I'm back to normal apart from peeing through my intestine into a plastic bag! Best thing is I get to stay in bed all night without any trips to the bathroom!\n\nJacko\t\t\t", "date": "2020-04-23T06:20:25+00:00", "topic": "Caring for my dad... how do I prepare?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tUnfortunately for you I seem to be your only responder; it would have been good to get alternate views. I know there are many with the other type of diversions who would sing their praises. My reasons for the iIeal conduit were my age and speed of recovery. You will feel vulnerable and out of your depth for a few days but if you have a good stoma therapist they will increase your confidence in managing your stoma and appliances.\n\nGetting used to sleeping with the night bag requires a bit of trial and error. I'm reluctant to share this as it sounds involved and complicated, but if you like your sleep you will thank me later. It won't mean anything yet but here are my tips for a good night sleep. (The therapist is unlikely to have learnt this bit)\n\n1.You will probably be sleeping on your back until it's comfortable to sleep on your right side, the stoma side. Won't take long.\n2. Have the night bag as low as possible. Mine is lying in a plastic box next to the bed.\n3. Make sure that the pouch is 1/3 to 1/2 full before connecting up the night bag pipe. After connecting you will turn on the tap to allow your pouch to empty into the night bag. This primes the system and removes any air locks, and causes a slight vacuum in the pouch. Use an elastic velcro strap to loosely tie the pipe to your right thigh.\n4. As you lie on your right side the slight vacuum helps any further urine to drain through the pouch down into the night bag. It took me a while to get this right so the pouch used to fill up without draining to the night bag and i had to force it through several times during the night. Depending how much I drink there is usually 1.5 to 2 litres in the bag in the morning and the pouch is empty. I'm pretty dehydrated in the morning.\n5. Just after waking is the best time to change the pouch as the stoma is still waking up but it can still trick you!\n\nI know it sounds daunting and it is for a few days but its a dream compared to weeks of 'training' the artificial bladder solutions and still having to get out of bed during the night.\n\nYou should be able to return to sport especially if you use a special belt to hold the pouch.\n\nTake care,.Grace and Peace to you and your wife.\t\t\t", "date": "2020-02-11T14:38:07+00:00", "topic": "Plasmacytoid tumor in a diverticulum", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Shacky 73\n\nAn easy decision for me, I went for the stoma and external pouch. Several reasons:\n1. I'm 69 and body image is no big deal for me, I can still swim in the sea if I detach my pouch and wear a T shirt. Having said that I understand why body image might be a problem for others. The pouches are almost undetectable and clothing choice helps; tight jeans are out!\n2. Main reason was less complications during the surgery and after. The internal diversion solutions sometimes can give problems which are a nuisance to deal with. I didn't want any of that; have the surgery and get back to normal life ASAP was my aim. I have had a dream run in recovery and manage the urostomy without any issues. True, it's a new normal but my wife and I have got over it reasonably easily.\nHappy to discuss further.\n\nJacko\t\t\t", "date": "2019-12-17T20:09:20+00:00", "topic": "Choosing Radical Cystectomy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi gqkandrk\n\nI think we are bladder buddies in some respects; I am 8 weeks out from having my bladder, prostate and urethra removed. I'm 69 and reasonably fit and lean.\n\nI was diagnosed with CIS in June 2018, had 2 TURBS, 9+3 BCGs by Feb 19, was OK until Aug/Sept 19 when the urine samples and biopsies showed a return and that it was in my urethra through the prostate area. I still had no 'invasions' into the bladder wall but CIS is a bastard and can soon get out of control. A second round off BCG has even less chance of being effective and how do you treat the urethra with BCG failing clamping off the end of the penis?!! So the decision was easy for me; 'if in doubt cut it out!' because if it reached the prostate it becomes an immediate Stage 4 situation.\n\nPost operative pathology showed CIS was everywhere in the bladder and that I had bad prostate cancer though it had not escaped. (I had not been able to keep up with PSA tests during all this time to check my prostate because BCG messes with the tests). Unfortunately there is some evidence of CIS in the lower ureters which will have to be monitored. All this shows how aggressive this stuff is and vindicates the decision to go ahead with removal. If I had made that decision in June 18 maybe my ureters would be safe now, who knows?\n\nIn summary, I have had no doubts about my decision; 8 weeks out and I'm feeling OK. I can describe my experience in the first few weeks post the operation another time if you wish and what was helpful and what wasn't. Suffice to say the Docs know all about cutting you up and sewing you back together but it is the nurses who give you your life back.\n\nCome back if you wish.\n\nMel\t\t\t", "date": "2019-12-17T20:09:20+00:00", "topic": "Choosing Radical Cystectomy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThankyou for all the comments here, very helpful.\n\nMy experience here in Australia has been similar. After the 2nd TURB necessitated to clarify the extent of high grade CIS the pathology indicated Stage 1. However the oncologist was concerned about the extent of CIS and explained that an extremely radical approach would be to go for removal. Having said that, he did say that post operative investigations on removed bladders indicate that in 50% of cases there had been no need for removal. His comment on BCG was that it had an excellent chance of success with only a 35% chance of some recurrence in 5 years. (Normally 25% but my situation seemed to be worse). He consulted his peers and they collectively recommended BCG plus a comprehensive and frequent monitoring program. Following 2 TURBS and 9 BCGs I have since had 2 scopes over 6 months both showing no active cancer. I will have another scope in Aug and 3 more BCGs in Oct.\n\nHis comment on removal, due to my interest in the 'final solution', was that a second opinion would be great BUT BEWARE WHO GAVE IT. He warned that sadly there are some who would jump at the chance of a privately insured patient to practice their surgical skills at my expense and leave me with life changing results albeit with no cancer. Being UK trained he said he took his Hypocratic Oath to 'do no harm' seriously, and would only advise BCG in my situation. I shall ever be grateful to him.\n\nJacko\t\t\t", "date": "2019-06-09T21:19:42+00:00", "topic": "You need to be sure that you are seeing the right medical doctors", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\ttv rocky\n\nApologies I should have said 'ONE of the indicators for seeking advice/assistance is body temperature' There are of course others.....\n\nJacko\t\t\t", "date": "2019-03-17T13:56:21+00:00", "topic": "BCG Treatments", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSounds good tgrocky.\n\nMy first three BCGs went pretty much as your first in terms of after effects. From 4 to 6 I noticed a slight increase in tiredness which became cumulative; lasted a day or two. The cumulative effect  continued into the maintenance BCGs 7, 8 and 9. Nothing taxing; I could have done a quiet days work the following day if necessary. The indicator for seeking assistance with after effects is body temperature so I monitored and recorded mine every couple of hours. Here in Oz we are instructed to seek medical advice/assistance if your temp reaches 38 deg C (100.4 (oF)). Mine reached 37.9 (100.2 (oF)) after 4 hours post release and then was back to normal within 24 hours.\n\nI also had some bleeding after the catheter went in; noticed as the bladder drained into the bag before fluid insertion. Normally if that occurs the procedure is halted as the risk of the bacteria entering the system through a wound is higher than otherwise. The first time it happened at No 2 we halted. Then at the No 2 re run I bled again. The nurses rang the Uro for advice which was 'the risk of not proceeding is greater than the risk of proceeding' (referring to the risk of the cancer growing) so on we went with no after effects other than described above. I bled for No 2, 3, 4, and 5 with no particular problem with after effects.\n\nTiredness as an after effect is a sign that the body is concentrating its efforts to fight the invading 'diseased' fluid and associated cancer so in a perverse sense it is a good thing.\n\nKeep your chin up, stay positive and rejoice that you are doing some thing positive to retain your health.\n\nJacko\t\t\t", "date": "2019-03-17T13:56:21+00:00", "topic": "BCG Treatments", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSirael2003\n\nI had my first TURB 18 June 2018 after one heavy episode of bleeding with follow up urine samples showing cancer. It was a shock to hear that I had one Carcinoma Insitu tumour. The Uro also took biopsies from all around my bladder and reported that there were cancer cells everywhere.....but only one tumour which he dealt with. So its appears to be not unusual to go looking for other signs of cancer by taking biopsies from other areas of the bladder. His actual words were 'I have never seen a bladder like yours before' relating to the multiple positive biopsies for cancer he found during the first TURB. As it was a high grade cancer he followed up with a second TURB six weeks after the first, as is normal practice, so as to check on any regrowth/rate of regrowth etc. I was a line ball case of BCG or bladder removal. The consensus was give BCG a go and so we did. After 6 sessions a further inspection revealed no malignant cells. I am now onto 3 maintenance sessions.\n\nUros can be somewhat perfunctory in their dealings with us which leads to some angst. We persisted in asking questions and he got the fact that he needed to go further than just 'trust me'. That was a turning point and since then and by filling in the ever decreasing blanks with forums like this I feel I know where I'm going and to a certain extent, using the forum, who is going with me.\n\nKeep your chin up.\n\nJacko\t\t\t", "date": "2019-02-25T23:39:34+00:00", "topic": "Questions after TURBT.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Alan, very helpful. Three hours to go before my last session, I can already feel the catheter negotiating the narrow passage close to my prostate, ouch!\n\nJacko\t\t\t", "date": "2019-02-24T19:27:59+00:00", "topic": "BCG Aches and Tiredness", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Regor\n\nThanks for the reply; we should keep in touch. I see the Uro on Tuesday next week and so will report after that. If the tissue pathology comes back negative then that's good but where are the cancer cells coming from? Or is it a second false positive? He doesn't think so. All very interesting. Look out for a post from me next week.\t\t\t", "date": "2019-10-01T09:27:44+00:00", "topic": "How effectiveness is BCG if High Grade CIS returns?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi all,\nI was diagnosed with High Grade CIS in June 2018; had 2 TURBS followed six weeks later by 6 weekly BCG treatments in Sept/Oct. The cystoscopy/cytology in Dec 2018 showed all was clear and so I had 3 maintenance BCGs in Feb 2019. In May 2019 the cystoscopy/cytology was all negative; the suspicious area was pink. My next inspection in Aug had showed 'negative' for tissue samples but one 'suspicious' urine sample with the suspect area looking red so we have just completed the process on 30 Sept. This time the cytology shows 'positive' for cancer cells in one of the 3 samples, the tissue pathology still to come. The suspicious area was back to red. My Uro thinks that the cancer has returned....to be confirmed by the pathology. He took bladder and prostate lining samples this time. (My PSA is in normal range but this type of cancer can attach to the prostrate lining.)\n\nMy Uro's assessment of the effectiveness of BCG in a case of returning case of CIS is that it is only 20% effective. If we try it is 15 weeks from now, with standard waiting times, before we can go back in and see if I am in the 20% of lucky ones. He is concerned that might be too long and has mentioned the radical solution.\n\nMy question is; do any Forum members have any experience of the effectiveness of BCG following the return of CIS?\t\t\t", "date": "2019-10-01T09:27:44+00:00", "topic": "How effectiveness is BCG if High Grade CIS returns?", "subforum": "6-men-and-bladder-cancer"}]}