{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tI try and keep a diet with plenty of vegetables and fruit that are deemed \"anti-oxident\". There are a lot of websites with the appropriate information. I also take an anti-oxident vitamin pack I picked up at Walgreens. I mentioned it to my Doctor and she said it was ok. I figured it can't hurt.  ", "date": "2008-07-21T12:33:23+00:00", "topic": "Vitamins and nutrition", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's cool. I had mine in March with the same glad results. Good luck.\t\t\t", "date": "2010-05-05T02:00:29+00:00", "topic": "Maybe a little good news - 2 yrs all clear", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, I can do an emergency repair in 10 minutes flat now. I am pretty religious about changing within 4 days. Some guys go longer, but that is just me. I drove 4 hours to a meeting, pulled up to the hotel and 'whooosh' it bottomed out. It was a scramble, with wife helping, but I made the change in the hotel lot and was ready to go in 10. I have leg bags, but have never tried them. I might on the next trip, except I am usually in shorts and it extends down to my knee.\t\t\t", "date": "2010-05-06T20:46:50+00:00", "topic": "Ileal Conduit", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt's been over 2 years and no infections or problems yet. Only problem I have is letting the bag go too long. I keep a change of clothes with me with wipes, new bag and seal, powder, at all times!\t\t\t", "date": "2010-05-06T20:46:50+00:00", "topic": "Ileal Conduit", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would think there aren't any grave time issues and 8 weeks of further treatment at stage 1 is do-able. Then a few weeks of monitoring to see if any recurrence. Generally, the RC is recommended at stage 2..muscle wall invasion. At least it was in my case. Did you discuss with the Mayo Dr the recommendation of 8 week regimen of miomycin? Is the Mayo Dr saying there is urgency? Those are the things you have to know at this point.\t\t\t", "date": "2010-05-15T14:02:05+00:00", "topic": "Confused", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI underwent my RC in April, 2008 and had the ilial conduit. It works well and you can get a lot of help in here if you choose it and need information. The stoma nurses at the hospital can also give you information before you decide. I can do my work, which consists of some physical activity, swim, and am pretty much doing what I did before the operation. I change my bag every 5 or 6 days. I drain it maybe every 1-2 hours and have a night bag for collection during the night. I have had no complications. Usually, I don't know I am wearing it. To get down to the nitty gritty, I think it is a very important decision. I have seen a lot of successes with the neobladder in here and some not so successful. I think if you are young you should have the neo. There is a cosmetic component. The sex thing would tie into that. Otherwise, it is the same, probably no erections without medication. I am 65 and after a year of cystoscopes and other probing,  I didn't want to see another thing up my urethra. Maybe this is short-sighted. But that is the decision I made. Good luck with what ever route you take.\t\t\t", "date": "2009-08-07T01:47:35+00:00", "topic": "For George to illiot of neo that is the question?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks guys. The worst is over at this point, and our lives have changed forever. But, the disabilities involved are at least manageable. So we can be thankful for that. Of course, I have a wood desk I knock on too.\t\t\t", "date": "2009-05-04T01:25:13+00:00", "topic": "I\\'m new at this nasty disease", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's interesting Barbara, my experience was similar. I had my RC in April, 2008 and had healing problems. Had another operation in September to clean it out, and it healed in a few more weeks. I have an ilial conduit as well.\nMy two subsequent scans, the last being in April, came out negative. I don't have any other problems at this time. But what a long strange trip it's been!\n\nJeff\t\t\t", "date": "2009-05-04T01:25:13+00:00", "topic": "I\\'m new at this nasty disease", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt took me longer due to wounds not healing. But I finally got normalized after 6 months R/C (04/28/2008). I have an ilial conduit. It has still taken me a few more months to feel 100%. I have been in the pool a few times and no problems. I have one of those rubber corsets you can find online, and that works great, keeps everything from floating around and looks better.  I'm 65 and pretty much a couch potato, so maybe that is why things have taken longer to come around. But my recent scan was clear, and am hoping everything stays this way.\t\t\t", "date": "2009-05-06T23:37:59+00:00", "topic": "Had RC and Prostate Removal Surgery April 30th.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t[b]How fortunate so many of us are to have these life-giving options available to us. Not so long ago, the results would have been far different.  This is so much more apparent during the holiday season when our family and friends gather around us. Happy Holidays everyone.  [/b]\t\t\t", "date": "2008-12-22T22:42:37+00:00", "topic": "The Holidays", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo far clear since my 04/08 bladder removal. I do have scans coming up in February. But I feel a lot of fatigue, never really up and going, have to force myself. But I am type 2 diabetic too, and that is a factor. Also take meds for muscle pain at night. That probably works into it as well. Good luck, sounds like things are under control for you.\t\t\t", "date": "2008-12-16T14:11:26+00:00", "topic": "Late effects from chemotherapy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am pretty well used to my ilial conduit system now. I found some full elastic waistband khaki's at JC Penney's, with NO beltloops. They look pretty good. With suspenders I do a pretty good imitation of Steve Urkell (I'm working on the dance). I just ordered the belly tube with pocket. I kind of want to make things more secure when I go out, and this might work. Also ordered the swim thing...a latex wrap apparatus that is supposed to hold it all together while you swim. One good thing about the bag is you can sleep all night and never have to get up! Small favors are accepted.\t\t\t", "date": "2008-12-10T15:17:54+00:00", "topic": "Ileal Conduit question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have an ileal conduit. For 6 months post surgery I had healing problems. My wound would not heal, I went through wound pacs, and other procedures for 4 months, then I underwent a revision which pretty much \"trenched\" my stomach and removed all the tunnelling that had occurred. Anyway, I am now 10 weeks post-revision and am completely healed.\n\nThat being said, if I had chosen a neo bladder I probably would have been in a lot of trouble due to the post op problems I had. One never knows. Now that my wound has healed, my bag appliance stays on with no problems. It is a disability, no doubt, but minor compared to many others.  I read an Italian study recently that said people with all 3 options seem to adapt themselves equally to whatever they have chosen.\n\nBest of luck with your choice.\t\t\t", "date": "2008-11-23T16:42:31+00:00", "topic": "New to this and facing RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI went to emergency room for a precautionary exam for some swelling near my wound vac. They performed a full contrast CT of my abdomen and pelvis. There were no complications, just maybe some superficial edema in my abdomen...or pressure from my wound debridement. A great by-product of the CT was that I was clear of any adenopathy of my abdominal and pelvic areas, including liver, kidneys, et cet. I am 5 months post RC. Now to do my chest area...\t\t\t", "date": "2008-09-24T07:38:09+00:00", "topic": "5 months and clear", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't want to seem presumptious, but can't one revise to an ileo-conduit subsequent to a neo bladder? Might this be an option that would solve the problem?\t\t\t", "date": "2008-06-26T19:15:04+00:00", "topic": "1 year out- bleeding and bladder infections", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n ", "date": "2008-09-07T19:55:46+00:00", "topic": "To neobladder or not to neobladder, that is my ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI went with the ilial conduit and outside bag on 04/30/08. So far so good. My bags only last about 4 days and I have to change them. This could be because I am still fighting the abdominal wound which did not heal. I underwent debridement on 09/11 and, hopefully, everything will close up the way it is supposed to this time. The wound vac dressings have interefered with the bag, since I had better longevity with the bag when I didn't have the wound vac.\n\nIt is good being able to hook up to the night bag and not worry about things until you awaken. The occasional leak isn't a big deal. By the way, you mentioned the penis and hoses, et cet. The ilial conduit system is where a piece of intestine is used to divert urine from your ureters to a stoma, which is located about 3 inches to the right of your navel. The urostomy bag adheres to the skin and covers the stoma, collecting the urine.\n\nI think if I had gone with the neobladder I would have had big problems re my wounds dehissing and the problems associated with healing, but who knows?\n\nI am 64 and probably would have elected the neo-bladder if I were much younger. However, I have heard of some serious problems occurring with the neo. This is rare but it happens.I figured Murphy's Law usually applies to me.  It does appear most people with the neo are happy with it.\n\nOnce I get out into the real world again and start going on trips, I am going to use a leg bag. They attach to your thigh and collect about 1/2 what a night bag does. They attach to your stoma bag just like the night bag does. I had one after a turbo once and it worked really well. They would be good for a hotel room or guest room too, since you just take it with you and don't have to leave any weird appliances around.\n\nBest of luck with your decision.\t\t\t", "date": "2008-09-07T19:55:46+00:00", "topic": "To neobladder or not to neobladder, that is my ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSound like you rolled the dice and came up a winner. Congrats.\t\t\t", "date": "2008-07-23T17:48:37+00:00", "topic": "My choice", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t6 weeks is about the norm. I just started short trips, after 8 weeks, but I have this wound healing problem which is slowing me down.\t\t\t", "date": "2008-07-09T14:03:45+00:00", "topic": "Recovery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI took lyrica during a severe case of shingles which developed after my first TURB last year. It is a drug that reconnects the nerves and i felt it was pretty effective. Best of luck. \t\t\t", "date": "2008-05-19T21:49:46+00:00", "topic": "Next one for waiting for test results", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was in surgery for 11 hours. I heard my urologist stayed in ICU with me for 6 hours post-op. I assume I awoke and he left. I know I was with the night ICU nurse for a few hours, so it sounds like it took me about 6 hours to come out of it. At least I think I came out of it (Ha Ha)\t\t\t", "date": "2008-06-05T09:27:36+00:00", "topic": "Help - Really Need Some Advice Please?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a renal scan in the hospital post r/c. It was basically an ultrasound. They were concerned about kidney function. I believe there was an isotope involved, but  I had so many scans I forget. It took about 10 minutes. The test was negative. It didn't seem to be a big deal. \t\t\t", "date": "2008-06-02T15:46:08+00:00", "topic": "Question about a renal scan", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe home health nurses are telling me the wounds are almost closed and I should be vac-free pretty soon. It's a pretty slow process and being type 2 diabetic probably is contributing to the slow mending. However, it's looking ok at this point. My strength is coming back, and should be 100 percent up and at my new life in no time!\nThanks everyone for your comments and concerns. \t\t\t", "date": "2008-05-22T21:36:26+00:00", "topic": "Jeff's RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Gene and Ginger. Your support is appreciated. I guess I had a smallish infection which wasn't the problem it was more like a problem with the incision site mending, which required the wound vac. This became evident about 3 days after the op and when I stood up I gushed everything out from my wounds. Anyway, that was unforseen and pretty freaky. Once they got the wound vac on that stopped. Now I am very close to closure and release from this machine! Thanks for the tips. Right..OJT at Yuma Regional...you don't make history often!\t\t\t", "date": "2008-05-22T21:36:26+00:00", "topic": "Jeff's RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my RC on 04/30/2008. All I remember about the event was being wheeled down the hall and awakening in ICU. My surgery lasted 11 hours. My URO only offered ilial conduit and I figured for my age and dispostion it might be the best for me. I was in ICU for 2 days. My biggest problem is my incisional wounds dehissed (sic), and leaked for days. eventually, after 12 days, they installed a wound vac. I was released after 14 days. I went home with the vac. It is redressed every 2 days by home health care. A wound vac is basically a wound packed with sponges, a tube on a cup placed over it and hooked up via a tube to a Vac machine. The machine is portable. Yesterday, the tech said great progress has been made and the 2 areas are only 3 centimeters deep now. There was infection involved, staph, possibly a form of MRSA, but that seems to be over.\n\nI am still weak after 21 days. Odd feeling for me. But a lot was done, and it would have to take a great deal out you.\n\nMy wife is an angel, has been by my side 100 percent.\n\nThis was, I heard, the first RC, for my local hospital and one of the longest surgeries!!  The care given was remarkable.\n\nWe are having problems with the bag system. Unpredictable results, but getting better at it as we try new techniques.\n\nMy grandkids \"don't get it\"...and how do you explain all this to them? You don't. But i just try to keep a happy face around them.\n\nThanks Gene and Ginger for the messages, and anyone else that messaged I may have skipped over, I am still \"in and out\" and have to catch up with the forum.\n\nAll my paths were negative for any spread at this time. \t\t\t", "date": "2008-05-22T21:36:26+00:00", "topic": "Jeff's RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks!\t\t\t", "date": "2008-03-11T17:58:07+00:00", "topic": " Bag people---any ideas on swimming  garb, to cover the bag", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRick, that is a lot of fluid intake. Is that just water or juice and pop too? Is there a reason for boosting your fluid intake?  Also, at night...you have a tube from your bag to a bigger bag? Do you have to take it along with you when you raid the fridge? Crazy little question, eh? Thanks again.\t\t\t", "date": "2008-03-31T22:51:10+00:00", "topic": "Year Ago Today", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks again, Joe. \t\t\t", "date": "2008-03-31T22:51:10+00:00", "topic": "Year Ago Today", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am a candidate for an RC, had my scans done, and am waiting for the URO appointment that will determine when the op is to take place. I am going with the outside pouch for several reasons. I am 64. I figure I will get used to it, will probably end up not thinking about it a lot, other times, might have to hassle with it. In any event, extending my life to enjoy my family, my grandkids, is my greatest consideration. There are a lot of other \"disabilities\" that would be a whole lot worse than this one. So, we should all take heart if we get that other chance.\t\t\t", "date": "2008-03-25T18:59:27+00:00", "topic": "Confused &amp;amp;amp; a Bit Scared", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Dale. I have my post test Uro appointment next week and I am sure that what will be recommended. Sounds like everything is going well with you. \t\t\t", "date": "2008-03-26T19:44:22+00:00", "topic": "When to RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know this may be redundant for many on the forum. But I would like to pose the following question:  When is a RC necessary when stage T2? In other words, if the tumor is in deep muscle, per the 03/05/2008 lab report, and 3.6 X 3.2 x 3.2 cm...should you try chemotherapy or should you just submit to an RC. Partial is not an option since it is in the bladder neck. 03/20/2008 CT's are clean outside the bladder. Bone scan is clean. A CT 5 months ago showed it in labia propria at 5X 4 X 2.5 cm. It would seem to me that I would be pushing the envelope to try and save the bladder at this point. Thanks.\n\nJeff\t\t\t", "date": "2008-03-26T19:44:22+00:00", "topic": "When to RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nBest of the holiday season for you and your family.\t\t\t", "date": "2008-12-15T21:46:16+00:00", "topic": "Latest Test Results...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI have been on pain meds for 5 months during my wound problem. My wound Dr recommended taking 2 senocets (sic), the constipation herbal pill, everytime you take a pain pill. It seems to work for both hydrocodone and percocette. Frankly, I did it a few times, now I just take one or two a day, but if you need to, it seems to Get'r done!\t\t\t", "date": "2008-09-17T15:10:14+00:00", "topic": "Progress and the lack there of", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThere has been a lot of really rotten news on the forum recently. I am wondering whether to get CTs 3 months post op or forget it until later, like next year! Seriously, I have read a lot of encouraging mets cases in here wherein folks live on and on after chemo or successive chemo and radiation. It's hard to be able to get a clear view of all this, the posts aren't indexed (no criticism, who would have time for that?). But, maybe some chemo stalwarts could come forward and post their experiences and longevity again for those of us that are scared shitless about the future.  ", "date": "2008-07-24T01:41:35+00:00", "topic": "The cancer is back", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tYou might start a forum thread, \"Chat\"...put it on top. Then you can post official room chat times and dates. Others can post they are going to be in a room at a specific time, et cet. ", "date": "2008-07-24T18:27:07+00:00", "topic": "How about a chat !", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI review mets posts, but have been very reticent to post or ask questions. I think you have arrived at a good solution and I support you in this. Best of luck to all.\n\nJeff\t\t\t", "date": "2008-07-21T18:01:31+00:00", "topic": "Just a thought", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI can empathize with the leaking bag. It took me a couple of  months to \"get it right\"...I use a Convatec 'stomahesive' skin barrier and their bag. I like to change mine on the 4th day. Usually, it starts giving way by then. I keep a spare in the vehicle. But I have had few accidents. Are you using the stomahesive powder on your skin before you apply the barrier? Also, I place a heating pad on me after I apply a new system, that kind of seals it better.\n\nHave a positive attitude toward it...Best way to go. Even after 2 years I feel better about it and handle it better each day. Changes take time to adjust to.\n\nI am having my 2 year scan tomorrow.\t\t\t", "date": "2009-12-18T18:45:47+00:00", "topic": "New bag man needs support.", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThat is a tough one. When I developed into Stage 2, my Uro said I could try radiation. But he also said if the radiation failed there were no other options. I guess that was because of the damage to the intestines which would result and they would not be useful for reconstruction. In any event, it sounds like radiation was successful in your case. That doesn't mean it can't return, and I imagine that is why the Drs are saying to remove. I kind of wonder why they would radiate if they knew it would have to be removed anyway. Who could recommend in a case like this? All I can say is that better safe than sorry, and the Drs are recommending removal and I would remove. I had my RC 2 years ago this month, just had my 2nd year scan and am clear. Thank God. I had an ilial conduit and it has worked fine, no cathing, no voiding problems, et cet. But everyone has to make their own decision. Best of luck.   ", "date": "2010-03-11T19:35:47+00:00", "topic": "To Remove or not to Remove, that is the question", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI use a Convatec 9 \" bag with flat skin barrier. I have a somewhat rounded abdomen. I had a lot of problems in first few weeks until I started this method:\n\n1. Remove old bag and skin barrier.\n\n2. Wash area with warm cloth.\n\n3. Staunch stoma lightly with 2 tampons to prevent leaking. Let skin totally dry.\n\n4. Apply Convatec Stomahesive protective powder lightly, and do not smooth out, leave it a little lumpy.\n\n5. Apply skin barrier, put on bag.\n\n6. Place slightly warm heating pad on for 60 seconds. This seals the adhesives.\n\nI rarely leak now and change bag every 3 days.\n\nHope this helps.\n\nJeff\t\t\t", "date": "2008-07-17T03:45:03+00:00", "topic": "leakages from ostomy appliance", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI have the ileal conduit, like Rah. But I have better BMs and more regular now than ever. I don't know how much intestine is used for the conduit, but it apparently hasn't caused problems in that area for moi. I eat a light to medium  breakfast, usually, sandwiches for lunch, and a solid dinner. Snack during the evening. Lots of liquids. Best of luck.\t\t\t", "date": "2009-01-17T01:13:47+00:00", "topic": "Updates and Questions on neobladder and bowel chgs", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tOur ostomy nurse...and you should see one, suggested warm hands on the bag once you apply it to the skin barrier. I thought, well, maybe low heating pad would be better and it seems to work. I apply it for 60 seconds as it is heating up. We are talking warmth not hot. Laying down is probably better, although I have applied it standing up if my wife is busy. Be sure the skin is clean and dry, and like I suggested before, don't use too much stomahesive powder, and let it be a little lumpy...if too smooth it seems to leak. If you use the paste you will get good adhesive qualities...but the paste is harder on the skin.\n\nAlso, we cut the hole up to almost 2 inches. This creates a better \"dam\" for us. I change every 3 days...going any longer usually results in leakage.\n\nI would encourage you to consult with a stoma nurse regarding which appliance is best.\n\nBest of luck, accidents will still happen.\n\nJeff\t\t\t", "date": "2008-07-27T04:50:22+00:00", "topic": "ostomy appliance and night bag", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tIt can be a bummer, just day-to-day problems. Today we went to the casino for some fun. I am 3 months post op with wound mending issues so I don't get out all that much. So, I get all dressed, we go, I am there 5 minutes and guess what? LEAK!! And everything had been going so well. Actually, I had one earlier in the day after my normal change. So I went through 2 new bags in one day. The first one I think was sitting on my couch, which might be too deep for me since it is the 2nd time it happened. The casino thing may have resulted from getting out of the truck, moved too fast maybe.  Also, I am wondering if I am using too much powder and it's too smooth. See...it's just a lot of little things that crop up and are conspiring to cause me to lose my mind. Hard to smile through everything, but you got to. I'll figure it out.  ", "date": "2008-07-22T11:42:33+00:00", "topic": "leakages from ostomy appliance", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI don't want to seem presumptious, but can't one revise to an ileo-conduit subsequent to a neo bladder? Might this be an option that would solve the problem?\t\t\t", "date": "2008-06-26T19:15:04+00:00", "topic": "1 year out- bleeding and bladder infections", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI found this interesting bit of info in a book about Kit Carson, \"Blood and Thunder\", by Hampton Sides. It was a discussion about the demeanor of President James K. Polk:\n\n\"Perhaps Polk's dour nature had something to do with the excrutiating medical condition he long suffered from as a teenager...Polk was diagnosed with urinary stones...was taken by horsedrawn ambulance to a famous Kentucky physician, Dr. Ephraim McDowell, and there underwent what was then a state-of-art surgery. With nothing more than brandy...the future president was strapped naked to an operating table with his legs hosted high in the air. Dr. McDowell bored through the prostate and into the bladder with a medieval-looking tool called a 'gorget'. The stones were successfully removed, but the operation is thought to have left Polk sterile and impotent. Polk's biographer thought that 'Polk became a man on the Dr's operating table, and were evidences of the courage, grit, and unyeilding iron that the whigs, british crown, and mexican army would encounter once he became president.\"\n\nYou see, it could always be worse, it could be 1813!!!\t\t\t", "date": "2007-03-07T16:03:11+00:00", "topic": "Ramblings", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThere is 'cool cancer' and 'uncool cancer'. I have now heard everything!\t\t\t", "date": "2009-11-07T01:38:23+00:00", "topic": "How did a popularity contest become a part of cancer survivorship?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\t[b]How fortunate so many of us are to have these life-giving options available to us. Not so long ago, the results would have been far different.  This is so much more apparent during the holiday season when our family and friends gather around us. Happy Holidays everyone.  [/b]\t\t\t", "date": "2008-12-22T22:42:37+00:00", "topic": "The Holidays", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks everyone.\t\t\t", "date": "2008-07-15T15:45:58+00:00", "topic": "Bob Scheiffer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI saw Neil Young at the Forum in Los Angeles in about 1971. It was the After the Goldrush Tour and he played some of his biggest hits. \"Broken Arrow\" was his tune on the first Buffalo Springfield album. Man, that brings back the memories!\t\t\t", "date": "2008-07-15T20:38:21+00:00", "topic": "My Favorite Musician-Neil Young", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks,Cynthia. I would be happy to participate as I intend to stay active in this forum. \t\t\t", "date": "2008-04-15T03:45:30+00:00", "topic": "Webcafe Chat room", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks Ginger. It's morning and I feel a lot better of course. Que Sera Sera as the old saying goes.   ", "date": "2008-04-18T19:05:51+00:00", "topic": "Smoking, more prevelant  in which states??", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe just spent 3 days at Del Mar last weekend, a seaside village in So Cal. It was our 43rd Anniversary. You cannot smoke anywhere in Del Mar, including the beaches, the sidewalks, public buildings, et cet. I think you can smoke in your car, but wasn't sure. This was a getaway before my pre-op appointment which was on Thursday. So I am scheduled for the 30th of April. I went 64 years without any health problems and here I am with Stage 2 Invasive BC. My scans show no other involvement, including an MRI done on April 5th. Of course, we don't know, do we, until they go in? Taking it a day at a time is a real challenge, I hope I can get better at it.\n\nJeff Finley\t\t\t", "date": "2008-04-18T19:05:51+00:00", "topic": "Smoking, more prevelant  in which states??", "subforum": "17-chit-chat"}]}