{"signature": ["TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tJust for reference, my TURBT, in which a 3 cm tumor was removed, took a good 2 weeks for me to recover from.  I don't think a couple of days is enough to get back to normal activity for most people (I guess it also depends on how much \"scraping\" was done).\n\nThe doctors never know exactly what they will take out until they go in with the cytoscope and then they can't tell you the results until they send it off to a lab.  Still, your care seems pretty erratic.  I agree with the others that you should go with the more experienced doctors.\n\nAlso, the fact that they told you to get a scan at 3 months is hopefully good news (but they should have explained exactly what's happening).\t\t\t", "date": "2016-01-01T13:58:55+00:00", "topic": "Needing some advice", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood luck.  I hope it goes smoothly for you.  Chances are your tumor will be removed and you will spend more time in your urologists office than you had ever planned, but you and the urologist will grow old together.\t\t\t", "date": "2016-07-16T00:24:23+00:00", "topic": "Unknown Lesion...Terrified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Joe.  Yes, TURBT can cause increased urinary frequency, no doubt about it.  I experienced this and it did subside after a few weeks.  The BCG can cause the same problem though, so you can plan to get used to it.  Best of luck with the BCG treatments.\t\t\t", "date": "2016-02-12T22:48:10+00:00", "topic": "Experienced centers in NJ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm a fellow New Jersey resident.  You've been through a lot lately!  I'm about the same age as you and am done with my first 4 BCG treatments.  So far, so good.  As Sara Anne said, definitely go to Sloan for the best care, or at least for another opinion.  You are lucky enough to be relatively close to one of the best cancer treatment facilities in the world, why not use it?\t\t\t", "date": "2016-02-12T22:48:10+00:00", "topic": "Experienced centers in NJ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe catheter insertion is pretty uncomfortable, but you get used to it quickly.  For me, the first time was the worst.  I'm now getting ready for the 5th BCG installation, and I've learned to relax and try to enjoy the process as much as possible (as strange as that sounds).  There are much worse things we could go through.  Also, the skill of the administering nurse has something to do with it.  I have 2 nurses that have placed the catheters, and I can clearly tell that one makes it more comfortable than the other.  This could have to do with the nurse's lighter touch or simply having more experience.  My best advice would be to relax as much as possible during the procedure and not tense up.\t\t\t", "date": "2016-02-16T14:56:42+00:00", "topic": "and another noob to BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHow did you find out that you have these polyps?  Did you have a CT scan or MRI?\t\t\t", "date": "2016-01-15T20:46:59+00:00", "topic": "Having my first cystoscopy help!!??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tFinally had my first BCG treatment.  I must say, it wasn't bad.  I expect it will be worse for the next sessions once the immune response ramps up.  For me, the most difficult part was the catheter insertion.  Not really painful, but very uncomfortable.  I'd definitely rather do this and hope it helps than do nothing!\t\t\t", "date": "2016-01-03T01:44:01+00:00", "topic": "Just had first TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Sara.  I guess I'll see just how lousy I feel and make a judgment call.  Based on your response, I'll plan on probably not doing too much though.    ", "date": "2016-01-03T01:44:01+00:00", "topic": "Just had first TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Rebecca,  as others have stated, if the cancer is \"high-grade\", BCG is usually recommended, as it helps to prevent the tumor from coming back.  High grade types of tumors have a recurrence rate that is pretty high (>50%).  Using BCG can help to reduce this recurrence rate and, from what I have read, is highly recommended in the case of high-grade papillary tumors. BCG is basically a weakened Tuberculosis (it is the same thing used in tuberculosis vaccines in children) that helps to stimulate the immune system to fight abnormal cell growth in the bladder.\n\nI am in the same boat as you...just had the TURBT and they identified high-grade papillary, so I will start BCG soon.  Another opinion would not hurt, right?\n\nBest, Jeff\t\t\t", "date": "2015-12-31T20:06:48+00:00", "topic": "Introduction", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHang in there Doug.  The article Sara posted was very informative.  BCG sounds like a pain in the butt to receive, but it seems to work well in most patients.  I laughed about your \"peeing hamburger\" remark.\t\t\t", "date": "2016-01-03T23:05:06+00:00", "topic": "BCG efficacy in managing CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou have to get your dad to understand that bladder cancer has a high recurrence rate and that by living a healthy lifestyle, he can hopefully take an active role in helping to keep his chances for recurrence as low as possible. It doesn't sound like he realizes the disease can come back at any time.  Hopefully it will not.  An occasional drink or two for most people is OK, but excessive partying is probably not the greatest idea.\t\t\t", "date": "2018-05-12T07:08:09+00:00", "topic": "Alcohol usage and bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSounds like she is having very fast recurrences that are happening even during the healing process.  She seems to be at high risk. Situations like hers are tough because the BCG treatment requires a healed bladder.  I would consider a second opinion before doing anything drastic, but it seems reasonable given her almost immediate multiple recurrences. A second opinion with another expert or even an oncologist is always a good idea in my book.\t\t\t", "date": "2018-05-14T23:50:43+00:00", "topic": "Having bladder removed? What should I do?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow, hope it is nothing.   My doctor does the bladder biopsy during the cystoscopy of he sees anything suspicious.  I wonder why you have to go back for a biopsy?  I know the prostate is a whole different issue, but they could do the bladder biopsy during the cystoscopy based on my experience.\n\nAt any rate, good luck with it and hopefully you will have no problems!\t\t\t", "date": "2016-02-10T02:17:07+00:00", "topic": "No sign of Cancer today at Urologist!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nneil0neil wrote: After 9 rounds of BCH treatment I was diagnosed with urinary bladder neck constriction (or obstruction).  Have managed this by catheterizing myself every other day.  Has anyone else had this problem.  I am told it is uncommon.\nHi.  Welcome to the site.  I know that obstruction is a rare side effect of BCG therapy.  Also, sometimes if you have a TURBT close to the bladder neck, it can cause an obstruction.  Do you know if your surgery was performed near the obstruction site?  If so, this could be the cause.  I'm not sure what can be done about it, but I would think a surgical procedure might be possible to open the passageway to the urethra.\t\t\t", "date": "2016-07-01T03:02:26+00:00", "topic": "Bladder neck obstruction after BCH treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome to the site.  It will be important to have the histology evaluated to see exactly what these new growths are. PUNLMP, as I understand it, are abnormal cellular growths, but not cancer per se.  I really wish you the best of luck and let us know how it turns out.\t\t\t", "date": "2016-06-19T15:45:20+00:00", "topic": "Inverted punlmp recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood luck.  I think a lot of us are in the same boat, with the thought of common recurrence in the back of our mind.  Hopefully it's in your head and all will be OK.\n\nAs for me, I'm pretty sure I was walking around with bladder cancer for quite a while before I actually did something about it.  We are all in a better place now that we have this frequent monitoring.  Even if it comes back, at least you can deal with it.  That is better than not knowing.\t\t\t", "date": "2016-07-17T20:31:34+00:00", "topic": "Nervous about Recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree with everyone that in general high grade tumors, even if non-invasive, get BCG treatment.  Is there something about your father's case that would make him \"not a candidate\" for BCG?  Every patient has their own clinical picture. If you think he can receive BCG with no contraindications, definitely get the opinion of someone who treats many patients with the condition.  Just curious, how old is your father?\t\t\t", "date": "2016-01-24T05:00:43+00:00", "topic": "Ta HG &amp;amp; 2 Uro said no treatment. Is it correct?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBladder cancer is sometimes described by the analogy of \"weeds in a lawn\".  Your story is an important one, as it reminds us all to keep managing our lawns even after the weeds have been pulled out.\n\nBest wishes for a good outcome!\t\t\t", "date": "2016-01-16T16:49:55+00:00", "topic": "It's back", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNew Punk Rock band name - Tattooed Bladder.  Please send me some royalties.   ", "date": "2016-01-21T10:30:42+00:00", "topic": "turbt", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBasically there is something abnormal in your bladder and they have no idea what it is.  Let us know how it turns out and best wishes for a healthy result!\t\t\t", "date": "2016-06-24T16:14:14+00:00", "topic": "Question...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThese are immunotherapy drugs being studied in several tumor types.  There are 2 approved drugs, nivolumab and pembrolizumab.  They are approved for other tumor types including lung cancer and melanoma, but there are some data in bladder cancer as well.  Certain patients will likely respond better than others, possibly based on the characteristics of their tumors (high expression of PD-1 will possibly respond better).  The brand names of these drugs are Opdivo and Keytruda (again, not yet approved for bladder cancer).  You can search these names and find more info.  These drugs work by increasing your own immune system's ability to attack the cancer cells.\t\t\t", "date": "2016-07-26T05:58:56+00:00", "topic": "PD L1 Trial", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tWe are so glad to hear this amazing news.  I hope you have continued success with this new treatment.  Best wishes to you.\t\t\t", "date": "2016-05-30T16:21:34+00:00", "topic": "REMISSION", "subforum": "7-metastatic-bladder-cancer"}]}