{"signature": ["TURBT", "TURBT", "TURBT"], "posts": [{"text": "\n\t\t\t\tJes,\n\nI received my treatments at University of Texas Southwestern in Dallas. I was given the choice of mitomyacin or gemcitabine. I chose gemcitabine because the side effects were a little less. Both had about a 30% success rate. I know I’m never going to be out of the woods with this, but it’s sure nice to have a stretch in between. Good luck to you, and keep us updated!\t\t\t", "date": "2018-06-03T19:33:44+00:00", "topic": "Repeated Turbts (4) and fulguration low grade tumors after BCG (3)", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello,\n\nI was diagnosed in April, 2016 with high grade and have since had 3 TURBTS with BCG in between tumors returning for a total of 18. Last October after my last TURBT I started gemcitabine once a week for 6 weeks ending December 20th. I went back end of January and no regrowths (yay). I went again at the end of April and no growths and urine test came back negative. Whew, after 2 full years I finally got a negative report! I’m not sure if this is a good comparison being mine are high and your’s are low grade tumors, but so far it has worked for me! Good luck and keep me updated please.\n\nGod Bless,\nJanice\n\nAge 64\t\t\t", "date": "2018-06-03T19:33:44+00:00", "topic": "Repeated Turbts (4) and fulguration low grade tumors after BCG (3)", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm sorry for your diagnosis, but I'm glad you found this sight. I was diagnosed last May. I am beginning my 2nd series of BCG with one tumor reoccurrence in February. The BCG treatments have not caused me much discomfort so I am hoping and praying the same for you. This sight has been invaluable for me as has BCAN's Inspire website. I can usually get all my questions answered on one or the other.\n\nWishing you the very best,\nJanice\t\t\t", "date": "2017-06-11T18:43:35+00:00", "topic": "Confirmed Non-Invasive Carcinoma on 6/10/2017", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy cancer came back after BCG, so I had a TURBT to remove new growths. The doctor is starting the BCG again and I'm hoping it will do the job this time and I can continue with the BCG maintenance. I think everyone is different so hopefully your results will be clear and stay that way.\nGood Luck!\t\t\t", "date": "2017-03-01T18:56:39+00:00", "topic": "Post BCG Check", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy procedure to do the biopsy and remove the tumor was done as an out patient. I went in at 6am and was home by 1pm. I had very little discomfort, but stayed home that day. I had it on a Thurday so didn't go back to work until Monday but I probably could have gone back the second day. I'm sure some have a little more down time but that was how mine went. I have since had 6 of the BCG treatments with no problems also.\n\nJust jump right in there and get your biopsy so you know what you're dealing with. This is very treatable when you get checked regularly and find a very good doctor that deals with a lot of bladder cancer. Good luck!\n\nJanice\n\n4/16 hematuria (blood in urine)\n5/16 biopsy and tumor removed (turbt)\n7/16-8/16 BCG 6 treatments (once a week for 6 weeks)\nCystoscopy scheduled 10/16\t\t\t", "date": "2016-09-06T04:06:20+00:00", "topic": "Doing nothing not an option", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBCG is a tuberculosis vaccine that makes your immune system kick it and fight any cancer cells. It's installed in your bladder by a catheter and you hold it for an hour or two. They usually do it once a week for 6 weeks. I just finished my 6th one with hardly any side effects.\nGood luck!\n\nJanice\t\t\t", "date": "2016-08-04T04:02:56+00:00", "topic": "Newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThinking about you and wanted to wish you good luck tomorrow. Mine went well and I hope yours goes well also!\n\nJanice\t\t\t", "date": "2016-07-16T00:24:23+00:00", "topic": "Unknown Lesion...Terrified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood girl for following up with the cystoscopy. If it is the awful c word, I bet you caught it real early since it didn't show up on the ct scan. Good luck and keep us updated!\n\nJanice\t\t\t", "date": "2016-07-18T17:30:56+00:00", "topic": "TURBT Postponed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi purrrkat,\n\nI understand exactly what you are going through. I got busy cleaning closets, printing life insurance claim forms, going over our investments. The only thing I wouldn't due was plan my funeral. Thank goodness I finally got my first TURBT after waiting 6 weeks. Then more waiting for results and a second opinion and now I'm on my 6 weeks of BCG and able to breathe a little better. I still have a few anxious moments, but I've convinced myself to focus on enjoying the time I have. It is definitely all consuming, so I have started planning for things in the future and learning to talk myself off the cliff. I know you will too!! Take some time and get a pedicure so when you have those feet in the stirrups you can enjoy looking at your feet. Ha! I actually did that and felt much better.\n\nOne more thing, nothing has been as bad as I imagined..actually nothing has bothered me so far except the waiting.\n\nI'll be thinking about you and praying for you.\n\nBest wishes,\nJanice\n\n4/17/16 hematuria\n5/26/16 TURBT 2.5x2.5x2cm TA HG,\n6/20/16 cystoscopy NED,\n7/15/16 start BCG\t\t\t", "date": "2016-07-18T17:30:56+00:00", "topic": "TURBT Postponed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tElfrola,\nI was searching on another site (bcan Inspire) and I found some posts from 2011 but the postings ranged from $75,000 to $300,000 so it looks like it's according to any complications and different hospitals. If you know where you will be going, you might call them and see if they can give you an estimate of standard costs. Be sure and tell them it will be self-pay, because a lot of times the price is reduced.\nGood luck,\nJanice\t\t\t", "date": "2016-07-06T00:04:06+00:00", "topic": "Estimated Costs Radical Cystectomy and Neobladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSo happy for both of us!!! Take it easy on that bike. Lol Happy 4th!!\t\t\t", "date": "2016-06-24T19:44:33+00:00", "topic": "New to the forum,,hoping not to stay,,,questions,", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust got the best news! The doctor didn't see any more cancer and I start the BCG treatments on July 15th..WooHoo!! Hopefully that will keep the cancer from coming back. Hoping you get an all clear today at your appointment.\t\t\t", "date": "2016-06-24T19:44:33+00:00", "topic": "New to the forum,,hoping not to stay,,,questions,", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust an update on my tests after gemcitabine. I went for my 2nd cysto after receiving 6 series of the gemcitabine in December, on August 27th and my bladder was clear, I got my cytology report today and no cancer cells present. I know the odds were not in my favor, but so far it has worked. After two years, three TURBTs, 18 BCG treatments, 6 gemcitabine treatments I finally got my first clear cytology in April and now a second one! So keep trying whatever they offer you, you might be in that 30%.\t\t\t", "date": "2018-06-20T20:52:16+00:00", "topic": "Gembiticine series after non response to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI’m a little late in responding but I received 6 treatments with gemcitabine and finished end of December. My 3 month cysto was clear with a negative urine test also, finally after two years I got a clean test. The doctor told me to come back in 4 months since mine kept coming back with the BCG instead of 6 months. I’m headed back for my cysto tomorrow. I will update after my appointment. Please let me know if you out received the treatments please.\n\nJanice\n\nInitial diagnosis 4/2016\t\t\t", "date": "2018-06-20T20:52:16+00:00", "topic": "Gembiticine series after non response to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Jack,\nI was just checking on you. I see you are into your second round of chemo. Is it intravesical? I had to quit BCG since it wasn’t working. I did 6 treatments of gemcitabine in December and I got my first clear cytology in April, so I hope it continues to keep it away. And hoping it works for you also!\n\nBest wishes,\nJanice\t\t\t", "date": "2016-09-12T00:11:04+00:00", "topic": "BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nMy doctor said in 38 years he had never seen this, but I was the 2nd person this month with those side effects, so you never know.  I have been going to UTSW in Dallas, but I may head to MD Anderson in Houston for a second opinion. I sure don't want this to progress so I'm with you on losing the bladder if I need to.\n\nJanice\t\t\t", "date": "2016-09-12T00:11:04+00:00", "topic": "BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Sara Anne!\nThis is terrible, not having any energy and not being able to stay awake.\nI'll send a message to the doctor if I'm not better soon\n\nJanice\t\t\t", "date": "2017-07-10T17:54:34+00:00", "topic": "BCG and continuous sleeping", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had a total of 15 BCG treatments. Now I can hardly keep my eyes open and so tired. It's been 2 weeks since my last BCG, has anyone else had this problem this long?\nI did not have any bad symptoms, just a little tired for a day or two so I'm a little concerned.\n\nJanice\n\nHematuria 4/2016\nTURBT 5/2016\nBCG 7/2016\nReoccurrence 2/2017\nTURBT 2/2017\nBCG 4/2017\nBCG maintenance 7/2017\t\t\t", "date": "2017-07-10T17:54:34+00:00", "topic": "BCG and continuous sleeping", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy Uro at University of Southwestern in Dallas will only allow you to hold it for 1 hour. I believe that is to try to preserve the bladder.  It seems like a lot of the doctors have different protocols in the BCG treatment. Also my Uro did not do a 2nd TURBT since it wasn't in the 2nd layer even though they did not get muscle.\n\nWishing you the very best,\nJanice\t\t\t", "date": "2017-06-09T04:06:39+00:00", "topic": "I got my pathology report back as Ta High grade aggressive", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI sure will Alan. I told him a got a good reference from my bladder blog on him. He got a kick out of that! It was a pleasure visiting with a fella from my neck of the woods. Even though there are no woods in west Texas. Lol\t\t\t", "date": "2017-02-10T00:05:36+00:00", "topic": "Cystoscopy - post initial BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRocky,\nSo glad you got through the surgery and doing really well. Hope things continue as well going forward. I am just beginning this journey, so I check the board nearly everyday and it gives me so much hope to hear everyone's story.\n\nGod Bless,\nJanice\n\n4/17/16 Hematuria\n5/20/16 Turbt TA HG\n6 BCG completed 8/19/16\nWaiting.......10/20 cysto\t\t\t", "date": "2016-07-21T14:34:26+00:00", "topic": "no chemo for non invasive cis?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\n\nThis is the video with Dr. Lamm\nJanice\t\t\t", "date": "2010-10-06T22:23:39+00:00", "topic": "BCG and septic systems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm sorry, the video on Dr. Lamm is on the BCAN site, Inspire.\nMy apologies.\nJanice\t\t\t", "date": "2010-10-06T22:23:39+00:00", "topic": "BCG and septic systems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI found an interview with Dr. Lamm on this site if anyone wants to watch it. He and another doctor were actually laughing about the Clorox protocol. He said in 30 years there has never been a case of anyone getting sick from this. He stated \"that is still in the BCG insert? There are much worse bacteria in our toilets.\" Just thought I would pass that along. BTW, I still follow the procedure, just in case. Lol\nJanice\t\t\t", "date": "2010-10-06T22:23:39+00:00", "topic": "BCG and septic systems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is wonderful news!! You both get to breathe easier..enjoy\n\nJanice\t\t\t", "date": "2016-07-20T00:02:24+00:00", "topic": "Good Cysto report 15 months after 1st TURBT", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Sara Anne..I am going in the morning for a turbt locally..then on to UTSW for a consult next Tuesday..was getting impatient since I've been waiting for 6 weeks to get all tests done so I knew what I was dealing with so decided to get the biopsy done here..sure hope I made the right decision.\t\t\t", "date": "2016-05-26T00:11:49+00:00", "topic": "Help with place to go", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have an appointment scheduled at UT Southwestern Medical in Dallas, but waiting to get an appointment at MD Anderson, also Mayo Clinic in Phoenix  can also see me soon. CT scan shows probable T3, but no biopsy staging yet. It's been 6 weeks since symptoms started and feel like I need to get something fast. If anyone has any ideas on which place would be the best, please respond. I'm very confused on ratings and doctors.\t\t\t", "date": "2016-05-26T00:11:49+00:00", "topic": "Help with place to go", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you so much!! I had my first series in Dallas so I'm hoping he will agree to have my second series in Austin.\t\t\t", "date": "2017-02-03T00:04:04+00:00", "topic": "A new non-invasive test for bladder cancer (UroMark)", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tDave,\nI noticed you are being treated in Austin. I am currently going to Dallas, but it's a 5 hour drive. I have a house about an hour from Austin which would be much more convenient. Would you mind sharing your doctor's name with me as I hope to be starting BCG treatments again and would like to find one closer?\nI love your signature, reminds me of Ringo Starr. Lol\nPeace & Love,\nJanice\t\t\t", "date": "2017-02-03T00:04:04+00:00", "topic": "A new non-invasive test for bladder cancer (UroMark)", "subforum": "31-articles-of-interest"}]}