{"signature": ["TURBT", "TURBT", "TURBT", "TURBT"], "posts": [{"text": "\n\t\t\t\tHi, Rosie: I can't say anything about Fla. insurance providers, but I used ACA coverage for six months between when a COBRA policy lapsed and Medicare began. I'm glad I had it, because I had a serious bleed a few days after a BCG treatment. I think you commented that you were looking around for a urologist. The only thing I can say is you want to be sure that the providers you'll be using--urologist, hospital, anesthesiologist, etc.--are in the insurance carrier's network. Out of network price for my little misadventure, including 2 nights in hospital, would have been in the $20,000 range. Good luck, Stu\t\t\t", "date": "2020-12-03T00:54:22+00:00", "topic": "Florida Insurance Recommendation or ACA info", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'd certainly be in touch with medical staff to check in about the situation. I had two rounds of BCG after 9/19 TURBT. Four days after second instillation (about 7 weeks after TURBT), morning elimination consisted of gross hematuria and lots of clots. Situation did not improve as morning progressed and by the time I decided to go to ER, I was only able to pass small amounts of blood and clot. Irrigation via catheter to clear coagulum (ultrasound showed bladder distended and 90% full of clot), emergency cauterization of tumor site, two nights in hospital (they were concerned about falling hemoglobin level), a unit of blood, and got to wear a catheter home for a couple of days.\n\nApparently the BCG irritated the resection site. Nurse Practitioner in charge of BCG said she'd only seen such a strong reaction once before in 4-5 years of working with it. I think we started treatment too soon because I seem to be slow to heal.\nStu\t\t\t", "date": "2019-12-24T08:51:43+00:00", "topic": "BCG Maintenance therapy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI imagine you've thought about this, but since state and Federal laws differ on cannabis, I'd be wondering how use might play with the Federal employer should they ask or test.\n\nStu\t\t\t", "date": "2019-08-08T07:52:59+00:00", "topic": "Still have painful urination 3 weeks after TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Ange:\n\nRe: Could it be they come back and say, do nothing else, it is ok, just have it checked often?\n\nThat's my protocol. Doc takes a look every 3 months to see if there's any recurrence. I had a second TURB because he saw something at second cystoscopy. Pathology said it was cystitis cystica, an inflammatory condition that, apparently, can look tumorous. Best, Stu\t\t\t", "date": "2019-03-09T21:40:15+00:00", "topic": "Diagnosed 5 days ago", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Olbrian:\nI see Johns Hopkins come up on lists of major centers for bladder cancer on this forum (although it's in Baltimore). I had a radical prostatectomy without complications there in 2005, but I don't know anything about the bladder specialists.\nBest wishes, Stu\t\t\t", "date": "2019-05-30T12:38:16+00:00", "topic": "Newly diagnosed - 2nd opinion needed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had a secondary round of minor bleeding and clot passing starting about 7 weeks after my second TURB in December, visible blood (off and on) at either beginning or end of stream for about 2 weeks. No blood in urine sample at 12-week cystoscopy. Doc said it's still healing in there. He got muscle tissue for biopsy during TURB, so I figure deeper cut took longer to heal. Good luck, Stu.\t\t\t", "date": "2019-04-24T02:34:35+00:00", "topic": "BCG postponed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tiXanadu,\nRe: “So either no one else has suffered the same symptoms, or it just isn't documented.” My glans was pretty torn up after my first TURB in Aug., maybe because it was a large tumor and the device they use was in place for quite a while. When I got home, the first thing to pass was half a shot glass of partially coagulated blood. For a week or more, it felt like I was opening up a cut every time I urinated. Sounds like you’re coming back to comfort zone quicker than I did. For a few days I availed myself of the opiates prescribed. My second TUR was less extensive time-wise; Doc was in and out in less than 15 min. Even so, when a buddy emailed to ask how I was doing, I responded, “You know you’ve been abused when you have to sit to pee.” I didn’t have as much pain, but I did seem to have some spasming and associated urgency. Fortunately, processes have come back around. Tks for the video.\nBest, Stu\t\t\t", "date": "2019-01-07T15:46:33+00:00", "topic": "New - blood in urine - waiting for more diagnostics - love some guidence", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Joea73. My FISH test showed no evidence of urothelial carcinoma. Here are a couple of comments from the report that line up with your explanations:\n\nThis test result does not rule out the possibility that the patient may have a low-grade (i.e. grade 1 or 2) non-invasive papillary urothelial carcinoma. Some patients with low grade non-invasive papillary urothelial carcinoma do not have abnormalities with this FISH test.\n\nFluorescence in situ hybridization (FISH) with centromere probes for chromosomes 3 (D3Z1), 7(D7Z1), 17(D17Z1), and a locus specific probe for 9p21.\n\nThey sent the sample to Mayo in MN for processing.\n\nI read all your posts for the technical info.\n\nStu\t\t\t", "date": "2021-01-11T19:29:37+00:00", "topic": "Why Was  A FISH  Test Ordered ?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy Uro ordered a FISH -- in addition to the normal cytology -- with my recent cystoscopy. I was curious, too, since he had not ordered one in the 2 1/2 years I've been seeing him. He said he does it every 1 to 2 years as an additional check.\t\t\t", "date": "2021-01-11T19:29:37+00:00", "topic": "Why Was  A FISH  Test Ordered ?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news!\t\t\t", "date": "2019-12-14T00:46:54+00:00", "topic": "TURBT Followup - Thoughts Welcome!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't want to speculate about the reasons for my recent experience, but I did think it fit under this topic: After 12/18 TURB, I had small clots and occasional visible blood (not gross) around week 7-8. At 3/19 cystoscopy, Doc says it's still healing in there. After 9/19 TURBT, I passed some clots and blood at beginning of week 4. Started BCG about 10 days later, as new tumor was upgraded to HG papillary. Four days after 2nd treatment, gross hematuria and clotting sent me to the ER and the operating room for emergency cauterization of tumor resection site.\t\t\t", "date": "2019-11-07T06:35:37+00:00", "topic": "Clots and gross blood 3 1/2 weeks after TURBT", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHTXfire:\nAt November cystoscopy following my initial TURBT, doc saw \"3 or 4 red patches\" around the initial resection site. (Of course this news didn't help my state of mind.) Had a second TURB with intravesical Mitomycin in December, although no catheter. Doc resected one site and biopsied another; pathologist identified cystitis cystica, but no cancer in tissues. Between weeks seven and nine, following 2nd TURB, started having some discomfort when urinating (particularly getting flow started), with minor bleeding and passing small clots. Sounds like your reaction is much more severe, but timing seems similar. I don't know if my experience was a reaction to Mitomycin or just the healing process. At March cystoscopy, doc says \"it's still healing in there.\" He'll be taking another look-see soon. Hope your symptoms diminish quickly. Stu\t\t\t", "date": "2019-06-02T04:40:07+00:00", "topic": "Delayed side effects with Mitomycin", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear teachcc:\n\nI am a relatively recent subscriber to the forum and have found it exceptionally helpful in providing information about this condition. I saw your post over the weekend, but didn't know how to respond. I apologize that I didn't.\n\nMy efforts at prayer have always been rather intermittent and disjointed, but I want to let you know I have been lifting-up in prayer you and your husband and son and his bride-to-be. I wish you strength and peace. -Stu\t\t\t", "date": "2019-03-01T02:01:07+00:00", "topic": "Husband's biopsy confirmed metastatic bladder cancer in lymph nodes", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHi, Gina. I've been checking this site for a couple of months to gather info, and decided it was time to register. l had my second TURBT this week and received a decent pathology report today. I'm pretty new to this, so I can't offer much in the way of advice, but I am wishing for a favorable outcome for you. Waiting for information can be so nerve wracking. Peace. Stu (aka, JigStep)\t\t\t", "date": "2018-12-21T04:58:51+00:00", "topic": "Gross Hematura", "subforum": "10-women-and-bladder-cancer"}]}