{"signature": ["TURBT", "Dx", "TURBT"], "posts": [{"text": "\n\t\t\t\tKoalaGuy\n\nsorry to hear of your diagnosis.  Wish I could offer advice, but the path you are on is far more advanced then mine so I have not personal experience to share.\n\ni will however offer up some prayers that you find answers to all your questions, that the oncologist you work with is a good fit and that you find courage and strength to battle forward!\n\nGod bless, stay strong and keep us updated!\n\nJim\t\t\t", "date": "2020-06-29T02:40:23+00:00", "topic": "New member", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJessica\n\nsorry to hear that your dad has bladder cancer. It is scary, but know that there is a community hear that will listen and offer up any advice or help they can!\n\nThe good news is that your dad's cancer is a good type of cancer of the bladder, if that makes sense.  Meaning very treatable with good long term results.  The not so good news is that it has a good chance of recurrence.  But again, if caught early very treatable!  So, the follow up plan is imperative and needs to be followed to the T.  He needs to go to all the scheduled cystoscopies as they are the best tool to catch any recurrences as soon as possible!\n\nLike your father's doctor has already suggested...... 3 months, 3 months, 6 months, 6 months, 9 months, 9 months, annually annually annually!!  Very important to get it done.\n\nGood luck, prayers, stay in touch and keep us updated!  STAY STRONG!\t\t\t", "date": "2019-12-15T16:14:16+00:00", "topic": "Low grade urothelial carcinoma", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tdlockesf\n\nwhen having a cystoscopy, especially with the anticipation that you know it is going to be done at some point (i.e. - routine follow up) (or in your situation bleeding and waiting for the dr) the anticipation can be monumental and so when the procedure is performed and completed, it may feel like it literally took seconds. To answer your question, it generally takes a minute or two, at least in my experience that's what it has taken each time.  And, doctors performing this procedure know exactly what they are looking for and at.\n\nUltimately, a doctor performing such a procedure is doing so with the knowledge that certain medical conditions cause the issues you were having and failing to do a thorough exam could certainly lead to unfavorable results to the doctor.\n\nthat said, i'm definitely not discounting your thoughts, feelings and position.  And I'm sorry your experience left you concerned and wondering, that is not what anyone wants.  I was a patient of such a physician (my GP) for four (4) years and I'll leave it at that.  IF...you feel that you did not receive the appropriate care, I would suggest you find a doctor that is \"right\" for you.  I don't mean a doctor who will tell you exactly what you want to hear but rather one who \"listens\" and \"takes time with you\" and will explain what needs to be done and provide it with thorough care.\n\nUltimately you are in charge of you and your health.  Find another doctor who will listen to you and provide you with the comfort and satisfaction you think you didn't get the first time around as well as a doctor who is the right \"fit\" for you.  It's not easy but it is necessary because ultimately if you don't feel like your being heard then you will always be left with nagging thoughts.\n\nPraying and hoping that you find the right fit and that the results are that you don't have cancer!  All my best and good luck!   Stay strong.\t\t\t", "date": "2020-07-08T20:50:09+00:00", "topic": "Welcome Dlockesf,Diagnosed as not having cancer but having doubts", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi guys.\n\nsorry for the drop off.  thought ild update and just vent a little.....\n\nI've been feeling crappy even after my TURBT back in october.  And a little over two months ago I found a lump on the right side of my neck which continues to get bigger.  I had multiple doctors appointments and finally had a physical exam by my ENT.  He ordered an ultrasound of my neck which in turn showed the 1 lump I found to actually be two tumors right next to each other and then also found multiple additional tumors throughout my neck and down into the top of my chest.\n\nToday I had multiple biopsies performed on my neck and at the base of my neck at the same time and am now waiting for pathology results.   I'll have those results next week Friday at 2 pm.  Anxious as hell not knowing what all this is.\n\nSo with all this i've been just trying to keep myself above water with continued fatigue, weakness, shortness of breath, difficulty in swallowing and discomfort all over body malaise.   And hence,  have just not made it to these forums.\n\nI hope everyone is doing ok and that everyone had a very Merry Christmas and happy New Year!\t\t\t", "date": "2018-10-09T14:06:08+00:00", "topic": "In the process.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDL a.k.a. doglover,  that's your new handle for me!  LOL\n\nI am relieved!! And yes the best diagnosis you can get for bladder cancer!!\n\nToo funny,  I was thinking the exact same thing about how our paths are identical!!!  Without a doubt scope buddies all the way, we are on the same schedule.... slightly ironic wouldn't you say!  I pray that neither of us gets anymore cancer news and that we both remain free from this ugly disease.\n\nI will meet with me urologist on Tuesday next week 11/13, but as it stands purely scopes with no other treatments at this time.\n\nSorry to hear about your knee.  I hope you recover quickly and are back to hitting the pavement soon.  I returned to the treadmill today....albeit a slow walk but it felt good.\n\nGod bless DL!  Praying for no recurrences for both of us!\t\t\t", "date": "2018-10-09T14:06:08+00:00", "topic": "In the process.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGot the call today.\n\nNon-invasive low grade transitional cell carcinoma.  TURBT successful with complete resection.   Start quarterly cystoscopies.\n\nRelieved that there was no invasion into the bladder wall!!!\n\nNot that anyone wants cancer but from a cancer perspective this is very good news!!!\t\t\t", "date": "2018-10-09T14:06:08+00:00", "topic": "In the process.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tdoglover,\n\nI am so glad to hear that you are emotionally relieved AND getting back to exercising!!  That is excellent news!!  You seem very calm with the final diagnosis of cancer, which I guess is a good thing.  I will continue to hold you in my daily prayers that you have no recurrence and you remain healthy and strong!\n\nI'm with you in regards to your urologist's comment, benign would be waaaayy better.  But I understand why he's saying what he's saying.  In the scheme of \"cancer\".......  low grade, non-invasive, that's much better than high grade T4.\n\nWhatever God's will, there is no doubt in my mind that you will carry the load!  With His grace continue to be strong!!!  As always, my prayers and thoughts are with you!\n\nI hope the running gets back up to full gear for you as soon as possible.    I tried getting on the treadmill thursday (1 full week after my TURBT) with the intention of walking a couple of miles.  I managed two relatively well, albeit a 20 minute mile pace.  The walk must have shaken up my bladder because several hours later wonderful material came out in my urine!!!  LOL!!!  Other than that a little tenderness that next day but have given it a rest and am feeling good.\n\nThank you for the continued prayers!  I will update when results are received on Nov 13th.\n\nAll my best.\n\nJim\t\t\t", "date": "2018-10-09T14:06:08+00:00", "topic": "In the process.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGlad to hear things are going in the right direction with your TURBT!\n\nThinking of you and praying that you continue to heal up!\n\nSounds like everything went well!\n\nRest! Update when you feel better!\t\t\t", "date": "2018-10-25T01:52:56+00:00", "topic": "Typical duration: cystoscopy &amp;gt; TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTony....\n\nI read your post,  and my goodness your words ring!\n\nWe are only human and our minds are just wired to think.   Our family and friends keep us busy and help us thru with distractions and things to do, but the quiet times are difficult.  I found binge-ing on a TV series helped get thru those quiet periods.\n\nYour next time stretch will be waiting for the pathology report.   It is crazy..... but when you start thinking,  find something to change your train of thought.\n\nPost surgery pay close attention to your body.   Don't be the hero and think you'll get through something.  if something doesn't feel right or seem right.....call your doctor.   rest.\n\nHoping all goes ok and that you get the best possible news.\n\nStay strong!\n\nJim\t\t\t", "date": "2018-10-25T01:52:56+00:00", "topic": "Typical duration: cystoscopy &amp;gt; TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tRobyn, sorry to hear that you're dealing with medical issues.  I will re-iterate Alan's words,  microscopic hematuria (and gross hematuria) can be a result of many different things.   So first thing,  breath.   Next again with re-iterating Alan's words,  I too would be concerned.\n\nI'm not a doctor but for me, after my experiences,  I would be obtaining a second opinion.  That's just me.   Like Alan suggested, antennas up.  You are in control of your body.   And so if it takes you a second opinion to gain that additional comfort then that's your choice and your right to do that.   No one should diminish your need to gain the information necessary to achieve comfort, confidence .....and assurance.\n\nI think 6 months is a long wait. I'm sure the doctor feels this is reasonable, but again you're in charge and if you think that's too long for you then discuss that issue with your doctor as well.\n\nPrayers that you find answers.  And more prayers that the answers you receive are not related to cancer.   Be strong!\n\nKeep us updated!\t\t\t", "date": "2018-11-16T12:59:35+00:00", "topic": "Atypical Cells with Microscopic hematuria", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tknifedealer\n\ni'm sorry to hear you are going through this.   my prayers and thoughts are with you.\n\nI will tell you that post resection,  definitely follow your doctor's words on resting and not lifting heavy objects etc.  REST!!!\n\nThese instructions are very important and necessary to proper healing.\n\nMy pain was high in terms of urinary relief post surgery for two days then tapered off, other than that the pain was not bad at all. I had significant blood clots post surgery and continue with such due to location and size of my tumor.   I met with my urologist yesterday,  3 weeks post TURBT .....and I still had scabs small clot and hematuria due to healing the day before (painless).\n\nBut again,  rest rest rest!!!\nPlease let me know how you make it with everything post surgery.\n\nthinking of you.\n\nJIM4\t\t\t", "date": "2018-10-19T09:10:00+00:00", "topic": "Had my TURBT today.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tdoglover\n\nglad to hear you had the resection completed!!  Best of luck with results and healing!!!\n\nJim\t\t\t", "date": "2018-10-19T09:10:00+00:00", "topic": "Had my TURBT today.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSounds like you're researching and doing what you need to!  Take breaks to not overload .....and speaking from a personal perspective, just remember you're the boss.\n\nGod bless you and keep taking those deep breaths!\n\nJ\t\t\t", "date": "2018-11-12T01:46:25+00:00", "topic": "Newbie, scared to pieces", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCorabell,\n\nso sorry to hear of your diagnosis.  I was just diagnosed with the best possible news as it relates to bladder cancer (Ta non-invasive papillary TCC) so I have not been dealing with the issues that you are.   Im no doctor,\nhowever, I've heard good things about Brigham & Womens.  And it looks like Alan is confirming the same in his reply!  I would think you are in good hands as they are affiliated with Dana Farber I believe.\n\nLike you I live North of Boston, right in the MA/NH line.  We are fortunate to have the medical resources that we have readily available to us and not having to travel cross country or several hours to get to qualified care.\n\nI'm holding you in my prayers and thoughts.\n\nIf you need an ear holler away.\t\t\t", "date": "2018-11-12T01:46:25+00:00", "topic": "Newbie, scared to pieces", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tdoglover.  sorry to hear that the final pathology is cancer.   im thinking of you and hoping you are doing ok.  sending up prayers that you find strength and courage.\n\naccording to my urologist,  this type of cancer has a high rate of recurrence.   hence,  the continuous monitoring.  I have no idea how correct this is as I have no experience with recurrence but thought I would share what my urologist told me.  so,  with that, do not miss appointments!!!!\n\nbe strong and remember....\n\nyou never know how strong you are,  until being strong is the only choice you have.\n\nGod bless!\t\t\t", "date": "2018-10-29T04:09:56+00:00", "topic": "Results: pathology report.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tswarmy....thanks for the insight!  this is useful information as well.  being caught off guard threw me.  my mind was just caught on seeing the tumor and didn't shift to anything else other than hearing my urologist say....\"ok, the scheduler will call you in the next few days so we can schedule a TURBT\" and my mind thinking it's back.  Didn't even think to ask about what does this mean from a treatment perspective, follow up perspective, or anything else.\n\nI followed up with my urologist with my questions after getting back home.\n\nLikewise my wife and kids worry more about than I do, or at least that's my perception.  I knew the possibility existed that recurrence was a good possibility, but I think that thought was tempered some because of being  a little over a year and a half with clean cystoscopies.\n\nAt any rate, thank you again and wishing you all my best. Stay strong.\t\t\t", "date": "2020-07-07T17:01:39+00:00", "topic": "Bump... REMINDER", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlan, thank you for the kind and good words! As always like you say, 1 day at a time.   Always hope that it is benign!  Seeing the tumor today during cystoscopy caught me off guard so I wasn't thinking to ask detailed questions.  My urologist went right to TURBT and getting OR booked and resection scheduled.   I have followed up with questions including BCG etc.\t\t\t", "date": "2020-07-07T17:01:39+00:00", "topic": "Bump... REMINDER", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi All!\n\nJust had cystoscopy this morning (post TURBT - approx 1 year 9 mos) and found a new tumor.\n\nWas feeling confident being so far out post TURBT October 2018 that all would be clear again as in prior cystoscopies.\n\nSO REMINDER, stay on top of follow up cystoscopies!!!  So important to catch these things as early as possible.\n\nWaiting for appointment for TURBT.  Any thoughts from experienced patients on best practices for individuals who fall into the recurrent category, feel free to share!\n\nAll my best.\n\nJim\t\t\t", "date": "2020-07-07T17:01:39+00:00", "topic": "Bump... REMINDER", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne.\n\nThank you!\n\nJim\t\t\t", "date": "2018-11-30T19:32:08+00:00", "topic": "elevated erythrocyte sedimentation rate......", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tquick question,  has anyone come across having an elevated erythrocyte sedimentation rate post TURBT?\t\t\t", "date": "2018-11-30T19:32:08+00:00", "topic": "elevated erythrocyte sedimentation rate......", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's good news!  Happy for you!\n\nSo good to hear this.\t\t\t", "date": "2018-11-07T23:20:55+00:00", "topic": "First three month cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tChels\n\nI just logged in and saw your post!  So sorry to see that no one has responded to your worries even with just a simple acknowledgement of thoughts of prayers.\n\nI'll apologize right up front for not having the right words for you personally,  but I did read your words and certainly can empathize with your concerns.   The constant wondering can wear down even the strongest of folks.\n\nI wish I could aleve your worries.  I'll be thinking of you as you enter for that first round cystoscopy and that hopefully nothing is seriously wrong and that you figure out what is causing all this pain.\n\nPlease update so I know how things went!\n\nJ\t\t\t", "date": "2018-11-07T23:20:55+00:00", "topic": "First three month cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\ttealady24  I'm thinking of you!!!  Keep fighting!!!  Stay strong!!!  You've got this!!!\n\nAnd thank you, everything will go well on my end!\t\t\t", "date": "2018-09-25T21:28:36+00:00", "topic": "MVAC side effects", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCynthia,\n\nfirst, thank you for being on these forums and sharing.  I hope you continue to be healthy and that all is good.\n\nFor quite some time now, I thought I was crazy.  Nagging health conditions (unexplained anemia, pain, continued weakness, fatigue, constant need to urinate, having to push to urinate,  etc...) that have persisted for several years.  Over that time, I found myself needing to rest (nap) (at times quite lengthy naps) and found sitting in the jacuzzi for an hour or two helped me get thru.    All the time I did this, my spouse (innocently) would nag at me and needle me to get up and get stuff done or as we joke about it now....\"get your lazy a** off the couch and get to work\"!\n\nOf course, she feels horrible about it now but point being, giving yourself permission to do these things is huge.  Even when you don't have a diagnosis!  Your words couldn't be any truer and patients/people need to hear them and realize it is okay to set everything else aside.\n\nI have not been officially diagnosed yet.  Hematuria 4 weeks ago, tumor found by CT scan 2 weeks ago, met with urologist 1 week ago, cystoscopy 1 week from today, TURBT to be scheduled shortly after cystoscopy.  Have had so many other symptoms for quite some time now and in retrospect it all adds up, but holding onto possibility that tumor is benign.  If not, as my urologist told me, we know the tumor has not gone through the outer layer of the bladder and he feels we have found this early enough!  Best thing out of all this is, I finally have evidence that tells me I wasn't crazy and now I know what I'm fighting.\n\nTo TeaLady24, stay strong, fight through, prayers and thoughts to you!\t\t\t", "date": "2018-09-25T21:28:36+00:00", "topic": "MVAC side effects", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}]}