{"signature": ["Surgery", "Surgery", "Surgery"], "posts": [{"text": "\n\t\t\t\tPjallen820,\n\nI am 14 months post radical cystoprostatectomy with an ileal conduit. I went through all the same research and decided that the IC was the best choice for me. I don't have a desk job and I'm moderately active all day climbing ladders and such. I have had no issues with the IC in doing anything I want to do. I have also had no appliance leaks and regularly get 1 week out of each appliance. I spend only about 20 minutes once a week in changing the appliance.\n\nI chose the IC for a few reasons. I didn't want to make a decision that best suited me at 45 years of age that made life more challenging as I get older. The IC can be maintained by a caregiver if that's where my journey takes me. More importantly, I chose the IC because for me, I saw it as the quickest way to adjust to a new normal and get on with life. I knew, personally, that I would struggle with the mental fortitude to train a neo bladder. 14 months later, I have no regrets.\n\nStay strong.. You'll beat this. Best of luck to you.\n\nJoe\t\t\t", "date": "2017-10-09T12:30:32+00:00", "topic": "BCG fails, what next?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGKLINE,\n\nSo hard to read about this coming from you... You have been the voice of encouragement and positivity for dozens of scared people passing by this site in search of answers, guidance or reassurance. I hope you're next update reflects good news. We're thinking of you..\n\nJoe\t\t\t", "date": "2017-07-18T18:24:16+00:00", "topic": "The best of times and the worst of times", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI just had my first round of BCG last Friday, 16 days after my last TURBT where 2 small tumors were removed.\n\nJoe\t\t\t", "date": "2016-03-31T21:54:41+00:00", "topic": "Nurse Dissented against Doctor, Confusion ensues..", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi again.\n\nSecond opinion at Sloan Kettering in NYC was rather uneventful. No chemo suggested at this time and we'll take a 'wait and see' approach and monitor for tumors in my abdomen with CT scans. Getting into and out of NYC is not fun at all!\n\nHad second cystoscopy/TURBT on 3/17. Dr was pleasantly surprised that there was only 2 small tumors to resect. No Mitomycin administered and I'm cleared for BCG in a few weeks pending final pathology confirmation.\n\nI do have a question for those that can help.. Since the TURBT, I have the sensation of having to urinate ALL the time! I'm up every two hours all night long feeling as if I have to urinate. I can go a little longer during the day, but the sensation is still there. Is this typical and does it subside over time? Dying for a good night's sleep!\n\nJoe\t\t\t", "date": "2016-02-12T22:48:10+00:00", "topic": "Experienced centers in NJ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust a quick update...\nSurgery last week went as good as could be expected. 7.5 hours long but 100% of the ureter was removed along with several pelvic lymph nodes & TURBT to remove several patches in the bladder. Ureter was 100% involved with stage 1 high grade tumors. Bladder tumors also found to be stage 1 and high grade. On November 30, 2015, these areas were clean during kidney surgery.\n\nPlan now is another TURBT in a month followed by BCG treatment. Chemo may or may not be administered since its not within the guidelines for stage 1 tumors, but it is returning rather rapidly and the lymph nodes near where my left kidney was are still there and could be at risk.\n\nAnd a second opinion at Sloan-Kettering in Manhattan even though all I've read is consistent with what the Dr has suggested.\n\nJoe\t\t\t", "date": "2016-02-12T22:48:10+00:00", "topic": "Experienced centers in NJ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, Jeff. Appreciate your thoughts. The answers you provide to other posts also keep me well informed! Great job!\t\t\t", "date": "2016-02-12T22:48:10+00:00", "topic": "Experienced centers in NJ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAnita,\n\nThanks for your well wishes. Yes, they will also cuff the bladder where the ureter penetrates. This has been a bit of a shock for sure having been lulled into thinking I had RCC contained in the kidney, clean margins after surgery and a clean bladder just 2 months ago. The cystoscopy results a few days ago really came as a shock. Yanked me from the state of denial I lived in briefly.\n\nBest of luck to Doug. With my kidney surgery I was feeling pretty good 1 week after and really good within 3 weeks. Hope he shares the same results!\n\nJoe.\t\t\t", "date": "2016-02-12T22:48:10+00:00", "topic": "Experienced centers in NJ", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood luck Mike. Glad to see you're going the BCG route first!\t\t\t", "date": "2016-02-23T02:49:54+00:00", "topic": "Path Rpt - Definitive Invasion is not identified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Dave,\n\nHope I can help. I'm 11 months post RC with ileal conduit. I am using a 2 piece Convatec appliance without Eakin seals and it is lasting 1 full week. To date, I have not had a failure of the bag or any flange leaks, except for the time I caught the bag in my zipper. D'oh!\n\nAt night, I too use the Hollister night drainage bag with the adapters supplied by Convatec. I'm getting 2-3 months out of the night bag (rinsing it daily with hot water) but I change the adapter monthly. I hang the bag on the side of the bed using a plastic hanger stuffed between the mattress and box spring. I run the night bag tubing under my left leg and between my legs to the appliance. I sleep on the left side of the bed, so it's reverse if you sleep on the right side. I pull some tubing to create some slack and find that my left leg holds the tubing in place. I'm a side sleeper and roll back and forth all night switching sides. No leaks or backups to date.\n\nI did find that I have to prime the night bag as I get into bed. That is to leave your bag 1/3 full of urine, connect the night bag, open valve and squeeze the urine out of your pouch to fill the tubing. Works like a champ and I rarely have a full bag develop.\n\nI suspect that some of the issue you are seeing may be from the 1 piece system. I prefer the 2 piece with the convex moldable adapter flange. Early on, I used Hollister products, but just couldn't get comfortable with them, but for no specific reason.\n\nI'm certainly glad to speak with you directly if you have any questions. ]Sorry it's taken so long to see your post... Not passing by the forum as often is I should.\n\nBest regards,\nJoe\t\t\t", "date": "2017-06-21T23:01:30+00:00", "topic": "Urostomy night bag system kinking/leakage", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFishfreak11,\n\nI am 6 months post radical cystoprostatectomy with an ileal conduit. I went through all the same research and decided that the IC was the best choice for me. I don't have a desk job and I'm moderately active all day climbing ladders and such. I have had no issues with the IC in doing anything I want to do. I have also had no leaks and regularly get 1 week out of each appliance. I spend only about 20 minutes once a week in changing the appliance.\n\nI chose the IC for a few reasons. I didn't want to make a decision that best suited me now at 45 years of age that made life more challenging as I get older. The IC can be maintained by a caregiver if that's where my journey takes me. More importantly, I chose the IC because for me, I saw it as the quickest way to adjust to a new normal and get on with life. I knew, personally, that I would struggle with the mental fortitude to train a neo bladder. 6 months later, I have no regrets.\n\nStay strong.. You'll beat this. Best of luck to you.\n\nJoe\t\t\t", "date": "2017-08-23T19:42:19+00:00", "topic": "T-1 high grade, scheduled for bladder removal 29 Sep. Decisions to be made...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi, Herb,\n\nI can't specifically tell you how to prevent UTIs but I can tell you the process I use that has served me well for the 1 year I've had an ileal conduit. I have not had any UTIs and get 7 days out of every appliance regardless of my activity level such as running, swimming or working outdoors in the heat/humidity.  I too have a small diameter stoma and it is slightly convex.\n\nProducts used:\n* Convatec Sur-Fit Natura Durahesive convex moldable skin barrier #404592 for stomas 1/2\" to 7/8\" in diameter\n* Convatec Sur-Fit Natura urostomy pouch #401544\n* Allkare flange removal wipes #037443\n*Cavilon skin barrier wipe #3344\n* I do not use Eakin seal rings at all\n\nProcess:\n* I remove the old flange/pouch using 2 Allkare remover wipes and then dry the area under the flange with a clean  washcloth.\n* I then use a small pencil shaver (mens personal beard groomer purchased at Target for $15) to thoroughly trim any hair that grows under the flange area\n* then I shower without the pouch and flange using only Ivory soap. Clean the area well.\n* I place a clean dry washcloth over stoma while drying off using a NuHope ostomy belly to hold the washcloth in place. Place the new flange in the belt against your body to warm it up\n* once dry I use one Cavilon skin barrier wipe over the entire flange area up to the base of the stoma\n* remove flange backing, open up the moldable stoma opening and place over stoma. The moldable opening will slowly close in around the stoma but it won't pinch it off\n* snap on the pouch\n* I then wrap the NuHope ostomy belt really tight for 30 mins to be sure it adheres well\n\nHope this helps you. Maybe there's something in my process that is different in yours that might make a difference.\n\nI use a Hollister night drainage bag and I'm curious as to how you disinfect it daily. I just rinse mine with hot water.\n\nJoe\t\t\t", "date": "2017-06-14T23:02:02+00:00", "topic": "I Continue to Continue-Topic, are sugestions to help prevent UTI's", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDave,\n\nBest wishes in your journey. This is beatable! Here is my IC assessment copied from a different post:\n\nHello, all,\n\nA few posts ago in this thread, I asked if anyone with an ileal conduit was willing to share their post surgery experience. I'll answer my own request for the benefit of others!\n\nIn Aug, 2015, I underwent a cystoprostatectomy to cure stage 1 high grade cancer. It was my third surgery following the removal of my left kidney and a second surgery to remove the ureter. Life was dark and gloomy for a year.\n\nI am now 6 months post surgery with an ileal conduit diversion and I couldn't be more satisfied with my decision. The first several weeks where challenging in order to test the different appliance systems and get used to how best to change it. Once I settled on the appliance arrangement, I was able to refine the process of changing it weekly. Yes, I am getting 1 full week out of an appliance and that is only because I am choosing not to push it longer. I have gotten the time down to about 10 minutes before a shower to remove it and 5 minutes after to reinstall it. Showering without the appliance once per week is quite nice!\n\nI chose the IC because it would be the quickest way for me to get back to normal and I knew I would struggle with the mental fortitude to train a neobladder. I do not have any regrets.\n\nI am active at home and at work. I travel extensively for work. My wife has had to FedEx supplies to me! I have had no issues traveling by plane or with airport security for that matter.\n\nI had my first round of scans in December and all were clear of cancer. I celebrated the results with my first tattoo.... A compass tattoo with the words Faith, Family, Courage, Hope at the NE, NW, SE, SW locations. My focus on these four things will guide my through the cancer journey.\n\nIt's hard to keep spirits up when you get that news but I'm certainly a believer now that there is life without a bladder. Life for me is 6 months at the time for the next 5 years. And I'm going to be damn sure I keep my focus on the important stuff!\n\nThoughts and prayers to everyone. Thanks for all your support and guidance when I needed it most!\n\nJoe\t\t\t", "date": "2017-03-25T18:08:27+00:00", "topic": "Bladder cancer Ileal conduit (ileostomy) Surprises?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMary,\n\nSo sorry to read this update. It is not what any one of us wants to read or hear for ourselves. I have followed your story on this forum as I was going through the tough decisions and I could feel your pain and anguish. This is not a club we signed up for!\n\nBut since my surgery, I have come to realize that we don't have a choice as to how much time we get to spend on this great earth, but we do have a choice as to how we live our days. I have had the dark days you speak of... The days when you don't want to get out of bed. It truly sucks big time. But every day I wake up, I am thankful for one more day with my wife and children. I have chosen to be thankful for that time with them and to make every day special. I have chosen  Faith, Family, Hope and Courage as the four guiding principles of each and every day of my life, however long that may be. I have chosen not to go back to that dark place in spite of cancer and for the benefit of those I love and those that love me.\n\nSo I hope you read this, and the comments from others that are in support of your journey, and that you take a moment to smile, hug your loved ones and choose life!\n\nJoe\t\t\t", "date": "2016-08-06T21:38:14+00:00", "topic": "An update from Mary", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello, all,\n\nA few posts ago in this thread, I asked if anyone with an ileal conduit was willing to share their post surgery  experience. I'll answer my own request for the benefit of others!\n\nIn Aug, 2015, I underwent a cystoprostatectomy to cure stage 1 high grade cancer. It was my third surgery following the removal of my left kidney and a second surgery to remove the ureter. Life was dark and gloomy for a year.\n\nI am now 6 months post surgery with an ileal conduit diversion and I couldn't be more satisfied with my decision. The first several weeks where challenging in order to test the different appliance systems and get used to how best to change it. Once I settled on the appliance arrangement, I was able to refine the process of changing it weekly. Yes, I am getting 1 full week out of an appliance and that is only because I am choosing not to push it longer. I have gotten the time down to about 10 minutes before a shower to remove it and 5 minutes after to reinstall it. Showering without the appliance once per week is quite nice!\n\nI chose the IC because it would be the quickest way for me to get back to normal and I knew I would struggle with the mental fortitude to train a neobladder. I do not have any regrets.\n\nI am active at home and at work. I travel extensively for work. My wife has had to FedEx supplies to me! I have had no issues traveling by plane or with airport security for that matter.\n\nI had my first round of scans in December and all were clear of cancer. I celebrated the results with my first tattoo.... A compass tattoo with the words Faith, Family, Courage, Hope at the NE, NW, SE, SW locations. My focus on these four things will guide my through the cancer journey.\n\nIt's hard to keep spirits up when you get that news but I'm certainly a believer now that there is life without a bladder. Life for me is 6 months at the time for the next 5 years. And I'm going to be damn sure I keep my focus on the important stuff!\n\nThoughts and prayers to everyone. Thanks for all your support and guidance when I needed it most!\n\nJoe\t\t\t", "date": "2016-06-09T22:03:58+00:00", "topic": "RC inevitable - NJ Dr. suggestions?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello again,\n\nI had a second opinion at the Rutgers Cancer Institute of NJ and after some discussion of trying a round of mitomycin on me (since BCG was not effective) and discussion with my primary urologist, the Dr at RCI NJ concurs with the recommendation of RC.\n\nGeneral consensus is that BCG was not effective due to the use of Imuran to treat ulcerative colitis. Imuran is an immunosuppressive rendering immunotherapy useless.\n\nRC scheduled for early August and will likely result in an ileal conduit diversion although both docs are split on their opinion between IC and neo bladder. I'm researching both right now.\n\nThere is a lot of information within this site that describe the initial trials and tribulations and life after a neo bladder (thanks, GKLINE!) but not much in the way of the same for an IC.\n\nIs anyone with an IC willing to share their experiences with initial adjustment to, and general overview of life after IC diversion in terms of activity levels, clothing, etc?\n\nI ask because I'm only 45 and work in an atmosphere that requires some lifting, bending, climbing ladders, indoor/outdoor work in all seasons, etc.... Power plant stuff. This may affect my decision but I'm also trying not to make a decision that might be good for me now and not so good as I get older. I'm leaning towards the IC primarily because of my colitis. While that's been well managed for more than a dozen years..... Who knows what the future may bring.\n\nThanks so much to all that post here.... The knowledge gained from this forum is priceless.\n\nJoe\t\t\t", "date": "2016-06-09T22:03:58+00:00", "topic": "RC inevitable - NJ Dr. suggestions?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDannieC,\n\nI am 6 months post radical cystoprostatectomy with an ileal conduit. I went through all the same research and decided that the IC was the best choice for me. I don't have a desk job and I'm moderately active all day climbing ladders and such. I have had no issues with the IC in doing anything I want to do. I have also had no leaks and regularly get 1 week out of each appliance. I spend only about 20 minutes once a week in changing the appliance.\n\nI chose the IC for a few reasons. I didn't want to make a decision that best suited me now at 45 years of age that made life more challenging as I get older. The IC can be maintained by a caregiver if that's where my journey takes me. More importantly, I chose the IC because for me, I saw it as the quickest way to adjust to a new normal and get on with life. I knew, personally, that I would struggle with the mental fortitude to train a neo bladder. 6 months later, I have no regrets.\n\nBest of luck to you.\t\t\t", "date": "2016-11-18T04:36:06+00:00", "topic": "Surgery questions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPaula,\n\nThanks so much for sharing your experience with Dr. Weiss. My urologist is also RWJ affiliated out of their Somerville Medical Center. I will be sure to speak with Dr. Weiss as the strategy develops.\n\nThank you again,\n\nJoe\t\t\t", "date": "2015-09-08T02:34:04+00:00", "topic": "Potential cystectomy with Indiana Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi, PLK,\n\nI hope your recovery has gone well since your last post! You mention that your surgery was done in NJ. Would you mind sharing the doctor and facility information with me? I am faced with RC very soon and wouldn't mind speaking with a doctor that has a lot of experience with the IP surgery. I will find out next week if that type of diversion is suitable for me. I too live in NJ. Thanks in advance and hope you are well!\n\nJoe\t\t\t", "date": "2015-09-08T02:34:04+00:00", "topic": "Potential cystectomy with Indiana Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRocksteady,\n\nMy doctor also told me that the nephrostomy was needed to place the stent. There is apparently no way to find the ureter by going in through the conduit outlet. Best of luck.\n\nJoe\t\t\t", "date": "2016-09-14T13:36:35+00:00", "topic": "need help with urostomy bag", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tRocksteady,\n\nYes, having this IC does get simpler with time!\n\nMy nephrectomy (removal of left kidney) was required because that is where my cancer began. They thought originally it was renal cell carcinoma and so they left the ureter in place. That is why the ureter was removed in a separate procedure once it was known to be transitional cell carcinoma and it had spread to the ureter and bladder. That is different than the antegrade ureteral stent and nephrostomy. I had both after surgery.\n\nDuring surgery there was a stent placed from the ureter through the conduit that quickly dislodged within a day of surgery. 2-3 days later the swelling of the connection between the conduit and ureter made it such that urine was not flowing. I had a nephrostomy tube placed directly through my right flank into the kidney and it drained into a separate collection bag for about a week. That was very uncomfortable and made it difficult to move and sleep. Keep in mind this was right after surgery too.\n\nThen they removed the nephrostomy and placed an anterior ureteral stent from the kidney through the ureter and into the conduit. That stent was painless. That stayed in place for six weeks until I had one heck of a sneezing fit and it dislodged from the conduit into the pouch. Saved me a trip to the doctors to have it removed!\n\nHope this information is helpful and best of luck to you. Let me know if I can answer any more questions.\n\nJoe\t\t\t", "date": "2016-09-14T13:36:35+00:00", "topic": "need help with urostomy bag", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tRocksteady,\n\nJust cruising through posts and I came across yours. I know it's late and you've probably figured out the answers to the questions, but I'll offer my opinion to you.\n\nI live in NJ and travel for work to both warm and cold climates I have found no problems with sticking the pouch into my jeans and tucking in a shirt over the top. I wear jeans and cargo type pants that seem to be a bit more roomy in the front for when the pouch fills up.\n\nI use the Stoma Guard device as a protector at work but when I'm at home, I don't usually wear it. It's pricey, but I work in an industrial environment so I was concerned about puncturing it if I walked into anything sharp. I'm considering trying the waist band by Ostomy Secrets which has a pouch for added support.\n\nI'm not familiar with a leg pouch. Can you offer more detail?\n\nFolding the pouch isn't an option as the pouch needs to fill up or urine will back up.\n\nHope you found a solution that works for you.\t\t\t", "date": "2016-09-14T13:36:35+00:00", "topic": "need help with urostomy bag", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tBacibear,\n\nI am 6 months post radical cystoprostatectomy with an ileal conduit. I went through all the same research and decided that the IC was the best choice for me. I don't have a desk job and I'm moderately active all day climbing ladders and such. I have had no issues with the IC in doing anything I want to do. I have also had no leaks and regularly get 1 week out of each appliance. I spend only about 20 minutes once a week in changing the appliance.\n\nI chose the IC for a few reasons. I didn't want to make a decision that best suited me now at 45 years of age that made life more challenging as I get older. The IC can be maintained by a caregiver if that's where my journey takes me. More importantly, I chose the IC because for me, I saw it as the quickest way to adjust to a new normal and get on with life. I knew, personally, that I would struggle with the mental fortitude to train a neo bladder. 6 months later, I have no regrets.\n\nBest of luck to you.\n\nJoe\t\t\t", "date": "2017-01-12T23:29:38+00:00", "topic": "Ileal Conduit or Neobladder?", "subforum": "6-men-and-bladder-cancer"}]}