{"signature": ["Dx", "Surgery"], "posts": [{"text": "\n\t\t\t\tJT123,\n\nTo answer your questions:\n\n1) plain and simple, you absolutly need to get a second TUR to verify the pathology.\n\n2)Pat answered this for you and she is this sites expert on the best doctors and hospitals.\n\n3)I got an appointment at Mayo Clinic 4 days after I called them. I just had to let them know that I had a recent diagnoses of cancer.  Most major hospitals will do what they can to get you in quickly.\n\n4)I for one went straight to bladder removal after a diagnoses of T1 G3.  I had what pathology called a very deep T1 or T1B.  After questioning my surgeion he told me there was a 50 - 50 chance that it was T2 but he felt I should be treated with BCG.\nI did lots of research on the outcome/survival statistics of T1 G3 treated with BCG and did not like what I read. At Mayo they also recommended BCG, but when I asked if bladder removal was over treatment, they admitted that it was also a option and that it would provide the best chance for long term suvival. It sounds like you have been educating yourself up to this point. Keep up the research as knowledge is you best weapon against cancer. Do a google search on T1 G3 and do some reading. Then you can make a educated decision on what path you wish to take.\n\nKC\t\t\t", "date": "2010-11-21T03:00:10+00:00", "topic": "Newly diagnosed, in need of advice", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJoe,\nI have not been on the site for a while and just came across your post. In 2006 I had neobladder surgery at the University of Chicago Hospital by Dr. Gary Steinberg.  He is one of the best Uro-surgeons in the country. I am more than 4 years out with a neo and can tell you that my life now is exactly the same as before the surgery.  Also, like you I live up north.  My wife and I live by the Canadian border in Ely Minnesota.  I would be glad to share my experiences with you about the surgery and answer any questionas you may have.\n\nKC Madsen\t\t\t", "date": "2010-10-26T23:54:44+00:00", "topic": "newly diagnosed; where do I go from here?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMike,\nI just came across your post: MAJOR BLADDER CANCER HOSPITAL IS NOT AN OPTION. I must have missed it the other day.  Thanks for posting that and trying so hard to drive that point home.\nI got a total of 5 opinions before I got my neobladder.  I took the time to travel to Mayo in Minnesota and went to several major university hospitals in Chicago. I evetually picked The University of Chicago Hospital and all the time I took making that decision payed off big time. I hope everyone that is newly diagnosed reads your post and takes apropriate action.  We have all been stressing that on this site, but I think your posting really conveys the message strongly.\n\nKC\t\t\t", "date": "2010-04-04T19:02:08+00:00", "topic": "Major bladder cancer hospital is NOT OPTIONAL!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAndy,\n\nSnowmobile trails is northern Minnesota?  We have more of them than roads! The Taconite trail is within 2 miles of our property and is 170 miles long. It connects to the tomahawk trail which is another 80 miles and we have the circle tour trail that goes from Ely to Lake Superior and then up into Canada before returning to Ely, about 400 miles. There are hundreds of miles of smaller trails also. Come on up any time.\n\nKC\t\t\t", "date": "2010-03-17T00:45:29+00:00", "topic": "Map of the journey-- Andy II", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tRick,\n\nGood Luck on your upcomming surgery.  Wishing you the best.\n\nKC\t\t\t", "date": "2010-03-09T11:09:32+00:00", "topic": "Milestone", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAndy,\nIm So glad to hear that your path report is clear!  Now you dont have to worry about that and can just concentrate on the recovery process. If your recovery continues at the pace you are on now you will be back to normal in no time!\n\nKC\t\t\t", "date": "2010-01-24T13:26:09+00:00", "topic": "The map of the journey--Andy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI think you need to get some more opinions on the pathology. If it is indeed T3 you are getting into dangerous territory. Most uros recommend bladder removal for T2. I remember what I went through trying to decide if I should continue BCG or get my bladder out. It was the hardest decision I have ever made in my life.  I asked my GP what he thought and I will never forget his response. He recommended that I concentrate on saving my life and not an organ. In the end though it is your decision and not a doctors or anyone elses.\n\nKC\t\t\t", "date": "2009-10-20T17:54:05+00:00", "topic": "New Dilemma?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSharon,\n\nGo back to the bladder cancer web cafe home page and go down to where it says \"join\nour affiliated email discussion group hosted by ACOR.   Click on \"email discussion group\"\na new page will open.  on that page click on \"join the list\"   Join up and post your\nquestions there.   You will get MANY more responsed from over 500 bladder cancer suvivors.\nIt is a VERY helpfull group.\n\nHope this helps,\nKC\n\n", "date": "2006-05-14T17:07:54+00:00", "topic": "CT vs. PET scan", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGo back to the bladder cancer web cafe home page and go down to where it says \" join our affiliated email discussion group hosted by acor\"  Click on \"email discussion group\"  another page will open up.  on that page click on \"join the group\"    after joining that group post your questions there.   You will get many responses from over 500 bladder cancer survivors.  It is a very helpfull group.\n\nKC\n\n", "date": "2006-05-09T13:00:07+00:00", "topic": "I'm confused !!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPaul,\n\nGo to the bladder cancer web cafe home page blcwebcafe.org/   go down to where it says\njoin our affiliated group hosted bay ANCOR.   join that group and Post your questions there.   You will get many responses\nfrom over 500 bladder cancer survivors.  I know there are also people on there from the UK.  I am T1 G3 and\nam currently receiving BCG treatments.   I think the UK people on ANCOR could help you out alot.\n\nGood Luck\nKC\n", "date": "2006-04-13T22:32:02+00:00", "topic": "Hi - Another Newbie", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSteve,\nSorry that you have to be going through this.  First you have to realize that a diagnoses of T1 G3 is very treatable and has a high cure rate. I am glad to hear that you are at least considering\nboth conservative and aggressive treatments. (BCG vs RC) There are pros and cons to both. The standard treatment is BCG and close follow up.  I was diagnosed with T1B G3 almost 5 years ago. the T1B indicates what the pathologist called a very deep T1. I had 2 tumors both of which were T1B. I saw 4 different urologogists and all of them recommended BCG, but when I asked about RC all agreed that it was not out of the question as a treatment and it was my choice. I chose RC.  I have a Neobladder and have no regrets. My life has not been changed in any way by having a neobladder. It was a gut wrenching experience trying to decide on going with BCG or RC. The post by jj803 shows the dilema of T1 G3.  JJ's initial TUR was diagnosed as T1 and the follow up TUR verified T1. he chose RC and after his bladder was removed it was T2.  In his case he made the correct choice. My advice to you would be Google T1G3 and read as much as you can. there are lots of studies and statistics out there. Then you can make a informed decision on whats right for you.  In your favour is the fact that you have one relatvly small tumor.  Acording to most studies I read, this improves the success rate of BCG. Choosing BCG is not without risks, but RC is a Major operation and has its own risks.Above all it is criical that you go to a Major medical center and are treated by a urologist specialzing in bladder cancer. I wish you the best in what ever treatment you decide on and remember that T1G3 bladder cancer is very treatable cancer with a high cure rate.\n\nKC\t\t\t", "date": "2011-04-12T22:40:51+00:00", "topic": "Newly Diagnosed w/ T1-G3 Tumor...Terrified!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Jack!  Keep those good reports comming\n\nKC\t\t\t", "date": "2010-11-11T00:23:59+00:00", "topic": "Today I am 3 Years Cancer Free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIn all due respect, Cottage cheese will not cure cancer, no matter how much of it you eat.  If it were me I would throw all the books you have on curring cancer with a diet in the garbage.\nIf you would like to see the results of someone who chose a \"diet cure\" over traditional medicine go to www.stopdoingcancer.com\nIt is the log of a man who had the same stage and grade bladder cancer as your husband.  He refused to have his tumors removed afer they recurred and instead followed the advice found in a book about curring cancer with a diet. The results were not good to say the least. If you follow the advice of traditional medicine you have a real good chance for a good outcome,and if you want to combine that with a diet, as long as it is a healthy diet there is nothing wrong with that. But I would concentrait on learning all you can about Bladder Cancer and following the advice of a doctor and spending very little time reading paperbacks written by \"doctors\" who claim to cure cancer with a diet.\n\nKC\t\t\t", "date": "2010-06-10T19:16:35+00:00", "topic": "Biopsy results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Jim, One year down and many more to come!\n\nKC\t\t\t", "date": "2010-05-19T10:30:52+00:00", "topic": "Free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrank,\n\nLooks like you have several different inputs already into your diagnosis, thats a good thing, but my question would be how many pathologists have reviewed your tumor specimins? Pathology is more art than science, so if I were you I would get at least one more pathologist involved.  That is if you have not already done that.\n\nKC\t\t\t", "date": "2010-03-05T00:29:24+00:00", "topic": "Prostate and bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrank,\n\nLow grade superficial bladder cancer is not life threatening. It does however require close follow up and survelance. I also know of people who have low grade prostate cancer and they also are just under close follow up as it progresses so slowly.  One thing you might want to consider is to get a second opinion from a major medical center that specializes in cancer.  I dont know where you live, but Im sure the people on this site would be glad to recommend one that is the closest to you.\n\nKC\t\t\t", "date": "2010-03-05T00:29:24+00:00", "topic": "Prostate and bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRudy,\n\nYour post just made me remeber that I peed sitting down for about the first 3 weeks or so after my surgery.  At first that was the only way I could void completely.  Eventually, I experimented with peeing standing up and evetually figured out how to empty completely. Its really a case of just having to relearn how to control your bladder.\n\nKC\t\t\t", "date": "2009-12-17T16:27:19+00:00", "topic": "Post RC Updates continued", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRudy,\nI will try to answer you question to the best of my experience.  I remember that no one seemed to be able to explain to me how to void completeley.  I asked the doctor and people on this forum.  I just seemed to have trouble keeping a steady stream going and never seemed to empty completely.  I finally figured out the right muscles to compress and also realized that the days of peeing with a steady stream were gone.  after some experimenting, I learned how to flex the right muscles and that it took flexing those muscles over and over a few times to completely empty.  I think you are on the right track when you talk about sucking your gut in like it was when you were 20. I also was givin a tip by a person on this forum that may sound strange, but it worked for me.  Grab one cheek of your butt and pull up hard as you void.  try one side and then the other.  As strange as is sounds pulling up on my the right cheek of my butt makes it eisier to void completely.  It seems to make the muscle contractions more effective. I still do this to this day although I get some strange looks from guys in line at the public urinals.\n\nKC\t\t\t", "date": "2009-12-17T16:27:19+00:00", "topic": "Post RC Updates continued", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHappy to hear of all your good news!\n\nKC\t\t\t", "date": "2009-12-19T00:04:16+00:00", "topic": "On a ROLL....Good News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tStar,\n\nA T1 can be treated with a bladder saving techniqe.  Do you know what grade tumor it is.\nif it is high grade you need to be carefull.  Also You need to get another\nopinion.   I was diognosed Jan 3, 2006.   I have gotten 3 opinions.   also you need to learn all you can\nabout BC so you can make informed decisions.  I know about the stress you are going thru.  I have thought of\nlittle else but my condition since Jan 3rd.   I have trouble functioning, but it is getting better as time goes by.\nHang in there.  Remeber you are not alone,  there are others going through the same thing.   This site is\nvery helpfull also.  Good place to get info on BC.\n\nKC\n", "date": "2006-02-17T21:32:27+00:00", "topic": "after tumor is out", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Mike!  Keep the good news comming!\n\nKC\t\t\t", "date": "2010-11-12T20:01:42+00:00", "topic": "More good news!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Ed,\nI havent been on here for a while, so I just saw your post now.  I was wondering how you were doing as you hadnt posted for a while. I am really sorry to hear of the problems you are having. I hope this all clears up for you soon. After reading Jims post, I would think your neo will go back to normal size like his did.  Anyway, hang in there and know that we are all pulling for you.\nWishing you ther best,\nKC\t\t\t", "date": "2010-07-22T16:55:42+00:00", "topic": "Looking for advice on urinary track infections,,", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tArthur,\nI can tell you that after my neobladder healed that things actually improved.  No more 3 month check ups and cystos's, no more bcg treatments and the knowlege that I had done everything possible to beat the cancer. I had much more peace of mind after my neo.  I will tell you what I went through and that may give you an idea of what to expect.As far as my operation, it was not as bad as what I thought it would be.  I was in the hospital 8 days. I went home with the typical hoses and bags.  I had a foley cathiter, A wound drain comming out one side and another drain from my neo on the other side.  I also had stents in my kidneys that exited in small tubes by the wound drain. I had one complication and that was that my neo had a leak and was leaking into my abdomen.  That healed on its own after the 10 days at home. My wife assisted me in back flushing my neo through the folley and out the neo drain every 4 hours. after 10 days I returned to the hospital and had all the tubes removed except the drain from my neo. This allowed me to have 2 ways to empty the neo, which gave me peace of mind until I got used to the new equipment.  If I remeber right I went back a week later and they removed the drain from my neo. I had very little control at first, but after a week or so I slowly gained continence.  I was out and about by three weeks after my operation. After 4 weeks I gained pretty good continence and by 6 weeks I was about 95 per cent continent. 100 per cent continece (durring the day) came at about 2 months. Night time continece came about the same time, but was not 100 per cent. I did not experience any real pain durring this whole time, just discomfort.  Today I am 100 per cent continent durring the day and have just a little leakage at night once in a while so I wear a pad at night.  My life is really no different now that it was before the cancer.  I hope this gives you some idea of what to expect.  Everyone responds a little different to this surgery, but hopefully this gives you an idea of what to expect.  Again, one of the most important things is having a very skilled surgeon. If you want to know anything else just ask.  Im sure others would be glad to tell you of there experiences also.  Hope this helps.\n\nKC\t\t\t", "date": "2010-06-09T17:58:08+00:00", "topic": "4 years with a neobladder - Happy, but Confused", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Mona,\n\nThat is reasurring and it makes sense because I am pretty active also. After one episode of bleeding my uro did a cysto and said my neo looked red and irritated. He did not say that he thought that was the source of the blood though. I have always suspected that it was just an irritated neo. I have learned that the doctors dont always have the answers and thats what makes this site so important. Your husband will soon be passing the 4 year mark too, so congrats to him also.\n\nKC\t\t\t", "date": "2010-06-09T17:58:08+00:00", "topic": "4 years with a neobladder - Happy, but Confused", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a pretty bad leak after my neo operation, but it resolved itself after about 10 days.  I was told at the time that it would heal and close off by itself, but if it didn't that one of the options was to put tubes into my kidneys to drain the urine and let the neobladder heal without urine in it.\n\nKC\t\t\t", "date": "2010-06-14T01:49:36+00:00", "topic": "3 months in with neo bladder and still leaing", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike,\n\nGlad to hear things went so well and you can go home!\nTake it easy for a while and heal fast.\n\nKC\t\t\t", "date": "2010-06-09T22:30:07+00:00", "topic": "Heading back for another hernia repair.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am almost 4 years out with a neobladder and mucus is less now than it was the first year or so.  The only time I notice mucus now is if I get dehydrated.  I have never noticed what I eat or drink making a differance in mucus other that drinking enough liquids to stay well hydrated.\n\nKC\t\t\t", "date": "2010-05-02T22:02:31+00:00", "topic": "Questions about mucus in neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust wanted to reinforce what the others have said.  You really should get a second opinion from a Major Medical Center that specializes in bladder Cancer. It is important to take the time to find the best surgeon you can. If a neobladder is your choice, you need to find a surgeon who does 50 or more neobladders a year.  The more the better. RC is a very complex operation and the outcome is tied directly to the skill and experience of the surgeon.\n\n\nKC\t\t\t", "date": "2010-03-15T15:14:20+00:00", "topic": "Question from newly diagnosed with muscle invasive", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\n\nYou have been going through so much lately and yes, cancer sucks! Just wanted you to know that I am wishing you the best.\n\nKC\t\t\t", "date": "2010-02-23T00:10:47+00:00", "topic": "OK..throw one more thing at me .see if i care", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRick,\n\nJust like the rest of the RC surgery, the outcome has a lot to do with the skill of the surgeon. If I were you, I wouldnt think about an implant until you see the results of the surgery.\n\nKC\t\t\t", "date": "2010-03-07T11:19:28+00:00", "topic": "sex after surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRick,\nResults can vary greatly from person to person, but I will tell you my experience.  I had very little control for two weeks following my neobladder surgery. After that continence came on quite quickly. At 4 weeks I had very good control durring the day with only very slight leakage. By about 6 weeks I had no daytime leakage at all.  Night time was another story.  It took me about 3 months to get good control at night. I then went through almost 8 months of having occasional accidents at night and then that cleared up also.  I am now almost 4 years out and have total continence durring the day. As far as night time, I still have very slight leakage once in a while, so I wear a pad at night just in case. I feel that my life is as normal now as it was before my sugery. Hope this helps ease your concern.  Good luck on your upcomming surgery.\n\nKC\t\t\t", "date": "2010-03-04T15:33:59+00:00", "topic": "Studer fears", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJim,\n\nGlad to hear you are back to normal!  Seeing as I am on a roll for projections, I'll make another one:  You wont have any other problems.\n\nKC\t\t\t", "date": "2010-02-06T16:10:17+00:00", "topic": "My turn", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to see you back with us and doing so well!  You have a great doctor.  Dr. Steinburg did my neo over 3 and a half years ago and I have had no problems. As far as the ED, I agree with Mike that it can take a year or more for the nerves to heal. Hope things improve for you in that area in the future.\n\nKC\t\t\t", "date": "2010-01-31T14:47:15+00:00", "topic": "been gone for awhile", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tEd,\n\nThe B in my T1B diagnosis represents a very deep T1. Although it is not standard staging procedure, some pathologists break up the T1 staging into T1A and T1B. I had multiple tumors, one of which was very deep so they staged me as T1B. The deep tumor broke into small fragments when it was removed and I was warned that the pathology may be inacurate because of that.  My surgeon warned me that there was a 50/50 chance that my deep tumor was actually T2, although the pathology showed T1B.\n\nYes my birthday is june 1, 1952 so we are the same age and born on the same day! Looks like it was an unlucky day to be born on as far as bladder cancer goes. But then again maybe it was a lucky day, we have both survived the cancer.\n\nKC\t\t\t", "date": "2009-12-01T17:05:41+00:00", "topic": "Edward Homeward..", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSled Ed,\n\nSorry to hear about your return to the hospital.  Hope you are OK now.\n\nKC\t\t\t", "date": "2009-12-01T17:05:41+00:00", "topic": "Edward Homeward..", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Rudy,\n\nSounds like it would be way more effective than just the little note I have pasted to my drivers license -- Ill check it out.\n\nKC\t\t\t", "date": "2009-12-03T23:30:42+00:00", "topic": "Back Home and Lessons Learned from blockages", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRudy,\n\nHow much did all that cost?  Where did you get it from?\n\nKC\t\t\t", "date": "2009-12-03T23:30:42+00:00", "topic": "Back Home and Lessons Learned from blockages", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI got my UMMA test results back today.  They were normal.  Normal range was listed as less that 3.8, mine was 1.1   Im going to have this test done by my GP next time I have a physical and yearly after that just to be safe.  I think its pretty important for all RC people to have this test done once a year.\n\nKC\t\t\t", "date": "2009-09-05T16:51:29+00:00", "topic": "Cystectomy and Bl2 deficiency", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI got this off the Mayo site:\n\nA normal serum concentration of vitamin B(12) does not rule out tissue deficiency of vitamin B(12). The most sensitive test for vitamin B(12) deficiency at the cellular level is the assay for MMA. If clinical symptoms suggest deficiency, measurement of MMA and homocysteine should be considered, even if serum vitamin B(12)concentrations are normal.\n\n\n\nKC\t\t\t", "date": "2009-09-05T16:51:29+00:00", "topic": "Cystectomy and Bl2 deficiency", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWebs,\n\nDo you know which test they gave you?  My results from the serum b12 test were at 364, which also falls into the normal range.  If you are in the normal range and they still tell you you need shots it again makes me wonder what good the serum B12 test is.  (if thats the test they gave you)\n\nKC\t\t\t", "date": "2009-09-05T16:51:29+00:00", "topic": "Cystectomy and Bl2 deficiency", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had a neobladder for a little over 3 years now. I have been very fortunate in that my neobladder works perfectly.  I am 100 per cent continet durring the day and usually also at night although once in a while I leak a little at night so I wear a pad just in case. I had the nerve sparing surgery and have no problems in that area. The only thing I would say is different is that I have to urinate about every 2 to 3 hours.  My neo does not hold as much urine as my original plumbing. So I can say that my life with a neobladder is not really any differant than before. I am a very active outdoors person and the neobladder has not changed my activity level at all.\nAs far as cathing, I learned how to do it just in case I ever needed to in the future, but have never had to.\nIt is easy to do once you learn how.\n\nMy recommendation to you is:\n\nFind the best surgeon and hospital you can.\nYour surgeon should be one that has done hundreds of neobladders  (or which ever RC you choose)\nAsk lots of questions and learn all you can about BC and RC.\nKeep a positive attitude.  Life will go back to normal after the healing is done.\n\n\nKC\t\t\t", "date": "2009-08-07T01:47:35+00:00", "topic": "For George to illiot of neo that is the question?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had this compication after my neo surgery.  The wound drain in my left lower abdomen was filling with urine. I had to empty that suction drain about every half hour or so.  It was very stressful to think that urine was leaking into my abdomen, but my doctor was not concerned at all.  He said it would heal and close up on its own.  The leak continued for the whole time I was in the hospital (8 days) and for a week at home.  The leak slowly decreased and after a little over 2 weeks it resolved and they removed the drain.  My other concern was infection, but I was told that urine in your body is sterile and does not become unsterile until it is voided. I think your son will be just fine after the neo has time to heal.\n\nKC\t\t\t", "date": "2009-07-22T05:08:58+00:00", "topic": "Question from ejwright", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am three years out with a neobladder and I have had a small amount of blood in my urine.  Uro scoped my neo and said it looked red and slightly irritated.  He also scheduled a CT scan which came up clear.  I was told that occasinal small amounts of blood from a neobladder are possible and no need for alarm,as long as other screening tests and scans are clear.\n\nKC\t\t\t", "date": "2009-07-07T02:00:11+00:00", "topic": "Blood in urine after neobladder ??", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike,\n\nI know a guy who had a neobladder about the same time I did.  He had problems with several intestinal blockages 6 to 8 months after his surgery. That was almost 3 years ago and he has never had a problem since then.  It takes time for your body to completely heal from such major surgery. I'd bet those problems are now in your past.\n\nKC\t\t\t", "date": "2009-04-17T00:19:57+00:00", "topic": "Intestinal  blockage", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOk , so my cystoscopy was ok, my CT scan was clear, my bone scan was clear and all my blood and urine tests came\nback OK.\nMy GP sent me to a physical therapist for the back pain I have been having for the past 8 months and he says I have a sliped disk in my back.  I have had 2 sessions with him and my back pain is about gone.  After all the stress worrying about a recurance, it turns out to really be a muscular/schelaton back problem.  I guess I dont feel bad because my uro and GP both went straight to all those tests.\nOn one hand I guess you have to be carefull to look for recurrence, but you also have to be aware that not every little pain or simptom is return of the C.  Where do you draw the line?  Im sure I am hated by my insurance company.\n\nKC\t\t\t", "date": "2009-04-13T13:17:02+00:00", "topic": "Old Neobladder - New problem", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Carol,\n\nI am currently scheduled for RC on may 24th.   And just like you I have been on BCG treatments.\nDoctors wanted me to continue with BCG, But like you I dont trust BCG treatments seeing as I have high grade cancer. (T1 G3)\nAnd also like you the cancer has become the focus of my life and I want it gone.  I will hopefully get a neobladder.\nwhat grade was you cancer?  What diversion are you getting?  I wish you luck with your surgery.  My email is This email address is being protected from spambots. You need JavaScript enabled to view it. if you want to chat.\n\nKC\t\t\t", "date": "2006-02-16T20:30:40+00:00", "topic": "Ileal Conduit", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGo to the bladder cancer web cafe home page  and go down to\nwhere it says join our affiliated email group hosted by ANCOR.  Join that group and post\nyour question there.  You will get many responses from over 500 bladder cancer survivors.\n\nKC\n\n", "date": "2006-04-22T22:15:54+00:00", "topic": "Chemo after Grade 3 Cystectomy?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks,  I will try that in the future.\n\nKC\t\t\t", "date": "2009-07-22T15:34:49+00:00", "topic": "Test", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThis is just a test--please ignore and delete\nCant seem to reply to the forum  --  keeps giving me a text error message.\t\t\t", "date": "2009-07-22T15:34:49+00:00", "topic": "Test", "subforum": "17-chit-chat"}]}