{"signature": ["Surgery"], "posts": [{"text": "\n\t\t\t\tThis was great news, Anita.\n\nI have also thought about you much.\n\nIt must be a great relief for Doug, you and the rest of your family.\n\nI wish him a speedy recovery, and soon you will be out dancing again.\n\nSincerely,\nKnut\t\t\t", "date": "2015-11-05T01:32:24+00:00", "topic": "Urothelial cancer in the left kidney", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood to hear, Nicke.\n\nI hope it stay this way for you.\n\n\nFrom your neighbourcountry,\nKnut\t\t\t", "date": "2014-04-20T22:32:14+00:00", "topic": "All clear", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Nicke.\n\nI live in your neighbourcountry Norway and had my bladder removed some nine and a half years ago.\n\nWhat we have common is that we both have been treated at Scandinavian hospitals.\nAnd I remember there were several people that had superficial bladder cancer. One guy had been to the hospital for BC every Third month for 14 years. So he was kind of fed up with.\n\nI was also 48 at the time when I was first diagnozed. (The average age is 67)\n\nI have been a member of this community for several years but it's the first time I see another scandinavian in here.\n\n\nI hope everthing works out well for you.\n\nI live in Oslo and had my treatment there.\n\nAnd I end this message with a swedish phrase:\n\nHej då, så lenge!\n\nSincerely,\nKnut\t\t\t", "date": "2013-10-26T19:05:24+00:00", "topic": "BCG, Mitomycin or nothing?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI did not have cemo before or after my RC in 2004. They stopped with that procedure in the 80s my uro said.\n\nI live in Oslo, Norway and had my surgery there.\n\nI hope things work out well for you.\n\nSincerely,\nKnut\t\t\t", "date": "2012-12-24T03:25:20+00:00", "topic": "Chemo before or after RC for invasive BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis was nice to hear, Nicke.\n\nYou are lucky that they found it early and that they follow you up closely.\n\nPlease let us know how things develops.\n\nAll the best to you.\n\nSincerly,\nKnut\t\t\t", "date": "2014-01-16T17:02:28+00:00", "topic": "Cysto today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have the same diversion as you and have had it for 11 years.\n\nI change all things every day, the stomaplate, the bag, and even the nightbag.\n\nIt feels better that way, and the risk of it smelling is lesser.\n\nI wish you luck with your bags, and eventually you will get used to it.\n\nIt sure changed my life.\n\nSincerely,\nKnut\t\t\t", "date": "2015-05-29T16:45:54+00:00", "topic": "Iliostomy Care", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Joe.\n\nI live in Oslo, Norway and had my bladder removed some 10 years ago.\n\nI was so depressed when first diagnozed. Actually I did not care about diversion or other things. So the UROs convinced me that having a bag was the best alternative.\n\nAt first it was uncomfortable to have it and it bowled out suddenly at an airport so I was taken aside for checkup. And at that time I felt that I had chosen the wrong diversion.\n\nOver the years I have become used to live with my bag on my stommack and it does not prevent me from doing most things. I still work, travel etc. Only thing I don't do is jumping into the swimmingpool with it.\n\nI wish you good luck with your surgery, and please let us know how things work out.\n\nSincerely,\nKnut\t\t\t", "date": "2014-09-23T18:45:45+00:00", "topic": "Seeking Support", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Anke and welcome home.\n\nIt will take some time before you recover fully. Remember this is a big surgery and some people compare it with a hearttransplant.\n\nHave the hospital made any plans for followups and training?\n\nI remember it took me a while before the skin on my stommack got used to the stoma and I used a rubberbelt to hold it there.\n\nIf you have pain you should talk with your URO or your personal doctor about it.\n\nJust relax now and think that you will feel better soon.\n\nSincerely,\nKnut\t\t\t", "date": "2014-09-21T00:39:47+00:00", "topic": "cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Bella\n\nI'm the one that \"celebrated\" 10 year without a bladder.\n\nI know how you are feeling now, and that you are scared.\n\nYou and your family must have been through a tuff time with your husband having lymph-cancer, and now you with this.\n\nAfter the surgery it will go some months before you fully recover and get used to live with the bag on your stommack. But I promise you it will better eventually.\n\nAre you german and living in Australia? Where will you have your surgery?\n\nI live in Oslo, Norway and had my surgery here.\n\nI cross my fingers for you, and please let us know how things work out.\n\nSincerely,\nKnut\t\t\t", "date": "2014-08-30T11:35:54+00:00", "topic": "10 years ago-having a Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's OK, Earl.\n\nGood to hear about others that have been long in this \"business\".\n\nI have heard about someone that had been around with his bag for 27 years.\n\nI wish you all the best in the future and that you keep on for a long time still.\n\nSincery,\nKnut\t\t\t", "date": "2014-06-29T19:40:58+00:00", "topic": "10 years ago", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSince they are waiting until December, 2 1/2 month from now, I would think that it is not that serious.\nI have also had higher levels in my bloodtests, (some livervalues) and they took a CT-scan at the next checkup but nothing was wrong.\nThe only thing they accomplished was to scare me. The higher livervalues came from drinking beer the day before or some meds..\n\nSo this will work out fine, Betsy.\n\nBut you can get a Norwegian hug..\n\nSincerly,\nKnut\t\t\t", "date": "2009-09-21T19:11:04+00:00", "topic": "I really need a hug", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTo Steve\n\nI was devastated and chocked on Saturday evening when I saw your message.\nThis was the last thing I thought would happen to Claire. She and I was kind of \"pen-pals\". Wrote many PM-messages to each others.\n\nOf cause that you and your family have lost a beatiful wife, and a caring  and loving mother. Our thoughts goes to you and you and your children.\n\nBut we on this web-community have lost one of our best friends, and I promise you:\nI will never forget her!!\n\nI wrote in some of the last messages to her: You will allways have a big place in my heart...\n\n\n\nSincerly,\nKnut\n", "date": "2007-10-13T21:08:50+00:00", "topic": "Claires Battles Over", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello again\nI also had T3a and clean lymphnodes and no metastasis. Not sure why they want to give her chemo, but it could be a precaution, just like they do with some other cancertypes when they have reached a certain level. Things should look better for her now, since they probably have checked out the other organs that could be affected. I googled  on internet and found several descriptions on chemo as precaution along with cystectomi. Ask the doctor and they will tell you.\nAnd remembering my own cystectomi, you should really know how much it means that you as her husband are in it with her all the way. My wife did the same thing. Please say hello to Clair from me, and as you can see, many here on Blcwebcafe are thinking about Clair, you and the rest of your family.\n\nSincerly,\nKnut\t\t\t", "date": "2006-08-24T07:26:46+00:00", "topic": "Wife Had cystectomy yesterday advice please", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had the same surgery some two years ago, and it took some time before it adjusted. Remember that they have cut his colon in two and sewed it together. All of his stommack is taken out while operating. I had also some problems keeping on the food the first weeks. Eventually, I keep to much of the food because I have gained weight.  I wish your husband a speedy recovery and knows exactly what he's going through.\nKnut\t\t\t", "date": "2006-08-12T22:10:39+00:00", "topic": "Diet after cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you for sharing the good news!\n\nI'm sure that this will work out well for you guys. \n\nSincerely,\nKnut\t\t\t", "date": "2018-02-09T00:54:15+00:00", "topic": "Urothelial Cancer in Lung", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI also miss the chat. Hope that it still will be like it was.\t\t\t", "date": "2013-12-02T01:13:20+00:00", "topic": "Chat?", "subforum": "17-chit-chat"}]}