{"signature": ["BCG", "Dx"], "posts": [{"text": "\n\t\t\t\tWhat luck! He left his practice and you get to find a new doctor who will give you the care you need and be respectful to you.\n\n\nBTW, I have a fellow Bladder Cancer friend whose urologist would not do any surgery or treatment until he quit smoking. You may find the same thing as you go looking for a new uro.\n\nKeep us posted in your quest.\t\t\t", "date": "2009-04-10T18:34:22+00:00", "topic": "Anger.!!!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis is a tough on to decide, I am sure Bobbie.\n\nWhat if you looked at the Quality of Life yuou have now and what you would have if you removed the bladder?\nList the pros and cons. It may help you decide.\n\nGood Luck and keep us posted.\t\t\t", "date": "2009-02-18T06:14:17+00:00", "topic": "Went to the Uro/oncology Dr. today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Shell\nNice to see you here.\nI considered myself young when I was diagnosed although not as young as you. I had just turned 44.\nI was googling something the other day, maybe Non-invasive BC??? however what popped up was a hit on a 19 year old who had BC.\t\t\t", "date": "2009-01-21T15:06:24+00:00", "topic": "New dx looking for young BC patients + 2nd opinion", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Slabman\nSo glad things are going so well for you.\n\nI am the opposite to Jack. This will be my 3rd summer with Turbs and Treatments. Doing Mytomycin for 6 weeks after I have my Turb.\n\nOh well, my cottage will be there next year.\n\nLucky me, I got to meet Jack and his lovely wife in Toronto. Great folks and lots of fun. Hope to see them the next time I go!\n\n ", "date": "2009-05-22T05:52:57+00:00", "topic": "Just Checking In.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuzy, will keep you in my thoughts and hoping your treatments do the trick.\t\t\t", "date": "2009-02-23T17:24:25+00:00", "topic": "please listen", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI hope you don't either Jack.\n\nThis is interesting Alan. Thank you for posting it. I would consider it if I lived near one of those hospitals in Canada, however they are all to far from home. ", "date": "2009-02-16T23:49:57+00:00", "topic": "Any one that fails BCG see below", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat great news Donna. Good luck with BCG, I just finished my 3rd round. Lets see a pic of you in that new red car! ", "date": "2009-02-12T22:29:15+00:00", "topic": "So Happy For Donna", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThats wonderful news Nix.\nDoing the Happy Dance for you.\n     ", "date": "2009-01-01T06:00:03+00:00", "topic": "Cysto Scorecard", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI found it took longer to heal my last time as well. That was my 5th TURB. I think its harder to heal the more work you have done. I also can say thats how I feel \"bladder twinges/spasms\" when I empty my bladder. It got better slowly but it did get better. About 4 weeks I would say.\n\nHang in there. You are doing great.\t\t\t", "date": "2008-12-17T07:02:07+00:00", "topic": "WELL POOPOO", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo sorry about your mom and cat. It sure makes for trying times.\n\nGood luck with your Turb and BCG's.\t\t\t", "date": "2008-12-17T07:02:07+00:00", "topic": "WELL POOPOO", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree about the timing however so pleased you had clear results.\nI start BCG round 3 on Jan 15. We can whine together OK?  ", "date": "2008-12-23T10:03:22+00:00", "topic": "Time for more BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is plenty to be thankful for Jack.\nHave a happy holiday.\t\t\t", "date": "2008-12-25T15:51:13+00:00", "topic": "I am so thank-ful!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had 2 rounds ( Jan-Feb/08 and April-May/08)and never experienced any bleeding or other complications. I am scheduled to begin another round of treatments soon. I will be more vigilant this time since I am so much more aware of my BLC thanks to this fantastic support group. No more living in the fog for me.\n\nI hope your OK sapie my friend.\n\nLet me know if I can do anything for you from my city.\t\t\t", "date": "2008-12-18T13:02:45+00:00", "topic": "BCG maintenance complications", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is a great prezzie. YAY!\t\t\t", "date": "2008-11-26T02:35:56+00:00", "topic": "Cysto results --- hopefully good (fingers crossed)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news. Enjoy your break and the holiday season.\t\t\t", "date": "2008-12-19T11:52:14+00:00", "topic": "good news today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI get the anxiety. I was quite surprised with myself and the anxiety I had before my last cysto. I would have thought I had gotten used to them but it is the idea of finding more tumours that upset me.\n\nWe all have to do it so at least you are surrounded here by others in the same boat. We can be your shoulders.\n\nI hope you have a clean cysto and please keep us posted.\n\nHeres a hint my holistic therapist told me, hold your right index finger in your left thumb. Its a way to \"rest\" the worry.\t\t\t", "date": "2008-12-11T04:13:55+00:00", "topic": "It has been a while since I been here", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDisregard what I said as I see in your past posts that you have had BCG treatments. Sorry for the goof up. I am a newbie. ", "date": "2008-12-02T06:30:06+00:00", "topic": "Been a long time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo you have had to cystos and only had tumours once? Or were there tumours during found in your 2nd cysto?\n\nI had 3 cystos, with tumours found, taken out and cauterized. After the 3rd time he started me on BCG treatments. I have had 2 rounds of that without success. More timours on 4th cysto, more tumours on 5th cysto. I will start another course of BCG  in Jan.\n\nPerhaps your URO is waiting to see if this time there are more and then he'd take action. I don't know but I wish you luck on the 16th.\t\t\t", "date": "2008-12-02T06:30:06+00:00", "topic": "Been a long time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTerrific news Suzi. Celebrate for sure!\t\t\t", "date": "2008-12-09T21:19:37+00:00", "topic": "Good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think its normal to worry however I really try to remain positive and hopeful of a clear cysto.\nI have had 5 cystoscopies and not once have I been tumour free. I have multiple tumours usually.\nOnce I start BCG, I really try to concentrate on the BCG eating up any little tumours that may want to start. Then the 3 month period to wait for the next cysto, I just try to put it out of my mind. As the cysto date approaches, I do find myself getting on edge but like someone else mentioned, this is for life. All my life I will be seeing a urologist and having cystos done. So whats a girl to do? I just live with it and keep movin'. I REALLY, REALLY, want to fight to not loose my bladder.\t\t\t", "date": "2008-10-10T16:15:01+00:00", "topic": "Worried about recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPlenty to be Thankful for. ", "date": "2008-11-26T16:42:05+00:00", "topic": "An anniversary, of sorts", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHappy Thanksgiving to my American survivors, families, and caregivers. I hope you all have a wonderful holiday and would someone eat turkey for me? please and thank you. ", "date": "2008-11-25T00:08:05+00:00", "topic": "Happy Thanks giving guys,", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news John. So happy for you!  Woooohooooo\t\t\t", "date": "2008-11-06T19:37:27+00:00", "topic": "BC reoccurence with/without hematuria", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne\nThat is great news! WhooohoooB)\t\t\t", "date": "2008-11-11T02:39:24+00:00", "topic": "CIS Detection", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI never have heard about BCG and arthritis. This board has so much information. I am so glad I found you all.\n\nAnd Ro, I like your hair. You look beautiful in your avatar.\t\t\t", "date": "2008-10-23T22:46:43+00:00", "topic": "Arthritic Side Effects from BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a successful TUR on Wednesday. I stayed overnight in the hospital and got home yesterday. I am tired and dizzy ( drugs and anethesia) and sore inside but otherwise I am A-OK.\nMy urologist said he removed \"numerous small polyps\"\n\nI am now awaiting a schedule for 6 BCG treatments to be followed by once/month BCG.\n\nThank you all for your support and wondering how I made out. I  so appreciate it. ", "date": "2008-11-07T20:16:26+00:00", "topic": "I had my surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIsn't it interesting  the different responses to this subject. I guess we never know who, what, when or where do we?\t\t\t", "date": "2008-11-01T14:34:18+00:00", "topic": "Did you smoke?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy BF is vegan as well. I think I would miss cheese. In fact, I know I would miss cheese.\nWhen she visits we eat almost the same thing. My husband and I have always eaten a lot of veggies and salads and we don't eat take out or dine out at all.\nMaybe on our birthdays, thats about it.\nI prefer my cooking most of the time. ", "date": "2008-10-19T13:25:20+00:00", "topic": "Dr Lamm\\'s Nutritional Suggestions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is my next protocol as well. Surgery tomorrow, 4 weeks of healing then 6 BCG treatments with monthly instillations.\t\t\t", "date": "2008-11-02T17:48:22+00:00", "topic": "BCG Failure", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIts nice to hear a positive outcome moon. ", "date": "2008-11-02T17:48:22+00:00", "topic": "BCG Failure", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Ed. I am so so glad I found this site. I feel a lot better knowing other people with blc. Its great to be here and in just a day or two I havve learned SO MUCH. I told my husband I feel a lot more relaxed now that I am here.\n\nI hope I can stay awake long enough for the chat tonight.  I am an hour ahead of Eastern time but I will try. And if not this Sunday perhaps next. Either way, thanks for the warm welcome. ", "date": "2008-10-30T19:04:26+00:00", "topic": "A Canadian checking in", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat, I have pulled the path report I have here. Again its in french but it says \"papillary carcinoma, low grade, multiple fragments, no evidence of bladder infiltration.\"\n\nWith that info, I concluded Ta G1. Now maybe I am reading it wrong. When my next path report comes back after surgery Wednesday, I'll go get ALL the reports and have a big discussion with him on what they say. To be honest I have never researched it enough to know what I have found just in the last day or so. And I have this support group to thank for that. I am going to be more proactive with my cancer. ", "date": "2008-10-30T19:04:26+00:00", "topic": "A Canadian checking in", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, Moon is so nice to hear of your positive results.\n\nMy friend Tom has had good results with BCG as well. After two 6 week rounds of BCG ( 6 months apart) he had had his first clear cysto. I was/am very happy for him. ", "date": "2008-11-03T16:30:44+00:00", "topic": "Moonerj and BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWonderful news. I'd have a glass of red with you but prepping for surgery so no liquor. How about a virtual clink with my water glass.\t\t\t", "date": "2008-10-27T21:10:17+00:00", "topic": "All clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have wondered this myself. I have never had a flu shot before and didn't plan on having one but last winter I was sick quite often. A really bad cold that lasted 3 weeks and a viral infection. I had had 2 rounds of BCG so I wonder if it made my immune system low??\nI will ask my uro on Wed.\t\t\t", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBlocked carotids is normal in a man your fathers age. Not unusual at all. He is actually lucky its not worse or thay may not operate on him if necessary. He would not withstand the anethesia. A friends aunt had her leg amputated last week, with a spinal as anethesia. She is elderly and has blocked arteries. She would not have survived being put to sleep.\n\nI don't know the effects of a blocked artery on BP. Why don't you research it?\t\t\t", "date": "2009-02-15T14:56:09+00:00", "topic": "Blocked Carotid", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n  Glad to see you are full of P&V.\n\nNice to have you posting too. ", "date": "2009-02-01T21:26:01+00:00", "topic": "He makes a better surgeon than a travel agent", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWTG Betsy! You are a powerful force.\nI admire your strength.\n\nI bet you'll look just as beautiful with your new do's. Scarfs and a stylish wig. Hot!\n\nPrayers that your next treatment goes as well. ", "date": "2009-01-17T22:50:17+00:00", "topic": "I\\'ve done it!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nCynthia wrote:Lets cross our fingers that she is just taking time to heal and is not on the internet.\nYes, thats what I am hoping.\t\t\t", "date": "2009-01-02T12:49:12+00:00", "topic": "Circle of support for Carolyn", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can scream really really loud!\nCynthia, I am so sorry you are going through this. I will light a candle for you on surgery day meanwhile you are in my prayers.\nFight the fight!\t\t\t", "date": "2009-01-10T01:40:41+00:00", "topic": "It’s always something---what’s behind curtain #3", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tContinued prayes for your sister and you Barb. What a trooper you are. Keep up the fight.\t\t\t", "date": "2009-01-05T01:41:08+00:00", "topic": "Update on Sister", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGK, I don't think you are crazy at all. I have non-invasice cancer and at times I feel like cancer is raging elsewhere in my body. I think its a normal reaction. You have been through major surgery. Sometimes our minds just race but fear not, you are not alone.\n\nI asked the very same question to my breast cancer friend. She said basical;ly the same thing. If she gets a twinge she gets nervous.\n\nAnd welcome to the board. Glad to see you have posted. And so happy to hear your hip pain in NOT cancer. YAY!\t\t\t", "date": "2009-01-06T20:24:59+00:00", "topic": "It stays with you forever", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCarolyn\nCheck your onsite email. I sent you a couple of posts.\t\t\t", "date": "2008-11-18T03:16:24+00:00", "topic": "MVAC question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThats a beautiful website. I bet you are going to help a lot of poeple Melodie. How wonderful.\t\t\t", "date": "2008-12-08T19:56:49+00:00", "topic": "New BC Website", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYAY you last chemo.\nI hope your rash clears up ASAP.\t\t\t", "date": "2008-10-28T22:58:03+00:00", "topic": "Weird reactions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMelissa, you enjoy your honeymoon guilt free. You dad would get really mad at you if you spent your holiday feeling guilty. Have a blast and please, could you have a swim for me? Ahhhhhh\n\nHappy Holidays\t\t\t", "date": "2008-12-15T21:46:16+00:00", "topic": "Latest Test Results...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThank you Cynthia for answering. I used to be regular but since starting BCG, I seem to be unprdictable or I am perimenopausal ( spell?), who knows.\nLast rounds of BCG I went on the pill to stop the periods but it wrecked havic with my body so I opted not to do that this time.\nI am going to hospital tomorrow. I will ask the nurse how to prepare.\nHope you are feeling OK. Hugs\t\t\t", "date": "2009-01-21T16:14:41+00:00", "topic": "Menstrating during BCG and Cystos", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tThis may sound silly but what will I do when my period starts the end of the month and I have a BCG treatment booked and a cystoscopy in the same week? I hope this is not to much infortmation for some, if so stop reading here.\n\nWith the BCG I have to hold it for 2 hours. Do I insert a tampon just before the treatment is administered or not use a tampon at all, perhaps a pad after she withdraws the cath?. I know the nurses are professional but I will feel embarassed.\n\nAlso with the cystoscopy, my legs are up high on those thingies ( leg rests I guess). Again I don't know what to do re: tampon or pad ( that won't work for him to get to urethra) or wear nothing.\n\nThe anticipation is making me feel sick and sad.\n\nToday is not a good day. Maybe I am hormonal?     ", "date": "2009-01-21T16:14:41+00:00", "topic": "Menstrating during BCG and Cystos", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tOh Thank you Pat. Please let me know what he says. And you are so right, most women are into menopause when DX with BLC.\t\t\t", "date": "2008-12-06T13:40:42+00:00", "topic": "Am I the only one?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tOh boy! I must be blind. I can't find any reference to BCG and menstrual cycles. ", "date": "2008-12-06T13:40:42+00:00", "topic": "Am I the only one?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tWell thank you Maria and Pat. I will look into it.\t\t\t", "date": "2008-12-06T13:40:42+00:00", "topic": "Am I the only one?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI have read about many women not getting the attention they needed quickly enough. When I had blood in my urine I was on my period at the time. I am so glad that I could differentiate between the two. Not so many women have been as lucky as I have that way. I was in the hospital emerg the next day.\t\t\t", "date": "2008-07-23T05:11:48+00:00", "topic": "A disparity in referring female patients to a uro", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tJulie\nI am so sorry to read this. I think the hospital bed would be a good idea. We had one for my father ( major stroke at 60 yrs old) and it was very helpful. Mom could rest knowing he would not fall out of bed and it did help when we transferred him and such, (elevating the bed, etc).\n\n\nSending you a big hug for support.\t\t\t", "date": "2008-12-15T03:23:40+00:00", "topic": "Compelling Evidence", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tWhat a lovely picture.\t\t\t", "date": "2008-10-13T21:18:40+00:00", "topic": "Picture of Dick and our Granddaughters", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI have wondered this myself. I have never had a flu shot before and didn't plan on having one but last winter I was sick quite often. A really bad cold that lasted 3 weeks and a viral infection. I had had 2 rounds of BCG so I wonder if it made my immune system low??\nI will ask my uro on Wed.\t\t\t", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "17-chit-chat"}]}