{"signature": ["Dx", "TURBT", "Surgery", "Chemotherapy"], "posts": [{"text": "\n\t\t\t\tHello Pat,\n\nI hope the redness is fading or at least not getting any worse.\n\nWhen I had my full head radiotheraphy in Jan i had really rosy cheeks and neck.\n\nSudacreme helped me ....just rubbbed in at night before bed and pure alo vera for daytime...stinks a bit for about ten mins then wares off quick.....and then you can use your normal body creams....perfume free.\n\nIt will get better....I promise....I remember my mum's redness faded fast after the end of treatment.\n\nxxxleigh\t\t\t", "date": "2010-03-22T22:22:25+00:00", "topic": "I BROKE THE MACHINE TODAY!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDearest Pat,\n\nI wish you all the very best with your treatment.\n\nMy thoughts will be with you and hugs too....\n\nxxxleigh\t\t\t", "date": "2010-03-16T22:41:37+00:00", "topic": "OK Start Radiation this week", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Pat,\n\nHad my friend forward the email again as I deleted it from my mail box. It was a message posted on Cancer Research UK Forum. No link to the mentioned scientific study but it's green tea right any enhancement to treatment I am willing to take onboard.\n\nThanks Mike for the tip about white tea..I am now having both...the white tea also helps to reduce fat levels which I am happy about. Have been piling on the pounds while on steroids these last few months.\n\n(Message on Forum )\n\n\nHi,\n\nI have an interesting information for you. I am working in hospitals and a colleague of mine, a radio-oncologist, has showed me a study *that was published in the Journal of neurooncology. This study shows that the consumption of green tea increases the efficency of radiotherapy.\n\nThere is an enzym in green tea, the epigallocatechin-3-gallate, that increases the speed of destruction of the cancer cell by 40%. That's what explains this synergy.\n\nMy colleague has told me that this information is not yet known by everyone, even not among radio-oncologists.\n\nI have 3 more tips\n\nWe need 6 cups a day. you let infuse for 10 minutes and you have to drink the infusion less than one hour after its preparation, otherwise it looses its properties.\n\nThe green tea from japan is the one with the highest conentration of EGCE.\n\nTo improve the efficency, you can eat foot that contains omega 3 (like curry, rapsberry, brocoli)\n\nMerry Xmas to all\n\nPS : Sorry for my english, it's not my natural language.\n\n*Journal of neuro-oncology 2006 80(2) 111-121\t\t\t", "date": "2010-02-02T19:09:56+00:00", "topic": "Update...YEA...HOORAY", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear George,\n\nHere here!!\n\nThank you for writing this post....\n\nOf course thanks to all you caregivers too!!\n\nLeigh\t\t\t", "date": "2009-11-09T19:12:07+00:00", "topic": "How do we care for our Caregiver?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Kathy,\n\nI am so very sorry to hear about your FIL.\n\nThis must be  a truley devastating time for you and your family. I so wish I had some answers for you but can only send my sincere well wishes for the best outcome.\n\nYour FIL will certainly be in good hands and I am sure they will make him as comfortable as possible until they can give you some answers.\n\nI hope that you have some positive news from the scan and that you have all the support you need from your loved ones during this time.\n\nLeigh\t\t\t", "date": "2008-10-14T21:22:48+00:00", "topic": "I\\'m scared, please HELP!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tInteresting article for those of us whom are/were node positive...\n\nI am happy they removed 29 nodes in my case....this new info certainly has given me a boost.\n\nThanks for this research Pat!!\n\nLeigh\t\t\t", "date": "2008-07-04T23:11:41+00:00", "topic": "article on node removal...just published", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Barb,\n\nI hope your dad has settled in with you guys in his new home...\n\nThe path report is idem to mine so I will be interested to hear what your oncologist will suggest for the next steps.\n\nI can only speak from my own experience with the chemo combo Gemz/Cispl and so far I cannot grumble about the few side effects.\n\nI am just finishing with the last of the second round chemo today and things are going really well.\n\nThis combo is far less toxic and better tolerated than MVAC and studies have shown that it has very similar end results as MVAC.\n\nSo far I have a full head of hair and have had no vomiting and function normally except after the Cisplatinum chemo which is given once a month.\n\nI have now had this twice and the second time around hit me much harder and I had aches and pains just like a heavy flu with yucky feelings for around a week.\n\nMy partner works all day and I fend for myself and do all my chores and can function normally. I slow right down during the Cisplatinum phase and just listen to my body and take lots of rest.\n\nI just wanted to give you a small insight and wish you all the very best.\n\nTake good care of yourself.\n\nLeigh\n\n\n\n\nThe unknown of how the chemo will effect \t\t\t", "date": "2008-02-14T16:53:44+00:00", "topic": "My Dad's Story", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Don,\n\nWishing you a speedy recovery and for excellent reports on your next visit to the doctors office.\n\nLeigh\t\t\t", "date": "2009-12-01T18:34:36+00:00", "topic": "Bummer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI take my hat off to all of you having BCG, I read of so many struggling with side effects...\n\nWishing you all the best sara anne...\n\nLeigh\t\t\t", "date": "2009-10-15T16:30:02+00:00", "topic": "Here we go again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Warren,\n\nIt has been a while since we chatted...the last time when I had my stricture opening op.\n\nI am sorry to hear you have been having continued problems...which I know can be very painful and stressful.\n\nLuckilly I have had no further problems and wish for you a speedy resolve to this problem too.\n\nWishing you many decent pee's with no pain and a wonderful wedding for your daughter.\n\nLeigh\t\t\t", "date": "2008-12-22T18:30:41+00:00", "topic": "Self Catheterization", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Rocky,\n\nThis is fabulous news...I am really happy for you.\n\nEnjoy the summer as much as you can with your hubby..I hope he is doing well.\n\nLeigh\t\t\t", "date": "2008-07-16T03:16:00+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Warren,\n\nGreat news!!\n\nThat is so funny...sex with a catheter inserted mmmm... ;D\n\nDid you get an idea of what they did with the stricture and how long are they keeping the catheter in this time?\n\nKnowing you a little from your posts...you are probably back to work today  please just take it easy and have a lovely weekend...\n\nKind Wishes\nLeigh\n", "date": "2008-02-19T00:47:19+00:00", "topic": "Back on the Merry-Go-Round", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Landon,\n\nGreat news about your scope....\n\nLeigh\t\t\t", "date": "2008-01-11T16:20:24+00:00", "topic": "1st Cystoscope Clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome home!!\n\nHere's to you building strength and zapping blockages ...and protecting your kidney.\n\nIt certainly is worth a try before re-considering RC once more.\n\nThinking of you...\n\nxxxleigh\t\t\t", "date": "2010-01-30T18:26:12+00:00", "topic": "Once again it is always something", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Char,\n\nGreat news....congratulations on your check-up graduation  \n\nI do hope you can get more resolution on your other neo issues...\n\nxxxleigh\t\t\t", "date": "2010-02-05T20:25:56+00:00", "topic": "Check up.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Mike,\n\nThis is really wonderful news!!\n\nWishing you a very well deserved holiday in Mexico...enjoy those warm aqua blue waters....\n\nAll the best Leigh....\t\t\t", "date": "2010-01-27T23:26:10+00:00", "topic": "One year and three months post RC: Good tests", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Ed,\n\nI am glad you hae the kidney stone issue resolved and well into yur healing after RC.\n\nWishing you a further uneventful healing process...\n\nEnjoy those falling snow flakes...\n\nBest...Leigh\t\t\t", "date": "2009-12-01T17:05:41+00:00", "topic": "Edward Homeward..", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAll the best Friday with your bone scan.\n\nLeigh\t\t\t", "date": "2009-09-29T18:02:02+00:00", "topic": "Bone scan", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Betsy Mae,\n\nWelcome back home from your hols and back to the forum. I hope the bug has gone away and you are feeling well once more.\n\nI read on the news that a mini heat wave is heading your way this weekend and for early next week. Hopefully then coming over to Holland too \n\nRelax, enjoy and top up your tan, hopefully with the imodium tucked away in the medicine cabinet!!\n\nLeigh\t\t\t", "date": "2009-09-08T06:55:11+00:00", "topic": "I\\'m back!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat to read your results Mike....\n\nLeigh\t\t\t", "date": "2009-06-23T23:03:32+00:00", "topic": "Positive Cytology...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello ejwright,\n\nDuring my recovery in hospital after RC I too sprung a leak in the neo and my lower right abdomin filled with fluid. This was not a pleasant experience and caused a lot of pain along with a very swollen belly.\n\nA new drain was added to the collection of drains I had and the flood gates opened and within minutes I had instant relief.\n\nThe lab tests confirmed the fluid to be a mix of urine and wound fluid. The idea alone to have urine leaking in your body is not something I wanted to hear of course.\n\nThe Urologist felt no need to patch up the neo as it would heal on its own and the body would absorb the excess.\n\nI did get better very quickly after this episode and had no further problems.\n\nI wish your son a quick recovery from this hurdle and for his recovery to be speedy.\n\nKind Regards\nLeigh\t\t\t", "date": "2009-07-22T05:08:58+00:00", "topic": "Question from ejwright", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello SailorMan,\n\n4 months after RC I started to have problems with urination as it begame harder and harder to push out the urine. A cystoscopy discovered scar tissue at the opening of my new bladder causing the restriction.\n\nShortly after I had an op to remove the scar tissue and widen the opening and to this day I have thankfully had no problems and my flow is far better.\n\nI remember it taking a good week after the op before urination became normal again...probably due to swelling in the area.\n\nI wish you well and hope that this is only temporary for you...\n\nLeigh\t\t\t", "date": "2008-09-14T12:34:57+00:00", "topic": "Scarred Urethra", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Anne,\n\nGreat news that you may return to work...\n\nLike you said though take gradual steps...it will do you a power of good to be back with your colleagues and friends.\n\nWishing you all the very best for your continued recovery....these poisons they pump into us takes months and months to clear our systems...So be kind to yourself.\n\nI too endorse the washing of the hands and drinking loads of water and if you can, excercise will increase your energy. It did wonders for me and now I am thriving.\n\nKind Regards\nLeigh\t\t\t", "date": "2009-02-02T16:11:55+00:00", "topic": "Further update on Betsy Mae", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am holding hands with you guys too for a speedy recovery...\n\nLeigh\t\t\t", "date": "2009-01-02T12:49:12+00:00", "topic": "Circle of support for Carolyn", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Cynthia,\n\nGood luck tomorrow with your appointment and wish you only positive news...\n\nLeigh\t\t\t", "date": "2008-12-12T16:28:20+00:00", "topic": "It is always something isn\\'t it?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Anne,\n\nYou are now probably in your first cycle of chemo and I just wanted to say that I am thinking of you.\n\nHere's to an uneventfull six cycle regime.....\n\nLeigh\t\t\t", "date": "2008-12-27T10:56:38+00:00", "topic": "Latest News", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Maria,\n\nJust wanted to check in with you and say hi and that I am thinking of you.\n\nI wish for positive results for your scan at the end of the month.\n\nLeigh\t\t\t", "date": "2008-12-23T19:27:21+00:00", "topic": "Mystery lump", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Charlotte,\n\nI am happy to read that you are now doing well and that you are approaching your last cycle.\n\nWishing you all the very best...\n\nLeigh\t\t\t", "date": "2008-10-16T18:27:13+00:00", "topic": "Hospital visit #2 in two weeks", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Charlotte,\n\nSorry to hear about the blood clot...I am so pleased that you are now home.\n\nHere's to your appetite coming back real soon..\n\nLeigh\t\t\t", "date": "2008-10-05T22:45:44+00:00", "topic": "Out of touch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Betsy Mae,\n\nI hope you have a calm and relaxing day off and wish you all the very best with the results from the biopsy....\n\nThinking positively for you...\n\nLeigh\t\t\t", "date": "2008-09-30T10:59:37+00:00", "topic": "Sometimes life just is not fair!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Mike,\n\nI am sorry that your news was not more positive....\n\nYou have shown amazing confidence and positivity during your journey so far. Keep up your active role you have shown and this will certainly ease the path on your next steps.\n\nFire away any questions you may have to the forum and I know answers and experiences will come your way.\n\nGr.Leigh\t\t\t", "date": "2008-09-24T12:58:49+00:00", "topic": "Confirmed bladder muscle invasive", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Jeff,\n\nGlad to hear your news about the CT Scan!!\n\nGr.Leigh\t\t\t", "date": "2008-09-24T07:38:09+00:00", "topic": "5 months and clear", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Betsy Mae,\n\nI am glad they caught the infection early and have started meds to hopefully clear it for good this time.\n\nOn the 14th I will be one year post RC and must have had a neo-bladder infection every month for the first six months and my last one was in May.\n\nMy Urologist informed me that it is common to have infections in the first year until the new diversion settles.\n\nIt seems to have settled for me now touch wood....and I hope this will be true for you too...\n\nLeigh\t\t\t", "date": "2008-09-04T19:29:24+00:00", "topic": "Yet another infection!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Webs,\n\nDuring my 4 cycles of Cispl/Gemz I continued to enjoy alcohol on my good days and was just not interested in anything on my yucky days.\n\nMy tipple was either wine or beer or the odd gin and tonic with ice and a slice and I had no ill effects.\n\nThe thought of having neat spirits may cause a burning sensation if you have a sore throat or sores in your mouth.\n\nAs with everything moderation is the key \n\nLeigh\t\t\t", "date": "2008-08-24T21:03:36+00:00", "topic": "Chemotherapy and cocktails.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Rene,\n\nI am sorry to hear that your Mum is having a difficult time with the chemo regime.\n\nI had 4 cycles of Cispl/Gemz and found that the Cisplatinum was very hard on me too. Your mum is 75 and I was 38 at the time, I am sure it will be much more demanding for the elderly.\n\nThe Cisplatinum is a bitch and will get harder each time and I found that I became more tired with each cycle. The first was ok although my recovery became longer for each repeated cycle and I satyed longer in bed each time.\n\nAll I can say is try to get the best anti nausea medicine and get your mum to drink lots of fluids to flush her system. My meds for Cisplatinum chemo was Emmend and Dexametason which was given by infuse on the chemo day and orally for three days after.\n\nI have heard that it is also possible to return to the chemo room for extra intravenous fluids.\n\nI really hope your mum fairs well and recovers soon....\n\nLeigh\n\nI have heard\t\t\t", "date": "2008-08-22T22:17:04+00:00", "topic": "chemo question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Patticake,\n\nI found the Gemz/Cispl chemo to be accumulative and the first few cycles for me had only side effects of tiredness.\n\nThe last two cycles hit me harder after the Cisplatinum and I had flu like symptoms with nasty joint pain and general tiredness which made me sleep loads.\n\nLuckilly I had no nausea and my appetite increased due to the steroids which piled on a few unwanted kilo's....\n\nI am now two months post chemo regime and feeling my old self again....\n\nAll the very best...\n\nLeigh\t\t\t", "date": "2008-07-21T21:26:52+00:00", "topic": "mom\\'s 1st chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Harleygirl,\n\nIf you have time please do seek a second opinion.\n\nYou can of course ask your present doctor for a referal. Your fears of insulting or getting an anger reaction is normal. I did also when I sought a second opinion for my RC.\n\nIt is common practice for patients that need radical or rare surgery to seek a specialist in that field.\n\nIf you need help to research a specialist please just ask....\n\nLeigh\t\t\t", "date": "2008-07-23T14:25:14+00:00", "topic": "Is It Okay to Question a Doctor?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Melisa,\n\nI am pleased things are going well for your dad and understand his relief on having the foley removed. That really gave me some jip the whole time it was in....\n\nI wish your dad all the very best with his continued recovery...\n\nLeigh\t\t\t", "date": "2008-07-18T03:19:12+00:00", "topic": "My dad - 3 weeks post RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Maria,\n\nI am so sorry that your pathology results were not more positive.\n\nWhen you make some sense out of this news please come back and update us on the plan forward.\n\nDo you know how many nodes they took during RC and how many of them were positive?\n\nThey may have taken all the positive nodes out already....\n\nYou are not alone Maria....I am routing for you.\n\nLeigh\t\t\t", "date": "2008-07-17T02:26:51+00:00", "topic": "After RC ............... quick hello", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Kat,\n\nIt is totally normal to have a breathing tube in after a radical cystectomy...as you know it is a long operation. The operation is longer than the op to get a new heart so you can imagine the strain that has on a body.\n\nI am 38 and had the breathing tube for a few hours after surgery, older people need far longer to recover sometimes. It is only a precaution and your dad's surgeon is being cautious because of his present health and smoking history. My guess is that it will allow your Dad to recover far speedier the way in which they are treating him post op.\n\nThe drugs given for pain relief are powerful drugs and he will be going in and out of sleep for a few days.\n\nKat please do not read anything into the breathing tube or sedation if a problem occured they would have informed you guys already, they will not hold important information.\n\nI hope you have a good visit....please do update us on his progress...\n\nKind Regards\nLeigh\t\t\t", "date": "2008-07-17T21:31:04+00:00", "topic": "Should I be worrying...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Kathy,\n\nThat is certainly were the UTI's are coming from....\n\nInitially after RC I had to flush my new bladder with saline solution and used a fresh cathether and syringe each time.\n\nThankfully my insurance covered all costs for me...I am not sure of your situation regarding this.\n\nI hope someone on the forum comes with some great hygiene advise for those that have to re-use equipment.\n\nAll the best to you....\n\nLeigh\t\t\t", "date": "2008-07-16T21:13:39+00:00", "topic": "Wash or steralize irrigation syringe?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Betsy Mae,\n\nGreat news about your scan results...\n\nWill they have to do something with the ovarian cyst?\n\nLeigh\t\t\t", "date": "2008-07-16T14:36:01+00:00", "topic": "Relief - for now anyway!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello George,\n\nIn the first few months of recovery I had several accidents in what was the learning curve.\n\nWhen I coughed or laughed or had the hickups then sometimes I would have a dribble. Nothing dramatic just a few dribbles and this was absorbed by the incontinence pad.\n\nThese accidents are rare for me now...one year post RC although I still wear a day time and night time pad in my underwear just in case. I guess it is my security blanket even though in the day I do not leak.\n\nDuring the night I wake automatically to urinate and rarely leak and when I do it is because I am too tired and sleep on through. I use the bathroom just before bed and wake once during the night.\n\nI enjoy lifes pleasures and drink wine and beer and eat whatever I choose.\n\nThe urge to urinate is different now with a full feeling in my lower abdomin and I can hold my urine for much longer than with my original bladder.\n\nIf I am planning on going out for a meal or visiting the cinema or theatre then I use the bathroom just before and after.\n\nRegards\nLeigh\t\t\t", "date": "2008-07-04T11:15:01+00:00", "topic": "very confused", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Holly,\n\nThank you very much for the update.\n\nSending positive thoughts from Holland for Susan....I miss her here on the forum.\n\nLeigh\t\t\t", "date": "2008-07-07T02:53:10+00:00", "topic": "Susan  update", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear newbie08,\n\nI can understand your concern and you have come to an excellent place if you feel like ranting. \n\nI would certainly get a clarification on the regime to calm your fears.\n\nSorry I cannot help with the cautery artifact question but someone will assist you shortly...\n\nLeigh\t\t\t", "date": "2008-07-02T12:57:59+00:00", "topic": "Chemo Regime???", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear newbie08,\n\nWishing your Dad all the very best with his chemo...\n\nRegards\nLeigh\t\t\t", "date": "2008-06-23T11:14:06+00:00", "topic": "Starting chemo!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Joe,\n\nThose new Wii systems are great for keeping you active...\n\nOn a recent trip to the UK to see my family my sister gave me a demonstration of the games and boy within minutes you work up a sweat.\n\nI need to ge out of the house more and get social so the gym works better for me but I certainly will not knock the new Wii  ;D\n\nHave fun with your Wii Joe ...\n\nLeigh \t\t\t", "date": "2008-06-13T13:02:51+00:00", "topic": "Question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI did get out of bed but oh what a struggle  \n\nIt is amazing how many muscles were in hibernation this past year, I feel everyone of them waking up now.\n\nMy next gym lesson will be body balance to stretch out the aches and pains....\n\nI must admit even with the muscle pain I feel alive again and happy to move my saggy arse.\n\nHere's to a tight bum and washboard stomach in the making.... :\n\nLeigh   \t\t\t", "date": "2008-06-13T13:02:51+00:00", "topic": "Question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI too have just had my first body pump lesson since my diagnosis last July...\n\nIt felt great to be back at the gym...I really need to shed some pounds put on during my chemo treatment.\n\nI hope I can get out of bed tomorrow  ;D\n\nI will keep on trying  \n\nLeigh\t\t\t", "date": "2008-06-13T13:02:51+00:00", "topic": "Question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Maria,\n\nPlease try not to worry over the results of the scan and focus on staying positive for your RC which will promote a speedier recovery.\n\nWhen you have the RC they will take it all away along with many nodes.\n\nI am thinking of you and wish you all the very best.\n\nLeigh\n\n", "date": "2008-06-13T19:47:06+00:00", "topic": "CT Scan results...........mixed views", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Maria,\n\nI am so pleased you have the chemo out the way...\n\nWishing you a relaxing time to build up your strength ready for RC...\n\nBest Wishes..\n\nLeigh\n", "date": "2008-05-31T01:35:17+00:00", "topic": "Chemo finished", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Melodie,\n\nThanks for your positive attitude and humour and good luck with your op for the stone removal...\n\nThinking of you....\n\nLeigh\t\t\t", "date": "2008-05-30T18:34:03+00:00", "topic": "Melodie is stoned ", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Peter,\n\nExcellent news....\n\nKind Regards,\n\nLeigh\t\t\t", "date": "2008-05-30T18:43:23+00:00", "topic": "SO FAR SO GOOD", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Anne Marie,\n\nI am sorry to hear that your partner has had delays in recovery from the RC.\n\nIt reminds me of my recovery which was very similar due to ileus, I did have a NG tube which cleared my stomach of the green stuff two to three times a day like clock work the green stuff started pumping out. I got used to it but any visiting family viewing this when it happened had suprised looks on there faces.\n\nI had a CT scan to check for any problems as my belly became very swollen as it looked like I was pregnant. A build up of fluid was found in my pelvic area and an extra drain was inserted which was a great relief to me as several litres of fluid drained away which relieved the pressure on my belly also.\n\nI also had a PIC line put in my neck during the RC surgery which was utilized to feed me intravenously with those bags of milky stuff.\n\nFor me it was 14 days after surgery when I could finally try food which was a cup of yogurt and custard mixed. The next day I was allowed a bowl of broth and a chicken sandwich which I dipped into the broth as the bread I just could not swollow.\n\nI lost 14 kilos in weight during this time and gradually became more and more active during the following days because of the food nurishing me giving me more energy. Sucking on ice cubes for two weeks did not offer much in the way of energy.\n\nIt was a long road to recovery and on the 21st day after RC I was able to go home. I never expected to stay so long and had in my head that I would be ten days max because of the full open incision. Of course that was if there were no hickups along the way.\n\nHold on in there....for some of us it takes longer to recover because of these hickups. Once home your partner will come on leaps and bounds I just know it....\n\nWhat a great motivation also....the WEDDING!!\n\nI wish you and your partner all the very best and for a positive outcome with the pathology report.\n\nKind thoughts and wishes...\nLeigh\n\n", "date": "2008-05-17T22:15:58+00:00", "topic": "seeking answers", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Sarah,\n\nI should have read your post properly   I have chemo brain I think....\n\nI too had trace blood in most of my urine tests and was also told by urologist not to worry.\n\nI hope you find the info you are looking for..\n\nKind Regards\nLeigh\t\t\t", "date": "2008-05-18T15:37:47+00:00", "topic": "Urine dipsticks", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Sarah,\n\nYou can make an appointment at your local doctor's office sometimes even with the nurse on reception to have the dip test.\n\nJust say you think you have a urinary infection.\n\nI have had it done several times since my RC last September in the UK and in Holland.\n\nIt gives an instant reading to check for any bacteria or blood in the urine and has alerted my doctor of bacteria present a few times and cipro was then prescribed.\n\nleigh  \t\t\t", "date": "2008-05-18T15:37:47+00:00", "topic": "Urine dipsticks", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Dan,\n\nI too was advised to self cath once all cathethers had been removed after RC.\n\nAt first it was twice a day to flush my bladder with saline solution. In the beginning I was prescribed a numbing gel to insert in my penis before cathing which did help with insertion of the cath.\n\nMost of the time I had little mucus or urine being retracted from the cath as like you I could pee it out naturally.\n\nAfter a few weeks it also became painful to cath and stung inside my uretha after a 3-4cm and once passed a certain point became easier. I guess regular self cathing makes it sensitive inside with the insertion of a tube a few times a day.\n\nOn my follow up exam one month later at my Urology office I was then advised to reduce cathing to once a week which was great news. My Urologist insisted that I kept up this weaning off schedule. The cathing for me was not to urinate as this could be done naturally but only to flush and cleanse the new bladder to prevent mucus build up in the beginning when production is at it's highest.\n\nThree months after my RC and cathing was stopped and since that time I have had no problems that have required me to self cath.\n\nMany fellow patients of RC are advised not to cath unless having problems with urination. I suppose it depends totally on the type and size of new bladder made for you and if the diversion was successful in all areas and connections.\n\nGood luck to you and hope that cathing ends soon for you too....\n\nAll th best\nLeigh...\n\n\n", "date": "2008-04-21T01:24:11+00:00", "topic": "Neobladder Self-Cath &amp;amp;amp; Irrigation - For how long?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Joe,\n\nGreat news abot your scan...what a relief that must have been...\n\nAll the best to you...\n\nLeigh\t\t\t", "date": "2008-05-09T13:51:21+00:00", "topic": "Good News !!!!!!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Maria,\n\nLast week I had pain in my pelvic area radiating into my hip joints and could hardly walk for two days.\n\nI called my chemo department to speak with the chief chemo nurse and was advised to take paracetomol for the pain, and that it was probably a side effect of the chemo. If the symptoms continued or increased I had to pay a visit to my GP.\n\nThe symptoms did get worse so I visted my GP and found out I had a urinary infection and was prescribed Cipro for two weeks.\n\nIt is amazing what an infection can do to your body....I see that you had Cipro prescribed for a infection also...maybe it would be worth getting your urine checked again to ensure your infection has gone.\n\nGood luck with your next cycle....\n\nBest Wishes...\nLeigh   \t\t\t", "date": "2008-04-13T04:19:46+00:00", "topic": "Chemo and effects", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Cathy,\n\nWishing your Dad all the very best with his RC and for a speedy recovery.\n\nBest Wishes\nLeigh \t\t\t", "date": "2008-04-01T04:32:26+00:00", "topic": "Dads op tomorrow, ", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Susan,\n\nThank you so much  \n\nAlso from my cats, Aarie,Aqua,BiBi,Maddy and Jasra  ;D\n\nLeigh\t\t\t", "date": "2008-03-19T18:50:23+00:00", "topic": "Neo bladder repair work....", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Dan,\n\nThank you for your message.\n\nAfter my RC when all catheters had been removed it took me a few days to gain continence control. The first few days I used nappies because any sudden movement emptied my bladder and I had little control on stopping the flow.\n\nLuckily my pelvic floor excercises kicked into action pretty quickly and I was able to start and stop the flow as desired. These are also called Kegal exercises and I guess you have been advised or will be advised about these. Everyone has a different experience and sometimes you can have instant control and for some it takes longer.\n\nAs the weeks and months move along incontinence issues improve and within two months I had near 100% daytime continence except for the occasional coughing or sneezing fit. I wear a protection shield in my underwear for security although it really is not necessary for day time but make’s me feel secure.\n\nFor me night time continence depends on fluid intake before bedtime and using an alarm to wake a couple of times during the night to urinate. Very quickly I regained an instinct to wake when I had fullness in my lower abdomen and often woke before the alarm.\n\nPresently I am having adjuvant chemo and all this has gone out of the window temporarily because sometimes I am too tired to wake and have more leaks during the night.\n\nI have two types of shields to wear in my underwear one for day and one for night, the latter has more absorbency for increased urine leakage.\n\nFor many it is possible to have dry nights also and each and every one of us has a unique experience in the continence training process. You will eventually find your own routine that works for you and your personal situation.\n\nPlease try not to get disheartened if it takes a while to control the flow, it is hit and miss in the beginning and patience is required.\n\nI hope this gives a small insight from my experience and please feel free to ask any question you want.\n\nKind Regards\nLeigh\n\n\n\n\n\n\n\n\n", "date": "2008-03-19T18:50:23+00:00", "topic": "Neo bladder repair work....", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat a difference a day makes...\n\nYesterday I was pretty sore and unable to urinate very well and was very worried I would have to return to the hospital to get the catheter re-inserted.\n\nI woke up this morning and had the best pee since my RC in September even though it is still tender I was able to empty my bladder in seconds rather than 10-15 minutes it usually takes.\n\nI am so happy today and my spirit has been lifted and so grateful to my urologist for the work he did on me.\n\nIt is amazing what little things please....but I really have struggled these last seven months with urinating and so happy it is resolved.\n\nWarren,\n\nMany thanks for the advise....crossing one's legs when sitting is also a no no I have found...\n\nThanks everyone for your wonderful caring advise and support you are all very special people.\n\nKind Regards\nLeigh   \t\t\t", "date": "2008-03-19T18:50:23+00:00", "topic": "Neo bladder repair work....", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Lisa...\n\nCongrats on your wonderful news...\n\nLeigh\t\t\t", "date": "2008-02-23T16:07:34+00:00", "topic": "3 month check up all seems clear", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Maria,\n\nWishing you all the very best with your chemo this week...\n\nKeep us updated on your progress!!\n\nKind Regards\nLeigh\t\t\t", "date": "2008-02-16T05:25:38+00:00", "topic": "Treatment begins at last .......................", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Melodie,\n\nGreat news to hear that you are back to work.....\n\nOnce you have settled in to this new schedule it will be the best thing for you.\n\nI am sure the sickness and headaches are just nerves as you get back into the swing of things.\n\nA year out of work is a long time but remember you have been through a lot this last year.\n\nTry not be too hard on yourself and take everything in your stride...you will be just fine  \n\nFocus on you and work and come back and visit when you can...\n\nKind Regards\nLeigh  \t\t\t", "date": "2008-02-16T06:24:03+00:00", "topic": "Melodie 2nd day back to work", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Joe,\n\nThe clippers are also on standby just in case  \n\nI have the all clear to go ahead with the second round tomorrow.\n\nBlood levels came up enough to go forward which is good...the sooner it is done the better...\n\nLeigh  \t\t\t", "date": "2008-02-15T12:42:36+00:00", "topic": "First round chemo done and dusted...but fold in neo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Ginger,Pat and Maria,\n\nThank you very much for your messages.\n\nMaria the fatigue was just for the day after the chemo session and to be honest I felt that I could have worked normally except for this day.\n\nMy doctor however signed me off work for the duration of the chemo because I work in a hospital as a food and diet assistant for patients.\n\nThe chemo lowers resistence and my doctor did not want me to take the risk of working with patients that are sick.\n\nThe anti nausea drugs used were zofran with the Gemz and Emend with the Cisplatinum and these worked perfectly for me with no sickness side effects at all.\n\nI was also prescribed Dexamethason which is a steroid and this was given with the Cisplatinum which helps to stimulate eating which it did in a big way.....I was ravanous all the time and have gained a few kilos   The Dexamethason also helps with keeping infections at bay I believe...\n\nI have not been offered injections to improve blood levels although I am aware they are available. Maybe a cost issue here though as they are very expensive, and think they prefer to wait a week for them to come up naturally before offering this injection as to continue chemo treatment.\n\nAsk as many questions you want Maria....my combination of chemo is far less toxic than MVAC so side effects will be differing and everyone reacts differently of course....I wish for you a smooth ride with MVAC....\n\nKind Regards\nLeigh\n\n\n\n", "date": "2008-02-15T12:42:36+00:00", "topic": "First round chemo done and dusted...but fold in neo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Dan,\n\nGreat to hear that you are on your last leg of your chemo.\n\nI am starting round two tomorrow and also have the combo Gemz/Cispl.\n\nI know for sure that your oncologist is keeping a good eye on your blood work which is taken before each chemo. If your levels are too low then your chemo will be delayed or rounded up.\n\nA side effect of the Cispl is kidney damage in some patients that is why they flush us so much after this has been administered to minimize the damage.\n\nNext time you speak to your oncologist or chemo nurse just mention your worries to them and they can check your kidney functions and reassure you.\n\nThe side effects I have presently are few but I do relate to the saw tongue  \n\nAll the very best to you for your RC on the 13th!!\n\nTake care.\n\nLeigh\n", "date": "2008-02-18T00:52:57+00:00", "topic": "Kidney Damage from Chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Maria,\n\nI am so glad you have found a great medical center and team for your chemo and RC...\n\nAfter my RC I was sent home for a week with a catheter and bag but was given velcro straps for my thigh. The straps had two small buttons on them which clipped onto the bag. The bag is then hidden under any garment. I also relate to the sloushing of the urine that Melodie mentioned   and constantly checking to see that the valve was closed.\n\nMaking little pouches for your bag in various colours is also a fabulous idea which will indeed keep you busy and take your mind off things a little...\n\nYou have a great positive attitude Maria and I know this will see you through this journey.\n\nKind Regards\nLeigh       \t\t\t", "date": "2008-02-05T02:31:43+00:00", "topic": "Percutaneous Nephrostomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Lisa,\n\nSorry to hear that you are not feeling too great at the moment....I do hope things will settle down very soon once your body adjusts to the new dosage.\n\nThe dizziness I can relate too also but have been lucky so far with my chemo side effects although I am only on the combo of Gem/Cispl and I believe you have the MVAC....\n\nThe pain in the soles of your feet sounds familiar as a side effect and I have read this on other posts...something to do with your nerve endings....I am sure someone can give you more advise on this than me.\n\nThe chemo seems to affect us all in different ways because I have not heard of the streaming eyes issue that you have which must be really irritating and I hope this clears up very soon for you...\n\nMaybe your sickness meds need to be increased or changed but I am sure you are already on the ball with that with your medical contacts.\n\nYou have the courage to see this through and this yucky blip will pass I am sure of it....\n\nTake care...\n\nBye Bye\nLeigh\n\n", "date": "2008-01-31T12:46:56+00:00", "topic": "Chemo gets worse how do you cope", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Don,\n\nExcellent news!!\n\nHave a fabulous trip...\n\nLeigh \t\t\t", "date": "2008-01-30T13:46:41+00:00", "topic": "Almost 6 weeks post op update", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Lisa,\n\nJust to let you know that I have been thinking of you on this chemo journey and wish you all the very best during this time.\n\nKeep up your courageous positive spirit and this will certainly see you through and will assist and help others who are to start this journey too.\n\nTake good care chemo buddie....\n\nLeigh\t\t\t", "date": "2008-01-21T14:38:07+00:00", "topic": "A quarter of the way there", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Maria,\n\nGreat to hear that you have a good oncology doctor and coordinator.\n\nGood luck with the port insertion and of course for the chemo treatment you will receive next week.\n\nMy adjuvant chemo starts on Tuesday and the unknown is what is making me on edge lately. I have read of other peoples experiences with chemo and they are all different. I guess all we can do is try to stay positive and listen to our bodies well over the coming months.\n\nI have been told my hair will also fall out or thin although for a man it is  different I guess. I can sport the bald look as it is kinda trendy in europe at the moment, just hope I keep my eye brows. For a lady I can imagine it to be much harder but I am sure you will manage just fine.\n\nConfrontation of the cancer will be harder for me I think...the scar from the RC was the first although easy to cover up and to be honest does not bother me anymore. Looking in a mirror later when my hair falls out and seeing the side effects of the treatment take hold will be hard. It will also be on public view of course when I pluck up the courage to venture out sporting the new look  \n\nI am totally with you on the paranoid point of view regarding scans....I too thought they hovered a long time as they repeated the scan recently for a brain scan. Then the wait for the results.....luckily and thankfully with nothing found, I wish this for you also.\n\nI wish also that a fantastic surgeon will be found very soon so that you can concentrate your energy to the chemo treatment and have one less worry.\n\nTake good care of yourself.\n\nLeigh \t\t\t", "date": "2008-01-11T01:52:40+00:00", "topic": "Quick update", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey guys,\n\nI am starting to wonder now why I was told to self cath and to continue to do so for the duration. My Urologist mentioned that it was important to cleanse the neo-bladder at least once a week from now on to reduce the risk of bladder stones and other neo-bladder health issues. Not sure what other neo-bladder health issues he was talking about.\n\nFrom the time I left the hopital after the catheters were removed voiding was never an issue thankfully...so self cath for me is never to void only to cleanse. I pee every two hours sometimes stretching to every three hours. I have 99% continence during the day and 90% during the night. I wear the Tena mens towel in my underwear during day and night for any leakage. Leakage occurs when I sneaze or cough ...when I have a few dribbles lol\n\nI have noticed that since the weather has been turning colder recently over here in Holland I tend to dribble more often during the day and my frequency of needing to void has increased during cold spells to once sometimes twice an hour...\n\nRegards\nLeigh\n\n", "date": "2007-11-14T07:16:57+00:00", "topic": "Neo bladder question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Sled Ed,\n\nI am so very sorry to read your news of a possibility of a new cancer for yourself.\n\nYou know as well as I words escape us when faced with the ravages of cancer.\n\nWe can only hope that the results will be minimal and be in our favour.\n\nSled Ed, I wish you all the very best in the coming time with your tests and results.\n\nThinking of you mate.....and please keep us updated.....\n\nBest Wishes....Leigh\t\t\t", "date": "2010-03-24T11:33:44+00:00", "topic": "Leigh\\'s Update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Melissa,\n\nPlease accept my sincere condolences for the loss of your father.\n\nWishing you and your family lots of courage and support during this time...\n\nxxxLeigh\t\t\t", "date": "2010-03-05T00:46:17+00:00", "topic": "The suffering has ended.", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tthanks everyone for your kind words...\n\nAnn, I am originally from the UK now living on the Dutch-Belgium border and have all my treatment in UZG in Gent Belgium.\n\nYes it was weird to see the images at first....interesting though.\n\nI wish your son and daughter in law all the very best with the move over to The Netherlands....Nijmegen is a wonderful part of Holland.\n\nxxx Leigh\t\t\t", "date": "2010-02-04T01:30:19+00:00", "topic": "MRI scan of brain... CLEAN!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Mel,\n\nI just wanted to say that I am thinking of you and your family during this trying time.\n\nI hope you and your mum can find some peace to relax and think of yourselves a little more.\n\nWishing you all the very best with your focus on your new up and coming child......please do try to be happy for you own personal experience of motherhood...\n\nKind Regards\nLeigh\t\t\t", "date": "2010-01-24T15:25:28+00:00", "topic": "It\\'s been a while...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello everyone,\n\nMike I know exactly what you mean...I was hoping for a new primary...sounds weird too right!!\n\nThanks so much everyone for your well wishes...\n\nJust to add...my main concern before surgery was my neo...I pre - warned my Oncologist, Neuro surgeons, and Nurses all about my neo and that with a catheter they would need to check outflow and flush and remove mucus if necessary.\n\nWhen I was wheeled down to the OR just before they put me to sleep I sat up and got the attention of the staff that were present and said that I had a neo bladder and whoever would be responsible for the catheter to check for outflow and flush and remove mucus if necessary, I assumed they understood me.\n\nMy surgery was five hours and the last phase I became very hypertensive and thankfully someone in the team checked the catheter and realized I had very little outflow of urine in the bag. They flushed and the dam gushed open and one and half litres of urine came out....not sure how much my poor old neo could have held up for before exploding......\n\nI remember the surgical team that passed me on to IC telling the IC team about it when they handed me over.\n\nI felt I had done enough to explain before hand but constant reminding is necessary.\n\nMaybe it would be a good idea to get the stoma nurse involved to communicate with OR staff when any surgery is planned...\n\nxxxleigh\t\t\t", "date": "2009-12-16T20:13:41+00:00", "topic": "Update on Leigh", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Forum Friends,\n\nJust had a call from my Oncologist with great news of clear CT scan results from my torso earlier last week.\n\nI am now in a really positive vibe to get this next hurdle done and dusted over the coming week.\n\nI get admitted tomorrow to the Neurology department and the op is planned for Wednesday.\n\nOnce again kind forum member friends, I have appreciated your messages of support and kindness.\n\nI wanted to wish each and every one of you a really fantastic Christmas holiday season with your loved ones.\n\nKindest Regards\nLeigh\t\t\t", "date": "2009-12-05T20:14:12+00:00", "topic": "Back from UK", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Stacker,\n\nExcellent!!\n\nThe treatment is having a very positive reaction for you and long may this continue.\n\nI hope you get some more reactions from others that have tried this drug for more info and experiences.\n\nLeigh\t\t\t", "date": "2009-07-15T17:35:09+00:00", "topic": "Has anyone had the chemo drug Abraxane?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tFantastic news!!\n\nGr,Leigh\t\t\t", "date": "2009-07-15T17:35:09+00:00", "topic": "Has anyone had the chemo drug Abraxane?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThanks for your replies and messages of support..I really appreciate it.\n\nI have been banned from flying so no winter sun this coming week...\n\nI will however meet up with my family in England over the coming days. We leave tomorrow heading for Calais for the ferry over to Dover.\n\nBeing close to my family will certainly make me feel safer and at ease.\n\nMy doctor has plied me with Alprozolam to calm me for the coming week.\n\nBack on Sunday 6th as Monday 7th I have my 6 monthly CT scans and appointment with Neurologist.\n\nThis waiting game is the worse part of the drama...doesn't get any easier.\n\nNow I feel like I have a time bomb in my head adding to the stress.\n\nApparently it is a dry blood clot...how they know it is dry or fresh I have no idea. My fear is that it will bleed again but they do not seem to be too concerned.\n\nI am told though if my symptoms get worse to head straight to the emergency room...this information just makes me feel calmer right.....\n\nAlprazolam here I come............\n\nxxxleigh\t\t\t", "date": "2009-11-26T12:56:15+00:00", "topic": "2 cm Mass in Cerebellum", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear CHR,\n\nI am assuming that your wife’s cancer has progressed and if that is so I am really sorry to read that.\n\nMy Oncologist advised me that the first two years after RC is the risky time for reoccurrence. CT scans apparently can only pick up mets from 4 millimetres and larger.\n\nIt can take a long time for the body to grow a new lesion-tumour and this beast can also grow flat extending the time of detection.\n\nHaving read the experiences of others here at this section the journey differs with each individual.\n\nMy understanding of chemotherapy the second time round would be to use new agents as the first line did not work with a curative intent and with reoccurrence used again would be resistant.\n\nThe cancer can take up residence anywhere in the body although bladder cancer cells tend to favour regional lymph nodes, bones, lungs, skin and liver.\n\nI am truly sorry that you and your wife are faced with this and I hope that you get all your questions answered easing this journey you both are facing.\n\nAs I am sure you are aware we have an amazing network of forum friends here to guide and support.\n\nTake good care of each other and please keep us updated on the treatment options offered.\n\nKind Regards\nLeigh\t\t\t", "date": "2009-07-02T14:52:09+00:00", "topic": "5 things I wish I knew (Mets)", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tPat,\n\nThis rational therapeutics makes so much sense...I would certainly investigate that option too.\t\t\t", "date": "2009-09-23T02:08:12+00:00", "topic": "Sutant", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Alisa,\n\nI can only imagine what you are dealing with at the moment and I am so sorry that you and your husband are in this situation.\n\nMy fear of progressing plays heavy on my heart being diagnosed at stage IV and this drew me to\nyour post. Thankfully I have no known mets and remain under close observation.\n\nI wish I could offer you some information that could help your situation. Having to decide what\nis best for your husband with regards to trials must be very heart wrenching.\n\nBest wishes to your husband with his chemo treatment and I send to you both positive thoughts for\nthe future.\n\nLeigh\t\t\t", "date": "2009-09-23T02:08:12+00:00", "topic": "Sutant", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Lisaloo,\n\nIt is good to read your update and know that you stable in your symptoms. I have often thought of you and your children. Glad to read that you have a great network around you.\n\nTake great care...\n\nLeigh\t\t\t", "date": "2009-07-10T12:15:50+00:00", "topic": "Sorry have been so quiet", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Rocky,\n\nGreat to hear from you...I am sorry to hear that Sam your hiking buddy has problems with his leg.\n\nHave you managed to get on the slopes and do some skiing?\n\nThanks for thinking of me.\n\nLeigh\t\t\t", "date": "2008-12-14T09:51:08+00:00", "topic": "Alive and well", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThank you all for your replies....\n\nLeigh\t\t\t", "date": "2008-12-14T09:51:08+00:00", "topic": "Alive and well", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tMay I offer my sincere condolences to the family during this time.\n\nIt is with shock and saddness that I read this post as I too have followed her courageous journey.\n\nThank you Maria for your honest and open account of your bladder cancer journey and for all your experiences that you shared with us here at the forum.\n\nKindest thoughts to a dear lady....\n\nLeigh\t\t\t", "date": "2009-01-31T17:14:30+00:00", "topic": "Sad news about Maria", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Mel,\n\nIt really does hit harder each time we move on to the next cycle..for me the last two laid me out for a week at a time.\n\nStrange things can happen with chemo and each of us experiences it differently. I remember one morning I woke after having the big one and I could not walk as my hips seized up. It was a great shock to the system and agony with every move I tried to make. Thankfully after a few days bed rest it cleared as quickly as it came.\n\nCisplatinum really is harsh on the body and each cycle will get harder and try to get your dad drinking as much as possible to flush that nasty stuff out.\n\nPlease try not to worry as they will be keeping ontop of your dad's blood work and reduce the dose if need be. I have read about lots of people going in to hospital for fluids after Cisplatinum...\n\nI wish your you and your family loads of strength to pull him through....\n\nLeigh\t\t\t", "date": "2008-10-01T17:03:06+00:00", "topic": "Rough day...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Lorrie,\n\nI am happy that you have checked in with an update...\n\nThat is really wonderful news that the chemo is having a positive influence in reducing the size of the tumors. Even with all the starting and stopping of the treatment which you were so worried about.\n\nThe chemo does ravage ones body and I remember that so well too....\n\nDuring chemo I had loads of infections from the neo and had several bouts of Cipro prescribed to keep those nasty bacteria at bay...my Doctor wanted to zap them and my Urologist said it was normal with the neo....my trust in them wavered and did not know who was right....The Oncologist said I could continue chemo though and could combine it with any Cipro necessary that my doctor prescribed.\n\nIn the beginning of my neo training and during chemo I found it hard to ensure my neo was completely empty and this may have created the infections. Now one year post RC I know the feeling of it being empty....It is like when you pull the plug in a bath of water and put it back in while you still have water in it....that kick back of the suction I have in my bladder when it is empty...\n\nIt is great to read that Bob is still being active though and helping you paint...\n\nI wish for you both many good days to come and long may the chemo zap away the cancer....\n\nLeigh\t\t\t", "date": "2008-10-01T10:11:05+00:00", "topic": "Update on the other Bob", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Clara,\n\nI am thinking of you both at this time and wish you lots of strength and hope that Bob will be made very comfortable.\n\nLeigh\t\t\t", "date": "2008-09-29T14:07:07+00:00", "topic": "Update on Bob.....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Mel,\n\nExcellent news!!\n\nI am really happy for you guys that he responded so well to chemo....\n\nGr.Leigh\t\t\t", "date": "2008-09-22T13:46:45+00:00", "topic": "Tears of JOY!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Stephany,\n\nI am so very sorry to hear your news....\n\nMy thoughts are with you both at this time and I am sending you hugs from Holland...\n\nGr.Leigh\t\t\t", "date": "2008-09-10T02:32:23+00:00", "topic": "Chemo is not working", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nI am glad you have a place hear to express your emotions and have support from your friends here at the forum.\n\nI am sending you a big hug from Holland and just wanted to say that I wish you and your Mum all the very best.\n\nSending positive thoughts for good blood results....\n\nLeigh\t\t\t", "date": "2008-09-05T02:47:05+00:00", "topic": "please read...I need my friends here tonight", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tthank you all very much for your messages of support.....\n\nleigh...\t\t\t", "date": "2008-08-28T20:28:47+00:00", "topic": "Wonderful News", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tCynthia thank you for the update...\n\nI am so happy he is now doing well...and wish him a wonderful time at the festival...\n\nLeigh...\t\t\t", "date": "2008-08-27T19:48:06+00:00", "topic": "Update on Zackary", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Stephany,\n\nI am sorry to hear of Doran's set back and hope that he is now home with you recovering in familiar surroundings.\n\nThinking of you both....\n\nLeigh\t\t\t", "date": "2008-08-28T00:12:04+00:00", "topic": "Doran\\'s back in the hospital", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nI read with great admiration for your inspiring dedication to Dick's healthcare in your role as loving wife and caregiver.\n\nWow you both really have had an action packed time with your granddaughters with wonderful memories to cherish.\n\nI think about you both often and wish you and Dick well and long may those quality moments you share continue.\n\nLeigh....\t\t\t", "date": "2008-08-31T01:16:43+00:00", "topic": "Still fighting", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nMy thoughts are with you both as this journey takes another path.\n\nGreat to hear that Dick is showing interest in being mobile in some way.\n\nThose iPhone thingy's take some getting used to though...at least it will be a challenge for him to master the many options.\n\nJulie wishing you all the very best and I take my hat off to you for being an incredible caregiver.\n\nKindest Wishes,\nLeigh\t\t\t", "date": "2008-08-20T04:26:02+00:00", "topic": "Tears Today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Jess,\n\nJust wanted to wish your Dad all the very best with his recovery from surgery.\n\nGetting used to his new bladder and gaining control once all tubes are removed will need lots of patience and support.\n\nI am not sure when the next batch of chemo will be planned but please be aware this may effect control of the bladder.\n\nI was lucky enough to gain control within a few days of the tubes being removed except for accidents when coughing or sneazing.\n\nWhen I started adjuvant chemo I found that sometimes control was lost at night times because of tiredness. If chemo is delivered which requires lots of flushing of the kidneys these will be the moments that will be more difficult.\n\nWishing all the very best for a smooth training of the bladder and a kick arse chemo regime.\n\nLeigh\t\t\t", "date": "2008-08-23T16:47:27+00:00", "topic": "Hello to all...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Clara,\n\nBob sure has had a roller coaster ride with this chemo and I hope that his blood levels return quickly.\n\nHow is he fairing since the removal of the cathether...has Bob managed to gain any control?\n\nThinking of you both often...\n\nLeigh\t\t\t", "date": "2008-08-16T21:19:26+00:00", "topic": "Bob is giving chemo another try....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Dan,\n\nI am very inspired by your journey so far and wish you all the best with the Zactima treatment you are having.\n\nPease do keep us updated...\n\nLeigh\t\t\t", "date": "2008-08-13T20:03:02+00:00", "topic": "Maybe we\\'re on to something", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear George,\n\nI just wanted to wish you well with your chemo regime. I am so glad to read that you are fighting strong.\n\nTake great care of yourself...\n\nLeigh\t\t\t", "date": "2008-08-23T01:09:22+00:00", "topic": "started chemo again today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear George,\n\nI too had a fear of leaving the house initially when my tubes were removed and I feared leaking with sudden movements and coughing and sneazing.\n\nMy excercise routine was to do my walking around the house and up the stairs and I rarely went out except into the garden.\n\nThis changed very quickly though as daily I could see and feel that I was gaining the control of my new bladder.\n\nIt has been a couple of weeks now since you posted this and I hope those fears have gone.\n\nYou are in a situation now that you have started chemo and this may or may not hinder your progress in gaining control.\n\nThe chemo will be temporary and an important step in your journey to recovery and any problems during this time will disapear once chemo stops.\n\nAll the best...\n\nLeigh\t\t\t", "date": "2008-08-11T02:33:08+00:00", "topic": "afraid to leave the house", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Stephany,\n\nI am sorry to read of this update regarding Doran's health.\n\nThinking of you all...\n\nLeigh\t\t\t", "date": "2008-07-24T01:41:35+00:00", "topic": "The cancer is back", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Holly,\n\nDuring my down time with the chemo my partner took over the responsibilty of looking after the house and cats, this I know was an extra burden although temporary.\n\nI too have often laid awake at night worrying and wondering what would happen to my cats if something happened to me.\n\nMy concern would be for Maddy as she is not a cat that could be easily re-homed because of her feral nature towards anyone except me. Even my partner will not go near her very often.\n\nI often thought that if things did not work out for me I would try desperately to find a good home for her before it was not possible anymore.\n\nYou really have a tough decision to make and it is not one that I could do very easily either.\n\nLeigh\t\t\t", "date": "2008-07-22T02:03:45+00:00", "topic": "A Holly thoughts thread...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Holly,\n\nMy kids are 5 wonderful cats and I have an amazing bond with my first cat Maddy. She is a mix of Siamese and Felix type although has the character and temperament of a Siamese.\n\nIt strikes me more than a coincidence that I too have a similar situation with Maddy whom started to urinate all over the house one year before my diagnosis.\n\nI thought that maybe she was getting terrorized by the other cats as Maddy was always a loner and never mingled or played with the others.\n\nShe often showed her jealous nature by striking out at any passer-by when she was cuddling up with me. I guess she was a one man woman in a way and protected me in her own way.\n\nThe urine from a cat is very pungent and cleaning up after her became a chore and I did not want to add this to my usual daily chores even in my at the time good health.\n\nMaddy had the option to venture outside but never chose to do this and stayed indoors using the litter tray to have a number 2 but urinating were ever she so pleased.\n\nAfter many failed attempts at protecting her from the other cats and segregating her to give safe haven I sought help from the vet.  I was advised to do much of the same and to return within a week if she continued. The vet would then investigate further to see if it was a medical issue.\n\nOf course the urination continued and I returned with Maddy to the vet the following week. Visiting the vet with Maddy was always a trauma in itself and tranquilizers had to be used just for checkups.\n\nAfter a series of blood tests, urine samples and physicals no medical reason was found until they completed an x-ray of her pelvic area.\n\nMaddy had large bladder stones and had obviously had lots of pain with urination and sought comfortable places to do her business. I was extremely relieved to have an answer to the problems and after the operation to remove the stones I am sure that Maddy was very relieved also to be pain free.\nMaddy continued to urinate for another week everywhere except the litter tray. The litter tray then became her urination depository of choice…thankfully.\n\nShortly after I too started to have bladder issues although luckily for my partner I urinated in the toilet and cleaned up after myself….\n\nI am so sure that the bonds we make with are pets/kids have far deeper levels that we just don’t understand fully.\n\nLeigh…\t\t\t", "date": "2008-07-22T02:03:45+00:00", "topic": "A Holly thoughts thread...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Cynthia,\n\nThe Survivors Conferences and the candle light reading of the names and a keepsake from our community is a great idea.\n\nLeigh...\t\t\t", "date": "2008-07-20T21:32:05+00:00", "topic": "Memorial Page", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Ginger,\n\nThank you for organising this wonderful gesture...\n\nI am sure Susan's family will be comforted by the fact that Susan touched the hearts of many....\n\nLeigh\t\t\t", "date": "2008-07-18T16:56:47+00:00", "topic": "Something  for Susan???", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Lisa,\n\nI am so pleased for you and happy they got it wrong \n\nHurray to scar tissue....\n\nWishing you a pain free treatment Friday...\n\nLeigh\t\t\t", "date": "2008-07-12T17:32:35+00:00", "topic": "Really rubbish time", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Robin,\n\nI would like to offer my condolences to you and your family...\n\nLeigh\t\t\t", "date": "2008-06-27T23:46:52+00:00", "topic": "Sad news", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Lorrie,\n\nI too worried about having my chemo delayed because of low counts. My 4 month chemo treatment turned into a 5 month program because of this.\n\nIt was always the last Gemz of each cycle that was delayed roughly a week until blood levels returned to acceptable levels to continue. I was assured this had no effect on the effectiveness and was within acceptable guidelines.\n\nYour oncologist will be keeping a close eye on Bob's blood levels and will pull the plug on treatment if necessary.\n\nI am glad you came here for a ramble and hope it helped...\n\nGood luck with everything Lorrie ...you guys are in my thoughts..\n\nLeigh\t\t\t", "date": "2008-07-08T11:18:48+00:00", "topic": "Just Saying Hello", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Bob and Lorrie,\n\nI am glad you guys have checked in with us here at the forum.\n\nPlease hang on in... with the chemo....from cycle one I was also in a foggy world and it felt like I had the leading role in a slow motion picture for five months.\n\nI wish Bob all the very best with his continued treatment and hope the fog lifts for you both real soon.\n\nMy thoughts are with you both...\n\nLeigh\t\t\t", "date": "2008-07-08T11:18:48+00:00", "topic": "Just Saying Hello", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Lisa,\n\nI am happy you have checked in with us again...and so pleased the radiotherapy is having a positive effect.\n\nWishing you all the very best with your next treatment this weekend..\n\nLeigh\t\t\t", "date": "2008-07-08T19:16:52+00:00", "topic": "Hi sorry I have been a stranger", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Melissa,\n\nI was not offered a port for my 4 cycles of gemz/cispl. I have never really had a problem with needles until my chemo started. It became more and more difficult to find veins and I then requested it after my second cycle.\n\nIt was declined because I was already half way through and they thought it was unecessary....I had to hang on in until the end of the chemo.\n\nIt became a sort of phobia for me against the needles as often I had to be pricked 2/3 times to get the infuse in a good vein.\n\nI really hope I never have to have chemo again but certainly would have a port installed if it came to it.\n\nLeigh\t\t\t", "date": "2008-07-07T23:20:58+00:00", "topic": "Chemo Question", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBig hugs from Holland!!\n\nI wish your bonusmum all the very best....\n\nLeigh\t\t\t", "date": "2008-07-02T16:40:09+00:00", "topic": "just need/could use a hug today...", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Melissa,\n\nI just wanted to wish your Dad all the very best with his chemo.\n\nHaving completed a 4 cycle course of gemz/cispl recently I can say thankfully I faired pretty well.\n\nThe cisplatinum was the most difficult regime and the effects remained with me for roughly a week. I experienced tiredness sometimes severely which wiped me out and needed to sleep many hours.\n\nLuckilly I never had any sickness and my appetite remained and the steroids given alongside the chemo stimulated my appetite and I gained weight because of that.\n\nOral hygeine is very important and alongside brushing I used a mouthwash made from salt. The sores remained at bay through the whole treatment.\n\nThe effects are different for everyone and I suppose depend mostly on your state of health at the start of the treatment.\n\nMelissa, I wish your Dad all the very best in the coming months and hope he fairs well with the chemo....\n\nBest wishes to you and your family....\n\nLeigh\t\t\t", "date": "2008-06-25T21:09:57+00:00", "topic": "Any advice appreciated....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThis would be so wonderful...here's to a positive outcome of the trials....\t\t\t", "date": "2008-06-29T18:26:42+00:00", "topic": "Cancer \\&amp;quot;Cure\\&amp;quot; In Mice To Be Tested In Humans", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Forum,\n\nOn a recent update to this post I made a boo boo which read....\n\nDear Forum,\n\nI have just returned from my oncologist appointment and was able to get an explanation for my understanding of the stages.\n\nI am still confirmed as a stage 4 because I have no known mets. Even though my tumour invaded my bladder and prostate and 17 nodes this is known here as regional disease.\n\nIt should have read stage 5and I now understand the Umm reply from Wendy more clearly... \n\nLeigh\t\t\t", "date": "2008-05-25T19:51:30+00:00", "topic": "Stage IV Bladder Cancer or not ? ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Peter,\n\nThank you very much for your support.\n\nI will definately hang in there!! and try not to worry about any negatives \n\nBest Wishes\n\nLeigh\t\t\t", "date": "2008-05-25T19:51:30+00:00", "topic": "Stage IV Bladder Cancer or not ? ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Ginger,\n\nThanks for that \n\nI appreciate your caring support...\n\nLeigh\t\t\t", "date": "2008-05-25T19:51:30+00:00", "topic": "Stage IV Bladder Cancer or not ? ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nThank you for your message..\n\nLeigh\t\t\t", "date": "2008-05-25T19:51:30+00:00", "topic": "Stage IV Bladder Cancer or not ? ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nThat is really sweet of you \n\nI am sorry I cannot help with regards to what you should be looking for with your mum.\n\nYour red flag moment for the plum jelly is surely a sign for you that your mum is not feeling her usual self. Especially after probably plucking many of the plums off the trees herself.\n\nI really hope that she is just tired and her energy levels are low. I know when I had an appointment coming up with oncology I would nose dive into worrying about the unknown.\n\nThe CT scan sounds like a good idea and the best way to approach it with your mum is by explaning your own reasons you would like her to have them done. Your mum is one strong willed lady and will make up her own decision for the way forward.\n\nWishing your mum all the very best for the next appointment.\n\nThose wild red plums sound scrumptious and yes I would love a jar of that yummy jelly.\n\nHappy jelly making...\nLeigh\t\t\t", "date": "2008-06-26T22:19:21+00:00", "topic": "Thinking of each of you today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tGinger...\n\nyou certainly have more to offer than a stomach settler  ;D\n\nwe love you Ginger!!\n\nLeigh \t\t\t", "date": "2008-06-23T18:40:55+00:00", "topic": "Our next round....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Clara,\n\nI am happy Bob is back home from his hospital visit and sorry you guys never made it to your holiday.\n\nI wish Bob all the best for Gemz next Wednesday, I found this part of the chemo treatment to have no side effects except constipation because of the Zofran given along side for sickness.\n\nI advise some sort of anti constipation syrup to be taken once a day to keep the bowels moving for a few days from Wednesday to prevent this.\n\nWishing Bob symptom free chemo and all the strength required to get through his treatment....\n\nThinking of you both...\n\nLeigh\t\t\t", "date": "2008-06-23T18:40:55+00:00", "topic": "Our next round....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Karen,\n\nGood luck with Angelo's transfusion and as ever my thoughts are with you guys....\n\nLeigh\t\t\t", "date": "2008-06-26T13:58:59+00:00", "topic": "Blood Transfusion Today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHolly thanks for the update on Susan...\n\nLeigh\t\t\t", "date": "2008-06-24T14:04:05+00:00", "topic": "Susan is ok :)", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nI am pleased Dick is home....please do take care of yourself too.\n\nLeigh\t\t\t", "date": "2008-06-20T23:15:43+00:00", "topic": "Discharged", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Robin,\n\nMy thoughts are with you and your Dad.\n\nWishing the very best for your Dad and your family.\n\nLeigh\t\t\t", "date": "2008-06-15T06:17:53+00:00", "topic": "Update on my dad", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Karen,\n\nAll the very best for Angelo's pain injection today.\n\nThinking of you both and wish Angelo a speedy relief of his pain.\n\nKindest Thoughts...\n\nLeigh\t\t\t", "date": "2008-06-10T02:10:32+00:00", "topic": "Wednesday is the Big Day...Quadrament  FINALLY!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nIt is very heartwarming to read your posts and I feel the love you have for your family in the words you write.\n\nI am sorry to hear your Dad is not doing so well at the moment...\n\nYou have only the best wishes at heart for your parents so any thoughts you have of their future paths could not be wrong.\n\nI am happy you can come to this forum and express your thoughts the way in which you do and share your experiences with us, this I hope will lighten your load in doing so.\n\nJulie I wish your Mum and Dad many a year of tomato planting and cherry picking and health and happiness to you all....\n\nLeigh\n", "date": "2008-06-11T02:09:18+00:00", "topic": "feeling sad today", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nI am thinking of you and Dick during this time.\n\nI also hope things settle down so that you can go to your 50th High School Graduation gathering.\n\nSending positve thoughts and best wishes...\n\nLeigh\n", "date": "2008-06-10T05:18:02+00:00", "topic": "Today's medical visits and 1 no treatment", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Clara,\n\nThinking of you and Bob and hope that your next Drs visit will offer more positive answers.\n\nKindest Thoughts...\n\nLeigh\t\t\t", "date": "2008-06-10T21:58:30+00:00", "topic": "Bob's visit to the urologist", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Lorrie,\n\nIt must be a great relief for Bob to have the catheter, wearing and changing diapers and bed pad every hour or two must have been exausting for you both.\n\nAs mentioned on a previous post I too became totally incontinent in the evenings when I slept during the week after the cisplatinum chemo. For me though it was temporary although just for those times it was really exausting.\n\nYou guys have had this since the RC was performed and I cannot imagine that at all it must have driven you both to the edge.\n\nI am not suprised he is sleeping far better with the catheter...I hope you are catching up on well needed rest too.\n\nI think the discomfort of the catheter will ease over the next couple of days once he gets used to the tube and bag. At least mentally he has gained control once more as he will be the one to empty the bag. Something he has not had for so long with the incontinence.\n\nLorrie I wish you and Bob all the very best and hope he has the strength soon to start his treatment.\n\nBest Wishes\nLeigh\n\n", "date": "2008-05-23T14:01:46+00:00", "topic": "What else can go wrong?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Lorrie,\n\nI am so sorry to hear about Bob and his recent problem with a blockage. Tht must have been very difficult for you both. I hope that the morphine helped to ease the pain until they got the cathether in.\n\nBob really has not had a break and you guys really deserve one...I am sending you both positive thoughts and hope that the chemo went ahead as planned yesterday and he sailed through it with no effects...\n\nWishing you both all the very best...\n\nLeigh\n", "date": "2008-05-23T14:01:46+00:00", "topic": "What else can go wrong?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear mleigh,\n\nI am sorry to hear about your dad and hope that the chemo treatment zaps the spread of disease.\n\nI have just finished four rounds of Gemz/Cispl and I found that music was very calming and blocked out the chemo room noise so as Karen mentioned an iPod or cd player would be a great idea. I second that about Hard Candy from Madonna...excellent especially track three and six ;D\n\nLots of magazines...I found I was unable to read books as concentration to a minimum with chemo brain..I found I was repeating a page several times as my mind wondered to other places. Gossip magazines with lots of pictures were good for me and I am a hobby gardener so garden magazines were my main mag of choice.\n\nEvery chemo facility is different and mine offered tea and coffee and water only so if your Dad likes anything else to drink this would be a good option to include in your care package along with any nibbles....I found it important to always have a few nibbles with me for a sugar hit or salty snack to keep the nausea at bay.\n\nChewing gum or mints to keep my mouth wet and fresh...\n\nEven on warm days the chemo sometimes gave me chills so something for your Dad to cover up with would be helpful. Of course the nurses will offer a standard blanket but a present from a family member or friend will be very welcoming and comforting...maybe a warm fleece blanket.\n\nI hope this helps...\n\nWishing your Dad all the very best....\n\nKind thoughts to you and your family.\nLeigh\n", "date": "2008-05-26T13:32:49+00:00", "topic": "Chemo comfort tips?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Karen,\n\nSo pleased to hear Angelo is home with you guys...\n\nWishing you and your family all the very best.\n\nLeigh\t\t\t", "date": "2008-05-22T14:51:05+00:00", "topic": "Finally Home!!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Julie,\n\nGood to hear from you and so glad to hear you are settling down with your thoughts over your mum.\n\nI guess we all have phases we pass in this journey with bladder cancer as a patient or caregiver.\n\nWhen we first hear about a cancer diagnosis we have that impending doom feeling that stays with us until we reach a kind of acceptance.\n\nJulie I wish you more and more peace of mind so that you are able to sleep more and of course lots of quality time with your mum.\n\nThinking of you and your mum...\n\nLeigh\n\n", "date": "2008-05-22T01:36:04+00:00", "topic": "almost starting to forget ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nMy thoughts are with you guys...\n\nWishing all the very best.\n\nLeigh\t\t\t", "date": "2008-05-13T22:52:46+00:00", "topic": "Another punch to roll with", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Karen,\n\nHere's hoping Angelo stays pain free and comes home quickly. Great to hear he is able to be more active in his own care and eating sushi...\n\nAmazing what pain relief can do eh!!\n\nThinking of you guys...\nLeigh\n\n\n", "date": "2008-05-15T08:38:45+00:00", "topic": "Pain Management---13 days and Counting----VERY FRUSTRATED!!!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Susan,\n\nBest wishes from me too  \n\nYou are in great hands in Houston for sure....\n\nThinking of you..\n\nLeigh \t\t\t", "date": "2008-05-07T17:57:30+00:00", "topic": "Susan in Houston quick update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nGood luck with your hubbies appointments Monday and Tuesday for the CT Scan results...\n\nWishing you both the best of news....\n\nLeigh\n\n\n\n", "date": "2008-05-08T04:55:54+00:00", "topic": "Results next week", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Karen,\n\nYou are one amazing lady!!\n\nIt really is inspirational that even when you are dealing with your hubbies admission to hospital for his pain management issues and scans. You find the time to share your story with us all here at the forum.\n\nI read your posts with great interest of course firstly for updates on Angelo and also for the great advise you offer through the experiences you are having with this journey.\n\nI am so pleased that the MRI, and CT Scans showed little change in any other areas.\n\nAnd getting that second opinion from a Orthopedic Oncologist...way to go Karen.\n\nAs you mention this really does prove that a second opinion...no matter how advanced a disease is...or how superficial something may seem to be...should be Mandatory...\n\nKaren withing you and Angelo and your family all the very best...\n\nThinking of you guys....\n\nLeigh\n\n", "date": "2008-05-08T04:51:47+00:00", "topic": "A Perfect Example Of Why A Second Opinion Is ALWAYS NECESSARY", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Lisa,\n\nI truely do not know what you are feeling right now with this news and can only guess.\n\nI just want to say that I am thinking of you and wish you all the very best with your appointments this week.\n\nWishing you the best outcome for your futher treatments. Please do not give up the fight and stay on the side of... \"it is not going to beat me\" ...please...\n\nLeigh    \t\t\t", "date": "2008-05-08T12:17:21+00:00", "topic": "my cancer has spread ", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nCongrats on the clear brain scan....\n\nYour mum certainly is a lady with character.....just out of hospital and then busy helping plant 500 or more tomato plants. It is fantastic that she continues to live and resume her daily routine of maintaining the farm.\n\nObviously she should be more careful for a few days until she finds her feet again and I guess everyone around her should keep a close eye on her.\n\nIt is shocking that the paramedics did not perform the basic checks....my intuition tells me your mum refused any further help which seems to be a pattern for your mum.\n\nI hope she takes good advise regarding her diet....eating lots of veggies and fruit is great but she certainly needs to know what vitamins and nutrients she is missing with this diet to be able to supplement it.\n\nJuile...I wish you all well and hope that the tomato planting goes well  \n\nLeigh\n\n\n\n\n\n", "date": "2008-04-23T00:48:40+00:00", "topic": "Waiting for Brain CT results", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Holly,\n\nI so want to be able to give you the answers you seek and desire to make sense of your current journey.\n\nYou would think that oncology departments and professionals would have far more information and explanations and support for the patient. It seems so often that important information is missing on the patient side with regards to the in between times of any treatment plan.\n\nMostly it is a watch and wait game when dealing with mets which seems to make no sense to me at all. You would think to tackle something small now aggresively would be the ideal rather than wait months and retake scans for confirmation of something the patient knew and felt was an issue long before.\n\nAny pain or discomfort in our bodies is a sign that something is wrong and getting to the bottom of these issues promptly surely is the best course of action.\n\nMy MX classification as I mentioned to you on a PM will be confirmed in a few weeks as the areas that show concern in my body on previous scans will be scanned again and reassessed. Deep down I know something is not quite right because of pain and discomfort I have had but obviously hope that it is just between my ears and my mind playing games.\n\nI wish I had more answers for all of us but I do not although I know that we are so much stronger here together sharing our thoughts and concerns.\n\nTogether we are as one....\n\nLeigh\n\n", "date": "2008-03-27T14:17:37+00:00", "topic": "Where I am at now", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie,\n\nOk I will admit it I have been crying my heart out the last few days with all these wonderful posts our forum buddies are posting.\n\nIt is amazing how words can touch the heart strings especially when they have been sealed for a long time.\n\nMy heart goes out to you and your mum and I wish you a wonderful birthday and I would also tape the birthday song....great idea Karen!!\n\nKaren, happy birthday to your hubbie also and I know you will make it a very special day.....\n\nBirthday wishes to both of you...\n\nLeigh    \t\t\t", "date": "2008-04-04T00:32:13+00:00", "topic": "I'm so sorry", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Susan,\n\nSending positve vibes and support to you in Houston from across the pond.\n\nLeigh\t\t\t", "date": "2008-03-14T02:38:58+00:00", "topic": "report from Houston by Susan", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Clara,\n\nGlad to hear that you both took a trip to the coast  \n\nGood luck with the appointment Thursday and with the future treatment plan.\n\nThinking about you both.\n\nKind Wishes,\nLeigh \t\t\t", "date": "2008-03-03T21:49:36+00:00", "topic": "Results of Bob's PET scan......", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Clara,\n\nI am very happy to hear that the PET scan showed little change.\n\nGood luck with the MRI wednesday and for a speedy resolve to his pain.\n\nWishing you both well.\n\nLeigh\t\t\t", "date": "2008-03-03T21:49:36+00:00", "topic": "Results of Bob's PET scan......", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Karen,\n\nMy thoughts are with you and your family..\n\nWishing your husband all the very best with his new pain treatment plan.\n\nKind Regards\nLeigh \t\t\t", "date": "2008-03-13T16:27:11+00:00", "topic": "Our Pain Releiving Choice", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Karen,\n\nI am sorry to hear that the results of the scan's were not more positive.\n\nI wish your family all the very best during this time and many more days of cuddling up and munchies.\n\nBest Wishes\nLeigh\t\t\t", "date": "2008-03-09T16:36:26+00:00", "topic": "Results of New Scans", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Susan,\n\nI too can only try to understand what you are dealing with at the moment.\n\nYou have explained your wishes very well in your post and I agree with Karen when she says put it exactly as you have mentioned.\n\nI know it is easier said than done though once in cosultation with your oncologist. Please have all your wishes with you on paper when you have your appointment just incase you forget anything as I am sure you would have anyhow.\n\nYou have the right to have the best treatment available and you have convinced me many times of your courage and strength in searching out the best treatment path.\n\nI feel your strategies and tactics as a warrior have served you well and being afraid is certainly no weakness but human nature when faced with adversity.\n\nThe immense power of self preservation for your fight and right to life inspires me and many others here at this forum.\n\nAs always...wishing you all the very best.\n\nKind Wishes\nLeigh\n\n\n\n", "date": "2008-03-05T16:42:33+00:00", "topic": "How do we engage a team to individualize treatment? I'm scared.", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Aimeth,\n\nYou and your family are in my thoughts at this time and my condolences go out to you all.\n\nThank you for sharing your husbands journey with us which is a special gift to everyone at this forum.\n\nTake good care of yourself and wishing you lots of strength with the services this week.\n\nKind Regards\nLeigh \t\t\t", "date": "2008-02-19T17:01:51+00:00", "topic": "Very Sad News From Aimeth", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Melodie and Maria,\n\nMany thanks for your messages and for taking the time to read my web log of my journey so far.\n\nI did have an overnight stay for the Cisplatinum as it is standard here in Holland to deliver the treatment this way. I have read on this site though that some patients have taken the IV home after chemo and flushed at home.\n\nThis forum and the wonderful people within it have supported me during difficult challenges and I am very appreciative of that in so many ways....\n\nKind Regards\nLeigh\t\t\t", "date": "2007-11-20T10:37:10+00:00", "topic": "Adjuvant Chemotherapy", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHello Forum,\n\nI would like to thank everyone for your kind words advise and support in my search for the best treatment.\n\nChemo has started now and if anyone is interested you can read my web log regarding my treatment and appointments etc...\n\nThe initial entry's are extracts from my story on the story board section from this web site which you may have already read and follows through to present day...\n\nwww.zeelandnet.nl/weblog/data/leigh/\n\nMany thanks\nLeigh \t\t\t", "date": "2007-11-20T10:37:10+00:00", "topic": "Adjuvant Chemotherapy", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Karen,\n\nGood luck with the radiation theraphy these coming days. I hope that the travelling up and down for treatment is comfortable for your husband.\n\nIf they say the treatment can take up to 5 days to start to feel pain relief in his shoulder, then I wish him to be pain free for Christmas and you guys can have a fabulous Christmas day together with your family!!\n\nSending you wishes of peace comfort and joy for the holidays.\n\nLeigh\n\n\n\n\n", "date": "2007-12-18T21:59:11+00:00", "topic": "Radiation Starts Tomorrow", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJust wanted to let you know how sorry I am for the loss of your Dad.\n\nWishing you and your family well during this time.\n\nLeigh\t\t\t", "date": "2007-11-16T02:08:05+00:00", "topic": "My Dad's Passing.....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHey Mike,\n\nHave done a little research now on the convene, condom catheter and feel ready to give it a bash.\n\nStill waiting for the brochure to choose best option for me.\n\nApparently I can order three tester boxes for a trial with 5 in each including bag and tubing.\n\nHow many straps do you recommend for securing tubing and bag and should I order a cover for bag. I have a few cats roaming the house at night and can imagine this could become a new scratch toy lol.\n\nThey can deliver within 24 hours so soooooo looking forward to getting a full night sleep for the first time in over two years since RC.\n\nLeigh  ", "date": "2009-12-08T11:07:53+00:00", "topic": "condom catheter", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThanks for your help and info Mike....much appreciated.\n\nKind Regards\nLeigh\t\t\t", "date": "2009-12-08T11:07:53+00:00", "topic": "condom catheter", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Forum,\n\nCalling fellow condon catheter users for tips...\n\nAt the moment I am being prescribed dexamethasone to relief the pressure in my head before surgery.\n\nUnfortunately this has reverted me back to incontinent in the evenings when I sleep.\n\nIt basically feels like I am in training again for my neo bladder.\n\nI want to order some night time condom catheters and have been posted a form which should arrive today with sizes and choices available.\n\nMy care provider would not send tests packs as they have so many and first need to get a guide of size and sort required before they send out any testers.\n\nMike I think you use these from time too time right? any ideas tips thoughts would be welcome.\n\nI am waking wet every few hours at night and this adds to the hardship of tiredness I have along with the constant bed changing.\n\nLuckily I have sets of matress protectors which can be changed and extra absorbent mats to lie on but they always move around and feels sweaty to sleep on.\n\nThe condom catherter will be the best option for now so that I can get a good night sleep and have less washing.\n\nI guess when I am in hospital next week for my head op they will insert a regular catherter until I can walk around again. It was good to read the recent post about ensuring the nursing staff are aware to check for out flow and back flush if required.\n\nIt will be the first thing I will talk about with them when I go for my pre- tests next week to make sure they are aware about the tendancy of the neo to produce mucus and block tubes....\n\nThanks for any info...\n\nKind Regards\nLeigh\t\t\t", "date": "2009-12-08T11:07:53+00:00", "topic": "condom catheter", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Bill Jr,\n\nI am sorry you had to go through that awful prostate exam it is unpleasant enough, it must have been excruciating having your added issues.\n\nIt is very encouraging that he will be taking these steps and I truly hope you will be on a speedy route to being pain free and infection free.\n\nTake good care…\n\nLeigh\t\t\t", "date": "2009-11-13T00:04:45+00:00", "topic": "Saw Infectious Disease Dr today", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Mike,\n\nGlad to hear that you have taken the step to use injections and I wish you all the very best.\n\nGr.Leigh\t\t\t", "date": "2008-08-08T21:09:14+00:00", "topic": "Bruises from injections for ED", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Pat,\n\nI value your advise and research and feel free to jump in anytime...\n\nThe link was very helpful and has made me aware that my technique is not up to scratch.\n\nRecently I have been injecting in the top nerve area instead of at the side at the 90d angle. I believe this may be increasing the bruising.\n\nDear Gene,\n\nI use the same needle and may be hitting a blood vessel but think I need to inject more at the side rather than the top area. I will let up on the pressure and see if that also helps.\n\nThanks to both of you for your help and support...\n\nLeigh\t\t\t", "date": "2008-08-08T21:09:14+00:00", "topic": "Bruises from injections for ED", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI guess this mens section has dwindled in support....\n\nBasically I was asking if the drug used that is injected to engorge the cavity should be engorging my penis head......because it is not and far less sensitive than before.\n\nI understand this may sound like a stupid question and what am I complaining about when it could be far worse....\n\nI would appreciate any personal experiences....it will be a while before I get to see my Urologist to ask this question so any info would be great.\n\nRegards\nLeigh\t\t\t", "date": "2009-01-04T21:46:22+00:00", "topic": "Injection users", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Forum,\n\nI use injections to gain an erection due to RC and no nerve sparing technique because of location of tumor.\n\nMy erections with the injections are very good although sometimes slightly painful. The only thing that I notice is that my penis head does not engorge as it did before RC.\n\nDo any of you guys using injections have this also?\n\nBest Regards\nLeigh\t\t\t", "date": "2009-01-04T21:46:22+00:00", "topic": "Injection users", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Harry,\n\nI use the shots on a regular basis and I am now used to the routine.\n\nIn the beginning it took several times to find the right dosage and now i have harder erections than ever before.\n\nYou have to inject yourself in your penis and sounds painful but really is not and it literally takes five mins to prepare the shot and inject and within minutes you will have an erection.\n\nOccasionally I have bruises on my penis from an injection which fade after a few days.\n\nMy erections last for around 60 minutes but as soon as you orgasm the erection becomes softer unless you stimulate once more.\n\nI have my injection syringe prepared in advance so that I always have one handy in the refridgerator for those moments of passion....\n\nLeigh\t\t\t", "date": "2008-11-05T00:30:49+00:00", "topic": "ED and shot option - questions", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Joe,\n\nCavaject is a well known brand name for ED although other drug medications have had better performance records.\n\nI suppose it is just like when we searched for the best possible surgeon to perform our RC's. We should do the same with ED meds as they all have differing success records.\n\nIf you are going to give it a bash I certainly would recommend starting on the lowest dose with any of the meds and working up to your own personal dose.\n\nSome guys need very little and some the whole ampule dependant on blood flow down below so to speak.\n\nOne great side effect from the injections is that it stimulates new nerve and blood vessel growth. This can lead to have a spontaneous erection in some...I too have had these even though I had no nerve sparing technique performed due to location of tumour.\n\nBest wishes...\nLeigh\t\t\t", "date": "2008-07-13T13:44:10+00:00", "topic": "Cavaject", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Joe,\n\nI have been using Intravenous Androskat for a few months now with great success.\n\nThis is used here in the EU because of it's high success ratio...it is also known under the names:\n\nPapaverine + Phentolamine which is a Bi-mix called Androskat from the (EU)\n\nRegards\n\nLeigh\t\t\t", "date": "2008-07-13T13:44:10+00:00", "topic": "Cavaject", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Forum,\n\nIt took several injections and adjustments in dosage to gain the best erection.\n\nIntially my Urologist injected 0.3ml which never resulted in a full erection and since this time I have increased the dose 0.1ml each time. When I reached 0.7ml my penis became very erect and slightly painful and the erection lasted one and a half hours. I then reduced to 0.6ml and this gives an erection within 5 minutes and lasts up to 40 mins to 1 hour.\n\nFor those of you that are maybe thinking of trying the injection it takes a little time to find the best dose and every one of us will require differing dosgage amounts and it is just a question of experimenting.\n\nThe biggest fear I had was with leakage during sex although up until now this has not occurred. I ensure my bladder is empty before I inject myself to prevent any possible leakage.\n\nClimax is exactly the same as before although dry of any sperm because of the RC. I also had no leakage of urine at any point during the climax either.\n\nAfter the erection had subsided the penis remains enlarged (kind of swollen)for several hours which is totally painless. Not a bad side effect I guess for impressing your partner  ;D\n\nFight the fear of the injection and try anyway...\n\nBest Wishes\n\nLeigh\n\n\n\n\n", "date": "2008-06-11T09:54:51+00:00", "topic": "Injection update...", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Sam,\n\nThank you for your message, I am very happy that this part of my life has been restarted and feel very grateful.\n\nGoing into the RC surgery I was hoping that the sparing technique would not have been a problem however because of the size and location of tumor it was not performed.\n\nMy Urologist however did suggest viagra to stimulate blood flow and Androskat injections. Apparently any fine nerve endings that may have been left over from the operation can be stimulated to grow.\n\nI guess everyone of us has a different response to medication and I am unsure why your husband was not offered medication theraphy first. I am no doctor so their must have been a reason why he was not offered it.\n\nIn answer to your question if it would be possible to use the injection when an implant has been installed I cannot answer. We do have implant users at this forum and I am sure they will be able to help with this question.\n\nBest Wishes,\nLeigh\n\n\n\n", "date": "2008-02-08T13:46:42+00:00", "topic": "Starting up my sex life...", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Forum,\n\nThe injections have been going very well and I have now found my ideal dose for a good erection. It is great to have the life injected  back into my willy  \n\nThe injections have stimulated the blood vessels so much that on several occassions I have had semi-erections on days when no injection had been used.\n\nThis was mentioned to my Urologist, as the nerve sparing technique was not performed due to location and size of tumor. He said that this does happen and small fine nerves and blood vessels often get stimulated because of the injections.\n\nI was hesitant for so long because of fear but now I am so happy to regain this part of me and so too is my partner ;D\n\nLeigh\n\n", "date": "2008-02-08T13:46:42+00:00", "topic": "Starting up my sex life...", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nPsychologically I found (and still do to some extent) that I feel kind of more \"delicate\" down there than I did. And this does effect how i am with sex. also, as i still leak a little I have to make sure I empty my neo properly and it's often in the back of my mind that I may leak a little during sex or just prior to or just after. this is a bit of a drag but we're ok with it.\n\n\nHello Tim and Forum,\n\nThis is playing greatly on my mind regarding leaking during sex and one of the hurdles keeping me from jump starting my sex life.\n\nI think making sure the bladder is empty before sex is important as you have mentioned.\n\nDo you find that you leak after what would be a dry orgasme for me also and if so....does this improve in your experience?\n\nMy partner and I have never been into watersports so to speak   :-[ and with my urine having the egg soup consistency I dont want to gross my partner out...maybe a condom would be an option.\n\nIt feels delicate to ask these questions but these are my issues and hangups and do not want to offend anyone by asking them...\n\nKind Regards\nLeigh ", "date": "2007-12-01T03:59:56+00:00", "topic": "Question?  What is your experience  regaining sexual  function?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Patricia and Zachary,\n\nYes I was also worried for infection...luckily I was already halfway through an antibiotic course for a bladder infection.\n\nI mentioned the stitch problem to my new Urologist recently and he said that it can happen and that is why he does not advise a bladder cleanse with a catheter unlike my original urologist whom performed the RC.\n\nI am also very pleased I pulled a stitch out instead of a staple.... \n\nSo I came away very happy that I no longer have to use a catheter for a bladder cleanse.\n\nI have noticed though when I eat too much dairy I have more of a problem with urination and have to push hard sometimes to release the urine because of a build up of the mucus.\n\nKind Regards\nLeigh\n\n", "date": "2008-01-11T16:29:40+00:00", "topic": "Stitch found during bladder cleanse", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Forum,\n\nI presently rinse my bladder with salt solution once a week advised by my Urologist.\n\nToday I had trouble getting my catheter to enter my bladder....after a little persuasion I finally pushed on through. After I had completed the cleanse I started to retract the cathether and I felt something scrapping my uretha.\n\nOnce the catheter was removed I could see attached to the end lodged in one of the holes a stitch. It felt pretty hard to touch and each of the three strands making up the stitch was approximately a centimeter in length.\n\nWell as you can imagine they must have used loads of disolvable stitches to get the new bladder urine tight. I just was never warned about this by anyone at the hospital. I had a certain amount of pain and bloody urine yesterday which is under control now.\n\nHas anyone else had this experience when cleansing the bladder, my RC was performed with open incision three and a half months ago.\n\nThanks\nLeigh\n", "date": "2008-01-11T16:29:40+00:00", "topic": "Stitch found during bladder cleanse", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Forum,\n\nThought I would give a quick update regarding the injections!!\n\nI am still waiting for the supplies to come from the manufacturer, apparently they are out of stock. They will deliver the goods to my pharmacy within 10 days.\n\nI was away recently on a little trip and was hoping to take the injections with me for a try out.... \n\nSurely I cannot be the only male in my area that has erectile problems. My pharmacy is located within a medical practice with 6 doctors which serve many patients in the area and they have no stocks. Guess I will just have to be a little more patient for some nooky.\n\nI am digressing a bit now but it is on a similar subject... whilst on my recent trip I had a spot of constipation, probably due to change of food and water. During my long toilet visit waiting patiently for a deposit. (choosing words carefully)  \nI suddenly noticed I was getting an erection....now having been told I was totally impotent and that the nerve sparing techniques could not be performed...this was a bit of a shock.\n\nThis has now happened on a couple of occassions when going to the toilet for a number two. The erections only last a few minutes and no time to put it to use  :-[\nI can only assume that during the pressing process we have with constipation this inturn allowed blood into my penis.\n\nAm I the only one with this anomaly or have any of you fellow RC guys had the same experience?\n\nKind Regards\nLeigh\n\n", "date": "2007-11-22T11:24:45+00:00", "topic": "Intracavernous Injection", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Ginger Beane,\n\nThanks for your message and you really don't have to apologize  \n\nI collect my injection medication tomorrow and I will certainly give it a go.\n\nUpdate to follow  ;D\n\nKind Regards\nLeigh \t\t\t", "date": "2007-11-22T11:24:45+00:00", "topic": "Intracavernous Injection", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Dan,\n\nMany thanks for your message, I really appreciate your information and the links to the the other site. I will certainly take a look.\n\nKind Regards\nLeigh\t\t\t", "date": "2007-11-22T11:24:45+00:00", "topic": "Intracavernous Injection", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCongratulations on your Dad's 83rd birthday!!!\n\nLeigh\t\t\t", "date": "2009-08-26T23:50:08+00:00", "topic": "Happy 83rd Birthday to My Dad!", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tDear Mel,\n\nCongrats on your wedding and I am so happy that your father sealed your special day.\n\nI hope you managed to have a honeymoon and sending you all the very best to you and your husband for a long happy and healthy life together.\n\nLeigh\t\t\t", "date": "2008-11-17T16:58:11+00:00", "topic": "Wedding!", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tDear Julie,\n\nHappy New Year!!\n\nI am glad you enjoyed the holidays and your mum has recovered enough to get out and about again.\n\nYour posts made me smile when you wrote over your mum and her daily chores and her active lifestyle on the farm.\n\nI wish you and your family many more quality moments with her.....\n\nKind Regards\nLeigh\t\t\t", "date": "2008-12-27T02:37:24+00:00", "topic": "happy holidays", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tDear Rocky,\n\nI am so very sorry to read your news about your brother Timmy.\n\nPlease accept my condolences to you and your family for your loss and wishing you all much strength.\n\nLeigh\t\t\t", "date": "2008-12-04T04:10:34+00:00", "topic": "brother", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI am so very sorry to read about your mom passing and may I offer my sincere condolences to you and your family.\n\nLeigh...\t\t\t", "date": "2008-10-05T17:52:01+00:00", "topic": "beyond words today", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tDear Jerrysgirl,\n\nI am so very sorry to read your news about your husband and mom...\n\nMay you have many more quality moments with your mom during this time...and that you have positive news with your husbands biopsy results.\n\nThinking of you and your family...\n\nLeigh\t\t\t", "date": "2008-10-05T17:52:01+00:00", "topic": "beyond words today", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tHello Ginger,\n\nSo glad to hear about your 5 day trip to Las Vegas with Gene and your family.\n\nDuring my recovery from the RC which was the same time as Gene's I never thought I could be well enough to even consider a trip away from home.\n\nIt really is amazing that we can recover and return back to the land of the living after the RC, because at the time it seems like a never ending journey.\n\nDuring recovery I was grateful just to be able to have a little walk and was so happy even just to have a bowel movement...I am sure Gene remembers those days very well.\n\nMy trip in December was for a week to Fuerteventura in the canary islands which I enjoyed so much and was so grateful to feel the suns warm on my face and body.\n\nJust all the little things make a world of difference having lovely meals and walking along the beach. All things I never dreamed could happen again so quickly after such radical surgery.\n\nIt brings a smile to my face when I read stories like yours and others when we have recovered enough to start living again...\n\nGinger please keep up your wonderful support you offer here at the forum and I wish you and Gene a wonderful few months together with ought any visits to mdical centers....\n\nTake care..\nLeigh   \t\t\t", "date": "2008-01-31T09:07:32+00:00", "topic": "Our Little Get Away!!!!", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tthat would be really cool, growing it around our neo's and a little helping hand of a muscle would be great.  ", "date": "2009-09-21T22:23:40+00:00", "topic": "The regenerating bladder", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHeading in the right direction...interesting, thanks for the info Pat.\n\nleigh\t\t\t", "date": "2009-09-08T18:39:53+00:00", "topic": "Personalized therapy for invasive BLC", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tDear Karen,\n\nI am so happy you guys are going for this trial....\n\nI wish you both the best of luck with your application..\n\nLeigh\t\t\t", "date": "2008-07-01T14:47:46+00:00", "topic": "Very promising research!", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tMelissa,\n\nCongratulations on the birth of your new baby girl Juliana.....\n\nxxx leigh\t\t\t", "date": "2010-04-11T12:36:38+00:00", "topic": "The new baby!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHey Rocky,\n\nI am glad you have come back to the forum.\n\nI hope this message greets you with health and happiness...\n\nAre the snows falling....are you hitting the slopes....\n\nxxxleigh\t\t\t", "date": "2009-12-02T23:36:09+00:00", "topic": "I\\'m back !", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Thanksgiving everyone.....\n\nxxxLeigh\t\t\t", "date": "2009-11-25T19:42:28+00:00", "topic": "Happy Thanksgiving!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Holly,\n\nGreat to have you back...it is always a worry when fellow forum buddies vanish.\n\nLooking forward to your update...\n\nChat soon...\n\nLeigh\t\t\t", "date": "2009-10-25T14:39:37+00:00", "topic": "I was simply lost", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tcongrats on the first interview being published....looking forward to the others.\n\ngreat job Charlotte\n\nthank you Mike for sharing.\n\nLeigh\t\t\t", "date": "2009-09-21T18:46:46+00:00", "topic": "First Facebook interview posted.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tBritish born in Immingham Lincolnshire now living in Zeeland Holland....\n\nEngland will always be home so this is my base in my heart if that counts lol\n\nLeigh\t\t\t", "date": "2008-09-17T16:09:18+00:00", "topic": "Calling UK members", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Warren,\n\nGreat looking cake!!\n\nGlad your back...\n\nLeigh\t\t\t", "date": "2008-07-20T03:18:29+00:00", "topic": "I\\'m back", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Forum,\n\nIs it just me or have the alert emails of replies to posts been turned off?\n\nLeigh\t\t\t", "date": "2008-07-18T13:50:06+00:00", "topic": "alert emails", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tKaren,\n\nThat is great...I have been pondering to do the same for a while now about  friends that I have neglected...\n\nI will stop pondering and pick up the phone \n\nLeigh\t\t\t", "date": "2008-07-16T13:40:18+00:00", "topic": "Christian The Lion", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Karen,\n\nThanks for that!! my emotions erupted after watching.\n\nBeing a cat lover myself it tugged at the heart strings...needed a good old cry anyhow...\n\nLeigh\t\t\t", "date": "2008-07-16T13:40:18+00:00", "topic": "Christian The Lion", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tYou certainly got me....I did have a good old laugh though.\n\nSecretly I wanted it to be true and be the same elephant.\n\nLeigh..\t\t\t", "date": "2008-07-16T13:45:46+00:00", "topic": "Another Incredible Story", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat to hear from you all....\n\nIt warms my heart to have you all as my forum friends and great to know when we reach out are calls are answered. It was really quiet this past week on the forum and I missed the connection.\n\nGinger thanks for the compliment about my picture ...blush blush... the prayer and support chain you posted for Zach and Heidi is very special and a wonderful idea...you really are a kind hearted lady.\n\nFor those having difficult times at the moment I send warm positive thoughts to you all.\n\nWe have a truley wonderful network of people here at the forum which really has been my second home since my diagnosis.\n\nWishing health and quality for all and lots of hands to guide us in times of need...\n\nLeigh\t\t\t", "date": "2008-07-14T13:06:24+00:00", "topic": "Calling all forum friends", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Ginger,\n\nI am so sorry to hear you have not been well....\n\nI really hope you are getting back on your feet again..\n\nBest Wishes\nLeigh \t\t\t", "date": "2008-06-18T19:38:52+00:00", "topic": "New experience for me!!!    C-DIF", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Karen,\n\nInteresting article....\n\nBefore my RC I worked in my local hospital in Holland and the general staff were excellent at keeping up with the rules regarding MRSA for known MRSA infected patients. These patients were also isolated with dedicated equipment.\n\nFor the other patients however sharing equipment was standard practice which made no sense to me....the blood pressure cuffs were never cleaned before moving onto the next patient.\n\nI feel doctors are the biggest problem especially when on the ward rounds as they move from patient to patient ward to ward and shaking hands with patients and visitors and not washing hands between patients.\n\nOf course some doctors did adhere to hygiene rules but many do not.\n\nWhen I was laying in my bed as a patient after the RC in another hospital I began to notice this more and more. Sometimes even the nurses did not use gloves to take blood or change dressings because they found it difficult to achieve the task with latex gloves...\n\nEven in my fragile state I became a cleaning freak in my own room and bathroom   I did not have the cleaning goods with me so I used the alchohol dispenser in my room to wipe down surfaces  \n\nLeigh\n\n", "date": "2008-05-27T03:21:17+00:00", "topic": "Hospital Stay?  Be Sure To Be ProActive Regarding Infection!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHello Rocky,\n\nGlad to see you back posting on the site....\n\nWhat a truley wonderful story about the deer...the way you wrote about them made me picture the scene so clearly.\n\nThe closest I have ever been to deer was in a wild life park in Germany last year and it was possible to buy corn to feed them along the way. They really love those dried up corn chips eh!!\n\nIt must be really amazing to have them so close to your home naturally roaming around.\n\nRocky..it must have been a difficult trying time for you recently with your hubby going through chemo...I want to wish him all the very best with his last two chemo's and with your scope.\n\nLooking forward to seeing the pictures of the deer especially the fawn...\n\nBest Wishes to you and your hubby.\n\nLeigh \t\t\t", "date": "2008-05-23T03:16:39+00:00", "topic": "Deer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Peter,\n\nI am so sorry to hear about the loss of your dear friend Tom.\n\nKind thoughts and wishes...\n\nLeigh\n\n", "date": "2008-05-17T17:42:28+00:00", "topic": "&amp;amp;quot;Luck Of The Draw&amp;amp;quot;", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Holly,\n\nI am sorry to hear that recent postings on the forum have upset you.\n\nIt upsets me to think that you may decide to leave the forum because of this, although I totally respect you if that is what you decide to do. I never saw the posts in question this weekend although from time to time over the last eight months that I have been a member, some posts have been upsetting to me also.\n\nFrom time to time I have read posts and replies to posts and cringed at the bad attitude and sometimes malice people have written. I strongly believe that this has no place on our forum which should be where we feel safe and free to express our concerns and problems in a respectful manner.\n\nI don’t always reply to every post because sometimes I really don’t know what to say that can help the situation. When I do reply with my own experiences that may be helpful I do so with the hope that my chosen words give support or sympathy in a caring way to the given situation.\n\nThis forum has helped me so much to deal with the problems I have encountered and you have been a fantastic support for me in so many ways. As you mentioned in your post, our forum friends have guided us and supported us and made this scary journey less intimidating.\n\nI will be ever thankful for your caring wise words of support you have given me on posts and personal messages.\n\nHolly whatever you decide to do I will always be eternally grateful for your unconditional caring support you have offered me and so many at the forum.\n\nKindest Wishes\nLeigh\n\n\n\n\n\n\n", "date": "2008-04-14T14:40:07+00:00", "topic": "Moving on", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Holly,\n\nMy sincere condolences to you and your family.\n\nI rarely come to this thread and understand now why you have been away for a while.\n\nTake good care of yourself.\n\nKind Wishes,\nLeigh\n", "date": "2008-03-14T03:29:30+00:00", "topic": "Hollys father passed", "subforum": "17-chit-chat"}]}