{"signature": ["BCG"], "posts": [{"text": "\n\t\t\t\tGood luck, Jill!\nMy experience was only two instances of hematuria within 18 months of each other; both times, there was so much blood I went into a panic and ran straight to my doctor's office.. I had no infection either time, but the first time, they treated me with antibiotics.  The second time, they sent me straight to the urologist, who scheduled a cystoscopy within 2 weeks.  He knew I had cancer since I never had pain or infection.\n\nMine is low grade, TaG1-but it has come back once now.  I go again in August for another poke and peek. I'm 49, was diagnosed at 47; I realize I may have this nuisance cancer for the rest of my life, but I plan on that being a LONG life.  I am going to ask my HMO to switch me to a urinary oncologist if it re-appears in August.\n\nI hope your diagnosis is the best possible, and this is a great place to ask any kind of question - we once had a discussion about how much blood is in your urine, and it quickly turned into a wine debate - well, mine was rose', and mine was zinfandel, but MINE was merlot, and mine was cabernet; you will be able to laugh when you know what's wrong, and have help dealing with it! \n\nBe strong, remain fearless!\nLauren\t\t\t", "date": "2008-05-31T01:19:24+00:00", "topic": "Not sure if I have it", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou'll have a normal life if you choose to.  You may obsess on some days, but if you choose to look at it as just another pothole on the road through life, then your days will be as happy as you make them.  For me, the changes were positive - I read all my food labels, eat healthier, and read ALOT about other things I can do to stay  healthier.  I'm only 49, I plan on living alot longer, with or without my bladder!  I just had back surgery from a stupid fall this winter, and it was much more bothersome than the cancer (that actually returned after an initial 2 yr absence)... now I'm trying to get my T2 diabetes back under control (some of those painkillers and the pain response it self got it all out of whack) - and in August, we'll see if the Big C came back again.\n\nI mentioned before, my urologist said if he had to get any kind of cancer, it would be superficial non-invasive TaG1 bladder cancer...\n\nI wish you the best of luck with your second TURB - deep breaths!!\n\nBe strong, remain fearless!\nLauren\nTaG1 12/05, 2/8, and hopefully no more!\n", "date": "2008-05-04T22:36:51+00:00", "topic": "Need To Ask", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou know, it was never even mentioned to me, pre-TURB, that I might have a catheter.. And I didn't.  I'm so glad, too.  Of course it hurt to pee for a little while, but the idea of going home with that inside of me just creeped me out!  Otherwise, in the scheme of things, post-TURB side effects are few - some have bladder spasms for a little while - I never did.\n\nOf course, on this BC journey, I have had to put up with more invasion of my urethra than I ever thought possible, and for my last checkup (when they found more cancer after 2 years clean), I swear it seized up and he had a darn time getting the scope in.  I told him my urethra was staging a protest and was tired of being invaded.. :\n\nSeems as if more men go home with catheters than women -\n\nBest wishes to your Dad.\t\t\t", "date": "2008-05-02T12:29:32+00:00", "topic": "Questions to ask post TURB?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBrenda,\n\nSame here, and my uro uses a rigid scope... but he shoots something inside me to numb me first (and he does them with my bladder empty, not full)... there is no pain, and minimal discomfort...but if you can, ask him/her if you can watch the monitor - I forget all about the discomfort when we are talking about what we are BOTH looking at on the monitor during the procedures. And so far, the only thing growing in my bladder since my surgery is some scar tissue, thank heavens!\n\nGood luck, and just remember to BREATHE!\n\nLauren\ndiag 12/05\nTaG1\t\t\t", "date": "2007-04-18T15:12:26+00:00", "topic": "Afraid of Test", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tmy grandfather told me that the old-fashioned cure for bladder/kidney stones was..... a CASE of beer.\n\nYou peed so much you passedthe stones, and you were so schnockered that you didn't even FEEL it....\n\nKinda makes sense, doesn't it? ;D\t\t\t", "date": "2007-04-06T21:53:36+00:00", "topic": "Hello Everyone", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWoo Hoo for you, Rachel!!  Well, not because you are in pain.. :-/ but because you dodged the Big C for now... You go celebrate with a big glass of ...well, whatever they'll let you have!\n\nLauren\t\t\t", "date": "2007-01-22T18:56:45+00:00", "topic": "not bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYep... my tumor was huge, like a stalk of broccoli, and it was the lowest grade superficial cancer...all I require at this point is a \"poke and peek\" (cystoscopy) and peeing in a cup every six months.\n\nSo be strong, and remain fearless!\n\nLauren\nDiagnosed 12/05\nTaG1\t\t\t", "date": "2007-01-11T02:47:47+00:00", "topic": "Just Diaganozed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSimon,\n\nI had a really large tumor removed a year ago - it was described as a \"stalk of broccoli\"... how appetizing ;D... anyway, it was TaG1 - very non-aggressive. I had one six month cycstoscopy, and all i had was scar tissue (a little too much, but I scar easily)...  My second follow-up is in a month, and I'm hoping for a repeat of the same good news.  I was 47 when diagnosed, a non-smoking office worker/dog trainer.\n\nSo large doesn't always mean bad.  Oh, and my uro uses a rigid scope, and a local anesthetic; yes it's uncomfortable, and it hurts to pee for a few days afterwards, but he let me watch the screen, which made me forget about the pain (I'm a sucker for Discovery Health Channel, so watching the inside of my own bladder in real-time action was cool..).\n\nBe strong, remain fearless!\nLauren\t\t\t", "date": "2007-01-03T08:48:33+00:00", "topic": "37 is too young. Look at the waiting rooms!!!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy papillary tumor was HUGE, my surgeon said he didnt' understand how I didn't pee every 5 minutes, it was taking up so much room in my bladder. It was like a stalk of brocolli. :o.. however, the pathology came back TaG1, and my first six month scope was completely clean, other than a little too much scar tissue had grown...\n\nSo don't worry about size - it didn't matter, in my case!!!  Wishing you lots of luck.\n\nLauren\t\t\t", "date": "2006-09-12T00:36:18+00:00", "topic": "at the beginning- had surgery today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy urologist told me that  my tumor took up the majority of the space inside my bladder, and looked like a big stalk of broccoli - he knew it would be cancer immediately from the CAT scan; but it turned out to be Stage Ta, Grade 0 - so, don't let it worry you, what they SAW, cause it might wind up to be the best, most 'minor' cancer it can be (if you can call any cancer 'minor').  Hope that encourages you!  I know, just the word cancer is enough to cause a major freak-out, isn't it?  Causes other people to freak out, too.  But there are so many different kinds of bladder cancer, stages, grades... keep the faith, and we all take it one check-up at a time...   ", "date": "2006-06-01T12:29:47+00:00", "topic": "just found bladder tumor/biopsy on Mon.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKimberly, I have had two recurrences of tumor (TaG1) since my initial TURB in Dec. 2005.  I had no recurrence for one year, and felt ecstatic at each cysto.  Then, the first time I saw that little bitty stalk of cancer on the screen (and had it biopsied and burnt off right then, owww), I went out to my car and LOST IT.  Cried so hard I couldn't drive.  I'd been coming here, knew this could happen, but I freaked.  I didn't think \"OMG I'm going to die\"... I just freaked thinking \"I have cancer AGAIN\".  So, BCG again, more clear cysto's, and then  a second recurrence 18 months ago.. this time, I didn't cry.  I hate to say this, but you get USED to it.  Ha, try and get people to understand that you get USED to hearing \"uh-oh, here we go again\", as a doctor is viewing the inside of one of your major organs!  I hope you do not have that first recurrence with all my heart.. but if you do, your feelings will be normal, go ahead and freak out a bit  and come back here and vent to all these wonderful people who know exactly what you are feeling!  Note:  I guess there really is no \"normal\" way to feel when you have cancer - it is what it is, but knowing you are not ALONE is very important; and allowing yourself your freak-out moments without feeling \"abnormal\" is important, too!\n\nBe strong, remain fearless!\nLauren\t\t\t", "date": "2011-03-02T15:58:21+00:00", "topic": "3-month cysto was clear--why am I Debbie Downer?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKimberly, I have had two recurrences of tumor (TaG1) since my initial TURB in Dec. 2005.  I had no recurrence for one year, and felt ecstatic at each cysto.  Then, the first time I saw that little bitty stalk of cancer on the screen (and had it biopsied and burnt off right then, owww), I went out to my car and LOST IT.  Cried so hard I couldn't drive.  I'd been coming here, knew this could happen, but I freaked.  I didn't think \"OMG I'm going to die\"... I just freaked thinking \"I have cancer AGAIN\".  So, BCG again, more clear cysto's, and then  a second recurrence 18 months ago.. this time, I didn't cry.  I hate to say this, but you get USED to it.  Ha, try and get people to understand that you get USED to hearing \"uh-oh, here we go again\", as a doctor is viewing the inside of one of your major organs!  I hope you do not have that first recurrence with all my heart.. but if you do, your feelings will be normal, go ahead and freak out a bit  and come back here and vent to all these wonderful people who know exactly what you are feeling!  Note:  I guess there really is no \"normal\" way to feel when you have cancer - it is what it is, but knowing you are not ALONE is very important; and allowing yourself your freak-out moments without feeling \"abnormal\" is important, too!\n\nBe strong, remain fearless!\nLauren\t\t\t", "date": "2011-03-02T15:58:21+00:00", "topic": "3-month cysto was clear--why am I Debbie Downer?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\n\nActually I don't feel anything wrong with my bladder once the BCG effects pass (which are still here today, 24 hours later, which is not normal for me)... it is very easy for me to forget I have had three recurrences of bladder cancer completely, until the next time I have to pee in a cup, get invaded by a scope, or entertain toxic substances internally!!  And for this, I am grateful, that I can focus on doing things to prevent cancer like avoiding some things, eating other things, and keeping a very positive attitude.\n\nI will very kindly say that perhaps your thoughts about cancer in general could be causing you to feel weird sensations in your bladder between treatments.  I went through that weirded-out phase after the original large tumor was removed from my bladder.  I wondered how something could grow in me for so  long, and I never knew it.... I thought too much about cancer being so silent, was it growing again, was it changing into something more deadly, etc...  there's no way to tell someone how to chase those thoughts away, I'm afraid.  But if you can, then you just go from day to day trusting in God and your doctor to keep the monster at bay.\n\nBe strong, remain fearless!\nLauren\t\t\t", "date": "2010-12-03T03:52:41+00:00", "topic": "side effects of BCG treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\n\nActually I don't feel anything wrong with my bladder once the BCG effects pass (which are still here today, 24 hours later, which is not normal for me)... it is very easy for me to forget I have had three recurrences of bladder cancer completely, until the next time I have to pee in a cup, get invaded by a scope, or entertain toxic substances internally!!  And for this, I am grateful, that I can focus on doing things to prevent cancer like avoiding some things, eating other things, and keeping a very positive attitude.\n\nI will very kindly say that perhaps your thoughts about cancer in general could be causing you to feel weird sensations in your bladder between treatments.  I went through that weirded-out phase after the original large tumor was removed from my bladder.  I wondered how something could grow in me for so  long, and I never knew it.... I thought too much about cancer being so silent, was it growing again, was it changing into something more deadly, etc...  there's no way to tell someone how to chase those thoughts away, I'm afraid.  But if you can, then you just go from day to day trusting in God and your doctor to keep the monster at bay.\n\nBe strong, remain fearless!\nLauren\t\t\t", "date": "2010-12-03T03:52:41+00:00", "topic": "side effects of BCG treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood God, how many 52 year  old women have bladder cancer??   I'm another one, completing my 14th BCG tomorrow.  I think it's passing the blood clots and the spasms after voiding that hurts the most, and I am just now starting to notice fatigue.  But since it seems to feel like your bladder want to fall right out of your pelvic floor, I find it best to lie down and NOT work on the day of my treatments!  Spoil yourself.  You are doing the best known preventive measure for bladder cancer, so lie down, drink water, green tea, rent some good movies, cover up with your favorite afghan, and in between bouts of peeing/screaming in the loo, take care of yourself!\t\t\t", "date": "2010-12-03T03:52:41+00:00", "topic": "side effects of BCG treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am having my 14th BCG tomorrow, been clean for 16 months only.  They are getting worse, so the dose has been cut in half, but it's still a bear for 6-8 hours after the initial void.  I am now taking ProSed, which only helps a little with the spasms... I used to work from home on these days, but anymore, it is much better to curl up on the bed with the dogs and watch movies, while jumping up every 10 minutes to pee blood and cry.  Fun, huh?  You are all right about how it's better than most cancer chemotherapies in the long run.  At least I know I'm going to feel much better by the 2nd day, and when the heck do I get a chance to take a WHOLE day off to lay on the bed and watch movies with the dogs??  Be strong, remain fearless!  ", "date": "2011-01-06T17:43:43+00:00", "topic": "New protocol for maintenance BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am having my 14th BCG tomorrow, been clean for 16 months only.  They are getting worse, so the dose has been cut in half, but it's still a bear for 6-8 hours after the initial void.  I am now taking ProSed, which only helps a little with the spasms... I used to work from home on these days, but anymore, it is much better to curl up on the bed with the dogs and watch movies, while jumping up every 10 minutes to pee blood and cry.  Fun, huh?  You are all right about how it's better than most cancer chemotherapies in the long run.  At least I know I'm going to feel much better by the 2nd day, and when the heck do I get a chance to take a WHOLE day off to lay on the bed and watch movies with the dogs??  Be strong, remain fearless!  ", "date": "2011-01-06T17:43:43+00:00", "topic": "New protocol for maintenance BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you, all.  #12 is done; and we did cut the dose to 50%, and I got some samples of Prosed.  OK, I don't think the Prosed worked, other than to turn my pee blue for 3 days now.  When I also passing blood, well, if you are familiar with the color wheel, it was pretty spectacular!  Jim, I think I donated most of my bladder lining to the sewer system this time, too.  I was glad I took the day off, as I usually try to work from home on BCG days - well not anymore.  I deserve to lay on the bed curled up with my dog and watch HGTV all day, right?\n\nI have not stopped to think too hard about the next round; you live one day at a time, and I don't like thinking about this disease between poke and peeks - so I just don't  .  But my life is laid out in 3 month increments right now, as is many of yours.  And I did figure that if I have to start again 6 weeks after the poke and peek, I will be peeing blood FOR CHRISTMAS.... auugh.  Perhaps I'll ask to wait till the new year, and start it off with a bang (heavy sarcasm intended) \n\nGood luck to everyone going through this.\n\nLauren\t\t\t", "date": "2010-08-12T18:32:12+00:00", "topic": "Just plain sick of it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe nurse said she'd get the dosage diluted for this week's treatment - yes!!!!  I cannot picture getting on a plane six 7 hours later after peeing out pieces of my bladder all afternoon...hopefully, it will only be half as bad.\t\t\t", "date": "2010-03-09T18:46:18+00:00", "topic": "For Pain?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe nurse said she'd get the dosage diluted for this week's treatment - yes!!!!  I cannot picture getting on a plane six 7 hours later after peeing out pieces of my bladder all afternoon...hopefully, it will only be half as bad.\t\t\t", "date": "2010-03-09T18:46:18+00:00", "topic": "For Pain?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just had my 7th treatment (the first of 3 maintenance ones this month), and boy did my bladder remember them!! I peed blood and had spasms for six hours....after that, I'm pretty OK except that I had muscle cramps all night while trying to sleep, and I think it's because I was very tense for those six hours.  I'm going to see if I can get a muscle relaxer next week.  OH - I went out to my car and turned on the seat cover and seat back heaters for awhile  they acted like a heating pad while the cramping was happening!\n\nMy doctor seems to think that if you DON'T have side effects, then it probably ain't workin'.... I'm gonnna go with that for now!  Hang in there.\n\nLauren\t\t\t", "date": "2010-02-25T22:44:16+00:00", "topic": "First BCG Yesterday", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just had my 7th treatment (the first of 3 maintenance ones this month), and boy did my bladder remember them!! I peed blood and had spasms for six hours....after that, I'm pretty OK except that I had muscle cramps all night while trying to sleep, and I think it's because I was very tense for those six hours.  I'm going to see if I can get a muscle relaxer next week.  OH - I went out to my car and turned on the seat cover and seat back heaters for awhile  they acted like a heating pad while the cramping was happening!\n\nMy doctor seems to think that if you DON'T have side effects, then it probably ain't workin'.... I'm gonnna go with that for now!  Hang in there.\n\nLauren\t\t\t", "date": "2010-02-25T22:44:16+00:00", "topic": "First BCG Yesterday", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCan I still have my BCG treatment?  I thought this was allergies, but today it is definitely a cold.  My 2nd BCG was last Friday; 3rd is scheduled for this Friday....\t\t\t", "date": "2009-10-13T13:57:06+00:00", "topic": "If i have a cold...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI haven't been on this board for a long time, because I only had one recurrence since my initial diagnosis in '05.  It was removed in my urologist's office.  Last Thursday, he found two more tumors, which he also removed in the office and sent for biopsy.  He is confident they are TaG1 again.  So now I start BCG in six weeks, after I heal.  I'm very glad he does not send me to the hospital for TURB every time - he can accomplish the same thing in 5 minutes in his office, even if I have to be awake and can really feel him snip those suckers off (OUCH).  He inserts a local anesthetic, but it doesn't work very well way up inside the bladder.  Still, 5 minutes of snipping is better than the whole day off, vomiting for hours from general anesthetic (I don't tolerate it well), and the whole scary atmosphere of pre-op, etc.\n\nI scheduled my six BCG appointments for Friday mornings.  I sure hope I'm feeling good enough for everything I have planned for my October weekends.  Wish me luck.\n\nDo most of you have mitomycin along with BCG?  I don't think he's going to do that, if they are still TaG1.\t\t\t", "date": "2009-08-18T20:44:35+00:00", "topic": "How many..........?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnn, those were the exact words my uro used!  \"if I was to have any kind of cancer, this is the one I'd choose.\"   So I lucked into a \"nuisance cancer\"?  Go figure!  I still feel odd, being the only woman in his waiting room, with a whole lotta older men with prostate issues!\n\nI know I will face another recurrence much easier... that first one was really an eye-opener, though. One of my biggest concerns is I'd like to change jobs in a couple of years; find a place where I can get good insurance coverage and also start my own business (I train dogs).  But this is one helluva pre-existing condition, and, being a nuisance cancer, it's going to be a nuisance for the rest of my life.\n\nI can't give blood anymore (gotta be 5 yrs cancer free, and that's not looking likely;) ) - and I swear that the scar tissue in my bladder is making it less expandable, as I have to pee so often.  More nuisance!\n\nBut I still have my organs, I'm not sick, and I thank God every day for my good health, no matter how much of a nuisance it is!\n\nLauren\t\t\t", "date": "2008-07-16T13:15:33+00:00", "topic": "Recur after 2 years \\&amp;quot;all clear\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNo, I didn't have anything during the intial TURB, nor this time...\n\nSo, now I'll start a new subject:  If it were you, and you had a second recurrence, and your doctor was a urologist, a board-certified surgeon, but not an oncologist, would you rather have your BCG/chemo treatments from an oncologist, or would you stay with the urologist?  You have no reasons for leaving the urologist, you are happy with your care, but would you feel better moving forward in the Bladder Cancer Odyssey with an oncologist instead?  (tumors are TaG1)..\n\nYour opinions??\t\t\t", "date": "2008-02-15T21:49:14+00:00", "topic": "It's back....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGoing for my six month \"poke and peek\" on Thursday; I was diagnosed TaG1 in Dec '05, and have had no recurrences, either.  I almost never think about it in between checks, but during the week before the cystoscopy, that's the time I have bizarre dreams and trouble sleeping.. guess I save it all up for that week! .\n\nHope to get the same results as y'all on Thursday; then I'll go celebrate with dinner with my Valentine (my mother, as I just broke up with the boyfriend, and Mom is actually more fun!).   \n\nLauren\t\t\t", "date": "2008-02-08T23:50:19+00:00", "topic": "THANKS FOR BEING HERE ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhen he called me the day after Christmas 2 years ago, and said \"yes, it's cancer\"...his next words were \"if I had to have any kind of cancer, I'd have this one.\"  That made me feel better from the start, actually.  Superficial non-invasive is so treatable, and though my research and time spent on this board has shown me that I may be dealing with it the rest of my life, I consider myself LUCKY.  And I hope that God sees fit to only send one type of cancer my way, in my lifetime.  But I'm still getting my annual Pap, Mammogram, and will start next year on the Big 5-0 with a colon screening...\n\nI only think about it when I pee in a cup every six months for a cytology, and once a year now for my cystoscopy..\n\nLauren\nTaG1, Dec '05\t\t\t", "date": "2007-11-17T15:45:34+00:00", "topic": "New to this", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tConnie,\n\nMy ex was as ignorant as he could be when I became diabetic 8 years ago..I wasn't allowed to MENTION anything about healthy eating, blood sugar, carbs, etc or he would tell me how \"sick he was of hearing about it\".. but in front of people, he swore he'd take care of me no matter what happened... it was all for show.\n\nIn an ironic twist, I was diagnosed with BC (TaG1) just 6 months after he left me for another woman (and, oh dear, her name was Connie. :o.).. so I dealt with my cancer alone, and it was better, all the way around.  I can just imagine how he would have dealt with that!\n\nRemember, your strength comes from inside of you.. and support can come from many places.  I am dating again, and I tell a man after a few dates... if he's going to skip out, I'd rather he do it sooner than later.  So far, so good...I have to explain alot about the true \"non-invasive\" part of the cancer (which has not returned so far, since the initial diagnosis in Dec. 05)...\n\nBest of luck to you,\nStay Strong, Remain Fearless!\n\nLauren\t\t\t", "date": "2007-10-17T10:12:56+00:00", "topic": "Lost Relationship due to Cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know, but having seen what a blend of 8 herbs (two of which are in essiac tea)have done to fight a virulent condition in my horse (sarcoids), I'm a firm believer in \"old medicine\".  He has had sarcoids for 15 years, but they don't spread - I increase his dosage of herbs if I see a few starting to bump out, but they never break the skin, and then they disappear - and there are so many horror stories of sarcoids blossoming all over horses, bleeding and interfering with breathing, hearing, voiding, etc.  We tried chemo (cisplatin), and they got worse, till I tried the herbal mixture.  Makes his grain smell like an Italian meal, actually, but he likes them! \n\nSo I put my faith in the properties of certain herbs, and maybe they are working for me, too.  In any case, something is working - fate, the power of prayer, hope - and maybe burdock root and slippery elm bark!   \n\nLauren\t\t\t", "date": "2007-09-12T20:59:35+00:00", "topic": "Clear check up! &amp;amp;amp; ssiac supplement", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWoo Hoo ;D  Cytology was clear again, so I can wait till the annual poke and peek in February!\n\nI wanted to mention that I found an organic supplement that has the same 4 ingredients as Essiac tea, and I'm taking it in pill form (can't stand bad-tasting tea..)  If anyone is interested, I'll go home and read the manufacturer and let you know.  A nutritionist that my sister works for recommended it.  AND my sister is giving it to her dog, who has osteosarcoma, just to keep her a little healthier till the end (she has mets to the lungs already).  Maybe that is part of my success in keeping the beast from returning since it's first appearance in Dec '05 (TaG1)...\n\nI wish the same good checkups to ALL of you.\n\nLauren\n\n", "date": "2007-09-12T20:59:35+00:00", "topic": "Clear check up! &amp;amp;amp; ssiac supplement", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary, you are toooooo funny!  ;D How many times does that happen to all of us - pink fuzz or some other matter causing us alarm??.. Always we are looking in the toilet, ever since our diagnoses!!!  I never had to have BCG treatments, but I still look, every time...I don't think the general non-BC population would understand, but you just made me laugh.\n\nI hope your discomfort is done for this week - have a great weekend!\n\nLauren\nTaG1\n12/05\t\t\t", "date": "2007-04-25T19:29:54+00:00", "topic": "Silly BCG Question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSimon, i saw pictures of my insides after a major surgery to remove tumors on the outside of my uterus (benign).. they did a laparoscopy 10 days later, and it looked like a haunted house, there were so many little cobwebs!  My surgeon told me it was all scar tissue, and it was growing very fast... nothing to worry about unless it causes adhesions later in my life.\n\nDuring my first poke and peek after I had a very large TaG1 tumor removed from my bladder, there it was again - inside my bladder this time!  This doctor also remarked that I had alot of scar tissue, and he remarked that it would only be a problem if I had to have repeated TURBS for the rest of my life (I'm only 48), or if it grew over the ureter opening; then they'd have to cut it out.  Fortunately, I haven't had a recurrence of the BC in the first 15 months.\n\nSo I hope your cobwebs are just scar tissue, too   Best of luck to you.  Stay strong, remain fearless!\n\nLauren\t\t\t", "date": "2007-03-23T06:17:48+00:00", "topic": "Been a while...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't know much about my doctor; but when i was laying outside the operating room last year, the OR nurse told me that she had a kidney problem and let the same doctor operate on her; I figured that was a good endorsement!\n\nI thought I would be on a six month regimen for quite awhile;  seems from the answers here that it varies by doctor, and perhaps by the doctor's feelings about what he's seen, and pathology reports.  I have copies of my pathology report if I feel like getting another opinion, but i think I will just continue to pray and behave and eat my broccoli, and drink my green tea, and take my Oncovite, and hope for the best. 8-)\t\t\t", "date": "2007-02-15T15:56:20+00:00", "topic": "Annual scope?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, I had my second clear poke and peek yesterday, and now my urologist says we can go to annual scopes, with cytology every six months.  My original tumor, while large, was TaG1...\n\nI watched the monitor, and saw a very smooth bladder wall, other than the area of scar tissue...\n\nDo you think I should question this, or go with it?  I sure won't mind not having a scope again for a year - it always hurts to pee for a week afterwards - but I'm looking for opinions...\n\nLauren\t\t\t", "date": "2007-02-15T15:56:20+00:00", "topic": "Annual scope?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy first follow-up cysto was with a rigid scope... maybe I had enough local anesthetic, cuz it wasn't too bad.  What hurt was afterwards, when it wore off - no spasms, just hurt to pee again, maybe from bumping the inside of the bladder with it.    My next one is on the 14th - hope I never have those spasms! :-X  My doc also said that rigid gave better results...\n\nLauren\t\t\t", "date": "2007-01-30T20:57:02+00:00", "topic": "Just Had Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've only had one check since my diagnosis last year and it was with a rigid scope.. i have to say i was so fascinated watching what was on the screen that I didn't feel that much - he used some good numbing gel I guess!  But yes, it did hurt to pee for a week afterwards...  :-[\t\t\t", "date": "2006-11-17T07:18:28+00:00", "topic": "Question about cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlthough I've only been diagnosed  last year (TaG1), I was inspired by recent posts to try my hand at a little more humor, put into verse.  Nods to Greg, the witty Brit, for the wine references..and Bubbles, et al for the other visuals....\n\nOh billowy waves of leafy coral\nAnd delicate gills of fishes;\nTall sturdy stalky of pale brocolli\n- all here against our wishes!\n\nDear doctor, tell me, can you see\nan end to all of this for me?\nI tire of gel and scopes and tubes\nand Burgundy, Claret and Rose hues...\n\nSomeday, can I pee without turning about\nand fervently hoping that what has come out\nNo  longer resembles a fine Cabernet\nBut more like a faded and dry Chardonnay?\n\n ", "date": "2006-11-16T22:15:03+00:00", "topic": "A little more humor...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlyssa,\n\nit helps to take all the positive steps you can to keep healthy - I bought books on what to eat if you have cancer, what to avoid eating, what supplements were good, etc.  I decided if there's any way I can convince myself that I have CONTROL over my future health status, then that's the area I should focus on.\n\nAnd I also thank God every night that I had another healthy day.\n\nDon't just sit and let it take over your mind - you take control of IT, and you will feel much better every day.\n\nLauren\t\t\t", "date": "2006-09-13T15:00:10+00:00", "topic": "Whats This?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just had my first 6 mo. cysto since having  a huge TaG1 tumor removed in Dec.  And it was clear!  Only one problem.. more scar tissue than normal. I should have known this.... I had 4 surgeries for infertility in the past, and scar tissue finally contributed to my permanent infertility.  Anyway, it's getting close to the right ureter opening, so its another thing to keep an eye on.\n\nNext check-up, 6 months.  I'm pretty happy right now, even if it DOES hurt to pee!\t\t\t", "date": "2006-08-15T00:31:20+00:00", "topic": "1st follow-up is clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter my first TURB (12/05), I had minimal bleeding, but it sure hurt to pee for at least 2 weeks  :-X, and there was still some pain for a month...  my doctor said it was because he did do a deep biopsy, since it was obvious the tumor had been there for a long time, it was so large. Imagine an open wound trying to heal in that atmosphere... gives me the chills remembering!  My dogs, who like to visit with me while I'm in the bathroom  ;D did NOT like me for the first 2 weeks, as for some reason, it felt much better to just YELL when I peed (if no one else was around)!\n\nMy first six month checkup is today; and I'm nervous!  I read it all too, and know that most of the time, there is no worrying about Ta Grade 0-1 turning invasive; but you CAN have 2 different kinds of cancer, so I am always going to worry every six months.  In the meantime, read all you can find here, follow recommendations on eliminating some things from your diet, etc.  And keep the faith!\t\t\t", "date": "2006-06-22T04:15:30+00:00", "topic": "recent superficial bladder ca removal", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Amy,\n\nMost of us with this type of cancer feel that way... we go a long time being told we have an infection etc, since the tests to check for cancer are so expensive and we don't fit the profile.  Being female and 47, my doctor didn't suspect cancer the first time I had lots of blood, but I had it again 18  months later, and feel very lucky that she referred me to a urologist at that time, and he scheduled me for an immediate MRI and a cysto/TURB the next week. I had a very large tumor, but it was Ta, Grade 0 - and I am going for my six month follow-up next week.   I guess if you are a male and over 60 and pee blood, they figure you for cancer first thing.  But not for younger females.  Especially as young as you.\n\nI was also assured that this type of cancer would not have metastasized into the blood; yet I can't help but wonder what is going on in my bladder for the last six months - did it grow back?  80% of the time, it does.  Is it still non-invasive and low-grade?  Sure hope so.\n\nThere is woman on this board who talks of 16 years and 37 TURBs... wow.  Not something to look forward to, but she's alive, she hasn't lost her bladder, and she has a great outlook.  Even my urologist said that if he was ever diagnosed with cancer, he would choose what we have over all other types.  Hope you feel a little bit better, reading the stories on this board. 8-)\t\t\t", "date": "2006-05-24T19:48:39+00:00", "topic": "diagnostic tests", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi, I've been Type 2 diabetic for 12 years, and had 3 instances of noninvasive bladder cancer in the last 5 years.  My only problem is that the BCG treatments are painful for me, so the stress on those days raises my blood sugar for the day...Otherwise, no problems.\t\t\t", "date": "2011-02-01T21:44:24+00:00", "topic": "Bladder Cancer and T2 Diabetes", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello,\n\nWhy did it take six weeks to recover from the tumor surgery?  Hopefully, that will not happen again.  I had a TURB and biopsy on Dec 20th, and I went back to work on Dec. 26th, just because I had 2 days off at Christmas... My tumor filled up most of my bladder, but was fortunately Ta, Grade0... I had the CT before the surgery. Now I just wait six months and have another cystoscopy, and pray it hasn't recurred. I am still in shock over all of it (I am 47 yr old female, non-smoker)...and am now a high-fiber, brocolli-eating, no-diet-soda, healthy food diabetic - tell me that isn't hard!!  Hey, perhaps now that we have cancer, we'll live LONGER because we gave up other unhealthy things... at least it helps me to look at it that way.\n\nI did have pain when I peed for a month after the surgery, but they said I was just slow to heal, since the biopsy went pretty deep.  A warm wet atmosphere is not conducive to fast healing!\n\nI hope your long recovery was a one-time thing, and from now on, you will only need a day or 2 off.  Best of luck to you!\n\nLauren\t\t\t", "date": "2006-03-10T13:16:28+00:00", "topic": "UPDATE", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tOh Bill, so sorry!  But I think you need to look for a Uro in the NEXT town.  You need to trust that your health care providers will be there for you when you need them, not three days later when they decide to return messages.  I think it would make the whole experience more tolerable.  Best of luck to you.  (I have my 2nd BCG treatment tomorrow, and had much better luck than you with it)...\n\nLauren\t\t\t", "date": "2009-10-08T01:08:07+00:00", "topic": "May stop all BCG\\'s.", "subforum": "6-men-and-bladder-cancer"}]}