{"signature": ["BCG", "BCG"], "posts": [{"text": "\n\t\t\t\tCongratulations!!!  That's great news - non invasive, low-grade is the best diagnosis that you could ask for!\n\nAs far as getting a second opinion, just let your urologist know that you want your slides sent for a second opinion.  I had mine sent to Johns Hopkins.  You can fill out the paperwork and give it to your urologist.  I know I felt a lot better knowing that Johns Hopkins agreed with the diagnosis I received from my local hospital.  A proper diagnosis helps to ensure the correct treatment path.\n\nHere's a link to Johns Hopkins site, where you can get more information and download the forms.\npathology.jhu.edu/department/services/secondopinion.cfm\n\nTake care,\nLilliang\t\t\t", "date": "2017-09-09T03:11:21+00:00", "topic": "Urologist Diagnosed me with Bladder Cancer Today - 29 Year Old Male", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome, and I'm sorry that you are joining our little club.  The first thing that you need to do is breathe.  Try to relax. We've all been where you are, and we know that it's overwhelming.  There's not much that you can do until you get the pathology report from the turbt.   I'd recommend that you have your urologist send your slides off for a second opinion.  I had mine sent to Johns Hopkins.  Most insurance companies will cover the cost for the second opinion, but if not - the cost is only $250, and well worth the peace of mind.\n\nPlease keep us posted.\n\nTake care of you,\nLilliang\t\t\t", "date": "2017-09-09T03:11:21+00:00", "topic": "Urologist Diagnosed me with Bladder Cancer Today - 29 Year Old Male", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Henriz,  so glad to read that you are doing well.  I have no experience with neo bladders etc, as my treatments have been successful and I still have my own bladder.  I imagine that some other folks will jump in with input and opinions based on their own procedures and experiences.\n\nTake care,\nLillianG\t\t\t", "date": "2015-10-02T23:07:09+00:00", "topic": "Just Received the basic news", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tStaying positive is the best thing you can do for yourself. You and I have the same basic diagnosis, and I'm still here with no reoccurrences 2.25 years later.  Don't let the negative folks bring you down \n\nTake care of you,\nLilliang\t\t\t", "date": "2017-07-25T13:42:57+00:00", "topic": "Non-invasive, aggressive stage 0", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust letting you know that I'm thinking of you and hoping that your biopsy goes well, and they find NED \n\nTake care of you,\nLillianG\t\t\t", "date": "2016-12-20T15:25:47+00:00", "topic": "Urine culture showing suspicious cells", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNo, I never had a stiff neck or headache.  My symptoms were mainly flu-like symptoms:  chills, very low-grade fever (99-100), aches, and fatigue.  I also had bladder spasms  and some joint pain (reactive arthritis).\n\nAll of the symptoms except the joint pain subsided within 24 hours or so.\n\nTake care,\nLillianG\t\t\t", "date": "2016-09-29T03:14:52+00:00", "topic": "BCG side effects", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJay, yes you are reading that correctly.  I am just now moving to maintenance treatments every 6 months.  If all stays clear, I will have maintenance is Jan 2017, July 2017, and Jan 2018.\nTake care\nLillianG\t\t\t", "date": "2016-08-07T19:17:50+00:00", "topic": "Newly Diagnosed, just after prostate cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBCG seems to affect everybody differently \n\nI had most of my discomfort and side effects with treatment 3 of my initial 6, and with my first set of 3 maintenance treatments. With each BCG treatment, I had a variety of side effects (flu-ish, urgency, etc) for the first 12-24 hours after each treatment, but most of the issues subsided within the 12-24 hours.  I also have had some joint pains since my first set of maintenance treatments, but luckily the pains/discomfort did not get any worse with my second set of maintenance treatments. For my second set of maintenance treatments, I was more proactive.  I took some Advil before I went for the treatment, and I took AZO about 30 minutes before I voided the BCG.  I also started drinking my water about 20 minutes before my first void, so that the BCG was diluted some when my 2 hour hold time was up.  That seemed to work for me.  I still had some feelings of urgency and 'peeing razor blades' for a few hours, but it wasn't any where near as bad as it was for my first set of 3 maintenance treatments.  So far, all of my treatments have been at full strength.\n\nTake care and keep us posted,\nLillianG\t\t\t", "date": "2016-08-12T00:11:59+00:00", "topic": "BCG reactions...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJay, so sorry you are going through all of this.  I agree with Alan - you need a second opinion for your peace of mind and also to be sure that nothing was missed.  If I were you, I'd seek a second opinion at an NCI hospital that specializes in bladder and urinary tract issues.\n\nYou can use the Treatment Center Finder located beneath the Help link at the top of this page to locate an NCI facility near you - or let us know where you are located, and someone on this site might have a suggestion of a great place or doctor in your area.\n\nI hope all goes well for you,\n\nLillianG\t\t\t", "date": "2016-07-04T15:02:41+00:00", "topic": "POS FISH, NEG CYTOLOGY, NEG CYSTO (TCC Kidney?)", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI can relate to \"Swearing off Google Searches\".  Much of what I found in cyber space was very outdated, and many of the studies and statistics were tainted because they included a mixture of folks who did and didn't follow the gold-standard of treatment and had or didn't have regular scopes.\n\nWith regards to urgency after a TURBT - I know I had to go more frequently than usual, but I don't remember that lasting for more than a few days.  I do have an issue with capacity/urgency when I'm having my BCG treatments, but it only lasts for a few days, at most.  Everybody seems to react differently to the TURBTs and the treatments. Each person's experience is unique, but we all seem to have some common side effects.\n\nI found that reading helped me keep my mind occupied while I waited for my pathology.  A good racy novel might help keep your mind off occupied \n\nHang in there.\nLillianG\t\t\t", "date": "2016-07-23T01:21:04+00:00", "topic": "Swearing OFF Google Searches", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm glad that things went well for you, and that you are a little closer to having a solid diagnosis.  Please keep us posted \n\nTake care,\nLillianG\t\t\t", "date": "2016-07-21T03:10:14+00:00", "topic": "TURBT Complete!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPurrcat, no - I did not have a cystoscpe or any cytology done during my initial diagnosis. I had a CT scan, and the tumor showed in the scan.  I was then referred to a urologist, and he scheduled me for a TURBT, based solely on the CT scan.\n\nI have had cytology done after each follow-up cystoscope.  So far, I've been lucky and they've all come back Negative.\n\nI'm sorry to read that your TURBT was postponed.  I know that just adds to your stress, but hopefully it will be over by the time you read this reply.  After the TURBT, you get to wait about a week or so for the pathology results, and then you'll know exactly what you're dealing with.\n\nPlease get some rest, no lifing more than 10 lb, and keep us posted.\n\nTake Care,\nLillianG   ", "date": "2016-07-16T00:24:23+00:00", "topic": "Unknown Lesion...Terrified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSara, I have to agree - the waiting was the hardest part for me too. Try to keep your mind busy - maybe watch a bunch of movies with the kids, go to the park, etc.  There's nothing you can do until the pathology report is available, and worrying is not productive.\n\nTake care,\nLillianG\t\t\t", "date": "2016-07-08T21:47:03+00:00", "topic": "need advice - pathologist needs second opinion", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSara, I'm sorry that you are here with us, but I'm glad that you found this forum.  After my local pathologist provided her pathology report, I had my doctor send my slides to Johns Hopkins for a second opinion.\n\nIt's always good to have a second opinion to help ensure that the tumor is staged and graded correctly. Hopefully, Johns Hopkins diagnosis will agree with the local pathology report and then your doctor can give you a treatment plan.  The treatment plan will depend on the grade and stage of the tumor, so it's very wise to make sure that the diagnosis is correct.\n\nKeep us posted and feel free to ask questions.  There's a lot of first-hand knowledge available at this site.\n\nTake care of you and try to relax a little.  I know from experience that it's much easier said than done \n\nLillianG\t\t\t", "date": "2016-07-08T21:47:03+00:00", "topic": "need advice - pathologist needs second opinion", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm glad it was just the AZO   My pathology results took about a week and a half to appear in my online folder/portal.  Once the report was posted, I was able to read it, do some research, and have my questions all ready for my follow-up doctor's visit.\n\nYou might want to check with your doctor's office or the hospital where you had the TURBT done to find out if there is a web site where you can sign up for access to your medical records and reports.\n\nTake care and keep us posted,\nLillianG\t\t\t", "date": "2016-07-06T01:21:20+00:00", "topic": "Neon Orange Pee after TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi - I'm glad your TURBT went well.  Are you taking any kind of urinary pain medication, such as AZO?  If so, AZO will turn your urine bright orange.  Or perhaps what you are see is a little blood in the urine, which is also common for a few days after a TURBT.\n\nTake care,\nLillianG\t\t\t", "date": "2016-07-06T01:21:20+00:00", "topic": "Neon Orange Pee after TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm so sorry that you are having this issue.  I have not heard of anyone getting blisters in their bladder.\n\nOne thing that seems to soothe my bladder after my BCG treatments is warm green tea.\nI buy the powdered green Matcha tea (mix it with hot water) and drink a few cups every day.  I've had only 9 BCG treatments, so the inside of my bladder still looks good.\n\nI hope this helps\nLillianG\t\t\t", "date": "2016-06-20T08:09:36+00:00", "topic": "BCG Treatment and chronic inflammation (blisters)", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDave, sorry you are here, but welcome to our world.  I was reading your thread, and decided to share my two cents about BCG and BCG Maintenance.  I had my 6 Induction treatments back in Sep-Oct 2015, and I just finished up my first set of 3 Maintenance treatments this past week, so the 'experience' is still very fresh in my mind.\n\nFor me, I didn't have anything more than slight discomfort (chills, low-grade fever, and urgency) for the first 3 induction treatments. Side effects for treatments 4 and 5 were fairly intense (bladder spasms, excreted tissue/blood fatigue), and then  treatment 6 was no big deal.\n\nThree months after the 6 induction treatments, I had my first cystoscope and cytology work (all was clear). My doctor decided to wait three more months and until after my second all clear cystoscope & cytology to start my 3 Maintenance treatments.  The 3  Maintenance treatments were at full dosage, and the side effects were a bit more intense than my #4 & 5 induction treatments, but very doable.  My treatments are usually at 11 AM, and aside from fatigue, all of the other side effects from the treatments were gone within about 12 hours. From what I've read over the past 11 months on this forum and the Inspire forum, it seems like each person handles BCG treatments differently, some seem to tolerate it better than others.\n\nWishing you the best,\nLilyG\t\t\t", "date": "2016-04-15T13:45:13+00:00", "topic": "Just had first TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI also had a large tumor removed May 28 2015.  Mine was high-grade, so they did a second TURB on July 9 to verify that they got it all, and that they staged it correctly as non-invasive. I also had my slides sent to Johns Hopkins for a second opinion and concurrence on the pathology.  My 6 induction BCG treatments started August 27 and ended September 30th.  My followup with my 3-month cystoscope was December 3rd. All looked good and the lab results from the wash came back with no evidence of cancer.  I've received no maintenance treatments (yet), but I do expect to discuss the treatment path with my doctor when I have my second cystoscope next week.\n\nI hope this helps,\nLilyG\t\t\t", "date": "2016-03-02T05:57:00+00:00", "topic": "Time from diagnosis to initial treatments?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJosh, I had my doctor send my slides from both of my TURBs to Johns Hopkins.  My insurance covered the cost for the second opinion.  JH charges $250, but there's a good chance that your medical insurance will cover it.\n\nLilyG\t\t\t", "date": "2016-01-31T12:16:45+00:00", "topic": "first turbt", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI've been taking Oncovite since June 2015 and have had no adverse side effects.  I buy it through Amazon and pay about $25 for a bottle of 100.  I take one a day, so a bottle  lasts more than 3 months and cost is about $.30 per day.\n\nI don't know if it helps, but it apparently doesn't hurt.  I had my first cysto in Dec after my 6 induction BCG treatments and there was no evidence of disease (NED), and the bladder lining looked pretty healthy (I watched). I go back in March for my second cysto and I'm keeping my fingers crossed that the lining will still look healthy and there's NED.\t\t\t", "date": "2016-02-20T05:27:42+00:00", "topic": "Oncovite Experience", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm in complete agreement with Sara Ann and Alan on this one.  Please get a second opinion. May is an awful long time to wait with a high-grade diagnosis, especially with no treatment.\n\nYou can have your doctor send your slides to John Hopkins for a second opinion on the pathology.  Per your post, the path report showed no muscle in the specimens.  In my case, the tumor was deemed high-grade, but there was no muscle in the initial TURB samples.  So to help ensure an accurate diagnosis, I had a second TURB to obtain a better specimen, and had the slides from both TURBs sent to John Hopkins to verify the pathology. Once I was fully healed from the second TURB, I started my 6 weekly treatments of BCG.\n\nPlease ask your doctor why he/she hasn't scheduled you for a second TURB - and why he/she hasn't scheduled you for BCG treatments.\n\nI wish you the best. Please keep us posted.\nLilyG\t\t\t", "date": "2015-12-31T20:06:48+00:00", "topic": "Introduction", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's a great and informative article. I've been asked several times how and when immunotherapy started, and now I can answer that question.\n\nThanks so much for sharing!\t\t\t", "date": "2015-12-29T01:40:34+00:00", "topic": "Training the Immune System = BCG??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJess, I'm so sorry that you are having these issues.  I know it's scary, because most of us on this site have been where you are now.  The sooner you get checked out and diagnosed, the better you'll feel.\n\nI found this forum back in May when I was first diagnosed.  The knowledge and support of the members here are both invaluable.\n\nMy symptoms were very visible blood in my urine, some minor urgency when my bladder was full, and a need to really push to totally empty my bladder.  After I was diagnosed with bladder cancer and the tumor was removed, the blood in my urine and the urgency went away, and I no longer struggled to fully empty my bladder. Your symptoms are similar to mine with the exception of pain - I had no physical discomfort; however, just because our symptoms are similar, it does not mean that your diagnosis will be the same as mine.  I strongly urge you to go and get yourself checked out ASAP.  If possible, go to an NCI center that specializes in bladder cancer.\n\nThe waiting, wondering, and feeling lousy is the worst part.\n\nTake care and keep us posted.\nLilyG\t\t\t", "date": "2015-11-02T19:13:32+00:00", "topic": "So many questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI just finished up my first 6 BCG treatments this past Wednesday.  My understanding was that I needed to disinfect the toilet with 2 cups of bleach for 15 minutes after I voided the BCG, and for each subsequent void for 6 hours.  In addition to the bleach in the toilet, I also used Clorox wipes to wipe off the seat etc., and I used warm wet & soapy washcloths to clean up my own 'bits and pieces'.  (The warm wet soapy washcloths were very soothing, and I disinfected them before they went into the washer.)  I also used antibacterial hand wash - and lots of it, followed by moisturizing hand cream.\n\nHere is a link to the insert for the BCG.  It may contain some useful information for you:  www.fda.gov/downloads/BiologicsBloodVaccines/Vaccines/ApprovedProducts/UCM163039.pdf\n\nMy side effects were not too bad, and hopefully yours will be mild as well.\n\nGood luck!\t\t\t", "date": "2015-10-05T02:31:05+00:00", "topic": "BCG Treatment and Family + clinical trials", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJD - So happy to hear that you got good news!\n\nTake care,\nLilyG\t\t\t", "date": "2015-09-19T16:46:48+00:00", "topic": "new to forum..question", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nI was diagnosed with TaG3 BC in mid May.  I think I know how you feel and for what it's worth, I waited until I had the pathology results of my first TURBT before I told my 28 y/o son; then, I waited until I had the pathology report of my second TURBT (was done about 6 weeks after the first) before I told my siblings.\n\nI wanted to have a confirmed diagnosis and an agreed to treatment plan defined before I said anything to my siblings.  I also wanted to be able to answer their questions honestly and intelligently, and to be able to reassure them that they didn't need to worry about me.  It worked out well for me, but they all said \"I wish you told me sooner\".  Despite their wishes, I'm still glad that I waited to tell them because it gave me the time that I needed to personally digest and research my diagnosis.  This way, I was able to share information and statistics with them about the treatment path I was on, and reassure them that for now, I have it under control.\n\nTake care of you and keep us posted,\nLillianG\t\t\t", "date": "2015-09-02T00:10:53+00:00", "topic": "Introductions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's great news.  Congratulations!\n\nDrinking a lot of water and Matcha green tea, and taking some over-the-counter AZO urinary tablets to soothe my irritated bladder seemed to help me throughout my BCG treatments.\t\t\t", "date": "2019-10-06T06:42:53+00:00", "topic": "Just had my cystoscopy after BCG treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations!  That's great news.\n\nThanks for sharing \n\nLillianG\t\t\t", "date": "2017-04-04T02:55:35+00:00", "topic": "Good news again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree 100% with Alan and Sara Ann.  I have the same diagnosis as you have, and you can see at the bottom of this post the path that my doctors have followed for my treatment.  BCG treatments definitely improve our odd.\n\nPlease seek a second opinion for your treatment path.\n\nTake care of you,\nLilliang\t\t\t", "date": "2017-01-21T22:20:11+00:00", "topic": "Just Received Pathology", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations - that's awesome news!\n\nThanks for sharing.\n\nLilyG\t\t\t", "date": "2016-04-14T16:21:00+00:00", "topic": "Euphoria sets in!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's really great news.  I just passed my 6 months all clear checkup, and it gave me a great ending to a really rough year.\n\nI wish you a Happy New Year with continued cancer-free reports/checkups  ", "date": "2015-12-15T21:06:11+00:00", "topic": "Two year cancer free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for sharing your good news. Reading about good results sure helps me keep a positive attitude as I start down a similar path.  I hope I get my first of many 'all clear' reports when I go for my initial cystoscope in early December.\t\t\t", "date": "2015-10-14T22:38:58+00:00", "topic": "Another hopeful update", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPLK, I'm so glad to read that you are doing well. I'm sure that you are relieved to have the surgery behind you.  I hope that you have a smooth and speedy recovery.\t\t\t", "date": "2015-09-08T02:34:04+00:00", "topic": "Potential cystectomy with Indiana Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm so sorry to read about your dad.  I really have nothing of substance to share with you, but I'm sure that others on this forum who have been down your path will provide you with some input. From what I've read, MD Anderson is one of the best hospitals, so hopefully they will be able to lay out a treatment path for your dad.\n\nI wish you and your family the best. Please keep us posted.\t\t\t", "date": "2015-12-31T15:31:01+00:00", "topic": "InvasiveBladder Cancer turned into Secondary Liver", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi momoftwo.  I'm so sorry to read about your dad's situation. I'm no doctor and I don't think anyone on this board will be able to tell you how long you will have with your dad. Hopefully, you will have many, many years.\n\nThe only suggestion that I have for you is to make sure that your dad is being treated by a hospital and team of doctors who have a lot of experience with bladder cancer. If he is already being treated by such a team, then talk to his doctors to find out what they feel is his best treatment path.  If he isn't at an experienced facility, then perhaps you can help him seek a second opinion from another, more-experienced facility.\n\nThere's always hope, so don't give up too quickly.  Please keep us posted on how your dad is doing.\n\nBest wishes to you and your dad.\t\t\t", "date": "2015-12-29T02:27:43+00:00", "topic": "Need advice on dad's bladder cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCatherine, that's awesome and inspiring news.  I hope all your future checkups come back 'clear'.\t\t\t", "date": "2015-10-17T02:43:01+00:00", "topic": "5+ Year Annual Checkup Clear", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's really great news - Congratulations!\n\nThanks for sharing.\n\nLillianG\t\t\t", "date": "2016-05-30T16:21:34+00:00", "topic": "REMISSION", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tPlk, I just want to wish you smooth sailing through your surgery on 10/05, followed by a speedy recovery.\n\nTake care and keep us posted,\nLilyG\t\t\t", "date": "2015-02-11T02:45:16+00:00", "topic": "Radical Cystectomy Options?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tSara Anne, thanks for posting this. It's always nice to read up-to-date treatment and research information.  \n\nLilliang\t\t\t", "date": "2016-07-21T20:36:16+00:00", "topic": "Non-muscle invasive bladder cancer treatment", "subforum": "31-articles-of-interest"}]}