{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\t** This thread discusses the content article: \n\tI hate bladder cancer\n **\n\nHello.  I am new to this site and to bladder cancer.  Was dx. on 2/18/10 with T1, High Grade.  I had TURBT then again 2 weeks later as pathologist thought it may be muscle invasive which it was not  (Thank God).  I start BCG on 4/14.\n\nMy main area of concern is that High Grade cancer has a 50% chance of reoccurance in the bladder or in another organ.  My urologist will be watching my bladder but WHO WILL LOOK OUT FOR MY OTHER ORGANS?  What do you do to ascertain that the other organs are not affected?  I need to know that I am doing all that I can to protect all parts of my body.  Please help.\n\nOn another note, I am so happy that there are finally people I can talk to.  The lack of awareness for bladder cancer is deplorable.  I will do my part to make changes and have an easier journey for others seeking education, treatment and companionship.\n\n\n\n", "date": "2010-08-06T11:33:11+00:00", "topic": "I hate bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAndy, if there wasn't muscle involvement then why would RC be recommended (scenario #2)?  In your 3rd option - muscle involvement - why would RC be probable and not a certainty?\n\nGood Luck to you and I look forward to your thoughts.   LORI\t\t\t", "date": "2010-04-27T00:07:49+00:00", "topic": "Going for 2nd opinion - need your help", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWearing an under wire bra brings about the same security concerns as a terrorist threat.  Before 9/11 I could waltz right thru, then after, I get stopped and patted down.  Not my favorite type of feel up, if you know what I mean.  The dectector has since been set lower so I no longer set off the machine and that makes my life less touch and more go.\t\t\t", "date": "2010-05-22T03:33:53+00:00", "topic": "Airport security", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}]}