{"signature": ["Dx", "TURBT", "TURBT", "BCG", "TURBT", "Surgery"], "posts": [{"text": "\n\t\t\t\tBaubbie2266,\n\nI have to say after 6 months with the Indian pouche I felt better with my choice.  Still odd to look at the stoma  but not terrifying. I hear about the people that chose a neobladder and how at night they are incontinent also how they need to empty so frequently!  I can go 5hrs or more depending on fluid intake. the big seller was the ability to be continent at all times with out a big learning curve.\t\t\t", "date": "2018-12-28T12:50:09+00:00", "topic": "Indiana pouch", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSMIKEY,\n\nYes the j pouche or indiana pouche will work while doing everything you did before,  my stoma is pretty small and the small amount of mucous seals it right up so I've had no leakage thus far. I can hold 700cc of urine before i have to empty it. A dull tummy ache is my signal to catherterize. So far if i watch my nitely water intake I can sleep from 11:00pm till 6am. Starting out is harder since you need to slowly stretch the pouche. Convience and short learning curve are why I chose the j pouche.\t\t\t", "date": "2018-01-19T23:21:02+00:00", "topic": "T4 Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAbsolutely true Sara, because of the possibility of constant catheterization I went with the Indiana pouche!\t\t\t", "date": "2018-01-19T23:21:02+00:00", "topic": "T4 Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAbsolutely true Sara, because of the possibility of constant catheterization I went with the Indiana pouche!\t\t\t", "date": "2018-01-19T23:21:02+00:00", "topic": "T4 Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGKLINE,\npositive for cancer cells  in urine?   hard news to hear, whats the plan? I say get with the Urologist and see what he has to say!\t\t\t", "date": "2017-07-18T18:24:16+00:00", "topic": "The best of times and the worst of times", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTin man,\n\nI'm new here but how did you do?\t\t\t", "date": "2014-06-02T14:21:16+00:00", "topic": "I'm terrified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm keeping a stiff upper lip and will await the biopsy, getting tired of lying on the slab but I've done it before guess I'll do it again!\t\t\t", "date": "2016-12-20T15:25:47+00:00", "topic": "Urine culture showing suspicious cells", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGREATEST CHRISTMAS PRESENT EVER!\n\nJust had my cysto, all clear! I'm hoping for same in MARCH, if so I'll be on maintenance starting then! So relieved I am glad You were all here for me! THANK YOU! and MERRY CHRISTMAS!!! For now this is a great CHRISTMAS PRESENT!\t\t\t", "date": "2016-10-06T18:03:08+00:00", "topic": "Starting chemotherapy GEMCITIBINE", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWill do!\t\t\t", "date": "2016-10-06T18:03:08+00:00", "topic": "Starting chemotherapy GEMCITIBINE", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCONGRATULATIONS!!!!! THAT'S GREAT NEWS!!!!\t\t\t", "date": "2016-10-07T08:36:11+00:00", "topic": "Suspicious symptoms", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDefinitely see a Urologist, My primary Doc thought I had a UTI , I was still concerned went to a Urologist and thats when I was informed it was cancer. You will at least get an answer.\t\t\t", "date": "2016-10-07T08:36:11+00:00", "topic": "Suspicious symptoms", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHope you had a nice Christmas!\t\t\t", "date": "2015-10-12T10:30:52+00:00", "topic": "cystscopy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI know its hard not to think about but try,keep doing what you normally do it helps! Remember. You are not alone we are all here!\t\t\t", "date": "2015-10-12T10:30:52+00:00", "topic": "cystscopy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tStill have to do maintenance. BCG!\t\t\t", "date": "2007-12-29T15:44:49+00:00", "topic": "Pain after cystoscopy....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey dnile,\n\nIn february i was cleard of bladder cancer, i had 6 BCG treatments, here it is almost april still stinging at end of urine stream and bladder spasms. I see my urologist in a few weeks maybe sooner. I guess what i'm getting at is recovery may take longer in some and this can reoccurr.\nGotta stay vigilant !\t\t\t", "date": "2007-12-29T15:44:49+00:00", "topic": "Pain after cystoscopy....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAfter my first TURBT the Doctor told me He would do a second deeper TURBT to make sure it didn't go further , On my second he found some on the ureathra near the prostate so He TURBT it and again a second one will be done in February to make sure its not deeper. they check all samples for cancer to make sure its not invasive.\t\t\t", "date": "2016-01-03T01:44:01+00:00", "topic": "Just had first TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWarren!\n\nWe are in the same boat. Im stsrting  BCG this teusday first  of 6! OBVIOUSLY I want my original parts. But if it progresses from here ill have an  RC. They turnt me 2 x second found a spot  on my prostate so it too was turbt.  Im hoping the BCG works! Let me know your outcome. In jan or feb ill get an additional turby to my  prostate .\t\t\t", "date": "2012-01-03T22:00:08+00:00", "topic": "Survival rates", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi\n\nI was told to hold it for at least an hour but if you can 2 hrs is better.  Also to rotate my body to coat the bladder the same way a glass of milk  would as you moved the glass around. Coating the bladder is the key. Im also taking a urinary analgesic that turns your urine orange, cant remember the name off hand but it helps if you have burning. Other than going to the potty a lot because of the amount if water im drinking so far not bad at all.\n\nI'm 52 yr old male, type 2 diabetes controled.  Hope your doing better!\t\t\t", "date": "2015-06-20T17:58:10+00:00", "topic": "BCG Treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSara,\n\nI agree, and he said prostate looked good but wants to view into the ducts so I will get a turbt for that. All in all I feel good about it.\t\t\t", "date": "2016-02-10T02:17:07+00:00", "topic": "No sign of Cancer today at Urologist!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have transient pains in my bladder at times, not an infection still stings at the end of urine stream, im woundering if the cancer has returned. Its always in the back of my mind, funny i read about that , where you are always woundering about the cancer. It helps coming back here to write and maybe someone can share thier after BCG cure journey.\t\t\t", "date": "2016-04-20T01:48:32+00:00", "topic": "2 months out After BCG NED, am I cured?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can't wait to see if I'm where your at !!!!!  ", "date": "2015-12-15T21:06:11+00:00", "topic": "Two year cancer free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYour posts is very exciting! I am looking forward to my 4rth instillment of BCG tomorrow!\t\t\t", "date": "2015-12-15T21:06:11+00:00", "topic": "Two year cancer free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhen I got my BCG they used a LIODOCAINE lubricant.\t\t\t", "date": "2015-01-12T03:59:57+00:00", "topic": "Altrnate to  BCG in US?  Is it Immucothel ??", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t_substandard,\n\nYou really cant go by odds or percentages, We are all different. but I do know that my nonmuscle invasive BC is now muscle invasive and my best chance at beating BC is an RC, I think getting rid of the source is better than leaving it in.\nI have a Wife of 9 yrs, 5 kids, 3 grand kids, I know they count on me and my thought is to do what I can to beat this !\nI may not win, but I'll always keep trying for me and them! And yes I agree with Cynthia change your user name your better than that!\t\t\t", "date": "2017-05-04T20:55:20+00:00", "topic": "42yrs, high grade, aggressive T2 - what are my odds?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have metastic bladder cancer, spread to my liver and lungs. Im starting immunotherapy tomorrow. Im 54, KEYTRUDA is what they will use on me, chemo didn't work for me. Have  they tried immunotherapy on your Mom?\t\t\t", "date": "2018-01-11T00:13:32+00:00", "topic": "Terminal bladder cancer (has spread)", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nI felt terrible after the chemo.  I had the same Gemzar and Cisplatin,  to me the Gemzar stung a little, but the after effects ugh! I stayed in bed for days felt nauseas. I hope this keytruda is my GOD send!\t\t\t", "date": "2017-11-13T20:07:41+00:00", "topic": "Lymph nodes", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlan\n\nNot great news, cancer is back spread to liver, lymph nodes, and lungs. No symptoms right now starting immunotherapy on the 18th.  Wish it wasnt so but im still going to fight!\t\t\t", "date": "2017-11-13T20:07:41+00:00", "topic": "Lymph nodes", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes! I have a pouch still got a few bugs to work out but the pouch right now has a filet and bag for healing. Soon I hope just the pouche!\t\t\t", "date": "2017-03-15T14:10:27+00:00", "topic": "THE PATH TO  RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack ,\n\nEverything you said I've been dealing with ! So I'm not the only one. I'm back from another hospital stint, bacteria returned.  Now I have a mainline in my neck and 24/7 antibiotic pumping thru it. I feel good of course with all the drains and lines I'm pretty much ready for Halloween.  You words are encouraging thanks again !\t\t\t", "date": "2017-03-15T14:10:27+00:00", "topic": "THE PATH TO  RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have my moments, and wish there was another way. tomorrow I go for CHEMO #2. I hope I don't get a replay of the last one!!! ER is not my favorite place. My stomach has been acting up off and on and my sugar is up! Doc thinks due to Chemo , They are talking about insulin I don't want that , but it would be while I'm going thru Chemo. I say lets see what happens in 2 weeks. Wish Me LUCK!\t\t\t", "date": "2017-03-14T00:44:50+00:00", "topic": "STARTING THE PATH TO  RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tdtat60,\n\n\n\n2 weeks one day a week then a break and repeat cycle, for 4 months then RC. I willl have GEMZAR and Cisplatin.\nOnco says just 4 cycles!\t\t\t", "date": "2017-03-14T00:44:50+00:00", "topic": "STARTING THE PATH TO  RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI read my posts, sometimes it sounds like I'm winning to me. Your right losing a bladder and ancillary parts better than death. Also even if outside bag I think I'm ready. It's funny how some things work well for some but not others. The progression to muscle invasive cancer is enough for me to start the process. Thanks for the reply! It's been ruff but I see a small light at the end of the tunnel.\t\t\t", "date": "2017-02-12T00:52:12+00:00", "topic": "Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell tried all of the Arsenal,  BCG, Gemcitibine, unfortunately didn't work for me.\nGetting the ground work done for a RC by summer time.  First 4 months of chemo. Doc says I'm a good candidate for neobladder unless my right kidney wich got blocked by a tumor dosent come back up to specs. If that happens I'll have the outside ostonomy.  I feel I tried all options and although this isn't my fave outcome getting rid of the cancer is primary!\t\t\t", "date": "2017-02-12T00:52:12+00:00", "topic": "Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats!\t\t\t", "date": "2016-10-29T02:18:49+00:00", "topic": "Good Checkup: Going On 7 Years", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTahitijin,\n\nI just found out today that my bladder cancer has also metastasized . It is in my liver,aortic lymph nodes and lungs. I will be starting my immunotherapy on the 18th.  I will be on Pembrolizumab or commonly known as KEYTRUDA, as far as i know it blocks a protective mechanism in cancer cells, wich allows your immune system to destroy them. I know it feels some times like your the only one going thru\nThis ,but there are others like myself and care givers like my wife. Its hard but gotta keep fighting!\nFYI\nMy Father inlaw who has stage 4 small cell lung cancer was predicted to die last july. He started KEYTRUDA, we celebrated both holidays with him and he acts and looks fine.\nHe is 76. I told him we will do it big next  Thanksgiving! And im looking forward to it!!!\t\t\t", "date": "2018-01-02T18:31:22+00:00", "topic": "New State IV Diagnosis", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tits a pretty intensive surgery, but I didnt know there could be an age limit, it takes a awhile to recover.\t\t\t", "date": "2018-10-18T16:49:34+00:00", "topic": "What is used to replace removed bladder", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tThey use your old ureter, unless like my self a ureter gets damaged,then there are other things they can use. depends on how much of your original ureter is bad. I am awaiting ureter reconstruction surgery since my left ureter got destroyed due to an infection.\t\t\t", "date": "2018-10-18T16:49:34+00:00", "topic": "What is used to replace removed bladder", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\t54, my bladder cancer started in 2015, RC 2016. Took me till begining of 2018 to be able to walk and used to my new normal because of the complications I had.\t\t\t", "date": "2018-10-18T16:49:34+00:00", "topic": "What is used to replace removed bladder", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tCantste,\n\n\nYes I do and Viagra helps. soon I will be losing my Bladder and prostate so will still do viagra but a friend of mine after losing his  prostate is now relying on shots since the surgery dammaged the nerves for erection, he says very little pain and always gets an erection!  I may be using shots after my surgery.  The TURBTS and BCG and Gemcitibine effected me in the same way. I hope this info helps.\t\t\t", "date": "2017-01-03T04:07:36+00:00", "topic": "Bladder Cancer and ED", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThe news is always the worse next to waiting\nI know. But at least knowing they can get a strategy! I had a bad reaction to my chemo and am still in the hospital as i write. But HOPE, is a powerful thing gotta just keep trying my Friend.\t\t\t", "date": "2017-03-29T18:52:52+00:00", "topic": "Plasmacytoid Urothelial carcinoma", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI think they will check in the upcoming months to see if it returns\t\t\t", "date": "2015-12-12T02:48:35+00:00", "topic": "No reacton to 6 week BCG treatments", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI'm in for the fight and I knew it could return, let's see what the new treatment brings. Gemcitibine might be the answer!\t\t\t", "date": "2016-09-03T10:21:34+00:00", "topic": "Red spots on bladder wall at turbt locations", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThe Cancer is back, T1 high grade in bladder and Ta in prostate Both superficial, I will be starting a 6 week dose of a chemo drug called GEMCTIBINE. I wish I had better news.\t\t\t", "date": "2016-09-03T10:21:34+00:00", "topic": "Red spots on bladder wall at turbt locations", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThanks Sara! I'll take that!\t\t\t", "date": "2016-09-03T10:21:34+00:00", "topic": "Red spots on bladder wall at turbt locations", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI submitted all required paperwork haven't heard anything from VA since last time I posted. I figure it will be awhile.\t\t\t", "date": "2014-07-14T00:23:41+00:00", "topic": "Marine Vet 1963-1967", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tVA took my info they said they arent accepting claims yet on the Camp Lejeune water issue but I'm sure after what you just posted i should get a call soon!\t\t\t", "date": "2014-07-14T00:23:41+00:00", "topic": "Marine Vet 1963-1967", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI hope they include BLADDER CANCER!\t\t\t", "date": "2014-07-14T00:23:41+00:00", "topic": "Marine Vet 1963-1967", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tGreat to hear! I hope mine turns out the same!i miss driving my tractor trailer!\t\t\t", "date": "2014-07-14T00:23:41+00:00", "topic": "Marine Vet 1963-1967", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tIm back! could not save ureteur,  so for neph bag removal I had to lose a kidney. sounds bad but the external bag was an issue to me. I hated it. might regret that in the future but for now its great! still getting immunotherapy and no sign of disease!!\t\t\t", "date": "2018-01-16T02:53:19+00:00", "topic": "Immunotherapy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAlan\n\nOne more surgery my friend to try and fix a ureteur.  next month! so much has happend All of you on this site have inspired me and kept me going!  Know that I think of you often!! and Thank You!!\t\t\t", "date": "2018-01-16T02:53:19+00:00", "topic": "Immunotherapy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tYour healthy and all things are possible now took me 3 x to find my wife your lady will come eventually!stay strong!\t\t\t", "date": "2015-11-04T22:36:56+00:00", "topic": "Here I am", "subforum": "17-chit-chat"}]}