{"signature": ["Chemotherapy"], "posts": [{"text": "\n\t\t\t\tCongrats Cynthia!  YOU certainly helped me when I first found this site.  No \"enterprise\" is successful without a superior leader.  Thank you Cynthia (and ED!) for 7 great years and many many more.\n\nLynda\t\t\t", "date": "2011-08-07T17:30:56+00:00", "topic": "Seven years of living", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWow PAt!  Of course kind, grade,stage is important.  But so is hope, help, and maybe a voice saying there is light at the end of the tunnel?  The best drs. and hospitals are great to have, but it doesn't mean that you'll mentally and physically recover better just by being treated at such with no idea what comes next.  No one has all the answers and I don't think I'm even close, but I will not sit by when someone asks a question I have experience in.  My alarm clock works just fine too, but when I'm up and moving around, that cord sometimes just doesn't reach all the way to where ever I'm at. This watch (BTW - Thanks MMC (mike) for mentioning it)has been a lifesaver for me and made my training easier.  I'm only a year out from my RC and now dealing with Lung cancer (met.) and I'm still finding ways to live my life under the cancer cloud.  If all anyone needed was facts, and only facts, we wouldn't need this site, just one person sitting waiting for the questions to roll in.  BUT all of us are here because we know what it's like to hear the words, \"You have bladder cancer\", and want to make the road smoother for the next person.\t\t\t", "date": "2011-07-25T12:20:25+00:00", "topic": "Stage 3 and no insurance", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKimbob -\n\nI know exactly how you feel!!  I went thru Bladder cancer and am now going thru chemo without insurance.  My husband and I are self-employed and WERE in very good health, but even then the premiums were just too high.\n\nYou will find an answer for any question you ask on this site.  Here are some of my ideas for you:\n\nStart right now and go to your Dr. and let him/her in on your situation.  No Dr.  (at least the good ones) will turn you away and will help you find a financial deal that works for you.  Also go to the financial center at the hospital and tell them the same thing.  They'll start a process with you to find alternative means for payments and help with discounts.  These will take time, but you should not delay treatment - keep pushing forward.  You two together are your best advocates and you determine what happens and sometimes how fast it happens.\n\nHome care -\n\nThis is what I did after RC (radical cystectomy) -\n\nRecliner - if you have one great.  If you don't borrow or buy one.  This will be the easiest place to rest, sleep, eat, etc.\n\nBed pads - Depends and I think Poise have a bed pad (big flat thing like for under a baby).  Get some to use on the recliner, and if you are brave enough to sleep in a real bed.  These are disposable and can make a rough night much better.  I have used these since I came home and never had to change the sheets in the middle of the night.\n\nYou will probably come home with a sewn in catheter in the stoma and a couple of drains from the kidneys.  If the hospital sends you home with a couple of basins (about 10 x 12 x 6) put all the drain tanks(!) in one of the basins and then into a cheepee recycling grocery bag with handles.  Much easier to haul around and discrete when sitting in your recliner entertaining visitors.\n\nFood will have different tastes than you are used to.  East what tastes good, even if it's icecream for breakfast.  You will need lots of protein - get it where ever you can.  Eat easy foods that are not going to cause digestion issues.  A bite or two of your favorites if you feel up to it, but don't overdo it.   YOu don't want back door issues now.  LOTS OF FLUIDS (especially water).  Letting yourself get dehydrated is going to cause you MAJOR problems with your pouch (if you get one - and I think the best solution for women).\n\nOnce you are thru the tether stage, you'll start training.  Your Dr. will probably say to cath every two hours.  Even tho' this means only sleeping every two hours, do not bend the rules and use a foley catheter at night.  This will slow down the training and keep you home bound longer. And you'll aready be cabin feverish.  There is a great watch on the market made for children to help them learn to not ignore the call of nature (4-5-6-7 year olds).  It has a auto-reset timer and very easy to adjust.  It's called a Vibra-lite 3, I made leaps and bounds in pouch training with this little gadget.  About $60, worth every penny.\n\nSince you're about to try going away from home - during the day I use a maternity nursing pad over my stoma with some 3M paper tape (no adverse reaction).  Protects the stoma and catches any drips, and if you start to leak you will feel the wetness and can get to a bathroom.  At night I use a poise pad sideways, just tucked into my underwear.\n\nCatheters - If you got an Indiana pouch, you now have a \"clean \"system.  Because of this, you can wash your catheters and reuse them.  If you find a source that will supply you enough to use a sterile oneevery time, go for it!  BUT if you have to wash them, use a anti-bacterial DISHWASHING soap, hot water, let them air dry on a towel and your good to go.  When I travel, my kit contains:  clean catheters in a ziplock freezer baggie, a regular ziplock baggie for the dirty ones(bring them home to wash them, throw the dirty baggie away), extra tape, extra nursing pads, one nighttime pad(in case).  It all goes in a cosmetic bag and NO BODY KNOWS!!!\n\nFood - you may find that foods that you ate before that never gave you a moments problem and now a problem.  Dairy, citrus, specific fruit or vegatable (mine is brocolli), will cause leaking.  Everyone is different, you'll learn what yours will be as time goes on.\n\nI know this sounds overwhelming and I totally know how you feel, and everyone else on the site will have ideas and ways to get thru and move on.  Keep asking questions - we're here for both of you.\n\nLynda\t\t\t", "date": "2011-07-25T12:20:25+00:00", "topic": "Stage 3 and no insurance", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDenise - I have an indiana pouch and I had lots of problems with timing.  Mow I have a watch that has a timer to set for whatever interval you want.  It's called a Vibralite3,it will vibrate and sound alarm as you need it.  got mine off the internet - works great!  I have no problems with timing now and even use it at night and don't wake my husband.  Lynda\t\t\t", "date": "2011-06-07T00:35:33+00:00", "topic": "2-hour timer?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDana -\n\nUnless something doesn't go according to plan during surgery or in recovery, I don't think he will be in ICU.  Usually a week to 10 days is a typical stay for most people, your Dr. will be the decision maker on this one.\n\nAs far as drain tubes, my last one came out a month after surgery (new suture thread, didn't disinegrate as fast as they thought).  Still, I did walk around the house and go for short car rides.\n\nThe hospital will probably have him walking the day after surgery, like Mike said, even walking in place next to the bed.  Movement is important, it wakes the body up and gets organs and systems moving after being messed with.\n\nThe Men and bladder cancer section will have more stories and info. on the neo-bladder.  Any little wrinkle that can happen, I think one of the guys has been thru it and lived to tell the tale.   \n\nLynda\t\t\t", "date": "2011-05-20T18:39:56+00:00", "topic": "HOSPITILIZATION", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDana -\n\nSounds like your Dr has a good handle on the next step for you and your husband.  If he's top in the BC field, run with it.\nYou'll get lots of input about the surgery and aftercare from everyone here (we've all done this before  ).\n\nLynda\t\t\t", "date": "2011-05-18T10:27:28+00:00", "topic": "cancer has become serious", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Sally -\n\nSorry to hear that your having to deal with this again.  It does seem to pop up at the most inconvenient time doesn't it?  I have had a full RC to treat my BC and can offer a compassionate ear.  BUT we have several ladies who have had treatments as you are going thru now and I know they will be chiming in soon.  Keep asking questions and doing your research.   I think it was a very good thing to change Drs.  Confidence in the Dr. treating you can make all the difference in the world (my husband didn't like my first uro either).\n\nKeep sending us updates.  We look forward to hearing a all clear report.\n\nLynda\t\t\t", "date": "2011-12-01T03:25:24+00:00", "topic": "Ready to tell my story", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can't comment on a neo-bladder, but the expert panel (the guys) who have them will certainly chime in.\n\nI would go with the RC and whatever diversion it gets you.  I had my RC with IP in 2010 and haven't had too much trouble with it.  It does take training and will have you off your feet for a while, but what's more important - your practice or your life?\n\nSince your practice partner is retiring for his own health issues are you contemplating taking on someone new?  Could this person get your practice thru this surgery and adjustment period?\n\nLots of decisions to make, and we've all been there.  Good Luck to you!\n\n\nLynda\t\t\t", "date": "2012-05-06T15:46:30+00:00", "topic": "Radical Cystectomy or More Intravesical Chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi April -\n\nI'm amazed  that your husband and in-law family have put you in the position of patient advocate/fix-it lady.  Are their any other children besides your husband?  Are they at all involved in your FILs care?  (my in-laws would run me out on a rail if I tried to do what you're doing.  But I give you big time credit for taking on the responsibility.)\n\nThe cath, even tho' not the most pleasant thing would give some relief for sleeping.  Does he want to try adult diapers instead?\nAs for the nausea - I have problems with it from my chemo and have found that the crystalized sugared ginger to be very helpful.  Just a piece in the mouth, bite down once and let the juice and saliva soothe the stomach.  I've had relief after just 20-30 minutes.\n\nAs far as your FIL not wanting to go to the Dr. to have any of these issues checked out - is it time for some tough love?   Forgive me for sounding severe, but he is a grown man of sound mind and you really can't make him do anything.  At the same time it's not your responsibility to fix it with no help from anyone.\n\nI give you all the credit in the world for standing by your family and attempting to move everyone forward.  BC is a horrible disease and effects everyone in a family.  I hope you can find some way to get more help for your FIL and for you.  This is not a journey to take alone.  My thoughts and prayers are for you and your family.  Please keep posting so we can help if we can.\n\nLynda\t\t\t", "date": "2011-09-23T13:40:37+00:00", "topic": "bladder cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi April -\n\nI'm so sorry that this is taking so much from you and your FIL.  Definitely get to the Dr. for evaluation on the issues he's having.  I'm going thru chemo now and while it's not any fun, the amount of help from drugs for side effects is a blessing.  I haven't had any severe problems other than fatique and just started to have issues with nausea after four months of chemo.  Also, dehydrating with any kind of BC alternative is not good.  Gotta keep everything flowing.  I can't imagine the Dr. not being available to your FIL in the condition he's in, but if that is the case I'd head to the ER.  Don't wait and don't let him (FIL) talk you into waiting.  Good luck and let us know what happens.\t\t\t", "date": "2011-09-23T13:40:37+00:00", "topic": "bladder cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDana - I know you're so overwhelmed that you don't know which way to turn.  There are so many factors that will decide how long you stay in the hospital.  The long distance away from the hosp. to your home may be part of his reason for saying 15 days.  From what you've told us, you and your husband are in good hands and I have no doubt you'll have a good outcome.  The surgery is not fun and I can't imagine what the waiting must be like.  If your dr. had another treatment that he believed was better than surgery I'm sure he would be going  in that direction, instead of setting both of you on this route.\n\nTrust and faith are hard things to have when life gets rough, but you need to find a peace with what's going on.  I truly believe that how you deal with the emotions of the surgery will have a huge effect on how your husband feels as well.  In my case, I spent a lot of time doing research (like you) and it was helpful to me to explain it to my husband and it calmed him down and made it an easier journey for me.  (he was calm and had some idea of what would be happening, that meant I could be calm)  Keep the nay sayers away!  (my MIL told my husband that we were going to lose our house to medical bills!)  It's easy to let your mind and the information you get be a burden and tear down the hope that you need.  Know that not much else matters right now except your health and your husbands health.\n\nKeep us posted on your husbands surgery.\nKeeping you in thought and prayer -\n\nLynda\t\t\t", "date": "2011-05-22T11:09:28+00:00", "topic": "HELP NEEDED AS FAST AS POSSIBLE", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Karen - Sorry you're having to decide IC or IP.  I have an IP and even tho' it's not been very long I'm very happy with my choice.  I was also lucky to find a Dr. who specializes in them in my home town.  I would definitely make the trip to (at least) talk with the more experienced Drs.  They will be able to give you more info and a better understanding on the procedure and recovery.  This is a MAJOR life change surgery that will be your new normal.  Take the time to make a wholy informed decision.\n\nLynda\t\t\t", "date": "2011-03-15T02:41:27+00:00", "topic": "It\\'s been a while  Need pros &amp;amp; cons of diversions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tquinlanm -\n\nI don't have experience with mets to bone, but do have mets to the lung.  My radiation was VERY smooth and I had no side effects.  The treatment did not cause any pain.  I hope you find the answers you need and area able to proceed to treatment asap.  Good luck!\t\t\t", "date": "2012-04-21T19:34:37+00:00", "topic": "Radiation for mets?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHI Tom -\n\nI was Dx'd in May 2010 with BC and had my RC in June 2010.  All my post op tests came back as clear and the nodes (27) they took were all clear.  I thought I was all set, but found out that I had MEts to the lung in MAy 2011.  (No I didn't know I was supposed to be monitored every 3 months).  BUT I am receiving chemo now and the tumors are responding.  It's almost harder to get thru the 2nd dx than the first.  I've had the best support at home and at treatment, I'm so lucky, but the reality is that no one knows what's going to happen.  Talk to your Dr. about your concern about the node.  They are your best source of info and don't let them put you off!  \"Everything's fine!!!... is not enough - you need more info to understand and find a good place to be with all that's happened to you.\n\nJmemas note on suppliments is a good one to also run by your doc. Mine did suggest a multi, vit D, calcium..., but be sure to get good sources for vitamins.\n\nAlso, get an idea of what your dr. is planning for future testing and at what timeframe.  This may help you to feel not so abandoned.  Again, they are the dr. you are the patient, but that doesn't mean that the medical pros are the final say in all areas.  If your Dr. won't work with you or you feel unattended to, it's time to find a better dr.\n\nKeep us in the loop, we are here for you!\n\nLynda\t\t\t", "date": "2011-11-22T16:03:55+00:00", "topic": "Lymph node positive", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tOK, so I had blood work done earlier this week for my one year follow-up with the uro who did my IP.  Got a call today from the good Dr. that said the blood work was back and all was normal on a basic metabolic panel(call was on the machine I had no chance for questions).  Does this mean that the cancer is still gone?  Or is this just a small part of a bigger picture yet to be looked at?  CT and chest xray scheduled for May 24.  Any opinions would be appreciated.\t\t\t", "date": "2011-05-13T22:57:53+00:00", "topic": "basic metabolic panel", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tTime frames can vary for a lot of reasons.  My case was about 3 years because I was convinced it was a UTI (almost all the time) and between drugs and homeopathic remedies I thought I could control it.  My referral to a urologist was in Jan 2010 and Dx(diagnosis) of bladder cancer was in May 2010 (Jan 2010 Dx was a prolapsed bladder).  After the May Dx, I had an \"exploratory\" surgery in June (thinking they could just cut the tumor out and be done), my RC was in July and I was back on my feet and doing pretty much whatever I wanted by the beginning of Sept.  Hope this helps.  You've found a great group.  Everyone here is very friendly and always ready to listen and help.\n\nLynda\t\t\t", "date": "2011-04-05T10:47:08+00:00", "topic": "Time to diagnosis", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tThanks Patricia!  I never thought I'd have these issues, but it sure beats cancer by a mile.  I did have OJ this morning (LOVE the stuff) so we'll see what happens tonight.\n\nFYI - for nighttime I have a couple of pads that you'd use for a childs bed when they are potty training.  It keeps my bedding clean and I can easily change it if I have a leak and not wake my husband.  Also use a tena pad stuck to a folded hand towel across my stoma to catch leaks(tucked in underwear).  (daytime is a nursing pad and micropore tape)\n\nIt's amazing how inventive you have to be to outsmart Ms. Leaky  \n\nLynda\t\t\t", "date": "2011-02-27T02:25:39+00:00", "topic": "Indiana pouch leakage options--question", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\thi Sandie!  Been thinking about you and glad to hear that you're on the mend.\n\nMy leaking is getting better.  I've done some \"experimenting\" and found that I may have a Indiana pouch sensitivity to citrus and carbonation (orange juice and soda).  So I've cut out both and what do you know, back to 2 1/2 to 3 hours between bathroom breaks!  And if I drink water with dinner and cut out liquids by 8pm I have a much better night.  (Went last night for 5 HOURS!!!!  Yippee!)  So the \"experiment\" goes on...\n\nLynda\t\t\t", "date": "2011-02-27T02:25:39+00:00", "topic": "Indiana pouch leakage options--question", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tEat what you want and whatever sounds good to you.\n\nWhen the nurses want to get you up and walking and you are hurting and just want to rest, get up anyway and walk!  It will make a huge difference in your recovery and getting your bowels working again.\n\nFind the most economical source for supplies you can.  This is for life and you want a place to get what you need without any hassle from your insurance company.  (FYI - my local medical supply has a 16 French red rubber catheter for $2.00 each!!)\n\nKeep a notebook of dr. visits and what is going on.  It will come in handy when you \"forget\" or \"remember it wrong\".  And if you sleep thru any family/friends visits you'll know who came to see you and when.  Also helps to keep track of indy training (went at 1 pm next visit to the bathroom is at 3 pm...).\n\nGet some comfortable clothes that are loose and not too tight at the stoma level.  Easy to put on is a plus too.  We also installed a handheld shower so I could use a shower chair and not get completely exhausted just washing my hair.\n\nSpeaking of hair,  you will get massive amounts of drugs in the hospital and some of that will make your hair fall out, this will be temporary,  Get a hair cut just before your surgery as it may be a while before you are comfortable in a chair leaning back.\n\nYou will probably go home with a catheter in place to be taken out at a later date by your doctor.  I had my catheter hooked to a bag, and put the bag in one of those pink emesis basins from the hospital (hard to carry and heavy when the bag got full), so that whole mess went into a tote bag with handles.  Much easier to carry and less obtrusive sitting on the floor next to my recliner.\n\nIt's great the your sister is coming to help, you will need it.  At first you will be grateful for any and all help, and then it will be slightly frustrating when things in your house aren't getting done exactly as you would do them but you keep quiet because you realize they are helping and your are blessed to have them around.  I knew that I was getting better when my husband and mom started doing laundry in \"mixed loads\"  instead of sorted into whites, darks, towels, etc. and I actually cared and got a little (OK, a lot) miffed and started doing things for myself.  Before you know it your back on your feet and it is a great day!!\n\nThanks for letting me tell you what I wish I had known.  I'll be thinking of you and praying for a successful and \"routine\" surgery and hassle free recovery.  The ladies and gentlemen on this site are a wealth of informtion, we're lucky to have someone who has gone before us to look to for help.\t\t\t", "date": "2011-01-23T19:55:25+00:00", "topic": "Questions about Indy Pouch  in women", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\twow!  Scary article.  I wonder if anyone on the ABLCS site has had problems getting appointments/care?\n\nPersonally, I can't believe the speed with which I was diagnosed and treated.  Truly supurb(sp?) care and follow-up.  Drs., nurses, everybody was top-notch, I couldn't have asked for better.\n\nBTW - My care was NOT in a known medical hotspot, but in a \"dying\" city if you read the news/internet.  Grand Rapids MIchigan may just be an up and coming medical center of the future.\n\n4 hospitals,\nLemmen Holten Cancer center,\nDeVos Childrens Hospital,\nFred and Lena Meijer heart center,\nthe list goes on...\t\t\t", "date": "2011-06-02T23:34:11+00:00", "topic": "Going to love this one", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tCatherine and Duke-\n\nCancer does seem to put everything in perspective.  I know that I've let go of a lot that used to bother me, but I also have less tolerance for the baloney from people just out to make life difficult.  I am having some issues with my pouch right now and my husband is more cranked off about it than I am.  I know it's not perfect right now, but it will get better and I'm better off as it is now than a year ago, so it's OK.  Thanks for your observations, I think they're right on!\n\nLynda\t\t\t", "date": "2011-04-08T06:30:42+00:00", "topic": "How people think?", "subforum": "17-chit-chat"}]}