{"signature": ["Dx", "TURBT", "Dx", "TURBT", "Dx", "Dx", "TURBT", "Dx"], "posts": [{"text": "\n\t\t\t\tDear Teddy's Mom,\n\nIn reading forum postings, there does seem to be a wide range of recovery experiences following a TURBT.\n\nBased on my husband's experience, staying well hydrated after the TURBT is essential.\n\nHis recovery time and residual discomfort has varied with the extent of the \"scraping\" as he calls it during the TURBT.  Twice he left the hospital with a catheter which we removed several days later at home with Dr's approval.\n\nPyridium was prescribed following each of  his TURBT's (and so were antibiotics and pain medicine).  Pyridium results in orange urine which can leave stains on fabrics/surfaces.\n\nUrgency/frequency of urination increased for a time after the TURBT so he carried a disposal urinal and change of clothes for longer car rides and work commutes just in case.\n\nOne of the most difficult aspects of each TURBT recovery was waiting for the phone call about a week later with the pathology results.\n\nBest wishes on your procedure.\t\t\t", "date": "2017-04-07T20:12:16+00:00", "topic": "Turbt - What to expect", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Winterwhite.  My husband also had a bit of a detour in his BCG schedule due to bladder irritation. It occurred in December 2015 when redness was observed during a routine scope exam about six weeks after his first maintenance round of BCG (doses 7-9).   This led to another \"scraping\" as my husband calls it.   The earliest available surgery date was a month later (January 2016) so our holiday celebrations were a bit more meaningful.  Fortunately, the pathology report confirmed no recurrence of CIS.   Since then, he's had another round of maintenance BCG, another scope with no signs of irritation and began another three week cycle of maintenance BCG this week.  Wishing you and your husband the best.\t\t\t", "date": "2016-12-21T00:53:25+00:00", "topic": "BCG and irritated bladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Gibsongal57,\n\nThe forum is a great place for caregivers and their loved ones who are members of the BC club.  I'm sorry that you are dealing with cancer concerns of both your parents and hope your father's recovery is going well.\n\nMy husband was diagnosed with CIS and has received BCG treatments. It's a 2 hour drive to the doctor's.  He generally receives BCG and we begin our trip home before he has voided the BCG.\n\nTypically there is an interval of time after receiving BCG when voided urine needs to be treated with bleach.  His strategy is to use a travel urinal which is later emptied and bleached at home.\n\nDepending on travel time, you might want to strategize on how a travel rest stop would be handled for your Mom.\n\nThe forum is here for you.  Stay strong and keep posting.\t\t\t", "date": "2016-09-04T19:35:43+00:00", "topic": "82-year-old mother with CIS and question BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJHU has a full vote of confidence from my family. We're in Southern Maryland with about a two hour drive to Baltimore and will be making that trip 04-07-16 for my husband's (52, CIS) scope exam.  Having access to and receiving excellent care has provided immeasurable peace of mind.  That's a point we emphasized when breaking the news to our children (in middle school and college), that Dad was receiving care from a BC expert.\t\t\t", "date": "2016-04-05T14:43:15+00:00", "topic": "New diagnosis - non-invasive micropapillary cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSue McG,\n\nI'm glad you pursued getting the biopsy.  It's just over a year since my husband's first scope and we saw what was later confirmed through biopsy as CIS.  He's completed 9 treatments of BCG with the next follow up in April.  He's had mild fatigue but so far the BCG treatment has been very tolerable.\n\nThe forum has provided a lot of answers for us.\n\nTime does seem to slow down waiting for the biopsy.  Hang in there and keep posting.\t\t\t", "date": "2016-02-05T18:13:52+00:00", "topic": "Awaiting results - Possible CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy husband (52 years old, CIS) has had 9 BCG treatments so far.  One time after voiding the BCG he did not hydrate as much and experienced more bladder pain.  He makes sure to push lots of fluids after voiding the BCG which means being near a bathroom.  He keeps a \"travel\" urinal in the car just in case and a brown paper bag to discreetly carry it inside to empty in the toilet. Best wishes on your treatment.\t\t\t", "date": "2016-01-03T01:44:01+00:00", "topic": "Just had first TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGlad to report the growth seen after 9 BCG treatments was benign and my husband will continue with 3 weeks maintenance BCG in April.\t\t\t", "date": "2015-12-05T13:52:48+00:00", "topic": "Growth after BCG, TURBT scheduled 1-06-16", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, Sara Anne.  The forum was instrumental in our decision to seek care at a major treatment center.  We are fortunate to be only 90 miles away from Baltimore.  That decision has provided huge peace of mind.  I'll post an update when we have new information.  Thanks again!\t\t\t", "date": "2015-12-05T13:52:48+00:00", "topic": "Growth after BCG, TURBT scheduled 1-06-16", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy husband has a TURBT on 01-06-16 to check growth seen during the post BCG cystoscopy.\n\nIf RC is recommended, are there any suggestions for exercises to start now that might assist with recovery and possible diversion training?\n\nThe DX earlier this year was a kick in the pants to make healthier diet a priority.  Alas, no six pack abs.  Here's to starting 2016 New Year resolutions early.\n\nThanks for any feedback.\t\t\t", "date": "2015-12-06T12:12:02+00:00", "topic": "Exercise recommendations before possible RC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear wifeofmike,\n\nI hope all goes well for both of you on Monday.  This is information my family may well need in the near future.  I haven't viewed any but there are videos on Youtube that might be helpful to you. I watched several Youtube videos before removing my husband's Foley catheter at home (home removal was actually suggested by our doctor rather than driving two hours to his office).  Best wishes.\t\t\t", "date": "2015-12-05T18:40:57+00:00", "topic": "RC/IC scheduled for 12-7-2015", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear wifeofmike,\n\nI'm glad you found the forum but am sorry for the circumstances that bring you here.  The contributors have been very helpful to me as the wife.\n\nGetting a second opinion or surgical treatment, preferably from a major cancer treatment center that sees lots of bladder cancer patients, is a good decision.\n\nMy husband's diagnosis was non-muscle invasion carcinoma in situ (CIS) and his treatment so far has included three TURBT's and 9 rounds of BCG.\n\nWe were going to work with a local urologist in our rural county who performed the initial cystoscopy.  While that doctor was on a planned absence before the first scheduled TURBT, we learned more about treatment of bladder cancer and realized we needed a specialist.\n\nWe gladly drive two hours one way to Johns Hopkins and have full confidence in his bladder cancer specialist.  Choosing the best care provider for us has provided me with peace of mind.\n\nIt may be the best thing for your husband's treatment that you will be working with a new doctor, hopefully one that treats lots of bladder cancer patients.\n\nBest wishes for you and your husband.\t\t\t", "date": "2015-11-08T14:21:37+00:00", "topic": "Husband DX with bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Lacy,\n\nMy 52 year old husband has had three TURBT's and was instructed not to lift more than 10 pounds after each procedure.  His first TURBT seemed to be most extensive.  He was home with a catheter for 3 days and not very mobile due to discomfort from the catheter.  Recovery was quicker the next two times (catheter removed before being discharged from outpatient surgery) but he did stay home from work the day after surgery.\n\nBest wishes for your surgery and your moving day.\t\t\t", "date": "2015-09-15T02:43:04+00:00", "topic": "Recently Diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSo happy for you!  My husband recently got a similar report after the initial BCG series.  It was very welcome news indeed.\t\t\t", "date": "2015-08-31T17:16:44+00:00", "topic": "Great news", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Murray55,\n\nCongratulations on your recent marriage and birth of your first child! I hope you are able to fully celebrate this joyful events as you continue your research into cancer treatment.\n\nMy husband receives care from an exceptional bladder cancer specialist at Johns Hopkins.  We may be biased (he does refer to my 52 year old spouse as young), but we consider him a rock star!\n\nSwitching from a local urologist to a specialist a quick 90 miles from home was the right thing for my family.  We have full confidence in the excellence of care as well as the benefit of relief from the persistent question of is everything being done that can be done?\n\nSeeking a second opinion was done based on posting forums that was the right thing to do, and I strongly concur with that advice.\n\nBest wishes to you and your family as you continue with your research and cancer care.\n\n-MadLove\t\t\t", "date": "2015-08-28T01:28:12+00:00", "topic": "30/male, dome T1b with CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGeorge,\n\nCredible explanation for the night owl posting.  The spouse took the BCG bladder out to a \"work\" function 30 hours after the first instillation and learned that it is not as tolerant of his favorite cold beverages as the post TURBT bladder. He claims moderation was the rule but felt like he was reliving some of his bachelor days while on shore leave.  Lesson learned (and all is well.)\t\t\t", "date": "2015-06-03T23:05:39+00:00", "topic": "Cystoscopy was done 2 days ago &amp;amp; Tumor found.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAs a care giver I know the anticipation is tough and can only imagine how it must feel as the one about to have the procedure.  The good news is your having the TURBT so quickly after your cystoscopy even if it hadn't allowed much time for getting questions asked.\n\nFor both the TURBT's, my husband did wake up with a catheter.  I think part of the recovery room time with a cath allows staff to monitor the output.  I sat with him in recovery for about an hour the second time and a bit longer the first time.\n\nFor both TURBT recoveries, three prescriptions were written. One was an antibiotic (Cipro) and two were for pain management (Percocet and Pyridium).  The Pyridium treats bladder pain/burning and sense of urgency. It turns urine into an orange color which may stain surfaces if not wiped up.\n\nThe Pyridium could not be given while in recovery (so staff could monitor normal output).  There was a hospital pharmacy so we were able to have all prescriptions filled and start the Pyridium right after discharge.  I don't know if he could notice bladder discomfort then because he was distracted by the discomfort of the catheter.  The antibiotic started the next day as he received IV antibiotic with the procedure and the Percocet was started 4-6 hours after discharge as needed.\n\nI will be thinking about you and a speedy recovery from your procedure.  And no heavy lifting for a while!  I recall instructions of nothing over 10 pounds for a while.  My husband was happy to have a doctor's note excusing him from trash and laundry duty.\n\nBest wishes.  Will look forward to an update when you are able and willing to share.\t\t\t", "date": "2015-06-03T23:05:39+00:00", "topic": "Cystoscopy was done 2 days ago &amp;amp; Tumor found.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Lisascop,\n\nI was in the procedure room at the local urologist's office in January 2015 when the first cystoscopy was performed on my 51 year old husband.  Seeing the tumor on the 60\" flat screen while seated on the lounge chair in the local urologist's office was unexpected but that visualization \"put a face\" on the cancer and made it something concrete for me as a caregiver.  We transferred to a bladder cancer specialist at Johns Hopkins and are now veterans of two TURBT's and the first of six weekly BCG treatments.\n\nThere was an interval of about six weeks between the cystoscopy with the local urologist and the initial TURBT with the bladder cancer specialist.  In my husband's case, the specialist does not feel that time has any long term effect on his outcome (diagnosed with non-invasive CIS).\n\nIf possible, work with a major hospital and specialist that sees lots of bladder cancer specialists.  As much possible, consider including your support system in your appointments.  My husband has saved a lot of time in not having to remember and repeat information!\n\nBest wishes!\t\t\t", "date": "2015-06-02T14:40:07+00:00", "topic": "Just got the news, what can I expect?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Jennybg3,\n\nI'm sorry you are facing this situation and am glad you found the forum.  It has been very helpful to me since my husband's recent diagnosis (CIS non-invasive).\n\nAre you working with a National Center of Excellence hospital or a bladder cancer specialist who sees lots of BC patients?  That forum feedback helped us with switching from the local urologist to a specialist at Johns Hopkins two hours away by car.  Working with a bladder cancer expert has brought peace of mind to my husband and myself.\t\t\t", "date": "2015-05-22T21:17:55+00:00", "topic": "Newly Diagnosed HG Bladder Cancer...scared!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tUpdate as of 05-22-15: Urine culture ordered by Johns Hopkins bladder cancer specialist and collected 05-22-15 at our local urologist's office.  Cipro antibiotic ordered as precaution for infection.\n\nIf the culture was reported back in a timely manner as negative, my husband could suspend the remaining antibiotics and keep the scheduled 05-26-15 first BCG Tuesday appointment or shift to 05-28-15 Thursday appointments for the series. Otherwise, he should complete the antibiotic course and begin BCG on 06-02-15 (original date for BCG 2nd of 6 instillations).\n\nDue to a slight misunderstanding over the phone with the local urologist's about the timely availability of the urine culture result, the initial BCG series will be pushed back a week to begin 06-02-15 after finishing the antibiotic course.  The misunderstanding was staff indicated the result would be available the same day and was referring to a dip(?) test.  Cultures are sent out and take about a week for results per the local urologist's office.\n\nWe will do some homework on options for quicker local testing results if something similar develops in the future.\n\nMy husband is anxious for the first BCG treatment to happen but accepts the need to rule out possible infection at this time.\t\t\t", "date": "2015-05-22T04:29:36+00:00", "topic": "Blood, increased pain before 1st BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, Sara Anne.  If a postponement becomes necessary, hopefully it will be brief.  While I'm sure he would be glad to stay away longer from another catheter, even a small one, he is anxious to begin the next phase of this journey. Thanks again.\t\t\t", "date": "2015-05-22T04:29:36+00:00", "topic": "Blood, increased pain before 1st BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy 51 year old husband is diagnosed with CIS.  TURBT's were done 03-11-15 and 04-22-15.  He is scheduled for his initial BCG on 05-26-15.  As of 05-20-15, he has a recurrence of visible blood, possible clots and increased pain on urination.  We have a message in with the urologist (bladder cancer specialist at Johns Hopkins).\nCould these recent changes impact/postpone the upcoming BCG treatment? Thanks for any feedback.\t\t\t", "date": "2015-05-22T04:29:36+00:00", "topic": "Blood, increased pain before 1st BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGo with your gut about sitting in on the doctor's appointment.  When my husband mentioned visible blood, my thought was an enlarged prostate and I discussed with my husband he should have that evaluated on the initial problem visit with the PCP.  I didn't go that appointment and there was no exam of the prostate.  An enlarged prostate has since been mentioned, but the focus now is on the BC.  I think if the prostate exam was done 12/2015, we may have gotten the referral to the urologist sooner.  The extra time in the long run probably won't change the outcome.  But it is something I regret.\n\nMy husband is also a go with the flow type person and not so concerned about the details.  He needs to have a second set of ears in the doctor's office.  Plus, the upside for him is if I am in the doctor's room, he gets out of having to do the play by play recall of the visit.\n\nIt's been useful to take a notebook to the appointments to keep personal notes and jot down questions in advance to ask the doctor.\n\nWishing you well.\t\t\t", "date": "2015-04-19T01:43:18+00:00", "topic": "Concerned - husband w/blood in urine", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear CRDot,\n\nMy 51 year old husband's symptoms presented 12/2014 and included visible blood in the urine.  The PCP treated initially for suspect UTI, followed up with CT scans with and without contrast before making a referral to a local urologist.  A cystoscopy in 01/2015 confirmed a mass in the bladder and a TURBT was scheduled with our local urologist.\n\nDue to a planned absence by the local urologist, the TURBT was planned for 3/2015.  That wait was a blessing. In that time, we discovered this forum and subsequently sought a second opinion with a bladder cancer specialist at a Center for Excellence a quick two hour drive from home.\n\nWe met with the BC specialist in 2/2015 and immediately knew we were had made the best decision possible.  A first TURBT was done 03/2015 and non-invasive CIS was diagnosed.  The repeat TURBT is schedule for 04/22/15.\n\nSwitching to a BC expert has provided tremendous relief.  While I continue to read and research, it's more for the purpose of being able to better understand our treatment plan.  If we had remained with our local, rural area urologist, I would have some doubt if everything possible was being done.  Based on initial feedback from the local urologist, my husband would likely have been scheduled for an RC rather than a repeat TURBT.\n\nThe forum has been a wonderful resource and I am grateful for the experiences shared by contributors and their feedback.\n\nI am sorry you and your husband are facing a potential BC scenario.  If that is the diagnosis, as most on this forum would say, plan for a second opinion with a BC specialist.\n\nWishing you well.\t\t\t", "date": "2015-04-19T01:43:18+00:00", "topic": "Concerned - husband w/blood in urine", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Marble68,\n\nYes, your posts are being read.  Hope all goes well with your cysto.  Wishing you more good days.  As for audiobooks, I haven't listened to it, and the topic isn't Sci Fi, but Ray Bradbury's Green Shadows, White Whales is a favorite read.  It's about living in Ireland while writing the screenplay for Moby Dick. Best wishes.\t\t\t", "date": "2015-02-04T17:29:57+00:00", "topic": "Newly diagnosed, had a TURB two weeks ago.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, Cynthia, for sharing your experience.  It's not obvious to me what value would be added to our situation.  We have had great access to our doctor.  It doesn't seem like it would be to our benefit to funnel or filter doctor-patient information through an agent who is not providing direct care.  Thanks, again.\t\t\t", "date": "2015-03-26T21:45:32+00:00", "topic": "United Healthcare Optum Cancer Resource Center ?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, Alan.  We are working with a uro-oncologist at Johns Hopkins after obtaining our 2nd opinion there.  First TURBT 03-11-15, CIS, with second TURBT to be scheduled in a few weeks after my husband's bladder has recuperated.  It was a substantial resection which can be significant with the CIS diagnosis.\n\nWe've been advised of potential treatment scenarios which will be finalized once the TURB #2 path report is available.  The options reviewed are similar to what many forum contributors have shared about their treatment for high grade non-invasive BC.\n\nOur confidence in the doctor is complete which has basically eliminated the overwhelming feeling of needing to be a 24/7 advocate with medical staff.  We're rolling along and want to avoid any potential and unnecessary roadblocks due to insurance issues.  To be sure, I've gotten second opinions of what is covered from the health insurance agents.\n\nI'm on the same page about not inserting a third party nurse coordinator into the process.  It seems to have the potential for countermanding the treatment plan our doctor will propose.\n\nThanks again for the comments.\t\t\t", "date": "2015-03-26T21:45:32+00:00", "topic": "United Healthcare Optum Cancer Resource Center ?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks for the information.  It's encouraging to be able to categorize the cancer now.\n\nIt was also soothing to make phone contact with the doctor today and discuss directly the pathology results from the first TURBT and plan of action.  Their was a brief moment of despair last night when he phoned after hours and I missed the call on the last ring.  It was a LONG 24 hours.\n\nThe current plan is to follow usual guidance for CIS and we are on track for a second TURB in a few weeks.  At this time, and based on current pathology results and CT scans, there is no indication of muscle invasion or mets.  More scans may be ordered after the second TURB with a likelihood of BCG/BCG alternative treatment.\n\nIt's another baby step up the bladder ladder to a hopeful recovery.\t\t\t", "date": "2015-03-23T15:23:17+00:00", "topic": "PATH report is CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe path report from my 51-year old husband's 03-11-15 TURBT was posted today to his electronic medical records.  The report lists two biopsy results, one each from the left bladder wall and one from the base.  Both are reported as \"focal in site urothelial carcinoma (CIS).  Muscularis propria is present.\"\n\nWe await contact from the doctor and hopefully will hear something soon to put this in context and frame the treatment plan of action. Based on what I've read in the forum, my interpretation is that the biopsy was deep enough to check for muscle invasion and that CIS means it hasn't spread into other tissues. If that remains the case, I'll consider it good news!\t\t\t", "date": "2015-03-23T15:23:17+00:00", "topic": "PATH report is CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello. My husband just had this done today.  It stands for transurethral resection of the bladder.  Sometimes its referred to as TURBT with the last T for tumor.  The doctor inserted a scope while my husband was under general anesthia and removed suspect tissue for analysis. The pathology report should be available in a week.\t\t\t", "date": "2015-03-12T02:14:46+00:00", "topic": "Husband diagnosed in January 2015", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks, Sneckie and Anita (DougG's wife).  The cath removal went well.  The words of praise were it didn't hurt any worse than when the scopes were removed in the doctor's office after two different cystoscopies.  My husband was so happy to be able to\nwalk about freely! He had been moving about the house with the cath but very gingerly.\n\nNo issues with incontinence but as other forum contributors have described, the frequency is, well, frequent, about every 30 minutes. He is drinking more fluids and may reduce intake slightly, but maintain at least 8 glasses daily.\n\nThere is some blood spotting but not in the urine.  The Dr. described the prostate as large and the source of the blood and that it should resolve itself as part of the recovery.  Also, there will be more conversations about the prostate after the path report and bladder treatment is planned.\n\nWe have one day left of Cipro and Pyridium and have contacted the Dr.'s office about possible refills.  Based on other forum topics, pyridium seems to be effective for many to have a gladder bladder.\n\nThanks again for sharing your experiences.  The forum threads have been very helpful in planning for the TURBT recovery.\t\t\t", "date": "2015-03-12T04:57:48+00:00", "topic": "Husband's TURBT 03-11-15 - Catheter questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks.  We're game for home removal of the catheter, especially since the pain level is much improved 24 hours plus out from post-op, about a 3 out of 10.  I appreciate the comment about looping the tubing.   Fluid intake and output are proceeding apace.  The recovery nurse demonstrated emptying the bag and all has gone well. Thanks again.\t\t\t", "date": "2015-03-12T04:57:48+00:00", "topic": "Husband's TURBT 03-11-15 - Catheter questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy 51 year old husband had his first TURBT today and is home with a catheter.  His tumor was large (left side and dome) and he has a large prostate.  The procedure took longer than anticipated due to the anatomy of his bladder. He was in a lot of pain (8 out of 10) in the recovery room.  I thought the pain may be a result of the amount of the resection. Nursing staff indicated regardless of the procedure, some patients experience significant discomfort when cathed while others tolerate it reasonably well. The 2 hour car ride home was an ordeal.  Every bump in the road was felt and brought my husband to the verge of tears.  The good news is that the pain is currently a 5 out of 10.  The cath can be removed in two days.  The doctor gave the option for us to do this at home in lieu of the four hour round trip to the hospital. My husband was initially reluctant about that before the drive home but is now all in favor.  We got instructions on cath removal from staff and it seems relatively straight forward to do.\n\nHe was discharged with a large collection bag.  The bag was placed on a clean absorbent pad on the car floor for the ride home.  Keeping the bag low seemed easy enough, but I noticed fluid not draining or draining slowly from loops or bows in the tubing.  The tubing suddenly seemed longer.  We stopped the car to help with drainage. Once home and in bed, it seems like care is needed to make sure the back of the collection bag is not sucked onto the inlet port to the bag.\n\nAny tips on managing the catheter are appreciated, especially\n1. Any thoughts/comments about cath removal at home?\n2. Is it okay to loop the tubing if the bag is always lower?\n3. Can the night collection bag rest on the floor or should it hang from something lower than the catheter?\n\nThanks for the feedback.\t\t\t", "date": "2015-03-12T04:57:48+00:00", "topic": "Husband's TURBT 03-11-15 - Catheter questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSorry I don't have anything to share about doctors in beautiful Wyoming and can imagine you may need to travel quite a distance potentially to access a major bladder cancer treatment center and specialist doctor.\n\nWe switched from our local general urologist to a specialist 90 miles from home after reading in the forum about the importance of working with a bladder cancer specialist.\n\nMy husband is 51 and we also had a January 2015 diagnosis of bladder tumors/cancer.  The TURBT was performed 03-11-15 and we'll learn in about a week the type and stage of cancer.\n\nSince our bladder cancer specialist is more likely to have \"seen it all\" and treated so many kinds of scenarios, I feel we will receive the most effective care and treatment.  That has reduced the worrying significantly.\n\nWe have full faith in the specialist to guide us to the best possible outcome.\n\nWishing you well from Maryland.\t\t\t", "date": "2015-03-13T03:47:24+00:00", "topic": "Treatment Centers in Rocky Mountains?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello.  My husband just had his first TURBT at Johns Hopkins today. I'll be posting about that separately.  We live two hours away in a rural area and initially had the surgery scheduled at our local hospital. Forum contributors talk about the value of working with a urologist that performs lots of TURBT's. We scheduled an appointment at Hopkins to review the history including the cystoscopy report from our local urologist.  The doctor worked in an unplanned cystoscopy during the same visit and we made the switch in doctors that day.  I'm grateful for that advice to not only get a second opinion but get one from someone who specializes in bladder cancer.\t\t\t", "date": "2015-03-02T01:34:56+00:00", "topic": "Second Opionion before Bioposy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear SpecialExport,\n\nMy 52 year old non-smoker husband shares a similar timeline.  He was treated 12-22-14 for a suspect UTI due to pain and blood with urination.  CT scans and cystoscopy were done in January 2015. A large mass was observed by the local urologist in our rural county. The initial TURBT was scheduled for 03-04-15 when the doctor returned from a planned absence.\n\nIn the meantime, we saw a new doctor at a major cancer center located a quick two hours one way drive from home.  While there, the doctor even worked in another cystoscopy. The TURBT is now scheduled for 03-11-15 at Johns Hopkins.\n\nSwitching to the new doctor has given me peace of mind.  In the first 29 years with my husband, I've been the \"what about\" worrier and warrier in tight spots.  As we face this new challenge, I'm going to (try hard) to let go of (most of) the worry because of the expertise in medical care.\n\nI'm further convinced that switching to a new doctor specializing in bladder cancer is the right thing for my family based on new tumors observed 02-24-15 that weren't there 01-29-15. I have confidence the pathology from Johns Hopkins will not under stage the cancer and the optimum treatment plan will be pursued.\n\nMany forum contributors advocate getting a second opinion from a major cancer center.  There's a posting with something like getting a second opinion is not optional in the title that might be beneficial to read.\n\nI'll be thinking about you on 03-04-15.\t\t\t", "date": "2015-02-25T23:09:45+00:00", "topic": "May have bladder cancer - scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy husband has a large tumor and the first TURBT is 03-04-15.  Any suggestions on pre- and post- operative care that's not typically in the literature?  Thoughts on home care supplies to stock up on would be appreciated as well.\t\t\t", "date": "2015-02-05T05:48:15+00:00", "topic": "Preparing for TURBT, things to consider", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you for your reply.  We live in Maryland, about 65 miles from DC and 90 miles from Baltimore.\t\t\t", "date": "2015-01-30T05:16:20+00:00", "topic": "Is a month too long for biopsy after cytoscopy?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy 51 year old husband had a cytoscopy today and the urologist identified a \"large tumor\" on the left side of the bladder.  In answer to our question, the Dr. said similar tumors are typically malignant.  We like this doctor.  Due to a planned absence, the Dr. is not available for the biopsy until 03-04-15.  The Dr. offered names of other urologists to schedule an earlier date for biopsy.  In answer to our question, he indicated the month wait was not likely to impact the outcome.  My husband first noticed blood in his urine about a month ago and has since received a course of antibiotics for possible urinary infection, a regular CT scan when a thickened bladder wall was diagnosed, a contrast CT scan and now cytoscopy. In hindsight, in recent months, there has been a need to urinate in the middle of the night. We have confidence in the Dr. But we have to be our own best advocates.  I welcome feedback on experiences with wait times before the biopsy procedure and feedback on potentially finding a different Dr. While the waiting adds to the anxiety, it allows time for research and making some planning decisions.  Thanks for your time and response.\t\t\t", "date": "2015-01-30T05:16:20+00:00", "topic": "Is a month too long for biopsy after cytoscopy?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Jim,\n\nHope you have a good report soon.   My husband (CIS) also had a precautionary biopsy due to redness after BCG.  This wasn't an issue after the first 6 treatments.  The redness was seen during the routine scope after the first maintenance series of 3 BCG treatments.  He has since completed another series of 3 treatments of BCG with no redness reported on the follow-up scope.\n\nHe continues to have slight discomfort when voiding which has been discussed with his BC specialist.  It's basically the new \"normal\" for my husband and hopefully will resolve itself once he completes (that is successfully completes!) his BCG treatments.\n\nBest wishes.\t\t\t", "date": "2016-09-09T16:09:37+00:00", "topic": "3 Month Scope after 6 BCG Treatments?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy husband had good news today.  No visible growth was observed during his Cystoscopy.  He will have another Cystoscopy in about three months.\n\nWe had some concerns about mild burning while voiding.  The BC specialist reassured us this discomfort is not uncommon considering what the bladder has been through (CIS, cysto's, three TURBTS and 12 BCG treatments.\n\nWhile it's not my husband's favorite reason to visit Baltimore, I'll look forward to the return to JHU and hopefully another good report.\t\t\t", "date": "2016-07-20T00:02:24+00:00", "topic": "Good Cysto report 15 months after 1st TURBT", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Mike,\n\nMy husband's completed 9 BCG treatments.  Urinalysis was done before each treatment.  Even though fluids were restricted, he was able to produce a specimen each time.  The discharge instructions were to hydrate well after the 2 hour BCG hold and first void and to treat voided urine with bleach for six hours.\n\nHydration seemed to ease irritation while voiding.  More in of course means out.  My husband carried a disposable urinal in a brown paper bag for those got to go moments.  Our one way travel to the urologist is 2 hours so we usually stop for lunch and first void using the disposable urinal and then carry the filled urinal home for the bleach treatment.\n\nHe had a TURBT/biopsy six weeks after finishing the first 6 treatments.  About six weeks after that, he had 3 weeks of maintenance BCG.  Six weeks after that, he had an in office scope exam.\n\nBest wishes on your BCG treatments.\t\t\t", "date": "2016-02-17T06:15:44+00:00", "topic": "Begin BCG in 2 wks and have some questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBenign is the beautiful word in my husband's pathology report from his 08-19-15 biopsy following an initial 6 week course of BCG.  I feel like we can now say the first leg of the journey is complete.  The next leg includes three weeks of maintenance BCG in about a month, with a follow-up cystoscopy about three months after that.\n\nTo respond to a different posting, the beverage of the day is something a bit more festive than cranberry juice!\n\nCheers!\t\t\t", "date": "2015-08-25T15:24:11+00:00", "topic": "Sharing good news (calls for more than juice!)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you for sharing.  It is very timely information. We are expecting the path report from my husband's first TURBT at any time now.\t\t\t", "date": "2015-03-17T18:20:52+00:00", "topic": "BCG Shortage and the Current Treatment of BlC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear MoreLife,\n\nConsider getting a consultation with a BC specialist.\n\nMy husband was planning to get BC care from the local Uro who oversaw the initial CT and Cysto exams.  The TURBT was scheduled a month after the Cysto.\n\nDuring that time and research, we found the forum and read the frequent advice to get a second opinion.\n\nWe did, and as a result, switched to a BC specialist at a center of excellence teaching hospital 100 miles from home.\n\nHaving a BC specialist providing care has provided enormous peace of mind for our whole family over the past two years.\n\nWherever you receive your care, bring a notebook with your questions written in advance and have a family member or friend with you as another set of ears and to help keep notes.\n\nBest wishes.\t\t\t", "date": "2017-04-14T23:57:00+00:00", "topic": "Stage 2 diagnosed from TURBT; What should I ask my urologist next week?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for sharing the news and for your contributions to the forum.  Best wishes to you and your team!\t\t\t", "date": "2015-08-07T19:02:42+00:00", "topic": "7 years today !!!!!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Karnak,\n\nPatience is a must.  Add to that no two BC journeys will be alike.  From some readings, I thought my husband (also CIS) would be bedridden for days after his BCG treatments with extreme fatigue and other symptoms.\n\nAfter each treatment, he experienced burning when voiding for about 24 hours. Once during the 3 maintenance BCG cycles, he had a slight temperature overnight with some visible blood/blood clots.\n\nThe biopsy after the first 6 BCG's was benign and he had a scope exam after the 3 maintenance BCG's.  Something's there and a follow up biopsy is scheduled for 01-06-16.\n\nSo, yes, patience is a must.\t\t\t", "date": "2015-12-12T02:48:35+00:00", "topic": "No reacton to 6 week BCG treatments", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThanks for sharing.  That's great news for you and your mom!\t\t\t", "date": "2015-11-11T15:12:55+00:00", "topic": "My Mother", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tDear Concerned Son,\n\nSharing information on a health issue like bladder cancer with loved ones, especially your children, is difficult.\n\nWhen their dad was diagnosed less than a year ago, we shared more specific details with our 19 year old than we did with our 13 year old.  That was our parenting decision based on what we felt was age appropriate for our children.  We emphasized that an excellent doctor was treating my husband and we have full faith in the treatment plan which includes a regular schedule of follow-up checkups.\n\nThe forum is here for you and your Mom and I hope your Mom continues to get good reports from the doctor.  It sounds like your Mom is in good hands at home and in the doctor's office.\n\nWishing you and your Mom the best.\t\t\t", "date": "2015-11-11T15:12:55+00:00", "topic": "My Mother", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI recently heard about the three part documentary by Ken Burns called Cancer: The Emperor of Maladies.  It is being well reviewed.  It will air on PBS March 30-31 and April 1 from 9-11PM ET.\t\t\t", "date": "2015-03-28T00:14:21+00:00", "topic": "PBS Documentary beginning 03-30-15", "subforum": "17-chit-chat"}]}