{"signature": ["Dx", "BCG", "BCG"], "posts": [{"text": "\n\t\t\t\tMerck (the Company that makes BCG) is releasing product as it becomes available.  There is a shortage, but it is available intermittently .  They're taking orders and filling them in the order received based on product availability.  I would keep checking with you Dr. every few days or ask them if there's a list they're keeping of patients to be notified when drug is available.  Like Alan mentioned many of us have experienced delayed treatments for one reason or another and are doing well.  Make sure you keep your follow up cysto appointments so any problems will be caught early.\t\t\t", "date": "2014-11-13T19:21:15+00:00", "topic": "BCG Question", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Everybody.  Hearing everybody's good news helps to keep a positive attitude and reminds us everything is not doom and gloom.\n\nHere's an article I came across comparing radiation doses of standard CT scans with other tests and with background radiation.\n\nwww.radiologyinfo.org/en/safety/?pg=sfty_xray\n\nDepending on which studies you read you will hear different opinions as to the risk of these radiation doses.  Some say it's no big deal and others will say we're all going to die of radiation induced cancers.  I suspect the truth is somewhere in the middle.  It's something to think about and be aware of, but if a CT test is truly needed it should be performed.  Like a lot of things in life it should induce a risk VS benefit analysis and thought process.  Don't forget there's risk in skipping needed tests as well as in getting too many.\n\nMike's loss is on my mind as well.  You think about him and you wonder if you're making the right call with your own care.  All of our cases differ, so our treatments shouldn't all be the same either.  Somebody with an invasive tumor might be worried about mets while I'm more concerned with missing a reoccurrence of another non-invasive tumor or missing a new tumor on the kidneys or in the ureters that would allow the cancer to become invasive or metastasize.  We just have to make the best call we can at the time and move forward one day at a time.   Being an active participant in your care certainly improves your chances for a successful outcome.\t\t\t", "date": "2014-11-07T16:43:41+00:00", "topic": "Clear Annual Check", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood News!  I just got an all clear this month as well so we are moving to yearly Cystos. I've has 3 years of BCG treatments as well following Dr. Lamm's protocol so we decided to stop those as well.  Be high grade I wasn't sure about stopping the BCG's.  My official path report was primarily low grade with high grade focal points.  I also have been smoke free for 4 years this month.  Taking all this into account we decided to stop the BCG's.\n\nI too worry about the cumulative radiation dose from getting too may CT scans.  I had one at diagnosis and one or two more at yearly intervals after that.  We decided to do an ultrasound next year at the 5 year mark instead of a CT.  That will give a picture of the ureters and kidneys that you don't get with a cysto.  This isn't as sensitive as a CT scan, but if anything doesn't look right we can do a CT scan after that.  A CT scan is a test you don't want to skip if it's truly needed, but you don't want to get too many of them with questionable indications either.\t\t\t", "date": "2014-11-07T16:43:41+00:00", "topic": "Clear Annual Check", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMerck's Tice BCG is the only product available right now.  They have a patient financial assistance program if you qualify.  You'll have to call them and give them your info and see if you qualify.  If not, explain your situation to your urologist and see if they will work something out with you.  Don't buy it from a \"grey\" vendor even if the price looks good and the site looks legit.  There's no way to tell how they stored the drug or even what's in the vial if you don't obtain the drug from reliable sources.\n\nwww.merck.com/merckhelps/vaccines/home.html ", "date": "2013-01-30T02:26:15+00:00", "topic": "BCG drug cost??? Is there any help out there??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree with Sara Anne.  It won't hurt and it may help.  I don't know about being told you HAVE to take it.  Personally I don't take any multivitamins.  I've looked at Onvovite and the Bladder 2.2 and if I were going to take one and price were no object I'd probably pick the Bladder 2.2.  It looks a little more complete and has lower levels of fat soluble vitamins in it.  As to whether either is superior to a plain old multivitamin w/mineral tablet is debatable.\n\nThe only supplement I take for bladder cancer is #2 PB8 capsules/day (a probiotic).  I've seen a few studies the suggest Lactobacillus Casei may help prevent bladder cancer reocurrence.  Probiotics are supposed to boost the immune system so it makes since they may help prevent bladder cancer as well.  As to weather it actually works in real life or not is debatable, but like the vitamins taking probiotics won't hurt (as long as you don't do that instead of routine follow up with a specalist).\t\t\t", "date": "2012-10-17T23:37:33+00:00", "topic": "Theralogix Bladder 2.2??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome.  As you know, blood in your urine can have multiple causes.  It may be cancer, but it may not.  A visit to a urologist and a scope would be in order to see what's going on.  You are smart to be questioning your family doctors assertion that a trip to a urologist is not necessary.\n\nI had blood and clots prior to diagnosis and was diagnosised with a superficial cancer (Ta).  Blood in the urine can not by itself accurately predict stage/grade - or even if you have cancer for that matter.  It is a symptom and the cause should be investigated further.  It may be hard, but try not to let your mind go too crazy.  Do push your doctor for a referal to a urologist whether or not your symptoms spontaneously resolve themselves.\t\t\t", "date": "2012-03-18T08:06:51+00:00", "topic": "Blood clots, onset questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBobby,\n\nWelcome and I'm sorry to qualify to be here.  I would also encourage you to get a 2nd opinion at a major bladder cancer center.  This way you can be sure of the diagnosis and treatment plan.\n\nWe're both fairly young as far as bladder cancer patients go and I have a family with 2 small children also.  I too suspect smoking caused my bladder cancer.  I felt guilty and ashamed for allowing this to happen to me and my family as well.  I'll just encourage you to not let those thoughts stop you from trying to do the right thing going foward.  You can't do anything about the past, but you can do something about the present and future.\n\nI figure bladder cancer gave me the kick in the can to finally quit.  I always knew I should, but I always said next week, month, year but next week, month or year never came.  It came November of last year.  The consequences finally became greater than the pleasure.  I just do it one day at a time and don't fall for the I'll only have one trick.  It's all or nothing for me so I choose nothing now.  I figure I'm going to do what I can to stop the cancer from coming back and after that what's going to happen is going to happen.  I'm going for my 9 month cysto next week and hopefully everything will still be clear.  I don't usually get too concerned about my checkups until I'm actually waiting in the exam room.  I'd say that's pretty good.\n\nDon't beat yourself up over the past.  Your efforts are better focused on the present and future.\t\t\t", "date": "2011-09-15T01:11:21+00:00", "topic": "I\\'m a mess", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWell I got back today from MSK and there were thankfully no surprizes.  Dr. Dalbagni is a man of few words, but he agrees with the local Uro's treatment plan.\n\nI got a cystoscopy in the office and he was satisfied with the way the bladder looks so he didn't recommend a 2nd TURBT.  He also saw the local Uro's notes, the CT Urogram, as well as the slides from the TURBT.  It's on to BCG starting Friday.\n\nIt puts your mind at ease a bit knowing the experts agree with your treatment plan.  Now, I'm established there as well should the need arise in the future.\t\t\t", "date": "2010-12-04T02:54:14+00:00", "topic": "New to site and diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Pat and Mike for all the advice.  I called the Uro on call last evening and he said the same thing you did about the blood and clots in the urine.  It's cleared up again for now at least.\n\nI'm preparing my wife for the possibility we'll have to go back to MSK for a 2nd TURBT after the consultation next week.  We aren't too far away, but it will take 3-4hrs to drive there.  I have a big dedictable on my health insurance if I don't get this done where I work but you've convinced me it's worth it.  Money means nothing if you're dead.  I've most likely got high grade and this is my window of opportunity to get it right. I'm not going to let it shut without having done everything I can.\n\nFlorida is one of only a couple of states that doesn't let you transfer a license in from another state.  I'm not sure I could pass the boards today to get a Florida license without a lot of studying.  That's impressive that your father did.\t\t\t", "date": "2010-12-04T02:54:14+00:00", "topic": "New to site and diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm going to start the 24 month maintenance treatment Monday and my Uro said this will be it.  I'm going to talk to him about continuing on using Dr. Lamms protocol.  From what I've read the effects of BCG eventually wane and risk of reocurrence begins to increase after a while.  I'm only 41 years old so I would prefer to keep the cancer at bay using Dr. Lamms maintenance protocol rather than risk a reocurrance and potential stage progression at some point in the future.  I think he'll go along if I show him Dr. Lamms protocol.  If I had a low grade tumor I'd probably stop after this treatment and call it good.  As to a 30 month treatment I'm not going to pursue that.  Dr. Lamms latest protocol I saw on his website omits that cycle.  Here's the link to Dr. Lamms answer on a BCG maintenance protocol question.\n\naskdrlamm.bcgoncology.com/2010/01/bcg-maintenance-schedules-which-to-use/ ", "date": "2013-01-10T17:44:10+00:00", "topic": "BCG Maintenance Schedule -- has it changed?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm not sure if there is an \"official\" change in BCG hold time or not.  I have see posts on Dr. Lamm's website stating that a 30 minute hold time may be adequate to receive the benefits of BCG therapy.  Personally, I try for 2 hours hold time.  If I can't hold it then I just go to the bathroom and don't sweat it.  The fact that I've seen a shorter hold time suggested on Dr. Lamm's website makes me not be concerned if I don't get the full 2 hour hold time.\n\naskdrlamm.bcgoncology.com/category/bcg-general/page/9/\n\nThere is one link where he advocates a shorter hold time.  I know I've see it in a few other questions he's answered on his website as well.  Dr. Lamm  is considered an expert on BCG treatment and basically developed the protocol we use today.  If it's good enough for him it's good enough for me.\t\t\t", "date": "2014-04-16T14:55:53+00:00", "topic": "Help is there change in BCG treatment?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo far so good.  I'm following Dr. Lamm's protocol and am on 3 weekly instillations once a year now.  The last 3 were this January.  I've never had an antibiotic after my BCG instillations and have never had a problem.  Good luck to you!\t\t\t", "date": "2014-03-27T01:33:18+00:00", "topic": "Anyone get a Sulfur Based  Pill After BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt's theoretically possible for an antibiotic to interfere with the BCG response if the antibiotic has activity against the BCG bacteria.  That's probably only an issue if you're taking the antibiotic on a regular basis prior to and during your treatment.  A one time dose after catheter insertion probably won't interfere.  By the time you body absorbs and processes the antibiotic you've already eliminated the BCG.  A lot of antibiotics are eliminated from your body via your kidneys - and Bactrim is one of them.  By the time it makes it into your urine I suspect the BCG has already done it's thing.\n\nI still don't think it's a good idea to take an antibiotic just in case for reasons previously mentioned (side effects, resistance, etc.).  Another possible reason to take one would be a traumatic catheter insertion.  These reasons are rare and the vast majority of us don't need the antibiotic.  They should be using antiseptic washes and wearing sterile gloves during the cath insertion and BCG instillation.  Those steps are more important to preventing infection than a dose of antibiotic.\t\t\t", "date": "2014-03-27T01:33:18+00:00", "topic": "Anyone get a Sulfur Based  Pill After BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou are probably getting Bactrim (trimethoprim/sulfamethoxazole) if it's \"sulfa based\".  I personally don't see the need for a one time dose of antibiotic after each catheter insertion.  The exception to this would be if you've had multiple UTI's or some anatomic abnormalities that make you susceptible to them.\n\nThe problem with multiple one time doses of antibiotics given \"just in case\" is they can encourage the development of resistance to the antibiotic given.  This could be a problem if you ever develop a \"real UTI\".  This could make it harder to treat because one of you 1st choices in antibiotics are resistant.  Simply put multiple exposure over time to the same antibiotic encourages the bacteria to become resistant to that antibiotic.\n\nI would ask your doctor if it's really necessary to get that antibiotic.\t\t\t", "date": "2014-03-27T01:33:18+00:00", "topic": "Anyone get a Sulfur Based  Pill After BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree with Mike.  I'm still on full dose BCG maintance every 6 months.  Sometimes I can hold it for 2hrs, and sometimes I can't. I think Dr. Lamm says a half hour may be an adequate time to hold the BCG.  Let your doctor know how it went at your next appointment and don't worry about not making 2 hours.  If the side effects become to troublesome they can always reduce the dosage and/or prescribe some medication to lessen the effects.\t\t\t", "date": "2012-11-12T15:52:58+00:00", "topic": "So upset", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'll agree that a 2nd opinion with a bladder cancer specialist may be in order.  Oncologist usually don't get involved until a tumor has invaded the muscle (ie. T2 or deeper).  A lot of specialists will do a 2nd TURBT 4-6 weeks after the 1st with any high grade/T1 diagnosis to be sure they got good margins.  It's important to get the stage/grade correct so that you get the correct treatment plan in place.  If I read your post correctly you got a diagnosis of T1 with no aditional treatments until you had a reocurrence.  It's time for a 2nd opinion with a doctor that specalizes in treatment of bladder cancer.\t\t\t", "date": "2012-01-02T19:16:16+00:00", "topic": "Should I be seeing an oncologist", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would also agree that your primary doctor and uro should consult about giving BCG while on Coumadin.  They may want to do bloodwork (Like checking an INR) before any BCG treatments just to make sure your coumadin dosage is right.  Most people tolerate BCG treatments fairly well, and the dose can alway be reduced if the side effects become bothersome.\n\nPersonally, I would not count on holistic treatments in place of standard treatments.  High grade tumors (which CIS is) can turn deadly if ignored or treated ineffectively.  There's some info out there that certain foods or supplements MAY reduce the risk of reoccurance/progression, but I haven't personally seen any studies that would convince me to go holistic as an only form of treatment.  I think holistic treatments can compliment standard treatments, but not replace them.\t\t\t", "date": "2011-10-23T20:17:34+00:00", "topic": "more treatment questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would also agree that your primary doctor and uro should consult about giving BCG while on Coumadin.  They may want to do bloodwork (Like checking an INR) before any BCG treatments just to make sure your coumadin dosage is right.  Most people tolerate BCG treatments fairly well, and the dose can alway be reduced if the side effects become bothersome.\n\nPersonally, I would not count on holistic treatments in place of standard treatments.  High grade tumors (which CIS is) can turn deadly if ignored or treated ineffectively.  There's some info out there that certain foods or supplements MAY reduce the risk of reoccurance/progression, but I haven't personally seen any studies that would convince me to go holistic as an only form of treatment.  I think holistic treatments can compliment standard treatments, but not replace them.\t\t\t", "date": "2011-10-23T20:17:34+00:00", "topic": "more treatment questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYour doctor is probably just trying to be thorough.  A cystoscopy can see into the urethrea and bladder, but doesn't see other structures in the urinary system.  A CT urogram can highlight problems in areas (if there are any) not seen by a cystoscopy. Doing the scan with and without dye is fairly routine also.  Some abnormalities will only show up with dye and some without dye.  Doing a scan both ways allows for a comparison reading of the images and a more through study.  I hope everything turns up clear on your scan.\t\t\t", "date": "2011-08-22T14:29:09+00:00", "topic": "ctt combined with ivp", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter induction BCG my Uro pretty much left the question of maintance up to me.  He said if I had CIS he would suggest maintance.  In his experience he said less that half of his patientce complete maintance.  I don't have CIS, but I do have high grade.  I decided to go with maintance for the reasons Sara Anne stated.  I'm going to try to follow Dr. Lamm's propocol at least for a while and hope for the best.\t\t\t", "date": "2011-04-30T03:41:49+00:00", "topic": "Confussed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome and sorry about your diagnosis.  I would be inclined to follow MD Anderson's advice and I wouldn't be concerned about a slight delay in BCG treatment.  High grade is something that you don't want to mess around with.  You want to be sure of the stage/grade and reduce the tumor load as much as possible before BCG is given.  You have to be sure of the diagnosis to be sure of the treatment plan.  It sounds like you're on the right track.\n\nIn my case, I had a TURBT by a local urologist and was diagnosised with TaG3.  I had my slides and records sent to Sloan Kettering and I went down for a 2nd opinion.  There Dr. Dalbagni did a cystoscopy in the office.  Between that and their reading of my slides they were satisfied with the grading and margins so I didn't have a 2nd TURBT and started BCG about 4 weeks after the original surgery. If MSK had suggest it I would have has a 2nd TURBT and delayed BCG.\n\nGetting a 2nd opinion is a wise move either way.  They'll either catch something missed earlier or they'll give you peace of mind that you're doing all you can to treat your cancer.  I hope all goes well for you.\t\t\t", "date": "2011-04-09T23:18:37+00:00", "topic": "Getting 2nd TUR before starting BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI finished my 1st 6 instillations a week ago.  The first one I had no problems with, and after that I had some burning and an uncomfortable feeling for about a day.  Pyridium for a day or so after the instillation takes the edge off for me.  I haven't had any of the bad side effects some have.  They're more of an annoyance than anything else.  I'm wondering if they'll build when I start maintance.  I guess I'll worry about that when or if I come to it.\t\t\t", "date": "2011-01-10T22:51:47+00:00", "topic": "After 10 years it\\'s CIS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had pretty much the same diagnosis of Ta predominately low grade with high grade focal points.  The first pathologist favored high grade and the 2nd opinion reading at MSK stated there was a significant low grade component, but enough high grade to render a diagnosis of high grade.  I don't know the exact percent of low VS. high grade but the local urologist suggest BCG and my 2nd opinion doctor at MSK agreeded.\n\nI don't know what the right answer is for you, but I'm on BCG and am starting my first maintance round Tuesday.  I'm going with the pathology reports and treating it as high grade. The local urologist pretty much left the question of BCG maintance up to me.  Since I've got high grade I'm going to try to follow Dr. Lamm's protocol as long as I can. In your case the fact that a major cancer center agreeded with your local doctors treatment plan is a good sign.\t\t\t", "date": "2011-03-17T15:42:44+00:00", "topic": "Looking for advice", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGot the good news today after my Cysto was postponed from last week due to the doctor being called away to an emergency.  He pretty much left the question of BCG maintance up to me after the Cysto was finished.  He said if it was CIS he would definately recommend maintance, but since I don't have CIS he could go either way.  He said in his experience less than half the people complete the maintance regemine in his practice due to various reasons.\n\nI figure I handled the 1st round without too many complications and I want to increase my long term rate of success.  Everything I've read here as well as other sources suggest a maintance regemine is preferable to stopping after induction.  I don't have CIS, but I am a G3 so I'm going to start maintance at full dose in 2 weeks.  If the side effects become intolerable then I'll ask about a dosage reduction vs stopping.\t\t\t", "date": "2011-03-08T01:21:58+00:00", "topic": "1st 3 Month Cysto All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Mike!  I know since being diagnosed I don't look at every little ache and pain quite the same way either.  Stuff I used to blow off can make my mind go wild at times.  I guess that means we're human.\n\nMark\t\t\t", "date": "2011-11-04T21:59:24+00:00", "topic": "The annual wait for results....", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike and Liz,\n\nI wish I had the right words to say now to make everything better.  That's out of my control unfortunately.\n\nOne thing I do know is the fear of the unknown is sometimes worse that the fear of the known.  Having bladder cancer definitely changes your outlook on life. Right now my bladder is behaving, but that's not a given to always be the case. The things I used to care about aren't as important to me and the things I used to take for granted I appreciate more today.  I've also had brushes with other situations that could be equally deadly, but have come through.  The biggest way is just taking things one day at a time.  You can't change yesterday and tomorrow isn't hear yet.  The only thing you have control over is now.  You lean on other people when you have to and you take it one day at a time and tackle your problems one bit at a time.  Have faith that you will get through this and will became a stronger person for it.\n\nI consider Mike a friend even though I've never meet him.  I haven't been on the forums much in the last 5-6 months, but something told me to look at them.  When I did I didn't like what I saw.  Mike helped me a lot when I got diagnosed 3 years ago.  The treatment I'm receiving today is largely due to Mike hammering home get a 2nd opinion, be proactive, and take charge of your own care.   My Uro said we could stop BCG after the induction was over.  The research I did at Mike's insistence said that's not the best course for high grade.  When and/or if a reoccurrence comes Mike's flow chart will be dusted off and put to use.  Even more than that Mike gave me hope, encouragement and support.  He's had a profound influence in aspects of my life.  If he's like that to a stranger on the internet he's got to be truly special in person.\n\nNobody knows exactly how this will unfold, but do know a lot of us are thinking and praying for you both. Don't be afraid to seek outside when you need it.\t\t\t", "date": "2014-01-10T17:29:38+00:00", "topic": "I'm am Mike McG's wife need help dealing with mets", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI'm inclined to agree with the others.  The risk of passing your cancer to the recipient is probably unacceptable to any transplant program.\n\nBefore I got diagnosed I was up to about #5 gallons of blood donations.  After I got my diagnosis I stopped giving.  I was never actually turned down.  I just guessed they wouldn't want my blood since I'm getting BCG and there is a small risk of acquiring an infection from the treatments.  Maybe it's time to revisit that decision after my next maintaince cycle which starts in a few weeks.\n\nJust thinking about helping other when you're faced with your diagnosis really says a lot about the type of person you are - which we already knew.  Looking at other ways to help other may be an option you and your family may wish to consider when the time comes.\t\t\t", "date": "2014-01-08T16:53:45+00:00", "topic": "Organ donation with mets?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tCongratulations, It's always nice to hear good news.\n\nRegarding supplements, I take #2 PB8's a day (a probiotic supplement).  It's supposed to help with your digestion and boost you're immune system.  I've seen a study or two that suggests lactobacillus casei may help prevent reocurrences of bladder cancer. As to whether it works or not who knows, but I did just pass the 1 year mark with no reocurrences.\n\nI personally don't take any vitamins, but being a pharmacist I was curious about the differences so I did a quick comparison of Oncovite and Bladder 2.2 ingredients.  They're similar in some reguards.  Oncovite has more vitamin A (too much maybe) if taken in the #4 caps per day dose and no selenium.  If I used this I'd probably only take #2 a day for a cost of about $0.50/day.\n\nBladder 2.2 has the Selenium, less vitamin A and more Vitamin D if taken in the suggested #2 caps per day.  At $1/day it seems kind of expensive for a vitamin.\n\nAs to whether these differences are significant or not is debatable.  If price weren't a consideration I'd probably take Bladder 2.2 over Oncovite.  Once again, who knows if either is superior to a plain multivit with mineral tab.  Like others have said if you can afford it probably won't hurt and may help.  I'd be a little leary about taking #4 Oncovites per day due to the high vitamin A content.  High doses of vitamin A can cause liver problems as well as other issues in some people.\t\t\t", "date": "2012-01-06T19:05:15+00:00", "topic": "How lucky can a gal with BC be?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI'm not sure exactly.  I had blood in my urine for a few days in the middle of 2007.  My Dr. at the time did a CT scan without contrast and a few other tests that revealed nothing and no further workup was done.  Then in November of last year I had blood in my urine again.  This time a different doctor called a urologist right away who ordered a CT urogram.  I was in the OR getting a TURBT about 1 week later.\n\nAs to whether or not it was there in 2007 I can't say.  I didn't have any more bleeding after that first episode until 2010.  I should have pushed for more tests in 2007, but I buried my head in the sand hoping it would go away and it did for over 3 years.  If it was there in 2007, than I'd say I'm extremely fortunate my cancer isn't invasive or metastatic.  The past year I had a bad feeling of what was wrong and I didn't handle it at all like the episode in 2007.  Why I handled each episode differently I don't know.  If I had ignored this last warning I don't think my story would have a happy ending.\t\t\t", "date": "2011-04-05T10:47:08+00:00", "topic": "Time to diagnosis", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI would think if you grow a new bladder from your own stem cells then the new bladder would be just as prone to bladder cancer as the old one was.  Even though it may not be a magic bullet it may still be better than options available today.\t\t\t", "date": "2012-03-18T15:53:45+00:00", "topic": "Growing your own bladder...", "subforum": "17-chit-chat"}]}