{"signature": ["TURBT"], "posts": [{"text": "\n\t\t\t\tWell said. Mike, George and Humpy. Your replies to Warren have inspired me to quit worrying so much and just tackle and lick this beast!\n\nWarren - the best to you, and think positive! We Oregonians (I was raised in Klamath Falls) are tough! LMAO after reading a forestry major was working at your local clinic (and on you), as I was a forestry major at Oregon State many years ago. Tell your doc you want a urologist, not a dendrologist!\n\nCheers - Maryland Mike\t\t\t", "date": "2012-01-03T22:00:08+00:00", "topic": "Survival rates", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Ric - Maryland Mike here - I'm a little slow in seeing your post and responding, but I'd like to say that I, too, passed tissue (and blood) during my BCG treatment regimen, and it doesn't seem to be that uncommon - in fact, my uro said it was a sign the BCG was causing a positive effect on my bladder. I kept a \"log\" in the \"Superficial (Non-invasive)...\" forum, in the \"Newbie - I'm checkin' in\" thread. There I describe my reactions to the six treatments.\n\nCheers, and stay positive - this stuff is quite beatable!\t\t\t", "date": "2012-08-16T22:35:40+00:00", "topic": "bcg treatment problem?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWow - guess I'm lucky. There are two uros in my immediate area, and one has a good reputation - he was Chief of Staff at our local hospital. He did my TURBT, HoLAP and bladder stone ablation, then administered all six BCG treatments personally. He enabled me to easily endure the BCG catheters by talking me through using abdominal relaxation techniques when inserting the catheter, thus easing insertion and the flow of BCG through the catheter. This worked well for me. We communicate by email, and he always responds the same day. He didn't hesitate to refer me to a well-renowned head of urological oncology at a large regional hospital when it was determined I need a divertuculectomy and partial cystectomy. All this, after initially telling me he might not be able to treat me because of my doubts I voiced to him about treatments and conditions (after reading a little too much online) - he promptly suggested a second opinion, which I got from that head of urological oncology, who was in complete agreement with my uro's treatment regimen.\n\nI already am very grateful to my local uro, and think he is worth much more that what Medicare is paying him. Perhaps you can simply ask your uro if he could spend some time discussing your case with you. After reading your posts, I feel very fortunate to have my local uro treating me.\n\nCheers - Maryland Mike\t\t\t", "date": "2012-02-08T19:54:14+00:00", "topic": "Physician Assistant instead of Doctor", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Warren - Bend, huh? I was raised in Klamath Falls! Left there in '65, but my 94-yr-old dad is still there. I went to Oregon State in '62-'64. Welcome to the club!\n\nI was just diagnosed with non-invasive papillary carcinoma (grade Ta) in September this year. I've already had TURBT and am on my 4th BCG treatment. I think it's absolutely wonderful you got on an insurance plan, as I know my care will be of significant cost over the long term. Fortunately, I'm now on Medicare (age 67) with excellent secondary insurance, so the financial part is the least of my worries.\n\nAbout costs: My TURBT was over $7k (as outpatient in hospital), and each BCG treatment is around $400 (of course, Medicare doesn't pay near this much to the providers). Since the normal BCG treatment regimen is 6 initial weekly treatments, followed by maintenance treatments in groups of 3, plus additional cystosopies and possible TURBTs, this could get quite expensive over the years - and I am determined that this will be many, many  years for me.\n\nIf you enter BCG treatments - I am keeping a running account how I react to them in a thread on this board (\"Newbie - I'm checkin' in\").\n\nCheers - Maryland Mike\t\t\t", "date": "2011-11-03T21:01:29+00:00", "topic": "Cost?", "subforum": "3-newly-diagnosed"}, {"text": "\npemquid wrote:PST--\n\nFirst, congratulations on the pathology report results! It's difficult to deal with the emotional roller coaster when you are first diagnosed and starting the bladder cancer \"journey.\" But, at least you have your good news before the holidays, and can perhaps begin to relax a bit now.\n\nIt sounds to me as though your urologist is following the standard and solid protocol for tumors of this stage/grade and number. I initially had a single tumor of the same type as yours, and it was only when I had a recurrence of 2 very tiny tumors 2 years later that my urologist recommended BCG. I was doubtful about that since I'd read BCG wasn't considered all that useful for low-grade tumors. I called my cousin, a radiologist specializing in the urinary tract, who works at a major NY teaching hospital. He concurred with my urologist's BCG recommendation.  Since the recurrence was in a different area of the bladder than the original single tumor, the way my cousin worded it was that \"the recurrence indicates your bladder lining wants to grow tumors.\"  I've just completed the full treatment protocol for BCG, and am doing great.\n\nHope your future check-ups are \"all clear,\" but know that if you do have a recurrence BCG may be the way to go\n\nAnn\nPST and Ann - I'd like to add a 2nd doctor's comment on multiple tumors. I went to the Chief of Urological Oncology at a very large regional hospital for my 2nd, and after reviewing my case (Ta,Mx, Nx) and TURBT photographs, he said \"since you have multiple areas with papillary carcinoma, I consider your entire bladder to be at risk\" - and thus he agreed with my local urologist on using BCG therapy for me (I have non-invasive low-grade tumors). I agree the literature shows BCG to me more effective against CIS; however, I see writings and studies that show effectiveness of BCG against Ta is better than other intravesical treatment options. I'm very happy with my treatment regimen - I'd rather be aggressive than passive on this one.\n\nCheers - Maryland Mike\t\t\t", "date": "2011-11-29T18:08:15+00:00", "topic": "My TURBC is over", "subforum": "3-newly-diagnosed"}, {"text": "\nPST wrote:I got a phone call with my pathology results today: Stage TaNxMx, Grade 1. Some biopsies were done of the rest of the bladder and there were no signs of Tis. There was a second tumor just getting started next to the first, but otherwise I guess things couldn't be much better. I was told to come back in three months. The doctor does not recommend a repeat TURBT or intravesical therapy under these circumstances. I would be interested if anyone regards this as unsound advice with low-grade non-invasive disease, but two adjacent tumors. It sounds like Maryland_Mike's doctor would agree with mine about BCG because the tumors were in one area.\n\nThis is all great news and I ought to be elated, but I feel strangely down, maybe because I psyched myself up to get through this and have deflated a bit now that the crisis is over.\n\nIt sure is nice to have people to tell who understand what you're saying.\n\nPST - That's good news regarding your staging and classification data! Hopefully you will remain in a stable condition for years to come. To reinforce your urologist's decision to wait for intravescial therapy and monitor your condition, I offer this segment from the NIH National Cancer Institute's discussion on Stage 0 (Ta,N0,M0 and Tis,N0,M0) bladder cancer:\n\n\"Intravesical therapy with thiotepa, mitomycin, doxorubicin, or bacillus Calmette-Guérin (BCG) is most often used in patients with **multiple tumors or recurrent tumors** or as a prophylactic measure in high-risk patients after TUR. Administration of intravesical BCG plus subcutaneous BCG following TUR was compared with TUR alone in patients with Ta and T1 lesions. Treatment with BCG delayed progression to muscle-invasive and/or metastatic disease, improved bladder preservation, and decreased the risk of death from bladder cancer.\"\n\nSource: www.cancer.gov/cancertopics/pdq/treatment/bladder/HealthProfessional/page5.\n\nThe NIH NCI website has lots of information and references on our affliction.\n\nCheers - Maryland Mike\t\t\t", "date": "2011-11-29T18:08:15+00:00", "topic": "My TURBC is over", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello, Alan - just wanted to let you know that after my HoLAP (Holomium Laser Ablation of the Prostate) on 9/30 to widen the path of my ureter through my prostate, I bled for over one month before stopping. My urologist had to wait to start my BCG (Ta, non-invasive with multiple sites) because of that. I'm now rounding 3rd and heading for home on the BCG treatments (two to go), and my urge to urinate is still sudden and strong, but the slight bouts of incontinence I had during the first month are gone. Hang in there - time seems to be a good healer after the reaming of the prostate.\n\nCheers - Maryland Mike\t\t\t", "date": "2011-02-18T04:41:21+00:00", "topic": "Update on me", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJimswife and Alan - I just ran across this post and felt compelled to respond. I didn't realize I had a urinary flow problem for years (as long as I can remember) - all I knew was that when I tinkled in a public restroom, my stream sounded more like a trickle when compared to some of the waterfalls beside me (:<) - I didn't think anything else of it. When I started passing visible blood earlier this year and had a CT, a large (3cm) bladder stone was found. My first cystoscopy showed a very narrow path for the ureter through my prostate, which was obviously restricting my urinary flow and causing incomplete voiding of the bladder. I had a \"trifecta\" (Stone ablation, HoLAP ablation of the prostate, and TURBT) in one OR table visit - and here I am with Ta non-invasive in many places in my bladder. Does the urologist suspect pooling of urine in the bladder for the stone and the carcinoma? \"Quite possible, but not definitive\", he says. I'd like to see a study done to see if urinary restriction over a prolonged time span can cause bladder cancer,\n\nThe best to all - Maryland Mike\t\t\t", "date": "2011-02-18T04:41:21+00:00", "topic": "Update on me", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Mary - welcome to the club! I think it's good your urologist is getting aggressive. BCG is usually quite effective in suppressing our evil affliction - there's lots of literature accessible on the internet attesting to that - in fact, my urologist (37 yrs experience) calls it the \"gold standard\" for treatment of Ta stage carcinoma until something better comes along. I did get a 2nd opinion, and the head of urological oncology at a large, highly-rated hospital agreed totally with my uro's treatment regimen.\n\nI'm just past the middle of my first treatment series (had 4th BCG treatment two days ago). Everyone seems to respond a little differently. I'm reporting on my treatments so all here can see how one patient responds (under thread \"Newbie - just checkin' in...\"). I'm determined to conquer this beast - and my uro (he's from India) says attitude is extremely important in treatment - so keep the faith!\n\nCheers - Maryland Mike\t\t\t", "date": "2011-11-29T13:13:31+00:00", "topic": "First BCG Treatment Today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello, rbmc - I'm also a newbie - did my first post yesterday. It's great to see people coming in. I was recently diagnosed, had my TUR (along with a HoLAP and bladder stone blasting), and now face BCG and who knows where from threre. I really look forward to my time on this forum - thank God for humankind developing the technology for us to communicate like this - and, of course, for the medical procedures to help us overcome.\n\nCheers - Mike\t\t\t", "date": "2011-10-25T23:23:29+00:00", "topic": "The Newbie Lurks, The Newbie Speaks", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWell, folks - after 2 years from my last report, I am STILL CANCER-FREE! I have graduated to once yearly cystoscopies, and I have my next annual one on December 8. I will let you know how it goes. BCG FOREVER! It seemed to work on me so far....\t\t\t", "date": "2011-10-25T13:29:18+00:00", "topic": "Newbie! I\\'m checkin\\' in....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, it's about time I reported on my wonderful progress. I have been clear of tumors in the bladder after two cystoscopies, each three months apart  . I will be getting a cystoscopy every three months twice more, then I go to a six-month schedule. I have NOT had any follow-on maintenance BCG treatments after the initial series of six, as both urologists on my case recommended to \"wait and watch\" due to the low grade of the tumor removed with the diverticulum (via Da Vinci robot) and the tumors resected from my bladder wall. I'm one lucky man, and I urge everyone I discuss my saga with to get to a urologist immediately if they have any symptoms, especially blood in a routine urine sample.\n\nKUDOs to the administrators of this board, and to the patients and victims who so openly discuss their battles with this terrible affliction. Let's all hope and pray that medical science keeps progressing to find more effective weapons against ALL of the thousands of cancer types out there.   ", "date": "2011-10-25T13:29:18+00:00", "topic": "Newbie! I\\'m checkin\\' in....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats from a 2-clear-in-a-rower! Here's hoping we stay that way! My next scope job is in December - I'm counting on it being an early Christmas gift.\n\nCheers - Maryland Mike\t\t\t", "date": "2012-10-09T19:13:14+00:00", "topic": "Wish Me Luck!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats, Doc. I will find out next Wed., 2/1, if I am clear. My intent is to join the \"clear club\" with you!\n\nCheers - Mike\t\t\t", "date": "2012-01-16T19:24:42+00:00", "topic": "checkup", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGREAT NEWS - congratulations! I get my \"look\" on 2/1. I'm doing it as outpatient surgery because my uro wants the Holmium laser available in case he wants to recist anything - and to \"refine\" the prostate ablation he did on 9/28. I'm feeling great, one month after the 6th BCG. Urinary habits are the best I've had in years - I attribute that to the HoLAP. I hope to join you in the \"clear club\" next week!\n\nCheers - Mike\t\t\t", "date": "2012-01-13T23:34:38+00:00", "topic": "Great Update on Friday 13th.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations! You are a role model for me (just had my 6th BCG). May you stay clear forever!\t\t\t", "date": "2011-12-12T15:52:02+00:00", "topic": "All Clear 6 Month Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHmm - maybe there's something to that.....\n\nCheers - Mike\t\t\t", "date": "2012-01-08T14:22:16+00:00", "topic": "MVAC", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tReally pretty, RBMC. The contrails make it look like Mr. Sun is stretching his arms towards us! Hope he's a great healer.....I think he is....\n\nCheers - Maryland Mike\t\t\t", "date": "2011-11-13T14:13:52+00:00", "topic": "Relaxing Sunset Over Lake Michigan", "subforum": "17-chit-chat"}]}