{"signature": ["BCG"], "posts": [{"text": "\n\t\t\t\tSounds like symptoms of prostatitis (happens to me after BCG).  But the doctor has to eliminate all other causes first, as I believe prostatitis is diagnosed by process of elimination.\n\nRoss\t\t\t", "date": "2010-11-11T20:56:14+00:00", "topic": "Side Effects of BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMike and Patrica are both great sources of info and have contributed for a long time.  If they recommend a second opinion, I would follow up.\n\nI echo Pat's comment about sorry that you're here, but glad you found the site so quickly.\n\nRoss\t\t\t", "date": "2010-08-28T20:12:44+00:00", "topic": "Joining a forum I never I dreamed I\\'d be joining", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKimberly,\n\nWelcome.  I like Mike's comment about the cello.  Very tongue in cheek, but he is a longtime contributor, along with a few others, and certainly a fountain of information.  As everyone is saying, there are a lot of success stories here, so stay positive.\n\nRoss\t\t\t", "date": "2010-08-28T20:12:44+00:00", "topic": "Joining a forum I never I dreamed I\\'d be joining", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tvgau,\n\nI think that many people live pretty normal lives (minus the cystos and other treatments).  And superficial is certainly different than invasive.\n\nI was first dx in March 2006 - 1 papillary tumor, non-invasive.  Then had 4 tumors in Sept 2006 and 11 tumors in January 2007 - all probably the result of seeding from the first.  The uro in 2007 did 30 min of mitomycin post TURB and then did a saline flush for 24 hours.  I have had the regular 6 weeks and then quarterly BCGs since, and have been cancer free since.\n\nI exercise regularly, drink moderately (mostly watching sports at a local bar), try to watch what I eat, and do not smoke.  I do take cholesterol medicine and fully expect that something else other than bladder cancer will take me (hopefully many years from now).  The regular check ups actually give me a little piece of mind that if I do have a recurrence, at least I will have caught it as early as possible.\n\nRoss\t\t\t", "date": "2009-12-04T02:00:14+00:00", "topic": "Bladder Cancer History", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPat,\n\nSorry to hear your news about a new cancer.  Your experience here, however, will greatly aid you in your new fight - you certainly know how to find info and are not afraid to seek other opinions.  I am confident that you will beat this new cancer as well.\n\nRoss\t\t\t", "date": "2009-10-20T03:44:20+00:00", "topic": "I guess i\\'ll have to find a new forum", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tVi,\n\nI had a low grade superficial tumor removed via TURBT in March 2006.  By September 2006 I had 4 new tumors - removed by cauterizing.  In October 2006 I moved to a new city and saw a new doctor in December 2006 - had 11 tumors removed, but this time the doctor took out each tumor with appropriate margins for review, instilled mitomycin for 30 min post-op, and left a catheter in with a saline wash for 24 hours; he was very thorough and even though I have had BCG treatments, I think the care he took during that 3rd TURBT is the main reason I have been cancer free since.  That first tumor seeded many tumors afterwards.  I too would recommend a second opinion with someone who sees BC everyday, as it never hurts.\n\nRoss\t\t\t", "date": "2009-10-31T03:00:42+00:00", "topic": "Just starting the journey", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome Steve,\n\nI found the same as you - thinking about the treatment worse than it is.\n\nGood luck with this cancer thing.\n\nRoss\t\t\t", "date": "2009-01-20T01:27:34+00:00", "topic": "I just signed up.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGator,\n\nLooks like you have a lot of good info here.  Several are very knowledgeable about this disease and treatments.  Second opinions always recommended before RC.  From reading here, there are many different reactions to BCG.  Mine was fine for the first 6 and the first maintenance, but then got fevers and severe spasms.  Remember that BCG doses can be diluted if the reaction is too severe (that is what my uro did).  Good luck with your dx and treatment.\n\nRoss\t\t\t", "date": "2008-10-25T23:07:50+00:00", "topic": "bcg how do you feel", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI would have to agree with everyone else here - go through with your scheduled procedure.\n\nRoss\t\t\t", "date": "2008-09-18T14:52:05+00:00", "topic": "A question from tomd", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSteve,\n\nWelcome.  I am sure you have learned that there are many knowledgable people on this forum.  It has been quite a while since I have posted - I got good news in March that I didn't have to return for cysto or BCG until December.  I am almost on a 12 month maintenance regimen now and 4 1/2 years clear of cancer.  It hasn't always been pleasant, but I am happy where I am now.  I hope the news you get as time passes is just as good.\n\nRoss\t\t\t", "date": "2011-04-19T14:11:25+00:00", "topic": "To All on the Board...THANK YOU!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree with many here-thinking about it is worse than the procedure.  I have had cystos with and without the local anesthetic (one uro did bladder washes for FISH and the lidocaine messed the test up).  I would rather have the cysto than the BCG.  Not my favorite procedure, but glad to have the checks every six months.\t\t\t", "date": "2011-01-06T14:07:38+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am recently divorced and have met a wonderful woman.  I believe we are both interested in pursuing this relationship, but I have not told her about having bladder cancer nor about the BCG treatments.  Everything I read has a person who has received BCG being safe 6 weeks after treatment and I am outside of that window by and additional 6 weeks, and not due again until October for another treatment.  Before things proceed further, I am going to talk to her about the treatments so that she can be involved in the decision about how we proceed - TB seems to scare people.\n\nHas anybody else handled this the same or is there any other advice?  Am I over-thinking this and should just say something before the next treatment if we are still together?  I seem to think honesty the best policy, but if there is truly nothing to worry about then why bring it up this early.\n\nThanks for any comments.\n\nRoss\t\t\t", "date": "2010-07-18T07:40:03+00:00", "topic": "BCG and new relationships", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlways good to hear great news.\n\nRoss\t\t\t", "date": "2009-08-08T02:22:29+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI wish you the best - hope it all turns out ok.\n\nRoss\t\t\t", "date": "2009-08-14T09:43:19+00:00", "topic": "ct scan and devasted", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear you are through with the last installment for a while.  Hope your next check goes well.  I contracted prostatitis from BCG treatments - that could cause some pain and burning - requires about 30 days of antibiotics but I felt better after only a couple of days.\n\nBut always bring up any odd pains to your doctor.\n\nRoss\t\t\t", "date": "2009-06-30T22:44:49+00:00", "topic": "BCG #6 complete!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news!  Always glad to have the check up done and over with and have some time before the next BCG!\n\nRoss\t\t\t", "date": "2009-05-25T17:26:20+00:00", "topic": "Cross you fingers....once again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI will answer the first question - I've had 3 TURBTs, biopsies of ureters and prostate, cystos every 3 months for more than 3 years, and 6 weeks + 4 maintenance treatments of BCG.  It has been 2 years since my last TURBT.  I am back to normal as far as frequency and all.  There is hope.\n\nTo the rest, I am sorry to hear about all the trouble with docs and facilities.\n\nRoss\t\t\t", "date": "2009-05-05T11:32:46+00:00", "topic": "A question for our other male members?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNever had a scope with a monitor - all have been with the eyepiece.  I think I read somewhere that there is a particular type of light they can use that lets the doc see better (near UV or something and done in Europe), but I've never had it done that way either.\n\nRoss\t\t\t", "date": "2009-04-29T00:28:46+00:00", "topic": "A Cytoscopy quetstion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlways good to hear good news!\n\nRoss\t\t\t", "date": "2009-04-13T20:01:09+00:00", "topic": "All clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy experience is 4-6 weeks after.  Cystitis or bladder inflammation occurs and you don't want to go through any unnecessary biopsies.\n\nRoss\t\t\t", "date": "2009-03-25T22:11:16+00:00", "topic": "Timing for recheck cysto following BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am on 1/3 dose and still have some effects, but generally gone after 24 hours.  I visited with Dr. Lamm and my doctor follows his protocol.  2 years cancer free so far.\n\nRoss\t\t\t", "date": "2009-03-29T13:21:48+00:00", "topic": "Can I safely skip 6th treatment?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think if your reactions are too bad, Uros sometimes hold off on a treatment, but I do have increasing effects each time I go through the maintenance as well.  Seems to me that doing something (even 5/6) is better than doing nothing.\n\nRoss\t\t\t", "date": "2009-03-29T13:21:48+00:00", "topic": "Can I safely skip 6th treatment?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrom what I have read and experienced, BCG has side effects (in a small number of cases can be serious).  Due to these effects, BCG might not be worth going through for a single tumor, especially if given post-op mytomicin.\n\nHope this helps.\n\nRoss\t\t\t", "date": "2009-03-28T00:03:31+00:00", "topic": "BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree with many of the posts here - I had two recurrences with more tumors each time (total of 16 when all said and done).  Have had 6 week regimen and then have had the maintenance 3 times so far.  I got really bad symptons but do a 1/3 dilution even on the maintenance.  Have been cancer free for 2 years now.\n\nI think the biggest question to ask has to do with progression.  My doctor and I discussed BCG or mitomycin - BCG appears to be better at stemming progression, even if the cancer returns.\n\nJust some food for thought - good luck with your decision.  For me it seemed prudent to \"do something\" to fight this thing - so I go through the regular treatments, even with negative cystos and feeling good most of the time.\n\nRoss\t\t\t", "date": "2009-01-13T15:53:06+00:00", "topic": "Would anyone refuse BCG treatments?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations!  The news we all like to here!\n\nRoss\t\t\t", "date": "2009-01-18T23:14:03+00:00", "topic": "Happy note", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter my initial dx, I had 1 tumor free cysto.  I was back in for 2 turbs at 3 month intervals after my first one.  Since then I have had 1 mitomycin installation and 6 weeks of BCG + 3 maintenance rounds.  In between I have had biopsies of ureters, renal cavities, and prostate - all involving stenting and restenting.  Fortunately, I have been tumor free since January 2007, but I always think the next cysto will reveal a recurrence - especially when I feel twinges every once in a while.\n\nThere is no guarantee that we will not have recurrences, but be safe in the knowledge that the checkups are designed to catch any that do happen.  Which is better, not knowing or catching a recurrence early?  I consider myself lucky that I get a chance to develop a relationship with a doctor who gets to know me as well.  My uro even recommended my current GP to me.  My experience has also taught me to be more empathetic to employees (I am a principal at a middle school and deal with employee relation issues).\n\nMy next cysto is Oct 20 and I have to say I worry as much as the next person.  My BP goes up a notch just sitting in the waiting room, so I cannot say don't worry, but I ultimately know it is all for the best.  I won't ever be worry free, but will approach each visit in stride - I already know what will happen if I do get a recurrence and know where to get info/second opinion if there is a progression (hope this doesn't happen).  Inbetween cystos, I live like I didn't have cancer.\n\nHope this helps.\n\nRoss\t\t\t", "date": "2008-10-10T16:15:01+00:00", "topic": "Worried about recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear the good news on the cystos.\n\nRoss\t\t\t", "date": "2008-10-20T22:29:10+00:00", "topic": "Good News &amp;amp; Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoes your uro do a bladder wash for FISH or does he use the voided sample?  Don't know if there is a difference in sensitivity, but my uro always does a bladder wash at the time of the cysto - which means no numbing gel  \n\nMaybe worth checking into.\n\nRoss\t\t\t", "date": "2008-10-10T19:52:31+00:00", "topic": "Squamous Cells", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne,\n\nSorry I am posting this a little late.  I had little reaction to the first couple of doses, then started to get hit a little harder - fever, bad bladder spasms, achy, etc.  After I visited Dr. Lamm he recommended a fraction of a dose and have had better treatments.  Doesn't hurt to get a second opinion on the protocol - my uro even recommended it to me.\n\nRoss\t\t\t", "date": "2008-09-24T16:28:11+00:00", "topic": "Symptoms of BCG reactions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid,\n\nI am so glad to hear your good news - what a relief! Especially at this very special time of year.\n\nMy uro has spaced my FISH test away from the BCG - we do the cysto and FISH a week or so before the BCG instead of doing each a week or two weeks after.  I have gotten good results this way and the BCG inflames the bladder and can mess up the FISH.\n\nI hope your future results are just as good as this.\n\nRoss\t\t\t", "date": "2008-09-25T16:20:26+00:00", "topic": "Just back from cysto...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am the opposite - I would rather have the drill.\n\nRoss\t\t\t", "date": "2008-09-15T20:30:01+00:00", "topic": "Whew!! Good News :)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary,  Thanks for answering the FISH question.  I do not get on as often as in the past - new job eats up a lot of time.\n\nDavid, The FISH test looks for abnormal chromosomal markers from cells in the bladder.  FISH can be done on voided samples, but my uro does a bladder wash through the cystoscope.  I have had positive results from the bladder and from the ureters, but visual inspection have all been negative.  Since then I have seen Dr. Lamm (I live close to Phoenix) and learned that false positives sometimes happen right after BCG, especially after the first 6 weeks of treatment.  All of my FISH results since last summer have been negative.\n\nRoss\t\t\t", "date": "2008-08-17T15:14:03+00:00", "topic": "whew! finally ! and a question for all", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations on your good news.  I have been almost 20 months cancer free.  I had 1 tumor removed in March of 2006, then had a clean cysto in June.  Thought everything was ok until checkup in September 2006 and had 4 tumors removed.  Moved to a different city in October 2006 and first cysto with new doctor revealed 11 tumors - seems I had a little seeding going on.  The new doc removed the tumors, instilled mitomycin after Turb and we started BCG maintenance.  Have not had any tumors since Jan 07, but have had some biopsies due to pos FISH - which we found out could be caused by the BCG therapy (as per Dr. Lamm).  I was never a smoker, but had exposure to aniline in college as a chemistry major - so really have not had much of a lifestyle change except to pay attention to eating more fruits and vegetables and drinking more water.\n\nIf someone had told me 10 years ago about all the cystos and catheters I would have said, \"not for me!!!\"  But now I am glad for all the checkups so at least this disease won't sneak up on me.\n\nRoss\t\t\t", "date": "2008-08-17T15:14:03+00:00", "topic": "whew! finally ! and a question for all", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNancy,\n\nAfter my BCG instillations I do have sloughed off material for a couple of days - not sure if 3-4 weeks is normal, but could still be part of the immune response.  I would ask the doctor.\n\nRoss\t\t\t", "date": "2008-06-20T16:43:25+00:00", "topic": "debris  after BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSusant,\n\nThinking about it is always worse than the whole procedure for me.  I have had 3 TURBTs, an additional 3 biopsies, and 6 weeks + 2 maintenance treatments of BCG.  So far so good for me, and I would rather do the BCG than the TURBTs or cystos.  Don't just think about recurrence, but also consider progression - I think that BCG has a good track record.  I do not claim to be a doctor, however, so please consider your doctor's advice when making a decision of this magnitude.\n\nRoss\t\t\t", "date": "2008-06-05T14:17:15+00:00", "topic": "I might not do it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBlai,\n\nI did not have BCG until after my 3rd turbt.  Didn't even have post-op mitomycin until that 3rd trip.  I have been clean since.  I agree with everyone else that if the tumor was single, small, papillary, noninvasive then you are probably ok with watchful waiting.\n\nRoss\t\t\t", "date": "2008-05-21T12:54:49+00:00", "topic": "dxd w/ noninvasive low grade bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid,\n\nVery glad to hear the good news.\n\nRoss\t\t\t", "date": "2008-03-05T21:55:16+00:00", "topic": "Cystectomy Needed for Recurrences of TA, CIS Non-Invasive BLC?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRocky,\n\nThat is a good question to ask the doctors at Johns Hopkins.  Sorry to hear that both of you are going through treatments at the same time.  Good luck to you both.\n\nRoss\t\t\t", "date": "2008-04-09T03:22:48+00:00", "topic": "bcg", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSlab,\n\nAs you can see, everyone is different.  If the side-effects are too debilitating, they can reduce dose or hold time.  I think the idea is to have a reaction, but not one so bad that knocks you out.  Good luck - I have found that thinking about all the treatments and TURBTs has always been worse than the actual event.  My hospital actually does these treatments on Saturdays - don't miss work and usually takes an afternoon to recover.  I would plan on too much for the rest of the day of a treatment.  My last 2 cystos were clear and at the last one, my doctor told me my bladder looked like it never had cancer - so in that regard I have had a positive experience.\n\nHope this helps.\n\nRoss\t\t\t", "date": "2008-04-08T04:23:47+00:00", "topic": "BCG Treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tConnie,\n\nI think only biopsy will tell for sure, but I did have some granulomas at the tumor healing sites after the initial 6 week BCG treatments - showed up as little red spots.\n\nRoss\t\t\t", "date": "2008-04-09T03:28:09+00:00", "topic": "tiny suspicious spot", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDitto to everyone's advice - get a second opinion about your concerns from pathology and cystos, as well as the treatment protocol.\n\nRoss\t\t\t", "date": "2008-04-03T17:24:19+00:00", "topic": "Should I seek a Second Opinion?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSimon,\n\nDid my first six on Wednesdays late in the day and was fine for work the next day.  I found out that they do treatments on Saturdays and so I go in for maintenance on Sat mornings and am fine for Sunday.  But make sure to have a dedicated toilet with plenty of bleach.  I think that thinking about the treatment has been far worse than the procedure itself.\n\nRoss\t\t\t", "date": "2008-02-16T21:12:44+00:00", "topic": "BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree - my urologist referred me to a MD Anderson-trained oncologist for bcg, but after my consultation, he sent me back to the urologist for the bcg treatments - he told me that my type of treatment was usually done by a urologist.  He and my urologist discussed how to set up the treatments at a local hospital so they did not have to be done in the urologist's small office.\n\nRoss\t\t\t", "date": "2008-02-15T21:49:14+00:00", "topic": "It's back....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRollin,\n\nWe all get nervous at peek and poke time.  I have been cancer free for a year and have my next checkup on 2/12 - still get nervous.  Your doctor was right - it was a good diagnosis, but still doesn't alleviate the fears.  Chances are small for progression and if you have recurrence at least you know what the procedure will be - more of a nuisance than anything.  Good luck on 2/25.\n\nRoss\t\t\t", "date": "2008-01-07T21:22:14+00:00", "topic": "Nervous", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nDid you have a regular prostate exam before the BCG?  Does your urologist feel any nodules now?  My psa was normal before BCG then went up.  I had no nodules before BCG, but had one form after.  I also had a positive FISH test, but negative cysto.  The recommendation was to eliminate any other forms of cancer, so I went ahead with a biopsy, which was negative (in addition to the ureters and renal cavities).  The prostate biopsy for me was not any worse than a TURB.  I am on maintenance BCG and my psa has been dropping since that first high mark.  My urologist believes it is non-symptomatic prostitis.  I hope this information helps you make a decision or at least gives you some other questions to ask.\n\nRoss\t\t\t", "date": "2008-02-02T18:59:13+00:00", "topic": "High PSA/Prostate Biopsy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nAfter BCG my psa also increased.  We are tracking the trend in psa values versus the BCG.  It was highest right after the initial 6 weeks, but has decreased since being on maintenance.  I developed nodules (prostitis?) after the initial BCG and had them biopsied just to be sure (due to a positive FISH also) it was not cancer - it wasn't.\n\nRoss\t\t\t", "date": "2008-01-28T03:31:37+00:00", "topic": "Cysto Clean-Two Years Without Recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlways a good feeling.  Congrats\n\nRoss\t\t\t", "date": "2008-01-11T16:20:24+00:00", "topic": "1st Cystoscope Clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSally,\n\nMy second TURBT I believe they used a heated filament - the uro said the tumors \"exploded\" when touched by the filament.  No mitomycin given at that time.\n\nRoss\t\t\t", "date": "2008-01-07T13:26:42+00:00", "topic": "TURBT Tomorrow", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGregg,\n\nHave you had any urine cytologies?  A FISH test?  CT scan?  Some otc pain medications act as blood thinners and may cause some bleeding at the scar site if you take them regularly.  Hopefully your doctor is right, but the protocol for cystos is every 3 months because of the possibility of recurrence.\n\nI agree with Gene, to start with the urine tests if you still have bleeding.\n\nRoss\t\t\t", "date": "2008-01-09T03:35:23+00:00", "topic": "Blood in urine after jogging", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSol,\n\nGood luck with the biopsies.  As you can tell, everyone has their own experiences with this disease.  I think it is great that there is a forum like this so that we can all connect and share - good place to start for any treatment option.  My cancer was TaG1 and recurred twice before I had any post-op mitomycin and BCG treatment.  I also had red spots after the BCG - all negative on biopsies.\n\nI hope you don't have to make a decision about your bladder, but always keep second opinions in mind and visit the \"invasive\" portion of this forum for info about RC's.\n\nRoss\n\n\n\n", "date": "2008-01-01T05:51:34+00:00", "topic": "37 year old desperately trying to save bladder", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPotter,\n\nI had what I think the doctor told me were \"calcified\" deposits on the former tumor sites at my first cysto following TURBT.  My cytology results also came back positive at that time combined with a high PSA test, so I underwent three additional surgeries taking visual and/or biopsies from former sites, as well as the ureters, renal pelvises, and prostate.  I cannot say for sure that he was concerned with just the deposits, nor can I say that I would have had any additional surgeries/treatments without the positive cytology/high PSA.\n\n(Subsequently, all visuals/biopsies and most recent voided FISH and cysto all negative.)\n\nI looked at any additional follow-up procedures as insurance to make sure I still didn't have cancer (or if I did, I was hopefully catching it early).\n\nRoss\t\t\t", "date": "2008-01-05T16:36:07+00:00", "topic": "Debris crystalised on  resection site of BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSol,\n\nI read one of your other posts and responded.  It looks like you are getting good advice.  Glad to see that you are seeking out as much info as possible.\n\nMy doctor has urged me to get a second opinion and has referred me to Dr. Lamm.  I live in the southwest and I am fortunate that I don't have to travel too far.\n\nRoss\t\t\t", "date": "2008-01-01T20:07:13+00:00", "topic": "Advice I received from the great Dr. lamn", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid,\n\nI had a prostate biopsy done last summer and I was told I could see blood for up to 6 weeks.  My guess is that removal of part of the prostate would lead to a similar recovery - again, just guessing because I am not in the medical field.\n\nMerry Christmas to all,\n\nRoss\t\t\t", "date": "2007-12-16T02:06:20+00:00", "topic": "Blood &amp;amp;amp; clots in the urine", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMax,\n\nMy first uro used the term \"nuisance tumors\" all the time - superficial and just a nuisance to have to go through with TURBT's to remove them.  They always seem to pop up at the most inopportune times as well.\n\nRoss\t\t\t", "date": "2007-12-19T21:23:40+00:00", "topic": "Bad news today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations! It is always great to get good news.\t\t\t", "date": "2007-12-08T01:45:56+00:00", "topic": "9TH SCOPE AFTER  22 MONTHS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrom what I've read I don't believe the severity of side effects are an indication of effectiveness either.  If you look at the protocols, it is even recommended to dilute the BCG if the side effects are bad - I think the idea is just to stimulate the immune response, not debilitate the patient.\n\nRoss\t\t\t", "date": "2007-12-07T18:47:38+00:00", "topic": "Side effects  from BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPotter,\n\nI had a neg cysto 3 months after my first TURB, but went positive for the next two (two more TURBS).  I have had 3 neg cystos since my last TURB, but had pos cytology - haven't found any other cancer.  I am fortunate that my tumors have all been superficial TaG1 papillary tumors (5-10% chance of progression to more invasive) and I am doing BCG, which I hope helps as well.\n\nI like Rosemary's post with the calculator (but I haven't tried it).  Personally, I am just aiming for the 2 year neg mark to go to 6 month check-ups.  I take it 3 months at a time, stay positive, and try not to focus on the smaller progression statistics for my type of cancer.\n\nHope this helps and that all goes well with your scheduled cysto.\n\nRoss\t\t\t", "date": "2007-11-27T18:49:30+00:00", "topic": "Cystos as predictors of recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDuane,\n\nI am sorry to hear about your previous TURBs.  My experiences have been very different, so I would be of little help.  Have you looked through the posts in the invasive bc section - next section after superficial?  Many of the people there have had RC's and might be able to share their experiences and help you with questions to ask your uro.  Or they might suggest where to go to get a second opinion.\n\nRoss\t\t\t", "date": "2007-11-26T19:07:38+00:00", "topic": "Found cancer at ureter opening", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis is a good place to post - lots of caring and knowledgeable people here.\n\nWhen I begin to think too much of the cancer, I usually visit this site.  Right now I feel fortunate that I am in the superficial category.  But there isn't a day that goes by that I wish I could turn the clock back and eliminate some of the risk factors for this disease - exposure to aniline as a chem major in college and working in the metallurgy field for 3 years.  But I have learned to live with the fact of check ups and what positive results might mean.  I even found that I was happy when I realized that the local hospital does BCG treatments on Saturdays - not as much missed time from work.  I also have a loving wife who has taken care of me through everything.  She reminds me how lucky I am.\n\nI agree with the responses here that you keep your chin up and take care of yourself every day.  Stay informed, read what others have to say about their similar situations, and keep posting.\n", "date": "2007-11-17T15:45:34+00:00", "topic": "New to this", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon,\n\nGood luck with the FISH on Monday and any decision you have to make regarding your situation - I know how difficult it is.  I had a neg cysto and pos FISH.  Lab documentation recommended looking for cancer elsewhere.  I had previously had the IVP's and CT scans for the upper UT and all were negative.  However, I followed doctor's advice to get biopsies from kidneys, ureters, and prostate (all negative also).  Everything took about 5 weeks to complete and I only missed about 5 days of work during the entire period.  Thinking about the procedures was definitely worse than the procedures themselves.\n\nMy advice is to just do your research and make a decision that is good for you - when you look back you don't want to have any regrets about anything you did or didn't do.  It seems like everyone's experience is a little different.\n\nMoreover, when I was trying to decide on mitomycin or BCG, I read somewhere that mitomycin should not be used in the absence of cancer.  Probably a good decision to hold off here (plus there are some possible negative side effects).\n\nHope this helps and that all of your tests return negative - it will certainly make your choices easier.\n", "date": "2007-11-08T03:26:02+00:00", "topic": "Abnormal cells", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the info.  I am going to keep my fingers crossed that the maintenance BCG will reduce the possibility of recurrence.\t\t\t", "date": "2007-10-25T04:04:17+00:00", "topic": "Background and FISH", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis is the first time I have posted on this website, but have mined it for useful information.  I was originally diagnosed in March 2006 (in a large urban setting with a good cancer center) and had 1 tumor removed - Ta,G1.  First cysto 3 months later was negative.  I then accepted a new job in a medium sized city 400 miles away from another large urban area (and another good cancer center).  Just before leaving my last job in Sep 06, I had a positive cysto (surprise! 4 tumors) and my doctor was kind enough to perform a TURBT before I left my previous position.  I arranged an appointment with a urologist in my new city as soon as my new insurance kicked in (60 days - I took the chance without COBRA - last time I do this) and did not miss a 3 month check up.  A cysto revealed more tumors.  My urologist confided that he did not see bladder cancer too frequently in this part of the US, but assured me he had worked in larger urban areas.  I had 11 tumors removed in Jan 07, post-TURBT MMC (for the first time) and have undergone 6 weeks of BCG.\n\nAt my first cysto (negative) after BCG my doctor took a FISH sample, which came back positive.  Since then I have had biopsies on prostate, ureters, and renal cavities - all negative.  My doctor does not know what to think and my research suggests to trust the cystos at this point.  I am also on a maintenance BCG protocol.  I trust my doctor and I have not had any second opinions - although my doctor works in the same office as his wife (also a urologist), thus, I get 2 for 1.  Has anyone else had experience with positive FISH results and negative cystos?\t\t\t", "date": "2007-10-25T04:04:17+00:00", "topic": "Background and FISH", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust in case you are still watching your original post - I always think of the time in between cystos as my time without cancer - so I don't give it much thought.  I also bike a lot.\t\t\t", "date": "2007-10-17T21:26:48+00:00", "topic": "First 6 BCG instillations done, now what?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTommy,\n\nI also had a spike in psa after bcg (lots of acronyms) along with a questionable nodule in prostate that I did not have prior to bcg.  I went ahead with the biopsies (I also had a positive FISH) and everything was normal.  My psa has since decreased, but not at an alarming rate.  I also developed flank pain after all the biopsies and bcg.  Apparently bcg can cause positive FISH, elevated psa and flank pain (cystitis in the kidneys?).  I had heard about the elevated psa, but did not realize the others.  We all respond differently I guess.  I have since had a negative FISH, 2 negative cystos, and get to postpone my next bcg until June.\n\nGood luck with any decision you have to make.  Just to let you know, the prostate biopsy was not any worse than a TURB for me - at least you know what to expect.  I hope everything turns out all right.\n\nRoss\t\t\t", "date": "2008-03-13T14:14:35+00:00", "topic": "New Problem", "subforum": "6-men-and-bladder-cancer"}]}