{"signature": ["Dx", "BCG"], "posts": [{"text": "\n\t\t\t\tThanks Sara Anne,\nMy Uro purposely waited 3 months after completing my 6-wk BCG course to do the cysto in order to reduce the risk of BCG inflammation confounding the results of the cysto.   Hopefully it is BCG cystitis as you describe.   What remains unclear to me is when is the BCG considered a failure, and it's time to pull the trigger on the RC?\t\t\t", "date": "2016-07-11T16:52:18+00:00", "topic": "First Follow-up Cysto...Red Spots or CIS?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Friends,\nDiagnosed at T1/CIS back in January, and today just had my first follow up cysto after completing the initial 6-wk BCG induction series in early Apr.  Uro pointed out several red spots in my bladder on the cysto monitor and wants to schedule another visit to take biopsies.   Hopefully the red spots are just continuing BCG inflammation, but if they turn out to be CIS,  what are the recommendations?   I would think at least another round of the BCG would be in order before classifying this as a BCG failure.   I expect my Uro will again recommend an RC.  Thoughts?\t\t\t", "date": "2016-07-11T16:52:18+00:00", "topic": "First Follow-up Cysto...Red Spots or CIS?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm in a similar boat.  Finished my initial 6-wk course in early Apr and still have some mild cramping almost 8 wks later.  I'm hoping of course it's my immune system attacking the cancer.   Will find out in July when my follow-up cysto is scheduled.   For now I'm enjoying the 3-month reprieve before \"Judgement Day.\"   Best wishes for a positive outcome to you!\t\t\t", "date": "2016-05-27T02:39:06+00:00", "topic": "Discomfort post BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Alan,\n\nSure hope I can look back 8 yrs too...congrats to you and Sara Anne!   Just wondering if the side effects (mostly fatigue and fuzzy brain) can linger on for several more weeks or months?   Of course, the fuzzy brain could just be the onset of Alzheimers I suppose, ha, ha!   If the side effects do become problematic, I'll certainly contact my Uro.  Thanks again!\n\n- Mike\t\t\t", "date": "2016-04-21T01:43:03+00:00", "topic": "BCG Side Effects - How Long?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Friends,\nFinished up my initial 6-wk BCG induction course 2 weeks ago, and was wondering how long should I expect the side effects to linger long-term?   Specifically...fatigue, frequency/urgency, mild burning and mild cramping?\t\t\t", "date": "2016-04-21T01:43:03+00:00", "topic": "BCG Side Effects - How Long?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Everyone,\n\nFinished my 6th BCG treatment last week for the initial induction course and called my Urologist's office about scheduling the follow-up cystoscopy.   The nurse called back saying the doc wants to wait 3 months before doing the cysto to ensure the bladder is completely healed up from the BCG.   She said if it looks good, then the doc will start me on the 3-wk BCG maintenance program.\n\nWhile I'm in no hurry to have another cystoscopy, was wondering if the 3 month wait was too long for my T1HG/CIS diagnosis?  Thoughts?\t\t\t", "date": "2016-04-12T18:43:43+00:00", "topic": "Cysto after BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJosh,\n\nAlways disturbing when there appears to be a disconnect among medical staff.  My military Uro goes with 6 wks after TURBT to begin BCG.   However, Dr Lamm, considered one of the authorities on BCG, indicates 2-3 wks after surgery on his webpage.   Whole point is to give your bladder a chance to fully heal from any tumor resection and/or biopsies before exposing it to BCG.   I believe you'll find the timeframe all over the map, but suspect 4-6 wks seems the norm for many...kind of depends on the extent of your surgery.\t\t\t", "date": "2016-03-31T21:54:41+00:00", "topic": "Nurse Dissented against Doctor, Confusion ensues..", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Alan,\n\nAppreciate the positive outlook and information.  Yes, hopefully the BCG will do the trick, and I can continue to kick the proverbial can down the road...indefinitely!\t\t\t", "date": "2016-03-28T05:51:46+00:00", "topic": "CIS Progression Timeframe", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey Friends,\n\nUro says I'm T1 with CIS.  Have currently completed 4 of 6 BCG treatments of the initial induction course with a cysto scheduled in May.   Trying to determine how quickly CIS can progress to \"invasive\" if the BCG fails, and will there be sufficient time for the dreaded RC.  Googled it, and all I could find were words like...\"CIS can spread or progress quickly to invasive\", but no timeframes given.   Are we talking about a matter of a few weeks or several months, etc...or is this the big unknown?   Does anyone have any more definitive information or can point me in the right direction?  Thanks!\t\t\t", "date": "2016-03-28T05:51:46+00:00", "topic": "CIS Progression Timeframe", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWhat you described is normal...had the same concerns initially.  Laying on your back or side should be fine...just remember to keep the bag below your bladder.   I actually kept the larger bag on during the day if I wasn't going outside since you don't have to empty it as often.   Attached it to a small rolling rack for carry-on luggage...worked great!   Get some rest!\t\t\t", "date": "2016-03-22T02:48:59+00:00", "topic": "New here", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDakota,\n\nSo sorry to hear you're going thru this at such an early age.   Mine is a male perspective.\n\nRegarding the catheter, I've had two TURBT surgeries since Dec 15 and had a catheter both times.   First time was for 12 days and second was for 3.   Hopefully they gave you a day bag (to wear on your leg with a velcrow strap...to keep the catheter in place) and a larger bag for night (hang on the side of your bed or place in a small waste paper can...hang inside the can off the side) so you can sleep the entire night without getting up to change your bag).    I usually wore lose fitting clothing...sweat pants (outside)  and gym shorts or pjs (inside your home).   Getting up and walking around is important also...hopefully your post-op instructions addressed this.   YouTube has various videos regarding how to use the Foley catheter.\n\nBest advice is to relax and take it one day at a time.   Your pathology report will determine the way ahead.    Wishing you the best!\t\t\t", "date": "2016-03-22T02:48:59+00:00", "topic": "New here", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSara Anne,\n\nAfter BCG treatment, how is CIS confirmed as present or absent...cysto visual alone or cysto  followed by TURBT biopsies?\t\t\t", "date": "2016-02-23T02:49:54+00:00", "topic": "Path Rpt - Definitive Invasion is not identified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYour points are well taken Sara Anne.   Treatment would remain the same for Ta/CIS and T1/CIS most likely.   Interesting however that my Uro wanted to yank my bladder following a round of chemotherapy as his first recommended choice of treatment.\n\nBegin BCG next week, so wish me luck!\n\nThanks!\t\t\t", "date": "2016-02-23T02:49:54+00:00", "topic": "Path Rpt - Definitive Invasion is not identified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Friends,\nHad subject phrase in both pathology reports from my 1st and 2nd TURBT procedures, plus the phrase \"the muscularity propria is present  and not involved\".  However, my Uro still considers my cancer to be T1.  Seems to me it should be Ta.   What am I missing?  Was wondering if anyone had the subject phrase in their pathology rpt and were diagnosed as T1 or Ta?   Thoughts?\t\t\t", "date": "2016-02-23T02:49:54+00:00", "topic": "Path Rpt - Definitive Invasion is not identified", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you Lillian,\n\nGlad to hear your success with both the Oncovite and BCG treatments.   I'm taking 2 Oncovite tabs per day now and begin my 6-wk BCG induction this time next week.    Hopefully they'll do the trick for me also.   Best of luck and hoping for a good outcome on your cysto next month!\n\n- Mike\t\t\t", "date": "2016-02-20T05:27:42+00:00", "topic": "Oncovite Experience", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Anita,\nIs Doug taking the high-dosage (4 per day) or just one per day?   The Oncovite bottle says one capsule per day, whereas Dr Lamm recommends taking 4 capsules per day.   As Sara Anne indicated, the Oncovite is expensive...$27 for 100 capsules.\n\n- Mike\t\t\t", "date": "2016-02-20T05:27:42+00:00", "topic": "Oncovite Experience", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tA one-hour intravesical treatment (confined to the bladder and instilled via a catheter) of gemcitabine or mitomycin chemotherapy is common at the end of the TURBT surgery to destroy any cancer cells still remaining.   When there is a shortage of BCG at your treatment location, gemcitabine may be offered as a substitute for weekly immunotherapy treatment.   BCG is normally used for only high-grade, non-invasive muscle disease (TA, T1 and CIS).   Not clear on your hair loss question.\t\t\t", "date": "2019-09-08T18:58:54+00:00", "topic": "Gemcitabine Regimen", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Arthur,\n\nWill be receiving my 22nd BCG instillation next week also.    Receive the instillation at the clinic, and then my wife drives us home...about a 45 min drive.  Have completed the 2-hr hold period without too much difficulty.   My approach...only drink water the evening before the treatment and then nothing to eat or drink after midnight.    Also, lay flat on the floor (I use a yoga mat)...15 mins on back, 15 mins on each side, and 15 mins on stomach (watch Netflix on my iPad).  You’ll be fine.\n\nBest wishes!\t\t\t", "date": "2018-02-15T00:31:35+00:00", "topic": "1st BCG Treatment Advice", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Friends,\nJust completed my 3rd BCG maintenance course (#21) only to learn from my Uro there is an apparent shortage of BCG.   Has anyone else heard this and if so, do you have any further information?  I've read there is only one maker in the US...Merck, and the other source, Sanofi, in Canada no longer produces BCG.  Thanks!\t\t\t", "date": "2017-09-27T01:43:56+00:00", "topic": "BCG Shortage?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Friends,\nTrying to decide if I go with \"local standby (Monitored Anesthesia Care)\" or insist on general anesthesia for an upcoming Bluelight Cysview Cystoscopy procedure to include several biopsies?   Has anyone had this procedure with the local standby MAC anesthesia and if so, how was the experience?   Thanks.\t\t\t", "date": "2016-12-01T20:16:32+00:00", "topic": "Anesthesia for Bluelight Cysto/Biopsies", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Friends,\nHad focal CIS recurrence after first 6-wk BCG, so opted for 2nd 6-wk induction.  Today had cysto at UT MED CTRC (NCI hosp) with new urologic oncologist who gave me an all clear...no evidence of disease!   Will begin 3-wk maintenance BCG next week following the SWOG protocol.   Will also begin participation in a Rapamycin clinical trial designed to boost the effectiveness of BCG.    With CIS, I know I'm not out the woods by a long shot, but for now I'm happy just dancing around the fire as long as practical.\t\t\t", "date": "2016-11-09T22:19:06+00:00", "topic": "NED!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou're right, the CIS could just be persistent, not recurrent.   Not sure in my case what that means in terms of treatment decisions.\n\nAnd will keep fingers crossed that you never have a recurrence!   Thanks again Sara Anne.\n\nBest,\n-Mike\t\t\t", "date": "2016-08-19T04:31:03+00:00", "topic": "BCG and Cystitis Cystica", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Sara Anne,\nSince I continue to have CIS, was hoping to get the ball rolling with either a second 6-wk BCG induction or beginning 3-wk BCG maintenance, and didn't know if the cystitis delay would be a huge impact.   Did you have any CIS recurrence?\n- Mike\t\t\t", "date": "2016-08-19T04:31:03+00:00", "topic": "BCG and Cystitis Cystica", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Friends,\nRecently received multi-biopsy path report showing one tissue sample with Cystitis Cystica.   Suspect this may be result of 6-wk BCG induction.  Was wondering if further BCG treatment is usually given with Cystitis or delayed?  One other biopsy revealed \"focal\" CIS which I presume means one spot only.   Meet with my Uro next week to discuss path report and way ahead.   Am hoping to complete at least one 3-wk maintenance BCG course before the next Cysto.  Thanks.\t\t\t", "date": "2016-08-19T04:31:03+00:00", "topic": "BCG and Cystitis Cystica", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Alan,\n\nInterestingly, the CTRC has an MD Anderson-trained bladder cancer specialist here in San Antonio...Dr Robert Svatek.   I plan to seek a 2nd opinion from him, but not sure if Tricare will cover the cost.  I'll just cover it myself if necessary.\n\nAlmost like a \"catch-22\"...requested a 2nd opinion referral earlier through my PCM (Primary Care Mgr), and it went straight to the BAMC Urology Dept where I'm being treated now.   Apparently under Tricare I can only get a referral to MD Anderson or the CTRC (or anywhere for that matter) if the level of medical service required is deemed beyond the availability or scope of BAMC.   This applies to 2nd opinions on diagnosis, treatment, pathology and surgery.   BAMC believes they can cover all those areas.   Not sure how many RCs are performed at BAMC, but suspect it's not as many as an NCI designated hospital.   That's why I was hoping to hold out until next year when I turn 65 and can go on Medicare.   Then going to MD Anderson or CTRC wouldn't be a problem.\t\t\t", "date": "2016-08-16T00:24:31+00:00", "topic": "CIS Remains After 6-Wk BCG Induction", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Jack,\n\nYes, our paths seem very much alike as do our treatment approaches.    Thanks for the two articles, and you're absolutely right...a tough decision...choose pre-emptive RC now or continue to \"dance around the fire\".    I'm hoping one more 6-wk BCG course (with perhaps interferon added) will produce NED, before the \"cat gets out of the bag.\"\n\nBest wishes,\nMike\t\t\t", "date": "2016-08-16T00:24:31+00:00", "topic": "CIS Remains After 6-Wk BCG Induction", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Sara Anne.\nAs a military retiree, I'm being treated at Brooks Army Medical Ctr in San Antonio under Tricare (Humana).   Scheduled to meet Urology Dept resident next week to discuss path rpt and way ahead.  My staff urologist has been recommending RC since day one.    Will discuss possibility of one more 6-wk BCG induction course with interferon as you mentioned.   Will also discuss getting a 2nd opinion from the NCI designated CTRC here in San Antonio.    Would have already been seeking treatment at the CTRC, but Tricare requires you seek care at military facilities first (if capable of providing the medical service needed).   Was hoping I could kick the can down the road at least until next year when I turn 65 and go on Medicare.  Then I could seek care at the CTRC with no problem.\t\t\t", "date": "2016-08-16T00:24:31+00:00", "topic": "CIS Remains After 6-Wk BCG Induction", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you MadLove,\nGlad to see your husband is doing well...best wishes for continued success!\n- Mike\t\t\t", "date": "2016-02-17T06:15:44+00:00", "topic": "Begin BCG in 2 wks and have some questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Friends,\n\nMy Uro agreed to begin initial 6-wk BCG induction on 2 Mar.   Had some questions for those who \"have been there, done that\":\n\n1). Understand a urine sample is required before each instillation to check for infection.    However, I also understand you are to refrain from drinking for several hours prior in order to more easily retain the BCG.   This would seem problematic (no fluid intake = no urine)?\n2). How long does the BCG stay in your system...is it believed to be completely voided out by the 6 hr point (stop bleach treatment in toilet) or does it remain longer, and if so, how long?\n3). How soon after completion of the 6-wk BCG cycle is the cystoscopy normally?\n\nAny advice (personal tips or patient instruction sheets) regarding preparation before, during, and after each daily treatment would be greatly appreciated.\nBest regards,\n- Mike\t\t\t", "date": "2016-02-17T06:15:44+00:00", "topic": "Begin BCG in 2 wks and have some questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Sara Anne,\n\nExcellent point...the Mitomycin was a one-time treatment after both the 1st and 2nd TURBTs.     I note you've had success with BCG treatment for CIS which gives me hope.   I'm resolved to fight this, pursue the BCG treatment, and avoid the RC as long as feasible.   Appreciate your comments and support very much.\n\nRegards,\n\n- Mike\t\t\t", "date": "2016-01-20T10:53:41+00:00", "topic": "BCG or Cystectomy?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Alan,\n\nBelieve my Uro is concerned that despite intravesical Mitomycin following the first TURBT, the original Ta tumor restaged up as T1, plus CIS is now present after the 2nd TURBT.    Since now being diagnosed as T1, CIS (after Mitomycin),  he thought the timeframe w/BCG treatment might be too risky, because if it did not work, with CIS the probability of metastasis is too great.   Said CIS doesn't necessarily follow at T1,T2,T3 straight linear progression...but can leap to T4 very rapidly.      In any case, sincerely appreciate your comments and support!\t\t\t", "date": "2016-01-20T10:53:41+00:00", "topic": "BCG or Cystectomy?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Friends,\n\nJust an update.   Met with military Uro today at BAMC to discuss pathology rpt and treatment options.    Path report revealed T1 and CIS.    Uro still recommends RC for best probability of survival, and believes BCG (in my case) is a big gamble.    Supports pursuing second opinion, so this is my current approach.   From the forum's \"treatment center finder\", will check with CTRC in San Antonio and possibly MD Anderson in Houston...both are under UT Health Science.\n\nSincerely appreciate everyone's counsel, advice and wisdom.\n\nRegards,\n\nMike\t\t\t", "date": "2016-01-20T10:53:41+00:00", "topic": "BCG or Cystectomy?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Anthony,\n\nGlad you found Steve's blog helpful and best of luck on your post-BCG cysto next week!\n\nKeep em flyin!\n\nRegards,\n\nMike\t\t\t", "date": "2016-01-02T00:45:10+00:00", "topic": "Alkalinity", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnthony,\n\nYou might look at Steve Kelley's blog, \"Got Bladder Cancer\", for discussion of the Alkalinity question.  He talks about a checking your PH daily and taking baking soda to achieve and maintain a certain alkaline level to help thwart the cancer cells.   I was just diagnosed with CIS and plan to explore the baking soda as an additional weapon in the cancer fight along with BCG treatment.\n\n- Mike\t\t\t", "date": "2016-01-02T00:45:10+00:00", "topic": "Alkalinity", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWas wondering what to expect for chemotherapy followed by radical cystectomy?\t\t\t", "date": "2020-02-28T15:35:52+00:00", "topic": "Expectations for Chemotherapy and RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Friends,\nBeen dancing around the fire trying to save my bladder since Dec 2015 treating HG TA and CIS with BCG.  Had HG TA recurrence about a year ago.  Along with it a second primary urothelial HG TA/CIS cancer in my right renal pelvis and ureter, and so right kidney and ureter removed.   One year later after two more BCG maintenance cycles, the path report revealed invasive HG urothelial carcinoma in the prostatic fibromuscular stroma (pT2)...a third primary urothelial cancer!      Uro called with the path results and indicated chemo followed by RC is his early recommendation.   Haven’t yet been able to have a comprehensive conversation with him about the way ahead but scheduled for first available office appt in 3  weeks.   He referred me to a medical oncologist who I will meet that same day to discuss the chemo I suspect.   So right now a little shell-shocked!   Was hoping to get some insights from those who have “been there, done that”,  while still adhering to the philosophy of “maximizing the likelihood of dying from something other than bladder cancer”.   I’m still grappling with the idea of several months of neoadjuvant chemotherapy followed by an RC and long recovery...is it all worth it?   If in the process of chemo and surgery, my remaining kidney gets trashed, I have no interest in spending my remaining years on dialysis.  Some questions:\n1) Understanding how chemo is very hard on the kidneys, was wondering how I would fair with only one kidney enduring cisplatin and gemcitabine for 3 to 4 months?\n2) How soon after chemo is the RC?\n3) How tough is the RC recovery?\n4) More prudent to skip chemo and go straight to RC?\nPlease know I will certainly be asking my Uro and the medical oncologist these same questions (plus many more) when I meet with them.  I was just hoping to have some insights beforehand.  Appreciate everyone’s thoughts.  Thanks!\t\t\t", "date": "2020-02-27T01:43:15+00:00", "topic": "Just Learned...Invasive Urothelial pT2 in Prostate!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tUpdate:  Got path results today...HG TA in right renal pelvis, rt ureter, and CIS again in bladder...so adios to right kidney and ureter in next 6 wks.   Question is...is it now time to bid adieu to the bladder and prostate as well?   Given the shortage of BCG, the writing may just be on the wall.   Meet with my Uro this week to discuss the way ahead!  Wish me luck!\t\t\t", "date": "2019-02-09T03:42:12+00:00", "topic": "Plot Thickens", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi Friends,\nHaven’t posted in awhile, so thought I update everyone on my status.   Was DX w/TA and CIS back in Dec 2015.  Had been NED for over two years which I understood was an important milestone.  Have been enduring the BCG SWOG protocol without too much difficulty and was to begin maintenance cycle 6 (out of 7) next week.   Went in for my cysto on Wed, and my Uro noted a new bladder tumor.   Sent me straight away for a CT-Urogram and found focal tumors in my right kidney and ureter.   Went in yesterday for my 4th TURBT and had biopsies in the bladder, prostate, right kidney and ureter.   Uro says there’s a strong chance I’ll lose the kidney and ureter...OUCH!   Must wait for the pathology results later next week.   Will also know then my bladder’s fate.  Guess I’ve been dancing around the fire too long thinking I’d perhaps beat the beast!   Wish me luck as my cancer journey takes a probable detour!\nBest regards and God Bless,\n- Mike\t\t\t", "date": "2019-02-09T03:42:12+00:00", "topic": "Plot Thickens", "subforum": "6-men-and-bladder-cancer"}]}