{"signature": ["Surgery"], "posts": [{"text": "\n\t\t\t\tRon,\n\nI did not leave out a thing;\nblcforum.com/cgi-bin/forum/YaBB.pl?num=1158754935\n\nand I'll answer ANY question...\nI wish you all the best!\t\t\t", "date": "2006-12-08T02:51:38+00:00", "topic": "Neo Bladder surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKathy,\n\nI am glad to hear the cafe was a comfort for you.  I found this wonderful place after my release from the hospital.  Made great reading while healing.  Don't ever hesitate to post a question or comment on your progress.  Plenty of people to help out here!\t\t\t", "date": "2006-11-27T16:59:09+00:00", "topic": "Thanks to the blcwebcafe", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNancy,\nIf you don't find any local support, you have plenty forum wide.  If you share a bit about your diagnosis (Stage, Grade) and treatment, I'm certain you'll find others that can share via email.\t\t\t", "date": "2006-11-16T15:04:09+00:00", "topic": "Other patients in Western WA", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTommy,\nGREAT News!  Best wishes with your treatments and thanks sharing.\t\t\t", "date": "2006-10-25T06:32:37+00:00", "topic": "Newbie with G2 Surgery next week", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBill,\nI am not going to tell you that RC is a bowl of cherries but I can say that the fear and anxiety are worse that the proceedure.  I will also tell you to involve yor wife through the entire process.  I think initially it's much harder on your spouse.  Remember... while you're fast asleep for 6-10 hours she will be pacing the floor of the hospital waiting for an update.  It would be good for someone to be there with her.\n\nIn recovery, again you're out of it while she deals with the fact that you now have tubes and IV's and she just wants to make it better.  It does take time but as I said earlier I am only 10 weeks out and from the exterior no one could tell what I have been through (other than losing 23 lbs).  On the inside I am still learning to work with my new plumbing but progressing.\n\nJust remember your wife... you are dealing with the pain and adjustments while she is dealinig with a situation she can not control and it is likely more stressful for her.  Give her a hug and tell her every day that you are getting better.\t\t\t", "date": "2006-10-17T07:14:13+00:00", "topic": "VA Hospital Experiences??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBill,\nWhile I can not comment on the VA, i wanted to let you know that I am 45 yrs old and 10 weeks ago I had my bladder removed.  The Doctors created a neo-bladder in my case.  I'm sure you've read some on this by now but I wanted to say that I am doing GREAT.\n\nBest Wishes\nMike\t\t\t", "date": "2006-10-17T07:14:13+00:00", "topic": "VA Hospital Experiences??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKaren,\n\nThis is not meant to scare you or your mother but I did want to say that 2 of the best BC centers (Mayo & John Hopkins) follow the protocol that any T-1, G-3 (High Grade) cancer found on initial TURB shall be followed up with a 2nd TURB (aka Re-Staging) before any treatment.  Staging cancer is key to hte proper treatment plan and regardless of the final staging... successful treatment plans are available.  There may be others, but My Uro came from Mayo and I had my 2nd opinion at Hopkins.  I personally did not want to bother with a re-stage myself but when they showed me reports that when re-staged, the initial TURBT was understaged from 40% - 50% of the time (depending on the report).\n\nSince treatment for T-2 is very different from T-1, I would say you want to be certain and Re-Staging is the way to do so.\n\n\n", "date": "2006-10-16T17:05:19+00:00", "topic": "Mom newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTed,\nSorry never heard of this before.  Just did not want you to think that no one was out there.\n\nMike\t\t\t", "date": "2006-10-10T13:49:59+00:00", "topic": "photo dynamic therapy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCan't say that I have been down the Chemo trail myself as of yet but my Dad is (for met Ocular Melanoma, eye cancer).  All I can say is to embrace the confidence you have in your treatment team.  I have lived the fear and frustration as well but find peace in the honesty and straight forwardness of my Uro.  I get pissed off and feal sorry for myself from time to time but remember there are others not as fortunate.  I only have to read the memorial section of this site to put things back in perspective.\n\nI will survive this thing even though I know that there will be more complications and challenges ahead.  I know that you can too.  Treatment is one factor in success but I also believe that your mind plays a role as well.  Believe in yourself!  As I have seen others say many times, the human being is very adaptable to change or as my favorite band REO Speedwagon says \"Roll with the Changes\".\t\t\t", "date": "2006-09-23T15:53:20+00:00", "topic": "Start Chemo on Monday struggling", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy Dr suggested ALWAYS re-staging due to stats showing 50% of initial TURB understage.  Mine came back same both times though, T1-G3, CIS\t\t\t", "date": "2006-07-12T00:54:52+00:00", "topic": "To Re-Turb or not to Re-Turb, that is the question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVin,\nI am 3 months post op so still young but here's my input.\n\nWhat are the most difficult aspects of the cystectomy?\nThe first few weeks post-op.  10 days in the hospital was too long for me but I hurled my first solid meal and had to start over with liquid.  As you recoop your digestive system wakes slowly.  I spent a few weeks with mostly liquid bowel movements.  That is painful.  Use wipes to help.\n\nHow long before you return to work?\nMine was 10 weeks, I had a couple of Urinary Tract Infections (UTI) that prolonged things.  It's common and I've had 3 more since but now they just knock me down for 1-2 days.\n\nWhat do you do for work?\nReal Estate Broker so mostly office work.\n\nCan you run, ride a bike, lift weights, or swim?\nYes to all.  I was a bit nervous about the weights but found no problem.  I'm not power lifting but do 3 sets of 15.\n\nIs walking around comfortably normal?\nPerfectly normal... Early on my wife had to remind me to stand up straight since I found myself slumping.\n\nDo protective garments show through clothing?\nI wear a very thin female pad during day and perhaps twice a week I am glad I did as I get that small \"leak\".  Nothing shows so have no fear.  In reality it would only cause a small wet spot in my underwear but I feel safer that way.  Evenings I wear a Depends underwear.  I am having issues with getting my bladder empty when I void (pee).  For the past few weeks I have been using a catheder before bed and once during the night.  Don't let the thought of inserting a small plastic tube in your penis to empty yourself freak you out.  Originally I did but really it does get to be very routine.  I am headed to my Uro next week to take a look inside to see if there is some physical reason I can not empty.  He is pretty certain something changed while I was stretching my bladder since I had no such issue until 4 or so weeks ago.\n", "date": "2006-11-27T21:21:32+00:00", "topic": "CIS: What are the facts and opinions?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCHEERS!!!\n\nThat was very good!\t\t\t", "date": "2006-11-16T22:15:03+00:00", "topic": "A little more humor...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCheryl,\n\nWhat yur refer to as a \"2nd Scraping\"  sounds very much like what is refered to as a \"Re-Staging TURBT\".  As my Uro explained to me after my initial TURBT, it's messy in there when I start resecting a tumor.  I'm looking trough a scope there is fluid flushing through your bladder and a lot of things going on.  A 2nd look is almost always a good idea.\n\nHe was pretty sure there was some tumor that he did not get but keep in mind... he found 5 tumors when he peaked inside.  Cheryl, I can not begin to say that everything will be peachie with your mom but it sounds like things are superficial.  That is excellent.  If you read the stories here you'll find many folks that were diagnosed with further progression and they are still telling their stories.  Hang in there... consider 2nd opinions and by all means... have confidence!\t\t\t", "date": "2006-10-08T17:10:56+00:00", "topic": "Mom having 2nd scraping done, so afraid....advice?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhit,\n\nHere's to your 3 month mark!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n... and man-n-n-n-yyy more (I'm singing)\n", "date": "2006-10-03T17:51:12+00:00", "topic": "3 month check up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTim,\n\nJust wondering what your choice was?  Sounds like we were both facing the RC question at the same time.  I am 4 weeks out from RC with Neobladder.  I am not going to say it's been easy but I am happy with my choice.  Let us know how you are doing!\nMike\t\t\t", "date": "2006-08-16T10:40:51+00:00", "topic": "Cystectomy Decision Hell!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlyssa,\nI can not imagine one \"secret\" to avoioding the worry.  I did find the internet a great diversion since I was able to educate myself while keeping busy.  I can not say that I did not go through some personal phobias though.  Every trip to the bathroom was an event looking for the next questionable clue.  Your Uro / Surg are a key.  I met with a few and stayed with the one I felt most comfortable with AND this was not the one from the big hospital with a reputation for handling BC.  \t\t\t", "date": "2006-09-13T15:00:10+00:00", "topic": "Whats This?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad a very interesting visit with a Phy Therapist today.  SHe has treated Hyper-Continence before and found some possible issues.  In simple language the series of muscles including pelvic floor, hip flexer, small lower back & ham string all work together in many ways.  According to her assesment I have a degree of weekness or lack or flexability in these areas which could cause the pelvic floor to compensate.  There may be hope for normal voiding down the road.\n\nNOTE:  If anyone does exercise their abs on a crunch machine, she warns that while in a normal situation this is good, those with neo-bladders should not.  With a neo-bladder you need to clench your abs while releasing your pelvic floor.  Crunches train your body to clench both together.  \t\t\t", "date": "2006-10-11T13:36:25+00:00", "topic": "Help with Hyper-Continence / Neo-Bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJ,\nSorry to hear about your husbands challenges.  Guess this is not something others have faced but do not be afraid to have a sit down with the surgeon.  I have had other issues and sitting down with my Dr. and scans or x-rays helped me understand what is happening and what we would be looking for as positives and things to look for that would require action.\n", "date": "2007-02-16T16:52:55+00:00", "topic": "Post Op complications", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI do take daily but that seems to be a theory that my Uro's mentor follows.  It does seem to be catching on but at least in the states, it can not be prescribed as a regular treatment yet.  According to my script records, I must have a lot of sex!?\n\nIf Viagra is a problem, you might try Cialis.\t\t\t", "date": "2006-10-18T20:34:45+00:00", "topic": "Questions to ask the urologist", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Day Friend,\n\nI am glad to hear your husband is doing well after surgery.  I have been updating my story \"Life with a Neo-Bladder\" under the Storyboard.  I pulled a clip from my last which discusses sex and Viagra.  I found straight forward sharing and information helpful and offer the same to those who want it.\n\n\nOK... move on... One of the huge benefits I find in this site is the feeling of not being alone.  Reading about others that are or have experienced similar feelings or events.  For this reason, I am going to move on to the subject of sex.  Men... I know this is a subject we avoid but is always top of mind.  Since I was terrified, I wanted to share and hopefully help someone down the road.\n\nAt my 6 week checkup the Dr asked asked if... as he said \"Any signs of life down there?\"\n\nMy wife and I had yet to try.  Doc said it was time to start breathing life back into it.  I did have a nerve sparing surgery and My Uro recommends a routine of 25mg Viagra daily to help with recovery.  He suggested a full 100mg dose and then get busy at least 2 to 3 times a week.  My wife was on her way out of town for a long weekend so all we could do was look forward to a good homecoming.\n\nWell... being the man-pig I am and also being a LOT nervous about ability, I thought I'd just give things a \"Test\" run myself.  The reason I tell my story is because while I did take the Viagra... the results were not what I had hoped for.  In about 45 seconds I proceeded to have what felt like a very weak and totally un-satisfying orgasm and there was no erection what-so-ever.  Now I was really scared!  Was this what sex was going to be???\n\nObviously I was very upset and concerned.  What was my wife going to say when she came home and we tried with similar results!  After a day, I decided to give it another try.  The outcome was only slightly more encouraging.  Perhaps 30% erection but similar feeling for an orgasm.\n\nWhen My wife got home, it was getting late and I had an appointment with the Uro the following day so the homecoming celebration was put off (whew).  In the morning, as we woke up I just felt like I could.  Long story short... I could not and that's when I explainied that I had tried over the weekend.  She was very supportive and understanding but deep down I'm sure she was wondering herself.\n\nAt the Uro that afternoon, we discussed exactly what had happened.  He looked us both in the eye and said \"Just keep working at it.  You've been through major surgery and it may take a some time.  The fact that you had some erection is a step in the right direction.  You didn't wake up from the surgery and start running down the hall... everything is little steps.\"\n\nI knew that if things did not work properly there were many treatments to comsider, but like any one, I wanted things to be as close to before a possible.\n\nLater that evening we decided to try again.  I wanted to take some pressure off and for me that's relaxing her first.  With that behind us things just seemed to progress naturally.  Now I'm not going to claim 100% on the erection side that quickly but my fears about a very mild and un-satisfactory orgasm were put to rest.  Since then... things are getting better every time.  Small steps lead to great success!\n\nMen... be patient.  I'm sure there will be some fear but be patient.  Also REMEMBER... while your partner may not share this with you, they are VERY nervous about touching you.  They do not want to hurt you and may be very timid.  Let them know that you are fine and lead them if you must.\n\nAgain, I write this in hopes of helping someone understand that they are not alone.  The unknown creates the greatest fear.  When my Uro reminded me that this was a journey that takes some time, I just felt better.  My concerns faded and I was ready to keep working at it.  Do not give up and remember... attitude is half the battle!\n", "date": "2006-10-18T20:34:45+00:00", "topic": "Questions to ask the urologist", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTim,\nGreat to hear from you again!  I remember my \"Last\" tube out day vividly.  While I was ready to get rid of it, I was also a bit nervous since it meant I was REALLY on my own.  You may find that you have little control initially but not to worry, it gets better quickly.\n\nI am going in for my 3 month scan later this week.  I'm excited and nervous but regardless thinking positive!  Keep in touch my friend!\t\t\t", "date": "2006-10-29T11:47:01+00:00", "topic": "Bag Watching", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh yeah Zach...\nI was amazed at how the amount of mucus dropped when they pulled the last tube.  I have never had a problem... is kinda weird when you get a goobie hanging off your... well you know!  LOL\t\t\t", "date": "2006-10-29T11:47:01+00:00", "topic": "Bag Watching", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTim,\nAgain, do you still have 2 bags?  Cath and super pubic?  Regardless I know what you mean about beinig obsessive.  WHile I was still in the hospital I did not agree with one of my night nurses and basically told her; \"Listen... this is my one chance at a bladder so either you get your supervisor or I start raising hell.\"\n\nAny way... I did find that occasionally even when I could not suck out with the syringe I still had urine flow but of course I watched closely.  I also found that if I had a concern flushing somethimes a walk around helped.  Also my Dr taught me to slide the cath in 1-2 inches deeper if flusing was a problem.\n\nObviously there are several tricks and theories but do not be afraid to go to ER if your concerned.  You don't want your bladder to stretch this early.\t\t\t", "date": "2006-10-29T11:47:01+00:00", "topic": "Bag Watching", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAndi,\n\nI can not say that it \"All\" comes gushing out, but I too experienced a period when it seemed as if I could not hold my urine.  Like yourself, it ws getting up from a sitting position.  I found two things that helped.\n\n#1 - Before I get up, I squeeze to hold in and while getting up, I sort of roll to one side rather than standing straight up.\n\n#2 - Make sure I go on schedule.  I'm sure you've learned that voiding is now a timing rather than urgency thing.  I found myself waiting too long and was full when I got up to go.  Now I do my best to go every two hours.\n\nIn any case, consult your doctor.  If you don't get the answers you need, try for another opinion.  Second opinions are not just for treatment options... this is important too!\t\t\t", "date": "2006-11-05T18:14:05+00:00", "topic": "unable to hold urine at all", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Steve...\nYou should know that my original message was sone time ago.  I've been tubeless for several weeks and I agree... laying on my side and even stomach is GREAT!\n\nAn update from my side... seems like I'll bear down and get a good stream going but after a bit it stops.  I'll wait 5 - 10 secs and bear down again and start it over.  Volume and such seems good (350 mL) but I do miss that one long pee (lol).  I will also say that occasionally I do have issues, usually at night where I can only manage 100 - 150mL and even that is tough.  Seems like I just can't get my pelvic floor to relax???\t\t\t", "date": "2006-09-20T21:29:47+00:00", "topic": "Learning Urination w/ Neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBill,\n\nThanks for your responce.  As I stated, it's just good to know you're on the right path (or not) from those that live with the changes.  I am staying dry during the day very well.  That seemed to come pretty naturally.  The slight ache or little \"spit\" is a sure sign to get to the bathroom.  My evenings are not quite so successful (yet).  While I am setting alarms every 2 hours or so, I find myself getting up to a very wet diaper/shield.  I am hopeful that with continued Keagles this to will improve.  I have only been bag free at night the past 4 evenings so while I am a little frustrated, I know it takes time.\n\nCurrently I am holding 250-300mL and yes, my Uro did warn me of hyper-continence (stretching it too much).  I can't remember off the top what his limit was but he did tell me to expect to go to around 450mL.\n\nAgain, thanks for your reply and your complete story.\t\t\t", "date": "2006-09-20T21:29:47+00:00", "topic": "Learning Urination w/ Neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDeb,\n\nI too am sorry to hear about the issues you have had so far.  It saddens me when I hear a story where Doctors have caused more stress than the diagnosis.  Like Lou, I strongly recommend seeking another opinion from an outside source.  I have said it many times... seen the results here and in my family.  Having COMPLETE trust in your Doctor makes a huge difference.  Based on your story it really does sound like your doctors were thrown a curve ball or two.  Like Lou, I think a major med center might have answers your local team may not simply due to experience.\n\nPlease do not get me wrong, I am not about to knock the use of a local team vs.  a major med center.  I chose my local Uro over John Hopkins.  I should say that my Uro did complete his fellowship at Mayo so he certainly was qualified but just as important... he made me feel comfortable.  He took the time.\n\nI say make some calls and by all means... let us know where you live.  I'm sure there will be sugestions on places to look into!\t\t\t", "date": "2006-10-04T02:37:06+00:00", "topic": "Losing control of lives", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJason,\n\n10 Weeks post-op w/ a neo-bladder.  I was experiencing lower back pains that came in waves as well.  It was like a cramp that surged for several seconds then gone.  The pain was too low to be my kidney and having stones in the past, I knew that was not it.\n\nMake a long story short... after several days of these cramps coming and going and suddenly I have a low grade fever.  Called the Doc ad he said \"Cath now and twice / day for a couple of days.  Seems I was not empting all the way so the volume slowly built up.\n\nAll is well now but it is true, neo-bladder can = more UTI's\n\n", "date": "2006-10-19T01:25:31+00:00", "topic": "Post-Neobladder Kidney Pains &amp;amp; High-Grade Fever", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClaire,\n\nAgain, I am not going through chemo but my father is.  I learned of my BC 3 weeks after he was told his Ocular cancer had metastisized to his liver.  No hope for cure.  Knowing that he opted to try chemo in th hope of 2 or three extra months.\n\nI can not compare my situation to yours but I do know what it's like to loose bladder control.  Fight UT infections (twice now) and without a doubt wonder if I (or those around me) wouold have been better off If I had just died.  I think that is common with anyone fighting.  This my sound strange but I look to those that have it worse than me and say to myself... \"If they can hang on, I have no right to feel sorry for myself.\"\n\nUnfortunatly I do not have to look far with the fight my father puts in every day.  He was told to go home and enjoy his last days.  Perhaps that would be best but he refused and has pursued every opportunity to extend his life.  Some say he's just reaching... he says if it brings 30, 60 or 90 days... a lot can happen.  Besides, since these are trials, it could help someone else down the road.\n\n", "date": "2006-10-10T17:23:51+00:00", "topic": "Chemo is horrid any advice", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRay,\n\nLou hits the nail on the head.  Just with the words your write your whole outlook has chnaged.  You have discovered the importance of faith in your Doctor.  I am so glad you found the one that has made you feel comfortable with your treatments.  Makes all the difference in the world doesn't it!\n\nFor any newly diagnosed individuals out there... let this be a lesson.  Read Ray's original posting and compare to this latest.  Keep looking every day if you must to find the doctor that gives you the warm / fuzzies you need.\n\nKeep us informed Ray... your story will help others.\t\t\t", "date": "2006-10-03T21:37:45+00:00", "topic": "UPDATE Surgery Postponed", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnne,\n\nI appreciate your father-in-laws concerns.  Cysectomy is a no turninig back decision.  Let me tell you why I made the decision I did and perhaps you can pass this on to him.  While I did read and see all kinds of stats and reports the one thing that came through was that not one of those people in the studies was ME.  Each patient has circumstances just a bit different than the study group so how could I possibly make a choice from those reports.\n\nMy local Uro took an aggressive approach.  I had 5 tumors staged T1-G3 with CIS.  He talked with me about several different options but leaned hard to cysectomy.  My 2nd opinion was through John Hopkins in Baltimore (known for BC specilists).  This Dr glanced at my path report and told me what they do.  No discussion, no input just talkinig at me (see complete story in the \"Storyboard\").\n\nWhen I returned to my local Uro we chatted somoe more and it boiled down to a fwe simple facts.  CIS is aggresive and not predictable.  T1 while classified as \"Superficial\" can turn to T2 at any moment.  When I was re-staged, things looked good and I could have very easily gone the BCG route but my Dr looked me in the eye and said when it comes to Bladder Cancer, we deal in 5 year survival rates.  Mike, you're 45 years old and I would rather talk with you about 25 or 30 year survivability.  There is no guarantee with anythhing but cysectomy early rather than late showes slightly better results.\n\nNow I am a gambler.  Love to play Craps but I was lookinig at reports that showed survival rates from 2% to 10% higher with early cysectomy.  That's 90% - 98% \"No reason to jump into it\".  I was not willing to gamble even a 2% chance when it came to life.\n\nI am 5 weeks post-op RC with a Neo-Bladder.  It has not been a piece of cake all the way, but I would not have changed a thing about my choice.  While I do have to return for periodic checks I am not living with the same concerns that I would had I opted for BCG.  I believe in my Uro and I believe in myself.\n\nSurgery is a scary thing but don't let the short term fear play a role in a long term decision.\t\t\t", "date": "2006-09-27T16:16:31+00:00", "topic": "Dilemma:To perform cystectomy or not? That the ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLynne,\n\nAs well, I can not say that I have had the SAME experience as you but I am learning that each of us endures our own complications.  My two cents in the ring says that if your original Dr can't help the situation after one try says it's time to look to others.  As Lou says, I too beleive that we have to take the bull by the horns and not only understand what is happeninig with our body but also exactly what the Dr intends to do to solve it.  If it makes sense, move forward.  If not, ask more questions.\n\nWhile I was recovering from my surgery in the hospital I was not comfortable with one of the evening nurses and how she wass handling a situation.  After some discussion I finally said, \"I'm sorry... and do not take this personal but this is my only chance at a semi-normal bladder (neo-bladder) and I am not willing to take chances.  I am asking that you either get your supervisor or leave the room and I will take care of things myself but I will not wait till morninig when my Dr. does rounds (as she was suggesting).\n\nLynne, I do wish you all the best... never stop looking for the right solution.\n\n", "date": "2006-09-08T15:01:08+00:00", "topic": "Cancer of my Urethra?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tShirley,\n\nThank you for sharing.  I am 4 1/2 weeks post-op from RC w/ Neo-bladder myself.  My doctor did warn of many complications that could arise after surgery but it is nice to hear about them from your perspective.  I am 45 years old now and hope to have another 25-35 good years in me.  I need to learn more about such side effects so that I am prepared to deal with them down the road if need be.\n", "date": "2006-02-18T18:46:19+00:00", "topic": "After the neobladder -incontinence, UTI Infections", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKH,\n\nJust wanted to touoch base and see how your dad was doing.  He is actually 1 week ahead of me with the RC and Neobladder.  My surgery was 8/22.  \t\t\t", "date": "2006-08-03T18:30:48+00:00", "topic": "Men with neobladders -  to talk with my dad", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike,\n\nThis may get confusing as my name is Mike as well.  I am 4 weeks post op and having similar stool issues.  One week ago I was actually keeping things solid with only two movements a day but then I took on an infection of sorts.  I could not eat and was back to the basic liquid diet for 3 days.  This sent my bowels back to, as my wife says \"Loose Tail\" mode.  I know what you mean about the pain after 2 or 3 but I am hopeful that this will pass.  If you hear any news, please share through this topic.\n\nBest Wishes,\nMike McKenna\nHaymarket, VA (DC Metro)\nRC w/ Neobladder 8/06\t\t\t", "date": "2006-09-18T13:28:55+00:00", "topic": "After surgery w/ my neo bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSteve,\n\nBest of luck... I am 45 yr old and 5 weeks out from RC w/ Neobladder.  Had my concerns and bad days along the way but already no issues during the day.  My Dr. leaves superpubic tube in as safety measure and for learning to void.  This week I start on leaving capped at night and get up to void.  Like the one step at a time approach myself.  \t\t\t", "date": "2006-09-07T04:55:34+00:00", "topic": "Choosing a Neo Bladder or external bag", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJohnny,\n\nHere is a link to a site dealing with cancer related pain and pain management.\n\nwww.cancer-pain.org/index.html\n\nI am 5 weeks post-op from bladder removal and doing well however my dad learned 6 months ago that his Uveal cancer (eye cancer) had metastisized to his liver.  Pain is starting to interfear with his daily activities as well.  He is afraid of getting all \"Doped\" up but from what I found, pain management is not about druging someone into a stupor.  I wish you and your grandfather all the best.\n\nMike\t\t\t", "date": "2006-09-27T06:36:17+00:00", "topic": "Please help...Questions about my grandpa", "subforum": "7-metastatic-bladder-cancer"}]}