{"signature": ["TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tHi Abby5566\nIf you are interested I may be able to assist you. I co-founded Bladder Cancer Canada. You can contact me through the Bladder Cancer Canada Discussion Forum.\nforums.bladdercancercanada.org/\nWe have a patient outreach program, and several volunteers who would be happy to speak to you regarding their experiences with the neobladder.\nAll the best,\nJack Moon\t\t\t", "date": "2017-11-14T16:18:37+00:00", "topic": "New to the Community", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Karen\n\nYes I now have annual cystos and still get nervous.(lol)\nHopefully the BCG treatments keep you all clear as it has for so many.\nIf you have any questions about your upcoming BCG treatments there are several on this forum that will be happy to share their personal experiences.\nAll the best,\nJack\t\t\t", "date": "2016-04-03T03:14:06+00:00", "topic": "41 yr old female, newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Karen\n\nSorry you have been diagnosed with bladder cancer. You will find the survivors in this group to be very helpful and can assist you on this journey. As Cynthia has stated NMIBC can be treated and has a very high success rate. I was diagnosed in 2005, had a few early small tumor recurrences, several BCG treatments 2006-2009, I have been all clear since 2007.\nThis group got me through all my treatments, answered all my questions, and several of the members here have become life long friends.\nI wish you all the best going forward,\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2016-04-03T03:14:06+00:00", "topic": "41 yr old female, newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Jon\n\nI am from the Toronto area and I co-founded Bladder Cancer Canada in 2009.\nwww.bladdercancercanada.org\nI can assist you with your questions, just go to Bladder Cancer Canada site (link above) join the discussion forum.\nAll the best,\nJack\t\t\t", "date": "2015-12-27T16:53:30+00:00", "topic": "New Terrified and From Canada", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree with the others regarding seeking a 2nd opinion, since you are close to MSK. They are tops when it comes to bladder cancer.\nAll the best,\nJack\t\t\t", "date": "2010-12-18T21:15:44+00:00", "topic": "newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSounds like you should listen to your doc.(lol)\nMy 1st Turbt was the worse one for me, had 3 tumors removed and 1 of them was quite large. I like you, felt 100% so thought I could do my normal routine, but also like you, every time I over did it the blood would flow.\nTook me about 6-7 weeks before I could do all the chores again, although I thought Debbie should just carry on taking the garbage out.\nMy next 2 Turbts were both very small tumors so not so bad, back to normal in a couple of weeks.\nMy last Turbt was 33 months ago, been very lucky that the BCG treatments I had seems to be keeping those darn tumors away.\nI wish you all the best,\nJack\t\t\t", "date": "2010-08-16T20:24:13+00:00", "topic": "Reluctant Newbie", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news Max, I celebrated 32 months clear yesterday and was moved to 6 months check-ups.\nCongrats and thanks for posting your wonderful news.\nJack\t\t\t", "date": "2010-07-10T22:57:17+00:00", "topic": "LATEST CYSTO", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe email and phone # is a bladder cancer patient that goes to Huntsman. She lives I think 2 hours from Salt Lake City.\nKandi does not live in St George.\nShe would be happy to talk to you.\nJack\t\t\t", "date": "2010-05-09T23:15:23+00:00", "topic": "Bladder boipsy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis is from a friend in Utah with bladder cancer\n\nMy uro is Dr Robert Stephenson at Huntsman Cancer Center. The other really good one there is Dr Dechett. I know of a guy who was treated in St George, but I don't know any of the particulars except that it has been 2 1/2 yrs and he has never had a recurrence. She can email me at This email address is being protected from spambots. You need JavaScript enabled to view it. or call 208-201-4609\nKandi\t\t\t", "date": "2010-05-09T23:15:23+00:00", "topic": "Bladder boipsy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Pat\n\nGlad the treatments are over and you are on your way to recovering day by day. It is amazing that throughout this entire battle, you have found time and energy to come on here and continue to assist and advise fellow BC survivors.\nYou are a very precious person and we all owe so much to you for the guidance you have given us all.\nGod Bless,\nJack\t\t\t", "date": "2010-04-15T23:14:16+00:00", "topic": "DONE...UNTIL THE NEXT BATTLE", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tRick replied to an email I sent him last week. Things have not gone well, and required a 2nd surgery. Hopefully we will hear from him in the near future.\nJack\t\t\t", "date": "2010-03-17T01:15:04+00:00", "topic": "Surgery Tomorrow....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree with the other replies, not much can be done until you have the results of your pat report.\nNow path reports do NOT take 2 weeks from ANY lab.\nPatients waiting for reports is USUALLY not the fault of the lab. It is the Uro's schedule when he can see you again.\nMy 1st Turbt I was in the hospital for 3 days, I had my pathology results before I left the hospital and so did my GP.\nAny test results are faxed to my Uro and my GP directly from the lab. The longest I have ever waited for any test to do with bladder cancer is 4 days.\nMy urine tests from all my cystos I have with-in 48 - 72 hours.\nEven my 2nd opinion path results I had in 2 days from the top bladder cancer hospital in Canada.\nAll I do is insure every paper I sign for tests is that my GP is copied and faxed on all results.\nWhen a fax arrives at my GP's office I am called immediately by his secretary to pick up my copy.\nThere is nothing worse than waiting for results so I recommend you do what you can to shorten the time span.\nI wish you all the best,\nJack\t\t\t", "date": "2010-01-08T22:11:10+00:00", "topic": "Too many Questions - Too few answers", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOriginally dx Jan 2006, 3 tumors, one being large,\nPath report TA low grade\nStarted BCG due to the size of the 1 tumor\nHad 2 recurrences during first 18 months year, single tumors still TA low grade\nHad problems with UTI's during BCG treatments (5)\nCompleted 30 BCG treatments Feb. 2009.\nLast Turbt Nov. 10/2007\nCancer free now over 2 years\nWill have 3 month Cystos until 3 years clear\nJack\t\t\t", "date": "2009-12-04T02:00:14+00:00", "topic": "Bladder Cancer History", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Andrew\n\nI have had a total of 30 BCG treatments.\nThe side effects you are having, I also had similar in my last 8-10 treatments, although I never had blood in my urine.\nDo they do a urine test before you have your BCG treatment, to check for a bladder infection? Two of my infections, of the several I had, were caught during this process.\nDo you currently have a high temperature?\nGet your urine checked asap, to eliminate if it's an infection.\nWhen is your next treatment?\nBCG has very progressive side effects.\nThe meds I took for my last 8 treatments were Phenazo for the burning, and the antibiotic was Cipro. Without these 2 meds I could not have finished my last 8 treatments.\nI am feeling your pain,\nAll the best,\nJack\t\t\t", "date": "2009-04-25T02:36:28+00:00", "topic": "I need help", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Bcn33\n\nAs Cynthia has said, there are many here who have been dx with the same type of bladder cancer as your son. My path reports indicate I have TA Grade1 tumors. I was dx in January 2006, have had several BCG treatments, and have been cancer free now 16 months.\nI know in the beginning it is very confusing and worrisome.\nBut you have come to a place here, where we fellow survivors can help and guide you through this ordeal.\nAsk as many questions as you wish.\nEnsure your son gets a copy of his pathology report.\nWe are here for you and your son.\nJack\t\t\t", "date": "2009-04-20T15:24:13+00:00", "topic": "Son newly Dxed BCG questions-bcn33", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi, Britt\n\nMy Uro, on my 1st office visit, after my Cysto said the following to me and meant it. \"If you want me to help you, you must help yourself\"\nHe had me checked 1 week later to see if I had quit smoking. I did quit cold turkey the day he told me. It was hell for 3 weeks, but as I look back, I am very thankful to him. I had tried to quit smoking for ten years, always made it 3-4 days, but always went back. The only trouble I have found, is that food tastes way too good now(lol) But thank god, beer tastes just as good without the cig.\nI wish you all the best,\n\nJack\t\t\t", "date": "2009-04-10T18:34:22+00:00", "topic": "Anger.!!!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy path reports have been taking 5-7days. My family doc is copied on all reports. So I know the results before I meet with my Uro, which is always 2 weeks from date of TURB or Cysto urine tests. I am lucky because my family doc is one of my golfing buddies, and always calls me the day he has the fax from the lab.\nAll the best,\nJack\t\t\t", "date": "2009-03-17T17:02:21+00:00", "topic": "Cystology results following TURBT - how soon?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLaughing my ass off!\nJack   ", "date": "2009-01-07T19:37:52+00:00", "topic": "another slightly-off laugh from Iowa", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI have had 3 TURBS, and 2 of the 3 were a 4 week wait, and 1 because of a cancellation was 2 weeks. So 5 weeks does not seem out of the ordinary.\nI wish you both all the best. Try not to worry and enjoy the up-coming holidays. Merry Christmas.\nJack Moon\t\t\t", "date": "2008-12-12T15:33:21+00:00", "topic": "Risk of 5 Week Wait for Surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi There\n\nThe normal protocol for BCG treatments, are 6 weekly treatments.\nIf the treatments are successful, then a series of 3 weekly treatments over a period of 3 years, known as BCG maintenance treatments.\nWishing you all the best with your treatments.\nJack\t\t\t", "date": "2014-07-11T14:00:24+00:00", "topic": "BCG  TREATMENTS AND SIDE EFFECTS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have a bladder cancer buddy who also had CIS recurrences after BCG.\nHe then had 8 weekly Valstar treatments and has been cancer free for 4 years now.\nWishing you all the best,\nJack\t\t\t", "date": "2014-07-17T03:49:42+00:00", "topic": "Valstar bcg fail", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood to hear all worked out and cysto was all clear.\nJack\t\t\t", "date": "2014-01-18T15:38:49+00:00", "topic": "A sigh of relief", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am sure you are aware that the side effects of BCG varies by patient, therefore I can only share what I experienced with the treatments. I did have 3 sets of 6 weekly treatments and 12 maintenance treatments. I will share my experience with my first set of 6 weekly BCG treatments.\nAll my treatments were on a Friday afternoon and by Sunday morning I was back to normal. Experienced urgency and some burning while urinating.\nI went home immediately after each treatment, only 1/2 hour drive from hospital.\nAfter my 6th treatment I was fine and back to normal with-in 2 days.\nMy cysto was 6 weeks after the last treatment, doc said 6 weeks because BCG usually inflames bladder so he wanted the bladder to be as free as possible from inflammation.\nI believe if Greg does get an all clear he would then begin BCG maintenance.\nI wish him all the best with the treatments,\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2014-01-25T03:28:28+00:00", "topic": "hope to start BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI would think based on my reading of MMC that 2 hours is sufficient to hold in the bladder, then drink water for the next few hours to flush it out of your system. MMC has success with non invasive low grade bladder cancer, whereas BCG is the gold treatment for high grade and CIS. Good luck with your treatments.\nJack\t\t\t", "date": "2012-07-23T21:22:09+00:00", "topic": "mitomycin treatments  (are they worth it?)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Joey. Good luck with your next 3 BCG maintenance treatments.\nBCG = Bladder Cancer Gone\nJack   ", "date": "2012-06-11T15:17:32+00:00", "topic": "All Clear Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Warren\n\nSorry about the recurrence after so long being cancer free. I have a friend who did have a recurrence of CIS, tried BCG, had a further recurrence and then tried Valstar. He has been cancer free 18 months now. Might be worth a try.\nFor sure on the 2nd opinion my friend.\nAll the best\nJack\t\t\t", "date": "2012-05-01T04:05:29+00:00", "topic": "Recurrence of CIS. Treatment options", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News Ann, so happy for you!!!!!!!!!!!!\nJack\t\t\t", "date": "2012-04-06T11:37:51+00:00", "topic": "All clear (still)!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Ann, I know exactly that feeling of finishing that last treatment.\nMay you stay cancer free forever\nAll the best,\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2011-12-02T17:51:45+00:00", "topic": "Happy dance time:  All done with BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHeavens no Cynthia, golf can maybe lead to early dx of bladder cancer and infections (lol)\nJack\t\t\t", "date": "2011-11-01T20:54:58+00:00", "topic": "It Might Be Back", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnn maybe it is my lousy golf swing (lol)\nJack\t\t\t", "date": "2011-11-01T20:54:58+00:00", "topic": "It Might Be Back", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Doug, Fantastic news.\nHave you moved to 6 month cystos?\nJack\t\t\t", "date": "2011-04-30T00:00:08+00:00", "topic": "Good checkup", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suzi\n\nSorry you are going through this. You have been given great advice by the members here.\nI had several bladder infections during my BCG treatments.\nFollowing my 30th and final treatment I had a major one, which I believe was actually caused on my 29th treatment. Cipro did not work this time as it had in the past. My Uro sent me to an infection specialist. My left eye was nearly closed, my gums heard, and joints were extremely sore. I can not remember the antibiotic I was given by the infection specialist. In about 4 weeks I was back to normal. During this time I saw the specialist twice a week. He was not sure what had caused the problem. He said I was fortunate that my Uro acted so quickly in getting me to the specialist.\nAfter getting a report from the specialist, I contacted my Uro, my 2nd opinion Uro, and Dr. Lamm. All three agreed that I was not to have any further BCG treatments.\nI continued to have a few infections during the following 9 months and continued to see the infection specialist. He found I was not fully emptying my bladder, which he thought maybe was caused by so many BCG treatments. He started me on cranberry supplements, 500 mg and also drinking 1/2 glass of 100% cranberry juice 2 times per day. I have not had a bladder infection since, and my latest pressure test done by the infection specialist indicated that I am now emptying my bladder, which he believes is because of no further BCG treatments.\nSorry to be so long winded, but I thought I would share my story with you.\nAll the best,\nJack\t\t\t", "date": "2011-03-15T23:55:52+00:00", "topic": "I need your help guys", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Nancy, you are ahead of me by 1 month. Hoping that 10 years from now, I am still trailing you by 1 month.\nCongrats, so happy for you.\nJack\t\t\t", "date": "2011-02-05T02:44:04+00:00", "topic": "3 years, 4 months clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Randy\nGood news is like a YAHOOOOOOOOOOOOOOO!!!\nAll the best,\nJack\t\t\t", "date": "2011-01-17T13:54:04+00:00", "topic": "Everything good", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Max.\nAll the best,\nJack\t\t\t", "date": "2011-01-11T20:17:36+00:00", "topic": "3yr cysto..no tumors", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic News!!!!!!!!!!!!\nJack\t\t\t", "date": "2010-12-17T22:31:28+00:00", "topic": "new guy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust great news Joey. Enjoy the holiday season cancer free.\nAll the best,\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2010-12-03T17:12:58+00:00", "topic": "First 6 month follow up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News Brenda, congratulations!!\nAll the best,\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2010-11-30T15:28:48+00:00", "topic": "Clear After One Year", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats on the All Clear Rocky!!!!!!!!!!!!!!!\nNot all pains are cancer related, could be a strained muscle or tendon.\nAll the best,\nJack\t\t\t", "date": "2010-11-26T22:41:30+00:00", "topic": "scope", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Ann congrats on this major accomplishment. I also got moved to 6 month cystos in June after being cancer free 30 months and finished my maintenance BCG treatments.\nEnjoy your free time now especially away from BCG.\nHugs\nJack\t\t\t", "date": "2010-08-25T19:35:41+00:00", "topic": "ALL CLEAR and MORE!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI fully understand your situation. Yes bladder cancer sucks and so do BCG treatments. BUT if they work and keep you cancer free WELL just maybe worth it.\nI like you have had 2 recurrences, was TA Grade 1 and had 3 sets of weekly treatments do to recurrences, and 12 maintenance treatments. Treatment 13-30 went from tolerable to just plain Hell. You see I got spoiled with no side effects during 1st 12. Maybe that is why I got the recurrences.\nBeen cancer free over 33 months now, and finished with BCG, so hang in there there is a good life after BCG.\nI hope you remain cancer free forever,\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2010-08-12T18:32:12+00:00", "topic": "Just plain sick of it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Red\n\nI had 6 weekly treatments at a time(needed 3 regimes due to recurrences) and had to skip some due to UTI's. My maintenance regime was 1 per month for 12 months.\nI have been cancer free now 33 months.\nHope this helps,\nJack\t\t\t", "date": "2010-08-08T21:40:14+00:00", "topic": "bcg", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Nancy\n\nCongrats on the all clear and on moving to the 6 month cysto cycle. I was moved to the 6-month cycle in June being 33 months all clear. I like you am not totally comfortable with this arrangement but since my original dx was TA Grade 1, my Uro seems to think I am ready. We have agreed I will have a urine test beginning of Oct which my GP will arrange.\nI also like you am done with BCG, which has been confirmed by my Uro, 2nd opinion Uro, and Dr. Lamm. The bladder can just take so much.\nI wish you all the best,\nJack\t\t\t", "date": "2010-08-07T22:40:58+00:00", "topic": "More Cysto News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Friends\n\nI am trying to assist a fellow bladder cancer patient.\nI have arranged a 2nd opinion for him on July 19th with one of the top bladder cancer Urologist/Oncologist in Canada.\nHis History\nDiagnosed in 2008 with TA High Grade. Began weekly BCG early 2009, and completed 8 maintenance treatments but had to stop due to inflamed bladder which has shrunk by 90%. He has never had a recurrence, but suffered from day 1 of the BCG maintenance treatments. The BCG was never reduced due to side effects.\nThe bladder shrinkage showed up in his CT scan a few weeks ago.\nMy Question\nHis current Uro who needs a good kick in the ass, has said that he can stretch his bladder back to it's orginal size. Has anyone heard of this procedure with an original bladder? I can not find anything on this procedure.\nMy friend needs something done, as he has to urinate every hour or so because his bladder will not hold much. He is not in any pain or have severe urgency.\nAny help would be appreciated.\nThanks,\nJack\t\t\t", "date": "2010-06-26T00:23:57+00:00", "topic": "Original Bladder Has Shrunk", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Alan\nBioniche is the sponsor of our Canadian bladder cancer network website.\nwww.cbcan.org\nThe trials are continuing in phase 111. Should have some preliminary results late this year.\nResults comparing their product directly vs BCG will be a few years away.\nPhase 111 trials are BCG refractory patients.\nI can tell you that the people I know at Bioniche are extremely positive about their product.\nWhen I hear more information I will post.\nJack\t\t\t", "date": "2010-05-09T13:06:41+00:00", "topic": "Lowered dose BCG - so far so good", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic Maz, may this be the 1st of many to come.\nYahooooooooooooooooo!!!!!\nJack\t\t\t", "date": "2010-05-06T15:31:23+00:00", "topic": "YIPPEE!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Ann. Happy for you.\nGood luck with the maintenance treatments.\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2010-04-22T15:07:03+00:00", "topic": "Happy Dance -- All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHave had 3 Turbts, the first was was rough as 3 tumors removed and 1 was large. My Uro will not send you home with a cath, so you stay in hospital unclear urine is clear. Recover was about 10 days. The next 1 was a small tumor recovery about 3 days.\nMy last Turbt had MMC instilled, the chemo made me very sick for 24 hours, other than that recovery was about 3 days.\nSince the Turbt with MMC and BCG treatments including maintenance have been cancer free 28 months.\nAll the best,\nJack\t\t\t", "date": "2010-04-13T03:40:39+00:00", "topic": "An unofficial poll!  Please read!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy History:\nMy original dx was TA Grade 1 with 2 recurrences. One dose of Mitomycin C after 3rd Turbt and 30 BCG treatments of which the 1st 12 treatments failed. No side effects on those first 12 treatments. A 2nd opinion at major cancer center as recommended by members here at ABLCS.\nMy goals in changing my lifestyle was to lose minimum of 25 pounds, and hopefully be cancer free.\nOther Changes Since Being Cancer Free:\nThings I have eliminated include cigs, diet drinks, most dairy products, meat portions no bigger than the palm of my hand, red meat only once a week, fast food, and sweeteners.\nThings I have added include walnuts daily, fruit daily, acai berry juice daily, fish twice a week, broccoli raw daily, asparagus, 3-4 times week, spinach twice a week, brussel sprouts 2 times a week, and green beans, pop replaced by fruit juice, a beer or two. Supplements Vitamin D, baby aspirin, cranberry capsule, and a multi vitamin.\nIn the winter walk a min of 2 miles 3-4 times per week.\nSummer is golf and since I walk, I get good amount of exercise and energy release(lol).\nSo What Have I Accomplished\nWell I am still cancer free, I have lost 26 lbs (187-161)\nfeel better about myself, more energy, and got a new wardrobe(lol)\nNow I do not know what has kept me cancer free, could have been the 1 dose of mitomycin C, could be BCG, could be diet and health changes, or could be a combination of the above.\nI am no doc or an expert, and have learned nearly all of my lifestyle changes from fellow warriors.\nWhat I do know for sure, if cancer does strike back, and if I ever need a RC, I am in much better shape physically and mentaly to take on that battle.\nIf this post helps just 1 person then I have accomplished another goal.\nThanks for reading and good health to all,\nBCG = Bladder Cancer Gone (Well I think so)\nJack\t\t\t", "date": "2010-01-24T12:32:15+00:00", "topic": "Health and Diet Changes My Experience", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Steve, yes this is a great feeling.\nEnjoy the news,\nJack\t\t\t", "date": "2010-01-22T14:38:24+00:00", "topic": "All Clear Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Max, I have my next Friday, hoping I can join in on your celebration.\nAll the best,\nJack\t\t\t", "date": "2010-01-19T21:39:53+00:00", "topic": "GOOD NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Bill\nSorry to hear an infection might have returned.\nDuring BCG treatments I had problems with infections. After my 5th my GP arranged an appointment with an Infection Specialist. I was on IV for 2 weeks but eventually the infections cleared. The infection was giving me urgency, burning and closed my left eye with swelling.\nThe specialist then had me take cipro for my remaining 8 treatments day of and for 5 days following. I have never had any further infections.\nI recommend seeing a specialist rather than your Uro.\nAll the best,\nJack\t\t\t", "date": "2009-12-27T18:05:06+00:00", "topic": "Is it back?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell I am sure Dennis would give you guys this advice.\nWork-out 3-4 times a week\nLots of endurance exercises\nSmile no matter where the ball goes\nGolf is a hobby not your job\nDrives are only measured in yards not in your score\nInsure holes 1 through 18 as as much fun the 19th\n\nThe above are usually his favourite quotes, he is one of the nicest persons you could ever meet, not a mean bone in his body, and you would never know he had a neo.\nJack\t\t\t", "date": "2009-11-10T20:54:02+00:00", "topic": "I joined the BCG reactor\\'s club", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am glad you guys are happy with your neos.\nI will do whatever it takes to keep my orginal,thanks \nI have a friend who got his neo in 1991, the son of a gun can out run me, and still hits his drives 275yds and he turns 70 next year. \n\nJack\t\t\t", "date": "2009-11-10T20:54:02+00:00", "topic": "I joined the BCG reactor\\'s club", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Chuck\n\nThis group encouraged me to get a 2nd opinion. I am so glad they did, it put my mind at ease.\nI had my path reports and slides sent from the lab by my Uro to the cancer PMH hospital. Because my Uro had did such a good job of getting biopsies, there was no need for a further Turbt to be done at the cancer hospital. This was told to me by the 2nd opinion Uro, who is one of the top Uros in Canada.\nHe agreed with my stage and grade of all tumors and agreed with my treatment regime. He actually told me that I was in very good hands and thinks very highly of my Uro.\nThis my friend did more for me than you could ever imagine.\nI began to sleep better, my attitude changed and I began to learn everything I could about bladder cancer so I could assist fellow warriors with my experiences.\nI can never thank Cynthia, Pat,Julie,Doug and Anita, Char, Nix, LadyJane, Ed, Sailer, Knut, and Mike and so many others enough.\nI wish you all the best,\nJack\t\t\t", "date": "2009-12-03T14:35:06+00:00", "topic": "BUMMER II", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can not offer any more advice than you have just received.\nI can share my experiences with BCG treatments.\nDuring my 30 treatments, I did have 5 UTI's of which one was very serious and I did have to see an infection specialist.\nThe symptoms of the serious infection was different than the other four. No urgency and no burning like the other four, just pain in the bladder and the back. After 3 days the infection spread to my eyes and my left eye was swollen and I could barely see out of it. My GP sent me to the specialist within 2 hours I had an appointment, tests done, and was put on antibiotics for ten days. BCG treatments were delayed due to this infection for 3 weeks.\nAfter the infection cleared, the specialist had me take cipro the day of and for 6 days following each BCG treatment. This was for my remaining 8 maintenance treatments. I suffered no further infections.\nI hope your husband does not have an infection, but he should be checked just in case.\nI have now finished the BCG maintenance and have been cancer free for over 2 years.\nI wish your husband all the best, and many more clear cystos.\nJack\t\t\t", "date": "2009-11-22T21:38:42+00:00", "topic": "Worst Pain of 30+ BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi David\nGood to hear the 1st treatment went well. Drink plenty of water today and tomorrow.\nBCG = Bladder Cancer Gone\nJack\t\t\t", "date": "2009-10-08T18:05:30+00:00", "topic": "1st Experience with BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats to your dad on the 2 years.\nIt is so wonderful to read success stories.\nI was 23 months clear yesterday, have another cysto on the 19th. I am hoping to join your dad on achieving the 2 year mark.\nJack:)\t\t\t", "date": "2009-10-09T00:14:02+00:00", "topic": "two years and all clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Pat\nI was TA Low Grade. I was not aware T1 could be low grade.\nBecause when I was initially dx with 3 tumors of which one was large my Uro advised he would like me to try BCG treatments.\nI have had 2 early recurrences and 18 weekly BCG treatments and 12 monthly maintenance treatments. I have had 1 FISH test early, and a cytology after each Cysto. A CT scan 1 per year.\nI got a 2nd opinion on my slides from a major cancer hospital last year. I am now 22 months cancer free and have my next Cysto in Oct. I have always had a cysto every three months.\nJack\t\t\t", "date": "2009-10-01T00:53:30+00:00", "topic": "What protocol for T1 low grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Jon\n\nI have completed my BCG maintenance treatments and have been cancer free for 20 months. Having had bladder cancer sucks, and so do the BCG treatments.\nI have learned to live with this health issue, because of this site and another I frequent. These people turned me around mentally 180 degrees.\nI found people with something in common, who shared their experiences, did research for me, taught me to live with blc. I now have many friends throughout the world who share in this disease with me.\nI am just so grateful my disease was caught early and BCG seems to have kept the tumors away. Is their a quick fix for bladder cancer, darn I wish there was. But someday there will be. Since my attitude has changed concerning blc,I now wish to give back to people what was given to me by fellow warriors. If I can assist someone by sharing my bladder cancer journey, I feel I am doing for them what has been done for me. I can't change that I was dx with bladder cancer. But I can change my outlook and feel lucky that sites like ABLCS exist.\nI wish you all the best, and hope that you can make peace with this disease.\nJack\t\t\t", "date": "2009-08-12T02:38:55+00:00", "topic": "BCG Maintenance ?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHopefully all clear Bill\nJack\t\t\t", "date": "2009-08-04T20:57:56+00:00", "topic": "Cysto moved up toTomorrow!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHappy for you Nix \nClear is such a nice word.\nJack\t\t\t", "date": "2009-07-24T20:37:22+00:00", "topic": "GOOD NEWS FOR ME, TOO", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suzy\n\nGreat you will find out if your tumors in the past have been CIS.\nYour Uro I am sure will give you a copy of your path reports.\nSorry you have been getting conflicting advice.\nAll the best,\n\nJack\t\t\t", "date": "2009-07-24T15:31:52+00:00", "topic": "confused", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suzy\n\nYour question is hard to answer until you get the path report from your latest tumor. If it is still TA low grade you should be fine.\n\nJust ensure you continue to check-ups(Cystos every 3 months)\n\nYou seem to trust your Uro which is good. Have you ever thought of getting  a 2nd opinion, due to the tumor recurrences and both BCG and MMC failing.\n\nI wish you all the best,\nJack\n\nPS: I thought you had CIS tumors in the past or am I confused on that?\t\t\t", "date": "2009-07-24T15:31:52+00:00", "topic": "confused", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis is a very good news post. Congrats to you all.\nLove words like clear and benign.\n     \n\nJack\t\t\t", "date": "2009-07-20T18:16:41+00:00", "topic": "GOOD NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI definitely had more fatigue with my last 12 BCG treatments vs my first 18.\nI finished BCG treatments the beginning of Feb. and still could not walk 1K without having to rest in April. Slowing the fatigue has reduced and now I walk 5K very easy. Actually walk 18 holes of golf and not tired one bit.\nThe only changes that have occurred is no BCG, stopped Vit D in Feb, reduced my meat intake by 1/2. I am now in better condition than before being dx with bladder cancer in 2006. I suspect the combination of changes helped, but I really think BCG was the main cause.\nJack\t\t\t", "date": "2009-07-19T03:24:21+00:00", "topic": "THE FATIGUE CONTINUES", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI love this post. Congrats, on the fantastic news.\nJack\t\t\t", "date": "2009-07-16T19:39:57+00:00", "topic": "Cysto findings today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBest of luck Nix, Monday the 20th will be a good day for you.\nAll the best,\nJack\t\t\t", "date": "2009-07-10T14:12:14+00:00", "topic": "Cysto Results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic!!!!!!!!!!!!!!\nJack\t\t\t", "date": "2009-07-07T16:30:03+00:00", "topic": "Even better news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy Uro gave me 1 instillation Mitomycin after right after my 2 & 3rd Turbt. But not after the initial Turbt.\t\t\t", "date": "2009-07-02T14:43:20+00:00", "topic": "5 things I wish I knew at dx?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLadyJane had her Turbt today in Toronto. Dr. Jewitt is happy with outcome.\n1 large tumor and a few small ones removed. Her best friend is with her, and says LadyJane is in no pain, urine is clear, and she is tired but a very happy camper. She will start MMC instillation's in August.\nLadyJane's best friend Kim took 2 days off work to be with her throughout preop and today. A true friend indeed.\nJack\t\t\t", "date": "2009-06-26T21:24:31+00:00", "topic": "LadyJane\\'s Turbt", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had BCG after initial Turbt, then another Turbt followed by BCG, then another Turbt followed by weekly BCG and 12 monthly maintenance treatments.\nCancer free now 18 months. Took a while for BCG to work for me.\nJack\t\t\t", "date": "2009-06-22T23:00:34+00:00", "topic": "The Moss Reports", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI wondered the same Bill. After 2 recurrences on BCG, I was ready to try something else, even looked into a RC. Then I got a clear Cysto, went on to BCG maintenance, and have been clear ever since. Since being off BCG for 6 months now, my physical life is back to the way it was prior to BLC.\nSo in my case the problems with BCG treatments have been worth it so far.\nI wish you all the best,\nJack\t\t\t", "date": "2009-06-17T20:58:43+00:00", "topic": "BCG (Tired &amp;amp; exhausted)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic News. Clear is such a perfect word.\nNow enjoy the summer:) cancer free!\nJack\t\t\t", "date": "2009-05-25T17:26:20+00:00", "topic": "Cross you fingers....once again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Al. My next Cysto is in July.\nHoping for another clear.\nJack\t\t\t", "date": "2009-05-16T13:47:08+00:00", "topic": "10% BCG Effective?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Slabman\n\nGlad to see you are enjoying life. I am too, 1st summer in 3 years with no Turbs or BCG treatments. Able to golf with the guys every weekend, my wife and I planning a vacation in August, assuming I am all clear at my next Cysto in July.\nContinue to enjoy, all the best,\nJack\t\t\t", "date": "2009-05-22T05:52:57+00:00", "topic": "Just Checking In.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLong-term outcome of bladder papillary urothelial neoplasms of low malignant potential\nY. Fujii*, S. Kawakami*, F. Koga*†, T. Nemoto† and K. Kihara*\n*Urology and Reproductive Medicine, and\n†Human Pathology, Tokyo Medical and Dental University Graduate School, Tokyo, Japan\nCorrespondence to  Y. Fujii, MD, PhD, Department of Urology and Reproductive Medicine, 1-5-45, Yushima, Bunkyo-ku, Tokyo 113–8519, Japan.\ne-mail: This email address is being protected from spambots. You need JavaScript enabled to view it.\n\nCopyright 2003 BJU INTERNATIONAL\nKEYWORDS\npapillary urothelial neoplasm • low malignant potential • bladder • TCC • superficial • long-term follow-up\nOBJECTIVE\n\n\nTo evaluate the long-term outcome of bladder papillary urothelial neoplasms of low malignant potential (PUNLMP).\n\nPATIENTS AND METHODS\nOf 475 consecutive patients with newly diagnosed bladder tumours between 1976 and 1993, 330 (69%) had superficial (Ta and T1) tumours and 53 (11%) were diagnosed as having PUNLMP. Fifty patients (mean age at presentation 57.2 years, range 26–83; male-to-female ratio 6 : 1) who were followed for> 5 years or until they died, were included in the present study. All histological slides were reviewed, and fulfilled the diagnostic criteria of the 1998 World Health Organization/International Society of Urological Pathology classification system.\n\nRESULTS\nThe mean (median, range) follow-up was 11.7 (10.8, 1.3–24.4) years. During the follow-up, 30 patients (60%) had local recurrences. The 2, 5 and 10-year recurrence-free rates were 66%, 51% and 36%, respectively. No patients developed high-grade or muscle-invasive (&#8805; T2) carcinomas, or upper urinary tract tumours, or died from the disease. At the last follow-up, 34 patients (68%) had been disease-free for> 5 years.\n\nCONCLUSIONS\nDespite a high recurrence rate, PUNLMP carries a very low malignant potential. We agree with the use of the term 'papillary urothelial neoplasms of low malignant potential' instead of 'superficial bladder carcinoma (cancer)' for these tumours.\n\n\n\nAccepted for publication 1 May 2003\n\nDIGITAL OBJECT IDENTIFIER (DOI)\n10.1046/j.1464-410X.2003.04415.x About DOI\n\nRelated Articles\t\t\t", "date": "2009-05-11T19:01:32+00:00", "topic": "Is PUNLMP considered \\&amp;quot;Cancer\\&amp;quot;?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDonna you slept with BCG, tumors never had a chance.\nYou will be clear, so will monitor on my birthday.\nDon't forget my present.\nJack\t\t\t", "date": "2009-04-29T00:28:46+00:00", "topic": "A Cytoscopy quetstion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi, Nix\n\nMy Uro does not follow Dr. Lamm's maintenance schedule protocol.\n\nI have had 3 TURBTS, and a total of 30 BCG treatments. Cancer free 16 months now.\n\nMy BCG maintenance schedule was 1 BCG treatment every fours weeks for a total of 12 treatments.\n\nNo further BCG is scheduled at this time. I will have 2 more 3-month Cystos and then go to 6-month Cystos for 3 years.\nMy tumors have been TA Grade 1.\n\nI wish you clear Cystos for ever Nix,\nJack\t\t\t", "date": "2009-04-20T20:45:22+00:00", "topic": "Keeping my fingers crossed!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suzy\n\nI was TA Grade 1. The BCG after 2 failures, finally did work for me. I am now 16 months cancer free.\n\nHave you had a 2nd opinion?\n\nI wish you all the best on Thursday.\n\nJack\t\t\t", "date": "2009-04-26T21:03:44+00:00", "topic": "mytomycin c for 6 weeks", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News Joey.\nHow do you spell relief: \"BENIGN\"\nHappy for you,\nJack\t\t\t", "date": "2009-04-10T21:47:48+00:00", "topic": "Recent Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVery happy for you Clijjlk.\nGood news is always welcome here.\nJack\t\t\t", "date": "2009-04-10T21:47:48+00:00", "topic": "Recent Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic News Dianne:) \nJack\t\t\t", "date": "2009-04-13T20:01:09+00:00", "topic": "All clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats, Slabman \"all clear is what we like to hear\"\n\nJack\t\t\t", "date": "2009-03-25T18:57:12+00:00", "topic": "Cysto Tomorrow", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTa, low grade papillary tumors progress in grade or become invasive less than 5% of the time, and are high in grade in only 1% to 3% of cases. In contrast, stage T1 tumors may be high grade in 30% to 50% of cases and are rarely low grade.1 Carcinoma in situ is considered a high risk form of bladder cancer with a widely variable outcome. Although all three kinds of tumors are considered non-invasive (formerly referred to as \"superficial\"), their outcomes are clearly different.\n\nI copied the above from blcwebcafe.org.\n\nMy last TURB had nearly no bleeding at all. The tumor was small. My 1st Turbt I had 3 tumors, and I was bleeding for 2 days.\n\nJack\t\t\t", "date": "2009-04-06T22:11:39+00:00", "topic": "microbacterial cell wall complex", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood news about the low grade Britt,\n\nBelieve me we were very scared when we all heard the word cancer.\n\nall the best,\nJack\t\t\t", "date": "2009-04-02T13:54:18+00:00", "topic": "I finally got some answers.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Sara Anne\n\nAre you sure that the cystitis has cleared. Did you take meds to clear the cystitis? Any bladder infection I had during BCG treatments, I was given antibiotics for 7 days, and had to wait 2 weeks until my next treatment.\nMy last 8 maintenance treatments I had to take the infection meds 2 hours after each treatment, just in case I got another infection.\nMy maintenance treatments had more side effects that the weekly treatments.\nNight and day differences.\nAlso my urine was tested for a bladder infection before each of my last 8 treatments. This only took 2 minutes for the Head Nurse to check.\nI wish I could help your more.\nJack\t\t\t", "date": "2009-03-19T23:33:07+00:00", "topic": "More BCG questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI wonder if they are trying different mixtures to different patients.\nVery interesting. This has really got my attention now.\nThanks Pat,\nJack\t\t\t", "date": "2009-03-03T18:39:24+00:00", "topic": "Reaction to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Orpheus\n\nPat has done a great job of explaining the wash.\nThe trial is only being conducted on patients,that have continued to fail BCG.\n\nwww.bioniche.com/research_trials.cfm\n\nJack\t\t\t", "date": "2009-03-03T18:39:24+00:00", "topic": "Reaction to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi, Pat\n\nI know that I would be receiving Urocidin. I am not sure what the double blind means. I read that also, but after I had received noitification, I would be acceppted in Phase 111. I was too late for Phase 11.\nI will try to find out from Dr. Jewitt's assistant when I return from vacation. As you know I am hoping I do not need to be involved in this trial.\nThanks for your interest.\nJack\t\t\t", "date": "2009-03-03T18:39:24+00:00", "topic": "Reaction to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats David.  Glad to see the BCG is working.\nJack\t\t\t", "date": "2009-02-18T02:17:21+00:00", "topic": "Another happy report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic News Sara Anne!!!\nSo happy for you:)\nJack\t\t\t", "date": "2009-02-18T02:17:21+00:00", "topic": "Another happy report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, Alan\n\nEarly results look good. If I fail my cysto next month, I will contact PMH in Toronto, where they are holding clinical trials and there are still openings.\nI hope I do not need to contact them. (lol)\nJack\t\t\t", "date": "2009-02-16T23:49:57+00:00", "topic": "Any one that fails BCG see below", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Donna, non-invasive is such a wonderful word.\nGood luck with the up-coming BCG treatments.\nEnjoy that new RED car!\nWe are so happy for you.\nJack & Debbie Moon\t\t\t", "date": "2009-02-12T22:29:15+00:00", "topic": "So Happy For Donna", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had 30 BCG treatments over the past 3 years. During my 1st 12 treatments I had very little side effects. But I also required a TURBT after each segment, TA Grade 1.\nThen during my next 6 weekly treatments, I had 2 bladder infections, burning while I urinated for 2 days, soreness in bladder and joints.\nDuring my 12 monthly treatments the side effects lasted longer after each treatment. My Uro had warned me when I started the monthly treatments, that the side effects would most likely worsen and last longer. This was based on his experience with many prior patients. Boy was his prediction correct.\nBut on a good note, I have been cancer free for 15 months, so the increased side effects for the last 18 treatments have been worth it. Next Cysto is March 26.\nJack\t\t\t", "date": "2009-01-26T20:58:02+00:00", "topic": "Mitomycin side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGod Bless you both Charlotte and Sharon.\nJack\t\t\t", "date": "2009-01-19T00:19:32+00:00", "topic": "Help! Insurance won\\'t cover catheters.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Susan\n\nMy last Turb, which was my 3rd had 3 tumors, and it took me about 4 weeks to completely recover. Good luck with the BCG, hopefully the treatments scare those darn tumors away forever.\n\nSlabman,\n\nMy Uro always made me use a cat for 5-7 days after the Turb. I hated that dam thing too. When my urine was 100% clean, he would then have the nurse remove it. He told me he was being cautious, but wanted to ensure their were no blockages.\nJack\t\t\t", "date": "2008-12-17T07:02:07+00:00", "topic": "WELL POOPOO", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News Doug on the check up.\nYou and Lady Jane will be starting BCG just as I finish my 12 monthlys.\nHopefully, you will both have the same positive news in 2009 that I expect.\nI have not given this disease the final knockout punch yet, but boy I have him backed in the corner and ready to go.\nGreat luck you two with your treatments.\nJack\t\t\t", "date": "2008-12-23T10:03:22+00:00", "topic": "Time for more BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Friends\n\nAt this time of the year we have so much going on, Christmas, family, and friends, and of course some of you with operations, treatments, and check-ups.\nI reached another milestone in my own struggle with BC, I am 13 months cancer free TODAY! Thats the best Christmas gift I could ever receive. I fight this battle one day at a time and try to stay as positive as I can.\nWhat has helped me stay so positve over the few months, is this web-site and all you wonderful people. I continue to learn from you all, each and every day and look forward to reading your comments each morning and evening.\nI am so thankful to each and everyone of you.\nGod Bless\nJack\t\t\t", "date": "2008-12-25T15:51:13+00:00", "topic": "I am so thank-ful!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFantastic news David.\nWhat wonderful Christmas gift.\nMay you and your family have a great holiday.\nJack  ", "date": "2008-11-26T02:35:56+00:00", "topic": "Cysto results --- hopefully good (fingers crossed)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFANTASTIC! FANTASTIC! FANTASTIC!\n\nGREAT NEWS!\n\nHave a wonderful holiday season.\n\nJack\t\t\t", "date": "2008-12-19T11:52:14+00:00", "topic": "good news today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Don\n\nI am on monthly BCG treatments. My URO asked that I do a treatment every 4 weeks for a total of 12 treatments. He will do a cyso 9 weeks after my last treatment. Then we will discuss a new plan of action, assuming I am cancer free.\nI am aware of 3 other Uro's in the area that also practice this type of monthly BCG maintenance.\nJack\t\t\t", "date": "2008-12-14T21:37:31+00:00", "topic": "BCG \\&amp;quot;Controversy\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suzi\nAt our new hospital, they have a complete urogolgy and pathogy department, which is fantastic. The 4 Urogolist in the area have all moved to this hospital along with specialist nurses.\nI am not sure if the new equipment is NBI, but I will ask next Friday while at my BCG treatment. I am pretty sure it is, since my Uro brags about it so much.(lol).\nI do not think I have had dye injected prior to my previous cyso's either, again I will ask the head nurse next Friday.\nI would think your Uro is aware of the NBI equipment, as I am sure the company that manufacturers the NBI, would want to sell him one for his clinic.\nIsn't this site great!\nJack\t\t\t", "date": "2008-12-13T00:32:30+00:00", "topic": "Is any one \\'s Uro used   (NBI)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Ann\n\nThe reason my URO moved me to 6 months cycos after 1 year free, is because my monthly BCG treatments have been working so well, no cancer cells in my urine or blood. I still have 2 monthly BCG treatments left.\nIf everything is fine in April, he will then start me on Dr. Lamm's recommended annual BCG maintenance schedule. I am wishful thinking, that I would start 1 year cycos next year. My URO insists on 6-month Cysos until 5 years tumor free. I am like you Superficial Stage 1.\nSorry for the confusion.\nJack\t\t\t", "date": "2008-12-09T21:19:37+00:00", "topic": "Good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have chosen to keep giving the BCG a chance to work.\nI have had 3 TURBs and 26 BCG treatments, since 2005.\nMy staging has been Superficial,TA Stage 1.\nI feel, based on what I have read, and reasearched, as long as my staging does not get worse, and tumors remain Superficial, I will try to save my bladder.\nMy Urogolist and my Family Doc both agree with me.\nI am now 13 months tumor free, and have completed 10 of 12 monthly BCG treatments. Maybe the monthly BCG treatments have finally worked.\nI tend to be a positive person, so I am assuming that is the case.\nI hope that the BCG treatments do work for your husband.\nI wish I could offer you more than my personal history with TURBS and BCG.\nBest of luck to you both.\nJack\t\t\t", "date": "2008-12-07T23:35:40+00:00", "topic": "2 BCG Treatments Down - 1 To Go", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Anita\n\nThe most tumors I have had removed was 4.\nTwo of the tumors were benign.\nThat was in 2006, and I still have my bladder.\nSince then I have had a TURB in 2007 and 2 tumors removed.\nIn all cases, the tumors were Non-invasive Superficial Stage 1.\nI have had several BCG treatments and have been cancer free for 13 months.\nMy Urogolist has always told me, that its not the number of tumors, but the grade of tumors. As long as the tumors remain Superficial,(non-invasive) he will continue to save my bladder.\nI wish Doug all the best.\nRegards,\nJack\t\t\t", "date": "2008-12-07T16:32:23+00:00", "topic": "Number of tumors", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is just fantastic news John.\nI am sure you are relieved. I know I was on Nov 3rd when I got the good news also.\nWishing all the best!\nJack\t\t\t", "date": "2008-11-06T19:37:27+00:00", "topic": "BC reoccurence with/without hematuria", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, 1 BCG treatment every 4 weeks, for 12 months\nThanks Kathy\nJack\t\t\t", "date": "2008-11-08T19:33:35+00:00", "topic": "BCG Monthly Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am looking for people that have had experience with monthly BCG treatments.\nI have non invasive cancer stage 1.\nI have had 8 monthly treatments with no tumor recurrences.\nI have 4 more scheduled.\nCan anyone share with me their experience with the monthly treatments.\nThanks,\nJack\t\t\t", "date": "2008-11-08T19:33:35+00:00", "topic": "BCG Monthly Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHappy that you are home, and sound so positive.\nHopefully the BCG treatments will work for you as they have for me.\nI really think the monthly treatments turned the corner for me.\n\nJack\t\t\t", "date": "2008-11-07T20:16:26+00:00", "topic": "I had my surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tA Fellow Canuck here.\nI have had 3 Operations and followed each 1 with 6 BCG treatments.\nI am now on the 12 monthly BCG treatments.\nI have had no tumor reocurrence in 12 months now, basically since I started the monthly treatments.\nI am a believer in BCG.\nI wish you all the best, stay positive, you will beat this disease.\nRegards,\nJack\t\t\t", "date": "2008-10-30T19:04:26+00:00", "topic": "A Canadian checking in", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou should discuss your pathology report with your Urologist ASAP. Based on what you are stating above, the tumor has invaded the muscle of the bladder, which means you have have muscle invasive bladder cancer.\nAll the best,\nJack\t\t\t", "date": "2016-05-11T20:51:03+00:00", "topic": "can anyone tell me what this means", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad blood in my in 2005, met my family Doc, he did several tests including an ultrasound and then sent me to a Urologist. Three tumors were found in my bladder, one which was very large. Started 6 BCG treatments, but had a recurrence, started another 6 BCG and had another recurrence. At this Turbt the doc instilled mitomycin C and I then started another set of BCG treatments, followed by 12 monthly maintenance BCG treatments. So as of this writing I have been all clear 4 years on Nov 10, 2011. During my treatments I had a number of UTI's and in 2009 my Uro sent me to an Infection Specialist. After several tests he found that due to the number of BCG treatments my bladder was never totally emptying. So he prescribed cranberry supplements. I have not had a UTI since and my bladder has recovered and is now totally emptying.\nIn 2008 thanks to the fine people at this site I got a 2nd opinion at a top bladder cancer hospital, who confirmed my pathology results and my treatment plan.\nFor many reasons I co-founded Bladder Cancer Canada in 2009. We have grown to over 600 members and grow by approx 7 members per week. We have raised sufficient funds to partner with Health Canada for our first bladder cancer research project in 2012.\nThere are several people on this site that motivated and helped with the creation of a Canadian bladder cancer support group.\nI honestly believe that ABLCS has the most knowledgeable patients and caregivers to support newly dx bladder cancer patients and their families. I still send Canadians who have a rare or complex diagnosis to ABLCS to get the best advice and support.\nBCG = Bladder Cancer Gone\nThanks for reading my story,\nJack Moon\nPresident\nBladder Cancer Canada\t\t\t", "date": "2011-10-30T23:53:39+00:00", "topic": "Jack\\'s (Moonerj) Story", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow you guys are good!!! True he was away from home for 4 days, in air conditioned environment, was not drinking his usual amount of daily water, and of course different food. Since he got back home, took a laxative which stopped the gas and constipation, his urine colour is back to normal.\nIn fact the last time this occurred same circumstances he was away from home when this started.\nThanks so much.\nJack\t\t\t", "date": "2011-02-27T15:18:56+00:00", "topic": "White Urine and Constipation", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCharlotte\n\nYou have nothing to feel guilty about. Dam, what you have gone through at such a young age, I find you to be just remarkable. You are here on this site helping, supporting, caring, and sharing your experiences with your bladder cancer journey. Do you know how many warriors you have helped here.\nFar more than you could ever realize.\nYou welcomed me to this site with open arms, and great advice.\nNo you are not guilty of anything, except for being such a compassionate, loving and caring person. I am proud to have met you, and have you as a friend.\nHappy Anniversary.\nHugs,\nJack\t\t\t", "date": "2009-08-06T07:15:26+00:00", "topic": "Guilt", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSounds like very good news Mike.\nHappy for you.\nJack\t\t\t", "date": "2009-07-01T02:07:49+00:00", "topic": "Cysto, self cath training, and \\&amp;quot;the shot\\&amp;quot;", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can't imagine anyone giving this report much credibility without mentioning stage and grade. If cancer ever returns to my bladder as noninvasive low grade, I will not have a RC. This is from 2 pretty darn good Uros.\nSecondly I have a friend who got a neobladder in 1991, lives a pretty normal life. He was Stage 2 high grade. Just gets checked every year.\nJack\t\t\t", "date": "2009-06-28T18:17:25+00:00", "topic": "Your opinion on this info!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo happy for you. Goals are set to be met. You reached all 3.\nNow go out there and Win a race for all of us. Just kidding.\nYou are an inspiration to your fellow bladder cancer warriors.\nCongrats,\nJack\t\t\t", "date": "2009-05-29T15:57:01+00:00", "topic": "There is  Life after Cancer! Even More!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad you are recovering now, Will.\nTalk to you Sunday on the chat.\nAll the best,\nJack\t\t\t", "date": "2009-05-13T00:12:43+00:00", "topic": "SailorMan\\'s Surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLMAO!!!!!!!!!\nSoooooooooo Funny!\nJack\t\t\t", "date": "2009-04-13T16:38:53+00:00", "topic": "Post Op care for cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHas anyone heard how Carolyn is doing?\nJack\t\t\t", "date": "2009-01-02T12:49:12+00:00", "topic": "Circle of support for Carolyn", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Betsy Mae\n\nI wish you much success with your up-coming chemo treatments.\nIt is great that you were able to find another support site, and talk with your peers who have had similiar treatments.\nMay 2009 be a year of recovery and happiness for you.\nHappy New Year,\nJack\t\t\t", "date": "2008-12-27T10:56:38+00:00", "topic": "Latest News", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo happy for you!\nJack\t\t\t", "date": "2008-11-08T04:33:17+00:00", "topic": "Great news", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Friends\nA fellow warrior has asked that I try to find information on the single chemo Abraxane. His Uro has recommended he enroll in a clinical trial Phase 11 using this new treatment.\n\nclinicaltrials.gov/ct2/show/NCT00683059\n\n1. Anyone have experience with this new of chemo?\n2. If so, what are the side effects?\n3. Can you report any results using this new chemo for bladder cancer?\n\nThanks for any assistance you can provide,\nJack\t\t\t", "date": "2010-01-15T02:08:04+00:00", "topic": "Need Help Info Abraxane Chemo", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHi, Stacker\n\nPlease email me, you have my email address.\nThere are treatments and clinical trials at PMH in Toronto.\nI can get you a 2nd opinion with Dr. Jewett who is on our medical advisory board at cbcan. He is a Urologist/Oncologist and is one of the top in Canada.\nJack\t\t\t", "date": "2009-11-17T17:49:18+00:00", "topic": "Help! Feeling Lost", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tHi Ed\nHow did your 2nd opinion go at Sunnybrook.\nI am also from the Toronto area.\nI am very familiar with Dr. Jewett in Toronto at PMH.\nIf you need any assistance in getting a 2nd opinion I can help you.\nI am President of Canadian Bladder Cancer Advocacy Network.\nCheck out our new website, we are just starting.\nWe have many of Canada's top Uros on our medical advisory board. www.cbcan.org\nWe are also looking for volunteers.\nYou can contact me at the site. email or phone.\nAll the best\nJack Moon\t\t\t", "date": "2009-08-25T21:57:39+00:00", "topic": "Living with stage IV", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n", "date": "2009-07-15T15:49:48+00:00", "topic": "BLC and Sexuality", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tMy prescription insurance is private insurance, Sun Life not through our government insurance.\nThe standard letter was a letter my Uro had, not sure if all Uros do this.\nI am glad I did not have to pay, $120 for 8 pills that you would cut in two.\nJack\t\t\t", "date": "2009-11-01T21:46:05+00:00", "topic": "Any luck w/Insurance paying for viagra or cialis?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi Mike\n\nDuring my last 18 BCG treatments my Uro prescribed viagra.\nMy insurance company in Canada covered the cost (80%) because the prescription was written for a treatment I was under going.\nMy Uro gave me a standard letter for me to send to the insurance company.\nThank god I do not have to use that stuff any longer, gave me  the worst head aches.\nJack\t\t\t", "date": "2009-11-01T21:46:05+00:00", "topic": "Any luck w/Insurance paying for viagra or cialis?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi Bill\n\nSorry to hear of your problems with the side effects.\nHave been checked for an UTI?\nI also found the maintenace treatments had more and longer side effects. But I would get that blood clots checked by the Uro. As Mike has stated you can get the doseage of BCG reduced.\nAll the best,\nJack\t\t\t", "date": "2009-09-12T13:20:20+00:00", "topic": "Started Maintenance BCG!", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi Bill\n\nI know from experience what you are feeling. It's not a walk in the park, and yes the side effects are progressive. Regarding the peridium, are you taking 2 tablets at a time? I began with just 1 tablet, and felt no relief.\nWhen I started taking 2, 3 times a day, it certainly reduced the burning and the pain in the bladder.\nHope the side effects subside soon.\nJack\nJust a reminder when taking medication never exceed or change dosage unless you talk to your doctor.  ", "date": "2009-06-05T23:04:25+00:00", "topic": "BCG Update", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI got the numbing jell after I asked for it, I think after my 8th or 9th treatment. From then on it was used for all future treatments.\nMy cath was a number 14, only know that because I asked after coming to this site last fall.\nI have found the jell is not standard practice for BCG treatments, as it is for Cystos. But if you ask you shall receive.\nAll the best,\nJack\t\t\t", "date": "2009-05-22T19:14:16+00:00", "topic": "New Bladder Cancer Pt", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi There\n\nI had stage 2 bladder cancer. I have had 3 operations, over a 3 year period, followed by 6 weekly BCG treatments after each operation, in fact after the last operation I had the 6 weekly treatments, followed by 12 monthly treatments of BCG.\nSince I started the monthly BCG treatments I have had no tumors reappear.\nI am now 1 year cancer free!\nI understand what your husband is going through with the pain in the bladder and the pain and buring while urinating.\nI go through 3-4 days of this pain and burning after each BCG treatment.\nSince my Doc put me on medications following each treatment, the pain and buring is far less, but still there. I also was suffering from many bladder infections, but they have disappeared since I started the medications 6 months ago.\nMy Doc (Uroglist) told me that the pain and buring are normal, and that I should be thankful that I get this, as it proves that the BCG is working.\nYou are wise to keep in contact with your Doc about the pain and buring.\nAsk him about the meds taht are available for the burning and for infections, trust me the meds work.\nI hope I have helped you some.\nRegards,\nJack Moon\t\t\t", "date": "2008-05-11T16:55:28+00:00", "topic": "BCG", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi, Lorrie\n\nFirst of all Happy Birthday.\n\nAfer reading your post I have just realized we are neighbours. I live in Georgetown, so I am thinking you are on the Kitchener area. If there is anything I can do to help you you through this period, I will make myself available.\nI still work, but am in your area a couple times a week.\n\nRegards,\nJack Moon\t\t\t", "date": "2009-06-06T22:59:44+00:00", "topic": "Thoughts on birthdays, life, &amp;amp; death", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Mark, it is a start. We have been able to secure over $300,000 worth of space for the cost and installation of the 4'X6' posters, at transit shelters, buses, TVs in hospitals, and gyms. We begin on billboards in the Spring. The artwork was donated and received the gold award for advertising for charities in Canada.\nAll space has been supplied at no cost from some generous corporations and cities.\nThis has all been accomplished by 1 volunteer who does not have bladder cancer.\nWe will next be targeting the general practitioners next fall with the same advertising except the wording will be \"Not Yellow, Something Is Wrong\"\nOur success with our 5K Walk in 2012 has made this all possible.\nOur goal over the next 3 years is to have bladder cancer known as well as prostate cancer.\nWe have been blessed with many dedicated volunteers.\nJack\t\t\t", "date": "2012-11-21T22:28:52+00:00", "topic": "Canada Public Awareness Program Now Launched", "subforum": "31-articles-of-interest"}, {"text": "\nwww.bladdercancercanada.org/main.php?p=785&lan=1\n\"See Red, See Your Doctor\" awareness program is being launched this week in major cities across Canada.\nJack Moon\nPresident\nBladder Cancer Canada\t\t\t", "date": "2012-11-21T22:28:52+00:00", "topic": "Canada Public Awareness Program Now Launched", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tPress Release For Patient Conference Toronto Canada May 28, 2011.\nJack\n\n\ncnw.ca/en/releases/archive/May2011/09/c2499.html ", "date": "2011-05-09T18:34:05+00:00", "topic": "Canadian Bladder Cancer Network Press Release", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi Pat\n\nI am not that well versed regarding RC's and conversions.\nWhat would be the advantages of this new procedure over current method?\nThanks for your help.\nJack\t\t\t", "date": "2010-07-31T03:40:06+00:00", "topic": "Want a new bladder from your own cells?", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tWhen I read this report, all I could think of was you Pat.\nI just hope that the Uros not located at the top cancer and teaching hospitals read this report. Dr Kassouf who wrote this report, is the Chair of our Medical Advisory Board, on the Canadian Bladder Cancer Network. He is a lot like Dr. Lamm. Every time I email him with questions from Canadian patients, I usually have a return email with-in 24 hours.\nJack\t\t\t", "date": "2010-02-27T22:04:48+00:00", "topic": "Management Of Non-Invasive Bladder Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThe is a lengthy report. If you are non-invasive I recommend you print the report for reading.\nSpeaks of current protocols, current challenges, and new things on the horizon regarding non-invasive treatments..\nJack\n\n\nwww.ncbi.nlm.nih.gov/pmc/articles/PMC2812001/?tool=pubmed ", "date": "2010-02-27T22:04:48+00:00", "topic": "Management Of Non-Invasive Bladder Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi Pat\n\nYou are so right I did answer my questions. In speaking to the President of CDN Uro ASSOC. the problem with the light is cost, and logistics. He thinks you will only see this equipment at the top cancer and teaching hospitals.\nThis will create a numbers problem at these locations.\nHe thinks it will take a few years to sort everything out as these hospitals will need more qualified nurses and more Uros just because of demand for this procedure.\nI will talk to Dr. Jewett about it in a few weeks and get his input.\nJack\t\t\t", "date": "2009-12-20T18:39:28+00:00", "topic": "FDA Committee Vote Favorable to Hexvix", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI wonder why the vote was only 9-8 in favour. Why were the 8 voting against?\n\nThis will increase the time for a cysto by at least 1 hour, as the Hexvix is instilled for 1 hour and then removed and then the cysto is performed.\n\nI wonder how many hospitals will actually use this new light.\n\nJack\t\t\t", "date": "2009-12-20T18:39:28+00:00", "topic": "FDA Committee Vote Favorable to Hexvix", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI have been taking baby aspirin for about 18 months now. I think I began around my 19th or 20th BCG treatment. Still cancer free.\nJack\t\t\t", "date": "2009-09-05T16:07:05+00:00", "topic": "Aspirin and BCG effectiveness", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tIn Canada we are in the early stages of starting a bladder cancer awareness group. We have 3 board members, and 5 medical advisers (top Uros) on board, along with the support of the Cdn Uro Assoc. Our website is under construction and hopefully will launch Oct. 1/09. We are proud to be the first national BLC advocacy group in our country.\nWe are currently recruiting Canadian advocates and volunteers.\nWe have applied for a charitable corporate charter from the Canadian government.\nWe are aware that this is a very immense project and will take time to get organized and on our feet properly.\nWe do not intend to re-invent the wheel and will be counting on people like Cynthia and Diane to guide us and assist us with their extensive knowledge in the awareness field. We look to ABLCS and BCAN as our friends.\nWe would not be in a position to even think about this project without the two proven groups in the USA.\nJack\t\t\t", "date": "2009-08-31T14:50:33+00:00", "topic": "Canadian Bladder Cancer Advocacy Group", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tYou are right there Pat.\nBut don't get me going on that subject.\nJack\t\t\t", "date": "2009-04-15T20:42:22+00:00", "topic": "Follow-up After RC For BLC-Is There Any Benefit?", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks for posting Sara.\nI just wish we could have heard the dialog between teacher and students.\nI agree with Mike, if you have non-invasive BLC, it's a must watch.\nJack\t\t\t", "date": "2009-03-21T18:55:19+00:00", "topic": "Good overview, non-invasive bladder cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi, Gordon\nI have asked for a few original studies that were done at the Princess Margaret Hospital in Toronto Canada. I had to email the Department of Urology and they would email the original studies on PDF, usually several pages long.\nI think if you emailed University of Michigan, Urology Department, they would send the report to you. Just an idea.\nJack\t\t\t", "date": "2009-02-07T17:10:42+00:00", "topic": "Why you might consider where you are treated", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks, Pat\n\nThe BTA statstat test is CLIA waived and also available for prescription home use.\n\nDoes this mean we can test ourselves?\n\nJack\t\t\t", "date": "2009-01-30T19:41:58+00:00", "topic": "new and better urine cytology", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks so much Donna.\nJack\t\t\t", "date": "2009-01-29T16:41:52+00:00", "topic": "Redbook article", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tOh yes Pat, he sounds about as bright as blown light bulb.\nI can't believe what I just read.\nJack\t\t\t", "date": "2009-01-16T19:56:15+00:00", "topic": "More Americans Urged to Get Cancer Screenings", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThis is an article that appeared in the Naples Daily News, Saturday, Dec. 20, 2008:\n\n\nJOURNAL SUPPORTS SANIBEL MAN'S CANCER CURE\n\n\nThrough his own battle with leukemia, John Kanzius may have developed cure for colon and pancreatic cancer.  His work has been recognized by researchers who may begin human testing within two years.\n\n\nBy Matt Clark\n\n\nThey've demonstrated the \"holy Grail\"of cancer research.\nIn a manuscript published Friday, researchers say they have successfully targeted and killed two of the most deadly types of cancer cells, colon and pancreatic; using the treatment invented by Sanibel Island and Erie, Pa., resident John Kanzilus.\n\"This is what everybody's been waiting for,\" Kanzilus said.  \"Can you target cancer cells? And the answer is \"yes.\" Can you kill them? Yes. Can you target specific cancers? Yes.\"\nThe experiments were conducted with live cancer cells in specimen dishes and not within animals, but the findings published on the Web site of the peer-reviewed Journal of Experimental Therapeutics and Oncology have shown once again that a man with no formal medical training - and who continues his own battle with a rare form of B-cell leukemia - can develop a treatment capable of killing cancer.\nNonetheless, Kanzius gives all the credit to the researchers, led by Dr. Steven Curley, a professor of surgical oncology at M.D. Anderson Cancer Center in Houston, rated No. 1 in cancer treatment by U.S. News and World Report for four of the past six years.\n\"I had the idea, but they're making it work.  They're the ones that deserve all the accolades.  I consider myself just a small gear in the whole big process,\" Kanzius said.  \"It is sort of funny, though, how I imagined this working when I first started working on the equipment that the first two tests would use all the elements that I thought of - antibodies and radio frequency.\"\nKanzius, 64, developed the treatment after witnessing first-hand the effect cancer had on children undergoing chemotherapy treatments, which he first saw while undergoing his own treatment in 2--3.\nDuring chemo-induced sleepless nights, Kanzius couldn't keep the idea out of his head: There had to be a better way.\nHis idea was to use his extensive background in radio transmitters to develop a harmless, low-frequency field of radio waves capable of heating metal.  The small pieces of metal would be targeted to specific cancer cells on the backs of synthetic, disease-fighting antibody cells created in a lab.  Heat the metal in the cells with the radio frequency feld, it was thought, and the cancer would be destroyed.\nThe researchers already have demonstrated they can kill cancer cells in laboratory animals using Kanzius' device and microscopic pieces of gold known as nanoparticles, which are non-toxic and so small 75,000 to 100,000 of them can fit across the tip of a human hair.\nBut those experiments, published October 2007, had the nanoparticles injected directly into tumors, not targeted to specific cancer cells.\nCurley announced the successes demonstrated in the manuscript in a letter to supporters earlier this month.\n\"This will be the first manuscript that proves that we can target nanoparticles to a specific abnormality on cancer cells, and increase the killing by getting more nanoparticles into the cells,\" Curley said.\nFor the experiment,Curley worked with six other researchers from M.D. Anderson, Harvard Uiversity, the Mayo Clinic and Rice University.  The researchers placed the pancreatic and colon cancer cells into sppecimen dishes with the nanoparticle-antibody pairs.\nBreast cancer cells, which the antibodies are unable to target, also were placed with the targeting paris in dishes as a control group.\nAfter 24 hours of incubation, the dishes were placed in Kansius' radio frequency field for two minutes.  The results? Nearly 100percent of the colon and pancreatic cancer cells were destroyed, while the breast cancer cells and other cells int he dishes remained unharmed.\nThe treatment's ability to hunt down and destroy cancer no matter where it hides in the body would allow for the treatment of cancer that has metastasized, or spread to other parts of the body.\nCurley believes the treatment will be effective with many types of cancer.\n\"We're now working on other types of cancer cells, including breast, liver, prostate, leukemia, and ovarian,\" Curley said in an Erie Times-News article published Friday.\n\"This is indeed an innovative mode of cancer management that hopefully can be used to target metastatic diseases where conventional surgical intervention by itself can be inadequate,\" Fan said.\nIn his letter, Curley said talks with the Food and Drug Administration already have begun.\n\"We plan to schedule a meeting with them in early 2009 to discuss the steps necessary to get this treatment to human clinical trials,\" Curley said.\nIf the research gets to human clinical trials, which some of the researchers have estimated may occur within the next two years, Lee Memorial Health System is expected to be a site early on for the experiments.\nThe research, which is funded through donations to Kanzius research foundation, has attracted a lot of attention from politicians in Pennsylvania, who have secured further funding and celebrities.\nAmong the notables are legendary golfer Arnold Paler and actress Sharon Stone, who is reportedly interested in the treatment's promise of targeting and destroying other pathogens like HIV.\nIn the coming months, Kanzius said several more manuscripts are expected.\nOne of those will be a study done on blood samples given by leukemia patients in Pennsylvania, in which the treatment was applied.  Results of animal tests also are expected.  The co-director of the Liver Cancer Center at the University of Pittsburgh Medical Center, Dr. David Geller, who conducted research into the machine early on, said the new manuscript appears to be a \"logical step forward.\"\n\"We still have a long way to go to prove targeting and thermal destruction in animals,\" Geller said\nDuring the summer, Kanzius designed a new machine capable of treating an entire person with the radio frequency field.  He said parts are being constructed.\nKanzius intends to visit M.D. Anderson in the coming months, not just to check up on Curley, but also to have himself checked out.  He's holding on to the possibility of using the treatment on himself.\n\"We're a long ways from where we started, and we see a lot of light at the end of this tunnel,\" Kanzius said. \"When we started out it was so much to prove, so much physics and science.  Today's manuscript was a very crucial part of this whole thing, without targeting you would never have this treatment.\"\t\t\t", "date": "2009-01-05T19:16:21+00:00", "topic": "John Kanzius may have developed a cancer cure", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tMay 2013 be a year of ALL CLEARS for all of you.\nHappy New Year\nJack\t\t\t", "date": "2012-12-31T21:07:40+00:00", "topic": "Happy New Year Everyone", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Friends\n\nABLCS was the 1st support site I found in 2007 after being diagnosed with bladder cancer in 2005. I learned more in a week here from all the great people, than my 2 previous years.\nBecause of what I was taught here, I figured we should have a support group in Canada. I co-founded Canadian Bladder Cancer Network in the fall of 2009.\nWe had a few members in 2010 organize a 5K walk. With just 9 teams CBCAN raised over $25,000. We will have our 2nd annual walk on June 25th 2011 in the hope to raise $50,000.\nABLCS has over 10 times the membership of our Canadian support site.\nCan you just imagine how much could be raised for ABLCS, if everyone really got behind the project. Do you know how many people could be helped. Do you know how much awareness could be spread.\nPlease give back to this great support group. Remember what these people have done for you. All donations are tax deductible. You have a site right here where your sponsors can donate to your walk.\nChallenge yourself people, you just can't believe the satisfaction you will receive by giving back.\nAll the best\nJack Moon\nPresident\nCBCAN\t\t\t", "date": "2011-01-20T12:41:38+00:00", "topic": "Challenge to All!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCongrats on your 2 year cancer free birthday Mike.\nAll the best,\nJack\t\t\t", "date": "2010-10-09T13:18:19+00:00", "topic": "We had cake!  :)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJust copy and paste. add the www. to youtube\nEnjoy\n\nyoutube.com/watch?v=NG2zyeVRcbs\n\n\n\nHere you go, we can all sing along with her.\nthe lyrics:\nWhat a great Bladder Cancer Theme Song\n\nI can almost see it\nThat dream I’m dreaming but\nThere’s a voice inside my head sayin,\nYou’ll never reach it,\nEvery step I’m taking,\nEvery move I make feels\nLost with no direction\nMy faith is shaking but I\nGot to keep trying\nGot to keep my head held high\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSometimes I'm going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nThe struggles I’m facing,\nThe chances I’m taking\nSometimes they might knock me down but\nNo I’m not breaking\nI may not know it\nBut these are the moments that\nI’m going to remember most yeah\nJust got to keep going\nAnd I,\nI got to be strong\nJust keep pushing on,\ncause\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSometimes I'm going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSomebody's you're going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nKeep on moving\nKeep climbing\nKeep the faith baby\nIt’s all about\nIt’s all about\nThe climb\nKeep the faith\nKeep your faith\nWhoaaa Ohwaoooh\t\t\t", "date": "2009-11-28T22:29:25+00:00", "topic": "My Bladder Cancer Theme Song", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRead the lyrics as you listen to the song.\nNow see if you can keep a dry eye.\nThis song is just so bladder cancer.\nHope you enjoy.\nJack\n\n\n\n\nI can almost see it\nThat dream I’m dreaming but\nThere’s a voice inside my head sayin,\nYou’ll never reach it,\nEvery step I’m taking,\nEvery move I make feels\nLost with no direction\nMy faith is shaking but I\nGot to keep trying\nGot to keep my head held high\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSometimes I'm going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nThe struggles I’m facing,\nThe chances I’m taking\nSometimes they might knock me down but\nNo I’m not breaking\nI may not know it\nBut these are the moments that\nI’m going to remember most yeah\nJust got to keep going\nAnd I,\nI got to be strong\nJust keep pushing on,\ncause\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSometimes I'm going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSomebody's you're going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nKeep on moving\nKeep climbing\nKeep the faith baby\nIt’s all about\nIt’s all about\nThe climb\nKeep the faith\nKeep your faith\nWhoaaa Ohwaoooh\t\t\t", "date": "2009-11-28T22:29:25+00:00", "topic": "My Bladder Cancer Theme Song", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI second that.\nJack\t\t\t", "date": "2009-11-25T19:42:28+00:00", "topic": "Happy Thanksgiving!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe missed you Char. Hip Hip Horayyyyyyyy for Lauren \nGlad you guys had a great time.\nJack\t\t\t", "date": "2009-11-10T19:14:49+00:00", "topic": "I\\'m Back", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Mike\n\nThis site was the first support group I found when I was struggling with this disease.\nABLCS has the best website for bladder cancer, and the most knowledgeable support group I have come across.\nIt was very important to me to get our site directly linked to ABLCS. The information about bladder cancer and the PEOPLE here are Second to none.\nI still attend the Sunday night chats when I can, and will continue. I just can not see a day, if I have access to a computer, I would not check in here ABLCS.\nJack:)\t\t\t", "date": "2009-11-02T21:45:07+00:00", "topic": "Canadian BLC Support Group Now Available", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Everyone\n\nToday the Canadian Bladder Cancer Network is born.\nWe are a non-profit national support group available to assist newly dx, and veterans of this disease. We have received approval from the Charitable Guardian in Canada.\n\nOur thrust will be patient support, awareness, and research.\nWe thank Cynthia for her support and the ability to link to this great site here, and members of ABLCS assisting me testing our website. www.cbcan.org.\n\nWe have a medical advisory board of 13 top Canadian Urologists, who will answer patient questions on our discussion forum. The Urologists have been big supporters of our group since this dream began.\nThanks everyone.\nTogether We Are Better\nJack Moon\nPresident\nCBCAN\t\t\t", "date": "2009-11-02T21:45:07+00:00", "topic": "Canadian BLC Support Group Now Available", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat to see you back with the group Holly.\nJack\t\t\t", "date": "2009-10-25T14:39:37+00:00", "topic": "I was simply lost", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAll the information for this bladder cancer patient forum is at:\n\nwww.bcan.org ", "date": "2009-09-29T18:36:37+00:00", "topic": "Bladder Cancer Patient Forum", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWould be happy to give you an interview Webs.\nJack\t\t\t", "date": "2009-09-15T20:23:47+00:00", "topic": "Facebook interviews", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNo question, the best by far \nJack\t\t\t", "date": "2009-09-07T14:57:01+00:00", "topic": "New Look", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tKarl\n\nAll I can say he that you are an inspiration to all bladder cancers survivors. Well done!\n\nJack\t\t\t", "date": "2009-07-20T08:08:55+00:00", "topic": "Some inspiration and perspiration!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLMAO, that is so funny.\nJack\t\t\t", "date": "2009-05-22T12:08:28+00:00", "topic": "A salutory tale!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCute! Good One.\nJack\t\t\t", "date": "2009-05-15T12:55:03+00:00", "topic": "The Three Bears", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWhere is it Mike?(LOL)\nWorks now, thanks\t\t\t", "date": "2009-05-18T21:55:35+00:00", "topic": "Cannes", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWell with that news, I am off to the DQ to get my favorite, Choclate Fudge Sundae, LARGE.\n ", "date": "2009-05-12T22:29:45+00:00", "topic": "another arguement for CHOCOLATE", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSo nice to have you back Charlotte.\nIt was great talking to you on the chat line last night.\nThanks for the BD card, you started my day off on the the right foot, with a big smile.\n \n\nJack\t\t\t", "date": "2009-05-10T23:13:26+00:00", "topic": "I\\'m Back!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Julie\n\nI wish you all the very best for a much deserved speedy recovery.\nHugs,\nJack\t\t\t", "date": "2009-04-27T00:58:29+00:00", "topic": "iceberg alley", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWebs,hope you get that laptop back soon, we miss you:)\nJack\t\t\t", "date": "2009-04-20T20:25:22+00:00", "topic": "m computer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCongratulations to the team and to your daughter.\nYou should be very proud.\nJack\t\t\t", "date": "2009-04-02T14:36:15+00:00", "topic": "Competition results", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tOk Rocky\n\nI have 2 answers:\n\nDuring BCG Treatments: 6 times would be my highest.\n\nNow let's see last night: just 1 time.\n\nSo I guess I lose.\nJack\t\t\t", "date": "2009-03-29T03:54:33+00:00", "topic": "contest", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that was funny!\nThanks so much:laugh:\nJack\t\t\t", "date": "2009-03-16T18:52:38+00:00", "topic": "American Courts", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHer she is again.\n\n\n\nI got this one from LadyJane (lol)\nEven Simon liked her!\t\t\t", "date": "2009-02-25T23:52:43+00:00", "topic": "You Must Hear This Little One Sing", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tShe actually made me cry.\nSee this video.\n\n\nwww.tagtele.com/videos/voir/19214/1/ ", "date": "2009-02-25T23:52:43+00:00", "topic": "You Must Hear This Little One Sing", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks, Mona\nJust copied for my wife. She will make me one on Sunday.\nThis could be dangerous(lol)\nJack\t\t\t", "date": "2009-02-20T16:38:58+00:00", "topic": "The most dangerous cake recipe", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tTo all you wonderful BLC survivors and caregivers, Happy Valentines Day.\nMay your day be full of love, friendship and companionship.\nThank you all for being so helpful and friendly to me over the past few months.\nYou make this journey alot easier.\nGod Bless You All,\nJack\t\t\t", "date": "2009-02-14T23:44:42+00:00", "topic": "Happy Valentines Day", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSo Funny!   \nJack\t\t\t", "date": "2009-02-11T13:24:38+00:00", "topic": "As written on hospital charts by Doctors!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat news on the clean Cysto Rocky!\nJack\t\t\t", "date": "2009-01-29T01:14:16+00:00", "topic": "housefire  and cysto", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that is hilarious:laugh: \nWhere do you gals find this stuff?\nI so look forward to these jokes each day.\nJack\t\t\t", "date": "2009-01-24T23:45:03+00:00", "topic": "WHY SHE TOOK THE REMOTE!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that is evil!\n\nJack\t\t\t", "date": "2009-01-22T23:38:16+00:00", "topic": "WOMENS REVENGE", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Everyone\n\nMy 2nd opinion is the same as my Uros. I was told that I am in good hands, and my Uro is well respected by his peers.\nMy mind is now at ease.\nThank you all,\nJack\t\t\t", "date": "2009-01-14T19:39:08+00:00", "topic": "Sunday Night Chatters Were Right", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLaughing my ass off!\nJack   ", "date": "2009-01-07T19:37:52+00:00", "topic": "another slightly-off laugh from Iowa", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDam, I picked a bad time to start a diet.\nSo, I will just copy and save for when I hit that magic target weight.\n\nJack\t\t\t", "date": "2009-01-07T13:11:42+00:00", "topic": "Cream Liqueur Ice Cream", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLaughing my ass off!\nJack   ", "date": "2009-01-07T19:37:52+00:00", "topic": "another slightly-off laugh from Iowa", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that is funny, Charlotte.\nThanks for the laugh!\nJack\t\t\t", "date": "2008-12-30T18:06:02+00:00", "topic": "A good laugh", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that is funny!\nLMAO\nJack\t\t\t", "date": "2008-12-29T01:26:30+00:00", "topic": "New name for Viagra", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Holidays to all you Bladder Cancer Surviours and Caregivers.\nYou are all very dear to me.\nJack\t\t\t", "date": "2008-12-22T22:15:57+00:00", "topic": "Happy Holidays", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat Fun!!!!\nThanks for a laugh. I needed that today!\nMerry Christmas.\nJack Moon:)\t\t\t", "date": "2008-12-12T09:55:06+00:00", "topic": "More margarita stuff!", "subforum": "17-chit-chat"}]}