{"signature": ["Surgery"], "posts": [{"text": "\n\t\t\t\tHi Sandy,\nI'm sorry he is having so much trouble with chemo. I had no side effects at all.  The neobladder sounds modern & upscale. The adhesive bag sounds like something Johnson & Johnson invented in the 50's for sandwiches but they work real well.\n\nI decided on the bag. My reasoning may not make a whole lot of sense to some but I thought that having fancy fabricated under the skin bladder might require another operation or two. I read threads here for about 2 weeks. I felt that the bag approach provided easy access should anything need repair or … A great part of that thinking came from my 30 years as a heat & air contractor. I would often need far longer to repair a unit that was difficult to get to. I charged more too.  The bag has worked pretty well for me. I’m old and forgetful so I date my bags so I know how long it has been on. I change every 6 or 7 days.  Leaks are in the past. It took awhile to get used to the adhesive procedures. I was a little intimidated by the stoma. It kind of looks like raw meat- I guess maybe it is! But I’m used to it. It is pretty tough. After a year without an appt.,  my stoma nurse & I are going to be testing bags with 1 3/8 inch hole or 1 ¼ inch hole to decide which is the best seal (and best comfort.) If he decides on bags, there are quite quite a few of us here who can smooth out the adjustments he may need.\n\nThis is an anxious time and it was for me too but it was only a week or so after surgery that my Doc came to me with the news- YOU ARE CANCER FREE! I want to wish him the same outcome. We will be watching for word from you.\t\t\t", "date": "2012-09-17T21:44:52+00:00", "topic": "neobladder pros/cons....please help", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Jack, I'm sorry that you are in a bit a medical fix but you have come to the right place for info. One of the big problems with cancer is there just isn't much \"public\" knowledge about it. When I say \"public\" knowledge\" I mean that most of us just don't know much about it. I is a bit complicated. The media likes sound bites and easy medical things to show the public. Much of what is being suggested for you has been done for many years. When I first heard of this and studied up on it on the internet I was amazed that the medical people could take my cancer bladder, throw it away, and give me a stickon plastic bag to do the job. (why not- my teeth are plastic and they work just fine!) Well, to make a long story short- they did that over 4 years ago and I go in once each year to hear that cancer has not returned. There are many of us here who can advise you and guide you in dealing with having a goofy plastic bag hidden under you shirt. If that is the one you chose we can answer lots of questions later. For right now I found it was helpful to take notes when I had Dr. visits. That way I could surf the inter net to beef up my head. Then I could ask better questions when I had my next appt. Ask anything. That's what we are here for.\t\t\t", "date": "2013-10-16T15:43:45+00:00", "topic": "New to the forum", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSo 2013 will really be a new year and a new life for you. We will be watching for updates as you and your doc undertake RC. I also plan to do a blog addressing my rejection of my bag. I recently mentioned to my stoma nurse that having this medical “appliance” is not easy for a man. She quickly commented back that women have just as much trouble adjusting. I’ve been reading posts for 3 years but have seen nothing. I suspect that it is pretty personal. I’m pretty open so maybe I can help with a blog of my experience. Remember it’s an open wound and requires your 100% co-operation. There was a very positive spin to my surgery- in only a few days after surgery I was declared cancer free!\n\nI was offered counseling a few days after surgery. It was poorly timed and I rejected it. This was a mistake.\t\t\t", "date": "2012-11-30T03:44:03+00:00", "topic": "Just Diagnosed with high risk bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAfter reading many threads here and elsewhere I decided on the bag. That was in 2010 and it has become a regular thing. I did have a difficult time adjusting to the bag but the problem was me (not the bag). I have been known to be impatient.  Now I deal with the bag only every 5 or 6 days when I change it. Leaks are common at first but eventually become history. There are many many variations in the bag designs. Stoma nurses are important in determining what shape bag is most comfortable. It takes a long time for the swolin area to relax after surgery. I’m retired but still do what I want, like mow the lawn or hang Christmas lights from the eve of the house.  Life goes on- it’s just a little different.\t\t\t", "date": "2012-11-30T03:44:03+00:00", "topic": "Just Diagnosed with high risk bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIt's wonderful to hear from you, Herb.\t\t\t", "date": "2012-12-03T15:48:25+00:00", "topic": "Sorry Been Awhile since I have been Here", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI did all my own driving so placed emergency bags and towels in the car and next to my easy chair etc but never had any need for the anti-nausea drugs. There was one day after chemo as I drove past a bread factory that the aroma was very heavy. I thought I'd need to grab for the bag but it passed pretty quickly. I recently ask my doc about having no responce to chemo and he just said- some do, some don't.\t\t\t", "date": "2012-08-25T00:09:49+00:00", "topic": "Potential RC. Providence,R.I.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI found note taking to be very helpful. Oh, yes it even forces the doc to slow down. Sure the doc has said it dozens of times BUT only once to you. What he is saying is important.\t\t\t", "date": "2012-10-24T00:55:10+00:00", "topic": "My dad.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSharon, It seemed to me that medical things are complicated and difficult to understand. I took notes. This slows the doc down and it gave me stuff to surf on the internet. Then when your notes and internet surfing don’t seem clear, we are here. Lean on us. That’s what we are here for.\t\t\t", "date": "2012-07-30T22:47:50+00:00", "topic": "Newly diagnosed today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tScared- of course you are. You wouldn’t be normal if you weren’t. Medical things are a puzzle to most to us until a firm diagnoses can be made. Your doctor will keep searching to pinpoint the problem.\t\t\t", "date": "2012-07-26T20:32:53+00:00", "topic": "scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIt is great to hear from you & Jim. Wonderful news. I just put my 3rd year sign out in the yard so lets celebrate.\nCheers from Sacramento\t\t\t", "date": "2012-07-07T03:28:28+00:00", "topic": "2 years this month!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJim\nIt seems that the more information the advance work provides the better it will all be if and when surgery begins. You are certainly in good hands with UCD. I’m local and follow the progressive work from UCD as well as Kaiser\n\nI just got my all clear ie: no sign of cancer for my 3rd year.\t\t\t", "date": "2012-06-25T16:47:37+00:00", "topic": "still confused.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello Gray & Dot\nIf you don’t mind I’ll call you “Gray” because we have another Doug. I’m older than you and confuse easily! lol\n\nDon’t worry about what diversion you need to get. There are experienced folks here who have knowledge of all of them and will advise you as needed. Mine is external.\n\nIt is important to understand what your doc is talking about. He might have flyers or brochures which he can mark areas for your attention. It is your body so it’s important that you understand what’s going on. Keep asking questions. Then if you’re still foggy about something more we all have experience that can be helpful. I found it helpful to take notes for doc visits.\n\nOK, buddy, deep breath. You are among friends here. Everything will be all right.\t\t\t", "date": "2011-07-31T16:38:27+00:00", "topic": "Just Starting the journey", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Gay (Dixie too)\nI just want to point out to you that I am alive and well. Please don’t let the averages from web sites get you to thinking in a dark area. Although your Thurs. appt. will help determine your treatment options I had my Chemo prior to surgery and I’m now cancer free. Don’t get negative. I know it is real easy to think about the worse but it’s important to focus on the best possible outcome.\t\t\t", "date": "2011-07-15T13:29:33+00:00", "topic": "Hello and help", "subforum": "3-newly-diagnosed"}, {"text": "\nlustron591 wrote:@george: thanx. i think my attitude is slowly changing from fear & dread to thoughtful anticipation.\nFear is often grown in the UNKNOWN. It can be a terrible thing. BUT that's where we come in handy. As fears, nerves, questions arise-we are just a keyboard away. We want you to do well.\nCheers for your wonderful progress.\t\t\t", "date": "2011-06-05T16:45:30+00:00", "topic": "CYSTECTOMY?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSurgeons are a pretty narrow specialty. Most do not have the background or interest in the difficulties patients experience AFTER the surgery. It is very important that you located this site and the wonderful knowledgeable friends here. We have experienced all of the diversions available so can be helpful whichever way you surgery goes.\n\nYou already have some pretty good reference materials and as specific questions come up just ask. We are here to help each other.\n\nI have the ileal conduit (stick-on bag) and after a number of leaky difficulties earlier I have adjusted to this goofy thing stuck to my stomach. Amazingly the darn thing works trouble free. The ultimate goal is to be cancer free and I find the bag to be a small price to pay to reach that goal.\t\t\t", "date": "2011-06-05T16:45:30+00:00", "topic": "CYSTECTOMY?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMine was not robotic. Just a trained capable surgeon & staff.\t\t\t", "date": "2011-05-19T20:03:58+00:00", "topic": "need help again", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tpsoriasis\nYou are quite right regarding the bag and psoriasis. I also have tender skin and the bag.  However if you need to go to the ileal conduit there are all sorts of RX lotions and powders etc to use as nec.\t\t\t", "date": "2011-03-17T10:15:33+00:00", "topic": "I\\'d like to introduce myself", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Alanlee  I’m motomike, not to be confused with Mike. He’s the younger better looking one and I’m older. I’ll be watching for your path report and stand by to offer advise and/or support as needed. As you can tell from my tag line at the bottom, I’m living proof that bladder problems are not the end of the world. I also had gone 69 years with only minor health problems so I was absolutely snowed when the docs started using long words for test results and treatments. I know it is easy for me to say don’t worry but worrying can upset other systems of your body and just make things worse. We are here to help and will be watching your posts.\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news on the ALL CLEAR. I’ll be watching for your 3 month post and wishing you the best then. Lets look forward to the all clear posts becoming habit forming for years to come.   ", "date": "2011-01-19T02:13:51+00:00", "topic": "newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSwag\nI did keymo before my ileal conduit surgery so you may have a very different mix.\nI took notes when I had Doc visits so I checked to see what my keymo included:\nMethotrexate MTX\nVinblastine\nAdriamycin\nCisplatin\nI had no side effects from this other than the expected hair (& beard) loss.\nAbout this time we had a family gathering for one of the kids birthday. I got the youngsters together and asked them what it was that made me a GREAT uncle. One boy guessed it was because I’m so old! No, I said. It is because your great uncle mike can do things that no one else can do. I can do things that no one else on earth can do!  With that I reached up and grabbed a handful of hair and removed it! Wow! The kids marveled and were delighted as I displayed a large chunk of my white hair. At our Christmas family gathering one little girl wanted to pull my hair to see if she could do it.\n\nI did the keymo fine. I did the ileal conduit surgery fine. It has been 8 months and the bag still gives me fits. The bag has been my biggest challenge of the whole ordeal.\n\n\nI sincerely hope that your family and friends have been safe from the flooding there. The news reports I’m seeing are really bad.\t\t\t", "date": "2010-12-28T01:23:27+00:00", "topic": "exercise/rehab following bladder removal surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Alanlee  I’m motomike, not to be confused with Mike. He’s the younger better looking one and I’m older. I’ll be watching for your path report and stand by to offer advise and/or support as needed. As you can tell from my tag line at the bottom, I’m living proof that bladder problems are not the end of the world. I also had gone 69 years with only minor health problems so I was absolutely snowed when the docs started using long words for test results and treatments. I know it is easy for me to say don’t worry but worrying can upset other systems of your body and just make things worse. We are here to help and will be watching your posts.\t\t\t", "date": "2011-01-28T10:04:47+00:00", "topic": "Newly diagnosed Alanjay", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMargellen\nIt is a stressful time so we are here to help in a variety of ways. It might be a question for you to ask your doc, it might be a web site referral for background, or just a bit of advice on something that worked for us. We will be watching for your pathology reports as well as other info from you and will be here for support for you both.\t\t\t", "date": "2011-01-07T16:26:16+00:00", "topic": "Just Diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tgwharvey\n\nYou are right. The link doesn't seem to work. Maybe Mike can repost it. I'll pm him.\t\t\t", "date": "2010-11-24T05:05:35+00:00", "topic": "Different bladder replacements", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tEileen\n\"spread\" is certainly a word we don't like to hear. It is my sincere hope that we watch for it to be slowed, then stopped, then eliminated as a hazard. We are with you in the battle.\t\t\t", "date": "2010-11-28T07:05:16+00:00", "topic": "scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks for the update. It sounds as if everything is progressing pretty well. I'll be watching for your updates.\t\t\t", "date": "2010-10-30T17:08:16+00:00", "topic": "Mama Trausch\\'s Surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust to clarify- I was speaking as my Sacramento family elder\t\t\t", "date": "2010-10-20T23:06:04+00:00", "topic": "1 week from RC nerves and questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJulie, as the family elder, I am the designated worrier. I’m really quite good at it and will do all the worrying and nervousness for you. This will allow you to just take long deep breaths and relax. I found surgery to be a snap. Now the extended liquid diet was another story. After weeks (seemed like months) of breakfast, lunch, & dinner of BROTH I was starting to like it!  OMG This convinced me that I was losing my mind. HA!\n\n\n\n\n\n\n\n", "date": "2010-10-20T23:06:04+00:00", "topic": "1 week from RC nerves and questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWe are all excited when we see a great report. cheers!   ", "date": "2014-03-13T21:00:59+00:00", "topic": "Path report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t2 in office\t\t\t", "date": "2013-01-29T23:05:36+00:00", "topic": "Cystoscopy in office or outpatient?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo Jim is doing well and you are also. Great news all around. Also glad you checked in..Cheers  ", "date": "2012-09-22T17:09:37+00:00", "topic": "Just checking in abcs", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIf you caught it early enough and took care of it right away there is a chance that it will just be a mater of checkups to be sure it has not popped up anywhere else.\t\t\t", "date": "2012-09-24T21:36:59+00:00", "topic": "Reoccurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe devil is hiding behind denial waiting for the cancer cells to move to other parts of your body and kill you faster. Denial is evil. Denial is dangerous. Denial is a killer. Denial is stupid. You will find no one here signing about wonderful DENIAL.\t\t\t", "date": "2012-08-24T01:27:05+00:00", "topic": "denial..BCG therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI like celebrating \"All clear\" so I'll certainly join you in this wonderful post.\nCheers!\t\t\t", "date": "2012-08-19T22:02:09+00:00", "topic": "First check up since diagnosis in in April", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid\nI was also 69 when my bladder cancer was detected and my prostrate was enlarged. I elected to have both removed after 4 months of chemo. It was a time of great joy when my surgeon declared me “CANCER FREE”.\n\nLike you I had serious doubts about not continuing with the medical solution. I decided that it was just the challenge I needed.  Beat cancer was my battle cry.\n\nThe medical folks can take care of that area. It will be up to you to maintain a positive frame of mind. There are wonderful support people here who can offer advise. Our experiences can be helpful for you.\n\nLife begins at 70.\t\t\t", "date": "2012-05-18T21:40:15+00:00", "topic": "bladder, prostrate cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy surgeon gave me a choice. I spent several days & nights reading threads and web sites and decided on the IC. I feel it was a correct choice for me. I had to become comfortable with my “nurse duties” every 3 or 4 days (changing the bag). I have always done this myself and finally became used to showering and cleaning around my stoma. At first I was very intimated by the stoma. It looks like raw meat but I have learned that it is pretty tough. There are several here who have had the IC and may be helpful as you have questions about the care & treatment of the stoma and the bag.\n\nAs difficulty as it might be to think of these different types of surgery- remember it is the end result that is the reward. My surgeon came in and announced that I was “cancer free”.\t\t\t", "date": "2011-12-24T04:11:07+00:00", "topic": "Making surgical choices and need input.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCheering for you Ann.  ", "date": "2011-10-24T18:26:24+00:00", "topic": "All clear, still", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood news is always welcome here.\nCheers  ", "date": "2011-07-28T17:06:12+00:00", "topic": "31/2 Year Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Sara Anne\nThat same question had been on my mind also.\t\t\t", "date": "2011-04-30T16:07:31+00:00", "topic": "Another question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n  Time to CELEBRATE ![color=#BF004  0][/color]\t\t\t", "date": "2011-03-17T06:31:04+00:00", "topic": "Check up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKimberly\nI like to ride on the positive of the all clear until a day or so before my tests. I have been pretty successful so far.\n\nI also vowed that if I’m going to be  down, it will be on behalf of some of our group here who truly deserve it.\t\t\t", "date": "2011-03-02T15:58:21+00:00", "topic": "3-month cysto was clear--why am I Debbie Downer?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWeeks away? Months away? Come on guys. That’s negative thinking. You shouldn’t let the next checkup color your life while you are clear. I think for most of us there are going to be checkups for the rest of our lives.\n\nSara Anne just got the all clear and is breathing easier now. Think of her as a roll model or maybe the president of the Good News club. I want to be in that club and enjoy every beautiful sunrise. Rejoice in your last all clear report.\t\t\t", "date": "2011-02-26T00:07:19+00:00", "topic": "check up again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t3 years is great news. You deserve the golf trip to Florida. Enjoy it.\t\t\t", "date": "2010-11-11T00:23:59+00:00", "topic": "Today I am 3 Years Cancer Free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt's good to hear of your good news. Cheers   ", "date": "2013-12-16T00:40:33+00:00", "topic": "So very grateful and happy!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTake a few minuets to analyze your depression. You will probably find as I did that it is a self-centered emotion. I try to get involved in other things that take my mind in other directions. Our neighborhood food closet needed help over the Christmas season. It was good to be a little help. I audition for acting roles for community theatres. The casting folks seldom need my flawless acting ability but I'm pretty good at making sets & locating props.   I recently got a dog. That’s certainly one way to shake up things around the house.\n\nI have loaded up several MP3 players with up beat cheerful tunes. It takes lots of time to locate just the right songs and just the right version but it’s fun to check on the songs that have peaked at number one then disappeared.\n\nIt is not at all surprising that you are experiencing gloominess this time of year Christmas is a popular time for depression. The short gloomy winter days are a natural environment for us to have dark thoughts and introspection.\n\nVolunteer. There are lots of needy people around and helping them is a good way to get your mind on better footing.\t\t\t", "date": "2013-01-11T21:03:49+00:00", "topic": "Three years after cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTammy\nI’m sure anxious that the colon is not involved but it will be easy for the Dr. to know when he does the surgery. We will be watching for updates along with you.\t\t\t", "date": "2012-11-02T13:46:02+00:00", "topic": "RC surgery on November 14th", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSadly, pain meds do cause constipation. I'm now having fair results with Milk of Mag, every night along with 2 stool sofners. I force a movement as nec.\t\t\t", "date": "2012-09-18T19:14:41+00:00", "topic": "Diet/Constipation/Stomach Pain", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI took several days of thought and recalling my after surgery recovery before posting to you. I should also point out that my Mom is 95 and still filling me with good Irish cooking when I visit and of course telling me how to run my life!\n If I were in my 80’s I’m not so sure I would give the go ahead to surgery. Life is full of difficult decisions and this will probably be one of the most difficult. We may not be much help in your decision-making; you must remember that we are here and will support you in any direction chosen.\t\t\t", "date": "2012-08-28T20:37:45+00:00", "topic": "Questions Regarding Chemo &amp;amp; Surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was a bit older than your dad and came through it in good shape. I suspect that we would all prefer that our recovery would move along quicker. We would like to get out of surgery and get back to life before cancer. It just takes awhile to get the body back to what it knows as \"normal\".\n\nYou are faced with many many questions about something very strange to us all. It is important to point out that there are many of us here who we like to think of as CANCER SURVIVORS. Sure it will be new, different, difficult so hang in there and keep your eyes on the end result. We can help explaining some of the future things. Expect About a week or so in the hospital waiting for the digestive system to settle in. This requires some unthrilling liquid food. It would be great to get home but maybe better to have talented med folks close. It seems like I walked like a duck for a week or so. Try to maintain a sense of humor. After he is home we will probably be closer and quicker than the hospital folks so feel free to ask anything any time.\n\nI'll be thinking of him Friday.\t\t\t", "date": "2012-08-17T23:35:45+00:00", "topic": "Very confused and worried", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Janet\nI had 4 ½ months before surgery with no side effects.\t\t\t", "date": "2012-08-11T14:59:38+00:00", "topic": "Update on Nat", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYour mom will probably get the ileal conduit. This is said to be the easiest operation and the most popular for elderly patients. There are quite a number of cancer survivors here who have had this operation and now have the stick-on bag. I’m glad that she is scheduled for the teach in. I did not feel that I was properly prepared to deal with the stick-on bag. I was, without reason, intimidated by the stoma that permanently sticks out of my abdomen. After a while selecting the right style of bag and installing it so it doesn’t leak became a simple do it your self-procedure. We are here to smooth out the little after surgery troubles.\t\t\t", "date": "2012-08-06T02:20:53+00:00", "topic": "Questions Regarding Chemo &amp;amp; Surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBelt- I wouldn’t be without mine. It was a little over a year before my stoma nurse & I tried the Hollister 8488 bag which have the attach points on either side for the belt. So my bag requires a barrier ring such as the Elkin and a belt 7299 or 7300. I like to limit my wear time to 4 or 5 days. I have been leak free for over a year. I think the belt helps hold my bag against my body when I go to bed. My body changes shape in bed.\n\nI surfed pictures of your bag and mine but neither shows the hookup points for belts. I’m guessing they are pretty similar.\t\t\t", "date": "2012-06-18T19:05:29+00:00", "topic": "Good Followup but Failing Pouch Adhesion", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t60 miles away- wow! You are not alone having your stoma nurse so far away. Mine is just a mile or 2 away. My first year or two were really important with guidance from my stoma nurse. I used phone, email (with pictures) and appointments. I was seriously intimidated by the stoma. I was afraid I would injure or damage it. It turns out it is pretty sturdy.\nI often wonder about the possibility that a retired wound specialists nurse might be just a few blocks away and connection just doesn’t happen. I wonder about Craigs list or pennysaver to find someone closer…?\n\nTo be much more practical we are online here and can share our past experiences.\nSeveral have expressed how great the Eakin seals are for them. I might try some.\t\t\t", "date": "2012-06-18T19:05:29+00:00", "topic": "Good Followup but Failing Pouch Adhesion", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tO K Jack,\nI guess you will be going through with pretty much what I had to deal with so I’ll be thinking of you on the 16th and the recovery days in May. I’m getting my “Cancer Survivor” 3rd year sign ready to go in the front yard.\t\t\t", "date": "2012-05-10T02:11:25+00:00", "topic": "Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHerb, it’s good to hear from you. I may try the Marlin convex but I’ve had no leaks for about a year. Stoma nurse said I should neutralize the skin with vinegar & water 4/1. Like you. I stopped using adhesive remover except when shaving. I hate that- I need 3 or maybe 4 hands - visibility on lower side is difficult.\n\nI checked when the fires were moving into New Mexico but saw that you were well away from the danger although a friend in Texas lost his home.\n\nI see above that RBH was looking for the Calvion site and I believe it was part of the Hollister web site. I'll check and post better site data.\t\t\t", "date": "2011-02-18T17:17:42+00:00", "topic": "Skin Irritations around stoma?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou are a success story for sure, Herb. Congratulations!\t\t\t", "date": "2012-01-20T00:41:58+00:00", "topic": "16 Months Cancer Free", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike, Thanks for this post. I reach a very high compression in the days prior to getting results. Now I’m in my 3rd year so I’ll try to relax into it (if possible).\n\nCongratulations on moving beyond this important milestone.\t\t\t", "date": "2011-12-15T19:56:49+00:00", "topic": "Recurrence after RC beyond 3 years is very rare", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's wonderful news George. Congratulations!!\t\t\t", "date": "2011-10-07T16:50:53+00:00", "topic": "Three Years for Me!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSue, there are several ext bag folks here who can advise you & Pete in that area. It is popular with older diversion patiences because it is easier on the body than the underskin diversions.\t\t\t", "date": "2011-09-12T01:56:26+00:00", "topic": "Waiting for Radical Cystectomy need advise", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t4 years cancer free!  It’s time to celebrate!!\n\nI suspect that I’m not the only Viet Nam Vet here. I’ll wish your friend the best of luck.\t\t\t", "date": "2011-09-13T03:04:56+00:00", "topic": "Any proud male owners of an Indy on the forum ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSue, there are several ext bag folks here who can advise you & Pete in that area. It is popular with older diversion patiences because it is easier on the body than the underskin diversions.\t\t\t", "date": "2011-09-12T01:56:26+00:00", "topic": "Waiting for Radical Cystectomy need advise", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSue, there are several ext bag folks here who can advise you & Pete in that area. It is popular with older diversion patiences because it is easier on the body than the underskin diversions.\t\t\t", "date": "2011-09-12T01:56:26+00:00", "topic": "Waiting for Radical Cystectomy need advise", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think your analysis is correct. There has been some moisture between your ring and your skin. This is a bit puzzling because it is still not a leak in the way we think of leaks.\nI recently left a belted convex bag on over a week and had a minor skin irritation which I am now treating with 4/1 vinegar/ water and stoma powder. Then spraying with “stingless protective barrier spray”.\n\nI understand that I will get to used to this and will change my bag when I feel a little tingle or itch. This is a signal that you have moisture between the barrier ring and your skin.\n\nI guess you are some distance from your stoma nurse as Herb is. Is your stoma nurse online? I really rely heavily on my stoma nurse in fact we are going to test a bag assembly that has NO ADHESIVE. It has a custom barrier ring and a belted bag, which is rinsed off and hung up to dry to be reused the next day (in rotation). For minor little problems those of us here can usually be very helpful.\n\nOne of the group told me that he changes twice a week and has no leaks.\t\t\t", "date": "2011-08-18T18:59:14+00:00", "topic": "Is this pink skin ring a problem?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust a note to point out that even those with outties are not living a perfect life. I discovered the longer wear of the belted convex bag and was leaving it on for 7 days leak free. It was wonderful until I found I had damaged my stomach material around my stoma. I’m now using diluted vinegar & stoma powder to neutralize & treat that damaged skin. Being on the learning curve was not what I planned for 70 but o well. Sometimes having a bit of humor helps. I’ve named my stoma “Squirt”! Sorry Preacher but sometimes a blast of 4 letter words makes me feel better.\t\t\t", "date": "2011-07-18T15:40:47+00:00", "topic": "Still Looking For Consistency", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBobbi and Barbara got the trend started last week. I’m sure glad I was able to continue that trend. I’ve been nervous & worried for weeks.\n\nI have 7 different amaryllis colors but seldom get them to bloom together. Mom brought the original from LA when she moved to No. Ca. in 1954.  Over the years the big challenge with them is keeping the snails and the frost away!\n\nThanks for your strength and support. I appreciate it very much.\t\t\t", "date": "2011-06-24T05:07:38+00:00", "topic": "2 years cancer free", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI’m on several pain meds which cause terrible constipation. I’m trying to reduce my pain pills (like every other day or take only the morning pill) and get some relief that way.\t\t\t", "date": "2011-02-27T15:18:56+00:00", "topic": "White Urine and Constipation", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGeorge\nYour humor and positive outlook are important to us here. Wonderful news for you and from you travels across the country online. I might be a bit jittery in mid May so I am always glad you and the others are here.\n\nCheers\nMotomike\t\t\t", "date": "2011-03-29T14:51:22+00:00", "topic": "Two and One Half Years! Not 2 1/2 men", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n I was posting a cake over on chit chat for Jimswife but unlike mike (mmc) who can post great things, I have lots of difficulty with that. Happy birthday anyway! ", "date": "2011-03-17T21:26:16+00:00", "topic": "Update on Jim and his BC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, I think you are right to put that difficult hospital time behind you and face a more optimistic time ahead. There are still obstacles, yes, but they are smaller, more manageable, so one by one you and he will overcome them. I marvel at the strength you both have shown.\t\t\t", "date": "2011-01-26T20:15:45+00:00", "topic": "home, sweet home", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for starting thread MamaT. I’m hairy so every few months must shave the adhesive area. (small electric Remington). I use the Hollister 7760 Universal Remover wipes. The contents say flammable so I’m guessing alcohol. Yes, it is a bit irritating but I follow it with anti-bacterial soap and warm water and sometimes with aloe baby wipes.\t\t\t", "date": "2011-02-01T22:48:59+00:00", "topic": "stoma care", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRayn I’ve stayed out of the thread because I am dumb about this med area (tumors) but I do want to let you know that I’m sending good vibes your way.\t\t\t", "date": "2011-01-21T23:32:27+00:00", "topic": "New Here . . .", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRayn I’ve stayed out of the thread because I am dumb about this med area (tumors) but I do want to let you know that I’m sending good vibes your way.\t\t\t", "date": "2011-01-21T23:32:27+00:00", "topic": "New Here . . .", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI’m in California so I guess my $5 went to help those mega millionaires! I sometimes get a ticket when the pot is low & the odds are a little better.\t\t\t", "date": "2011-01-05T00:00:17+00:00", "topic": "My new Years Wish", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou mentioned insulin and had almost forgotten that I was on it for a time until my readings returned to a more normal level. I had a feeling the liquid diet had something to do with it although I was type 2 about a year before the bladder thing.\t\t\t", "date": "2011-01-02T01:10:13+00:00", "topic": "weight loss", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlan\nI am delighted with the young men’s style of extremely long t-shirts. I’m actually worried that this fad might not last long. I’m buying up a good stock of them. Be careful about cotton content, the more cotton, the more shrinkage.  I’m looking through my old shirts and having second thoughts about keeping many of the shorter ones. I am finding that clothes are expensive and completely overhauling a wardrobe can get pricey. I just bought a sweater. It would have been $20 cheaper but was from a men’s tall store. {groan} Quick, suggest long shirts to all the relatives!\t\t\t", "date": "2010-12-13T18:57:15+00:00", "topic": "Disguise a bladder bag for summer at the beach?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYour post of great news has brought warm cheerfulness into my home this cold winter morning. Isn’t it amazing how good news can change attitudes miles away? Thank you.\t\t\t", "date": "2010-05-08T07:31:38+00:00", "topic": "Happy Day !!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t“Hospital Psychosis”! I have never heard of such a thing. I'm glad you are over that problem and getting adjusted into normal ever day life with the bag.\t\t\t", "date": "2010-10-02T09:15:18+00:00", "topic": "9-11 Surgery Done and I Got Home Yesterday", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAbby, what a great post. I take strength from people like you who have gone through the before surgery doubts and the huge after surgery adjustments. I wanted to put a positive spin on my “CANCER FREE” diagnosis from my surgeon and did it with my yard sign. I wanted everyone to know the joy I feel as a result of the surgery. Keep up the good spirit & good work.\t\t\t", "date": "2010-08-16T02:34:15+00:00", "topic": "Faith", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tToday is Herbs day for surgery. I'm anxious but sure everything will go well.\t\t\t", "date": "2010-08-21T23:52:14+00:00", "topic": "It is Time to Decide What Procedure For Bladder Removal", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy ileal conduit was in May and has been trouble free. It does what it is designed to do. I’m 69. It is forcing me to be something I’ve never been-ORGANIZED!  I’ve set up an IC service station in the guest bathroom & always have a bag cut & ready, clean dry cloths, waterproof plastic wastebasket etc. I carry a travel kit too. Even fresh new bags let me down sometimes & leak (probably due to my procedures not faulty bags).\n\nI did not find surgery to be difficult although I’m sure I was a sorry sight in recovery (oxygen in nose, staples in belly, etc). I lost almost 20 lbs but didn’t need them.  I find the adjustment to the bag to still be a challenge. Humor helps.\n\nSept 11th is your big day. I’ll be thinking of you and then watching for your future posts. Don’t worry. The Docs know what they are doing.\t\t\t", "date": "2010-08-21T23:52:14+00:00", "topic": "It is Time to Decide What Procedure For Bladder Removal", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm having a \"Cancer Survivor\" sign made! I have a corner home so it should look great!\t\t\t", "date": "2010-08-25T16:31:18+00:00", "topic": "Ileal Conduit - What to expect after surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter 4 months of keymo, my bladder & prostate were removed and replaced with the Ileal Conduit, May 12th.  I’m almost 70 and had very few medical problems (high blood pressure & back pain) so the thought of having a plastic stick-on bladder was revolutionary. It’s like a post-it note except with better adhesive!  I won’t tell you that I’ve become entirely comfortable with all the unique procedures necessary but I’m adjusting and so will you.\n\nMy operation was easy, followed with over a week in the hospital recovering (liquid diet -really boring). I'm still timid about showering & it looks like I'm going to need to shave the area!\n\nLEAKS HAPPEN-at 65mph on the freeway!- at Red Lobster resturant! (Carry a spare.)! At 3 a.m. in bed! #%~#%%*^\n\nI was delighted to see Jeff’s post regarding a standard 4-day life for each bag. I’m setting that as my leak free bag life goal.\t\t\t", "date": "2010-08-25T16:31:18+00:00", "topic": "Ileal Conduit - What to expect after surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tsadness, of course, but a certain amount of humor helps for a balance.\nThe other Mike\t\t\t", "date": "2014-04-24T01:51:06+00:00", "topic": "Update on Mike", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\t\"all clear\" is certainly good news. My best to you and Jim.\t\t\t", "date": "2011-11-03T01:03:56+00:00", "topic": "Good News on CT", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDana\nThis is a rare cancer not often seen even by the professionals. It certainly would be wrong for me to comment except for info from my own experience. I will however be watching for information as you and your doc formulate a plan of action. I remain upbeat and hopeful that your husband can get over the hump and then look forward to a more cheerful future.\t\t\t", "date": "2011-07-10T05:26:24+00:00", "topic": "Starting chemo tomorrow", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSuper news. Way to go!\nCheers  ", "date": "2011-07-13T21:45:59+00:00", "topic": "Jim\\'s CT results!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tYour can do attitude will serve you well in dealing with the bag procedures. I’m absolutely sure you will not have 5 thumbs on each hand as I did after my R/C.\n\nI’m wondering if maybe posting with title line like “lymph nodes – chemo” might bring it to the attention of a different group of members? Just a thought.\t\t\t", "date": "2011-04-14T13:25:19+00:00", "topic": "Full of Anxiety....Trying to Stay Positive", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tThat's wonderful news Julie. Lets hope that this will become a year then year after year of all clear.\nCheers\t\t\t", "date": "2011-04-14T22:35:41+00:00", "topic": "great news!! 6 month all clear!!!", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tSangeet, I'm wishing your Aunt the very best and watching for news.\t\t\t", "date": "2010-12-02T11:03:19+00:00", "topic": "Surgery or Chemotherapy is for Bladder cancer", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI joked that it was as if my butt was nailed to the sofa! As a gardener it was difficult to see many of my potted plants just needing water and not be able to generate the energy to deal with it. I hired a guy to cut my lawn telling him it would only be for a month or 2. It was 6 months! I’m now slowly regaining perhaps 80% of my pre op activity level. I have a date with my surgeon latter this month to discuss this, erratic sleep and bowel.  In all fairness I was having bowel problems prior to surgery. Friends tell me I’m 70 (like I need reminded) but I’m not satisfied with 80%.\nI envy you that you were up & walking almost a week ahead of me. I was stuck in ICU for 3 days.  Keep up the good work. You are inspiring. I watch for your posts.\t\t\t", "date": "2010-11-12T01:00:55+00:00", "topic": "so tired", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tIt’s always wonderful to just hear from you but also great to realize that Jim is 2.5 years on the clear side. Have a clear 2013. Cheers\t\t\t", "date": "2012-12-22T01:41:42+00:00", "topic": "It has been a long time...", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCancer as past history. That is really good news.\t\t\t", "date": "2011-09-13T23:44:06+00:00", "topic": "Post surgery at MD Anderson", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tWell stated, Herb. Cheers  ", "date": "2011-09-17T19:08:50+00:00", "topic": "Over a Year Whoppee!", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tWe will be watching your progress and supporting you as best we can. Please keep us informed.  Wishing you the best.\t\t\t", "date": "2011-07-30T13:56:43+00:00", "topic": "Gathering info for the decision time", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCan you hear the cheers from Sacramento? Wow! What an ordeal. Congratulations go to George who at 81 is starting a new life (and to you). Exciting news! May the rest of his recovery be easier.\t\t\t", "date": "2010-11-10T15:32:24+00:00", "topic": "Robotic, laproscopic surgery", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tAfter the radical (hate that word) surgery I had a number of tests and my surgeon declared me cancer free. While it certainly seems like a big step to remove the bladder and in my case also the prostate it really is worth it. It is nice to be free of the big C.\t\t\t", "date": "2011-01-18T00:20:25+00:00", "topic": "Treatments other than Bladder Removal Surgery", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI think you are right. Although my age was not discused I am almost 70. Whatever the route to \"Cancer Free\" it is worth it!\t\t\t", "date": "2010-07-18T07:18:16+00:00", "topic": "What\\'s worked for night time continence", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\t\"The club no one wanted to join\"-absolutely!\nI got a hardcore (slanted) presentation from the hospital Chief Surgeon. I assumed either he was more comfortable with the stoma conduit procedure or perhaps my insurance company liked it (cheaper?). I surfed the net but got confused and depressed so went with his preferred option. As I become more comfortable with the challenge the bag presents my mental attitude improves also.\t\t\t", "date": "2010-07-18T07:18:16+00:00", "topic": "What\\'s worked for night time continence", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tGood Idea. Just let him know that there are lots of folks here who have experienced this surgery and understand his pain. As time goes by it becomes easier to understand the healing process and the medical appliances needed.\n\nWe are here to make it easier. No question is to difficult. We want to make his recovery as easy as possible\t\t\t", "date": "2012-09-15T03:48:28+00:00", "topic": "New with questions", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tHelen, I’m pretty sure the devil is behind DENIAL- just to allow the cancer cells to spread around to other parts of the body. Be strong. We are all here to stand behind you and support you both.\t\t\t", "date": "2012-07-26T19:21:48+00:00", "topic": "In denial", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tThis is great news. I knew the kid would do well but was worried anyway. I just posted my bag procedure so I won’t repost it here. It’s kind of long. I have trouble editing.\nIt is on a thread “Can you tell me about Bladder replacement options” and it is #37325.\nI set a TV tray up in the spare bathroom with all the stuff easy to reach in front of the toilet. I even have a hair dryer to get the skin dry and ready for the bag adhesives to stick real well.\t\t\t", "date": "2011-03-17T14:22:02+00:00", "topic": "HELP! My 13yo is getting Ileal Conduit in April", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tEmr\n“being bored in the hospital” yes, I can relate to that. I had to get friends buy me a laptop. Is there a scheduled date yet? I would think that his age would be an advantage to his IC Room and recovery room time. We’ll be thinking of him.\t\t\t", "date": "2011-03-17T14:22:02+00:00", "topic": "HELP! My 13yo is getting Ileal Conduit in April", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI hope that all is well with your dad. I’m especially anxious that he not have as much trouble getting used to the bag as I did. Refrigeration guys have got to stick together so tell him I’m wishing him the best recovery and if there are any questions just let me know.\t\t\t", "date": "2010-12-09T00:12:53+00:00", "topic": "Father having radical cystectomy on Friday", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tYes, Mike ^^ is right. Depression is a big deal- even dangerous! I was amazed at how depressed other patients were when I was in Keymo. I was on antidepressants and still had difficulty. Have a talk with the Doc on this.\n\nThe bag is like a crying baby. Until he gets used to it- it will require attention often and immediately. At 70 I was at a point in life where I wanted to set in the shade, watch the grass grow and occasionally go pull a weed in my garden. The bag would not allow that life style for me and it will also turn his life around for quite awhile. He will be forced to DEAL WITH IT. Please forgive me for being blunt but I’m sort of having to deal with it still (& my surgery was in May). I’m only slightly ahead of your dad and I still go into a cussing tirade when the bag insists on untimely attention (like 3 am). These are becoming less frequent as I improve with cleaning & applying the “appliance”.\n\nI thought of putting an ad on craigslist for a nearby ostomy nurse but my crises are better now. At 3 a m I also considered a taxi to take me and my leaking *%%^#+~ bag to emergency.\n\nYour dad is independent stubborn and private. He determined this when he didn’t want you in on the ostomy nurse appt. so the bag is a fact of life and he must deal with it. Of course this is a crisis time but it gets better and easier to handle.\n\nOf course you love your dad and would do anything you can for him BUT in the final analysis he is going to have to bite the bullet and come to terms with his future life. You cannot allow his difficulties to impact your mental health, your life or your job. I sence that your dads depression is also becoming yours. Have a sincere talk with you mom & dad.\t\t\t", "date": "2010-12-09T00:12:53+00:00", "topic": "Father having radical cystectomy on Friday", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tEncouraging news. Thanks for posting.\t\t\t", "date": "2011-08-17T01:12:34+00:00", "topic": "UM’s clinical trial for new bladder cancer drug", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI had cisplatin until last May and have been ingesting for the last 3 months. I was not concerned with my appetite but with my back pain. My Rx pain meds have serious side effects. I would like to reduce my pain meds in the afternoons. This has worked some but it’s hard to gage amounts to ingest.\t\t\t", "date": "2011-02-24T20:00:46+00:00", "topic": "Ingredient in cannabis restores taste for cancer p", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tCynthia Thanks for the link.\t\t\t", "date": "2011-02-09T17:40:07+00:00", "topic": "Hospital volume and 90-day mortality risk after RC", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI blew $400.00 a few years ago. I don’t know what went wrong. In college in the 60’s we all knew that hypnosis could cure everything. My  2 packs per day continued- unslowed!\nNext month will be my 6th so I’m hangin’ strong.\n\nCheers to Mike & Mark. Born leaders\t\t\t", "date": "2012-08-27T01:30:59+00:00", "topic": "One year as a non-smoker", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks Mike. My 95 year old Mom subscribes to the “don’t worry” thinking but I have difficulty controlling it. I find it very helpful to worry about someone elses health problems instead of my own.\t\t\t", "date": "2012-11-28T15:38:58+00:00", "topic": "Don\\'t Worry!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDon't forget, we are a sort of family here. Because I was raised around Joplin and Carthage I will always be in your Cancer FREE cheering section.   ", "date": "2012-11-04T01:40:32+00:00", "topic": "Guess who", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI’m on month 2 on the pill and I’m cheering for all your successes.\t\t\t", "date": "2012-05-26T13:09:24+00:00", "topic": "Nine months since I quit smoking!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIt seems like everyone is giving us good news today. Thank you.\t\t\t", "date": "2011-07-30T04:01:10+00:00", "topic": "update", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDiane\nI am cheering for you because I know that live performances are so much better than recorded. I’m delighted that it worked so well for you to have him perform right nearby.\t\t\t", "date": "2011-07-06T08:31:08+00:00", "topic": "A dream fulfilled", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDumb me. The cake is too big. The photogenie wont let it come thru the door & I'm too dumb to reduce it. HA!\n\nSo everyone just step out in the hall and get your piece of cake & bring it in here.\nHappy Birthday ", "date": "2011-04-02T06:48:54+00:00", "topic": "Happy Birthday to Jimswife", "subforum": "17-chit-chat"}, {"text": "\n", "date": "2011-04-02T06:48:54+00:00", "topic": "Happy Birthday to Jimswife", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tEveryone\nJimswife just had a birthday and I just happen to have a great (fairly fresh) birthday cake in my photokitchen. Party time for both Jimswife AND for Jim who just got the all clear from the Doc! Two great reasons to celebrate!\t\t\t", "date": "2011-04-02T06:48:54+00:00", "topic": "Happy Birthday to Jimswife", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThe kid who just won is just barely 20. That would have been great to see live.\t\t\t", "date": "2011-02-16T03:31:53+00:00", "topic": "hiking the at trail", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGood that you are going ahead with it. I took a retirement cross country campervan trip in 07. 8400 miles, 40 days, no schedule. I don't think I could do it now. Glad I did it and glad you are also! I'll watch for your return post. Cheers!\t\t\t", "date": "2011-02-16T03:31:53+00:00", "topic": "hiking the at trail", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI just want to echo those Thanksgiving wishes. I’m especially thankful for this site and the collective knowledge, support and friendships I’ve found here.\t\t\t", "date": "2010-11-25T15:09:59+00:00", "topic": "Happy Thanksgiving to All", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI delight in such shows but had to wait until I retired to rebuild my kitchen because I wanted to DIY it myself. It’s finished now and enjoying the new look.\t\t\t", "date": "2010-10-14T18:49:07+00:00", "topic": "My Niece Nicole\\'s new show", "subforum": "17-chit-chat"}]}