{"signature": ["Surgery"], "posts": [{"text": "\n\t\t\t\tI just got my neobladder on 4/25/07 and have been VERY happy with it so far.  I have only had one instance of nighttime leakage but am dealing with the hypercontinence issue.  I'm only 38 and very active with horseback riding and boating, so I was concerned with the functionality and asthetics of anything other than the Studer Pouch I have.  I did not have the DeVinci laproscopic procedure but the 'ol fashion surgeon performed procedure at M. D. Anderson Cancer Center in Houston.  My doctor, Dr. Barton Grossman, was wonderful about making the opening as small as possible (only from my pubic bone to the bellybutton) and talking about all the pro's and con's beforehand.  If you still have any questions or if there is anything I can help with, please e-mail me at This email address is being protected from spambots. You need JavaScript enabled to view it..\n\nGood luck!\t\t\t", "date": "2007-04-29T05:55:26+00:00", "topic": "Working neobladders in women", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAnother factor you may want to consider when you discuss this with your child is how well-versed he is on the internet.  My husband and I told our kids (12 & 15) the truth, then they went to the internet for more information.  What you find when you google \"cancer\" isn't always good, so it took a number of discussions to clarify and detail the treatment I was receiving.  At one point, my son asked me if I was going to die.  I assured him that I had the best medical team possible and that we were all working to make sure I didn't die.  He was allright with that answer.  My husband just had another discussion with the kids a few days ago.  They are OK with everything that's gone on and were able to talk about what they would have liked us to have handled differently.  They were hurt that we didn't tell them immediately when we got the diagnosis (we took a few days to figure out what to tell them).  I am lucky to be a survivor at this point but will not hesitate to talk to them if anything else comes up.\n\nGood luck with your own child.  You know him better than anybody in the world, so do what you think is right and be open to talking about whatever questions come up. \t\t\t", "date": "2006-11-06T21:06:34+00:00", "topic": "helping", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMaria,\n\nI had my R/C done at MD Anderson last year and they were WONDERFUL... treated me like a \"princess\", as my husband says.  He's going through treatment for lung cancer down there at the moment and apparently is not happy that he's not being treated like a \"princess\", too.\n\nI had Dr. Randall Millican for oncology and Dr. Barton Grossman for surgery.  Who do you have?  We've spent a lot of time in the ER with my husband and you are right, they are GREAT!\n\nThe docs gave me about a month-long break between the chemo and the surgery, which was nice.  It gave me a bit of time to feel a bit more normal.  As we found out though, my energy levels were still VERY low.  My husband treated me to a \"Congrats for Getting Through Chemo\" trip to Key West 2 weeks before surgery and I ended up spending most of the trip sleeping in the hotel room.  In hindsight, we'd have been better off planning the trip after I had recovered from the surgery.  Oh, well.  It was still nice to get away!\n\nYou have a great attitute!  It will all be over before you know it and life will be back to normal (for the most part) in just a couple of months after your surgery.  If you need anything or have any questions, let me know.  We're at MD Anderson pretty regularly these days, so maybe we could meet up and chat?\n\nBest of luck,\nChristine\t\t\t", "date": "2008-05-31T01:35:17+00:00", "topic": "Chemo finished", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood luck with the shower, but don't force him... he's been though hell already!   \n\nYes, I am STILL tired sometimes.  Over the last month it's been much better but I am not yet back to completely normal energy levels.  I am certainly a lot more energetic than I was right before I was diagnosed and I feel a whole lot better.  It'll come back but will take some time.  Just let him take it easy.\n\nTake care!\nChristine\t\t\t", "date": "2007-08-05T21:45:49+00:00", "topic": "small question about showering", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\n\nWith my neobladder, I had a Foley catheter leading to a collection bag on my left side and on the right side had stents from my kidneys draining into a first an ostomy bag, then a collection bag.  I had leg bags, too but it ended up being such a pain to \"rewire\" all the tubing and strap them on for a few hours, then spend 20 minutes cleaning them after use.  I was all about making life easier at that point and carrying bags, although not fun, was easier.  Adhesive remover became one of my best friends during that month, what with all the tape on, tape off, and tape moving that was going on in sensitive areas.  Minimizing the taping was also improved by leaving the bigger bags attached.\n\nThat's just my experience - I am certain there are many, many more people out there with their own  stories to tell,  some probably a lot better and a few may be worse.  I have to agree with you... just getting home was SO, SO nice!\n\nGood luck!\nChristine\t\t\t", "date": "2007-08-05T21:45:49+00:00", "topic": "small question about showering", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, George!\n\nI have done some googling on this issue and apparently it's pretty common in females who have been through RC.  The surgeon added that it seems to be more common in thin women, too.  I have an IVP and check up on the 29th, so I will ask about the possibility of scar tissue being the problem.\n\nThanks again!\t\t\t", "date": "2006-10-11T13:36:25+00:00", "topic": "Help with Hyper-Continence / Neo-Bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank goodness y'all are posting about this situation!  I am 5 weeks post RC and have been having a problem with hypercontinence, too.  When I had the kidney stents and foley removed, there was a lot of discussion about incontinence but not one peep about hypercontinence.  I have been extremely stressed about the difficulty I have been having trying to urinate.  It's especially hard to start the flow if I really need to go.  I bear down and have tried different positions, running water and breathing exercises with little results.  Stepping into a bathtub each time I need to pee is not going to be practical, although it may be an option occasionally.  I finally just have to cath myself which makes me feel like a total failure.  I have had only 1 incidence of leakage in the middle of the night, which I am incredibly thankful for and we're flushing each evening, so mucous has not been a problem.  The new bladder is holding about 500 cc already.  I gave up on the Kegels because clearly the muscles down there are nice and strong (am  I wrong on this?).  I also have a call into my surgeon but have not heard back from him yet.  Does anyone have any additional ideas?\n\nThanks in advance for your help!\t\t\t", "date": "2006-10-11T13:36:25+00:00", "topic": "Help with Hyper-Continence / Neo-Bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am brand new to the board (this is my first post) and was surprised to see that there really ARE younger women out there that are going through the bladder cancer experience.  I am 38 and was diagnosed with very rare squamous cell and transitional cell cancers after my urologist peeked into my bladder and found a huge tumor.  Since the diagnosis on 12/18/06 I have had 4 TURBT's, 4 rounds of chemo and finally the RC with a Studer Pouch on 4/25/07.  I experience the same looks in the urologist's office full of old men but it did score me quick attention and treatment by the Head of the Urology Department at M.D. Anderson.  I became one of his few \"pet projects\".   I have fortunately been declared cancer-free post-op (YEAH!) and am learning to use my neo-bladder.  Thanks so much to all of you ladies out there for letting me know I am not as bizarre as I thought!\t\t\t", "date": "2007-03-02T16:32:59+00:00", "topic": "Diagnosed aged 35", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tIt's been a little over a year now since I went though diagnosis, chemo, several TURBT's, a studer pouch created and all the education that goes with major lifestyle modification.  All of the wonderful friends on this message board have helped me through the process and helped provide hard to find answers, experiences, and suggestions.  The help provided made navigating this whole bizarre and unexpected cancer situation as easy as it could possibly be.  A huge thanks to you all!  I look forward to reciprocating the support and information and doing what little I can to help others through their bladder cancer experiences.\n\nMy 6 month check-up on 12/29/07 came up clean... YEAH!  I am also now somewhat of an expert on possible treatments for hypercontinence issues related to the studer pouch and internittent self-catheterization (as well as techniques for keeping catheters on-hand while still living a very active lifestyle).\n\nIf I can be of help to any of you all, let me know.  I look forward to getting to know you all better!\n\nChristine   \t\t\t", "date": "2008-05-29T09:52:37+00:00", "topic": "I say a big THANK YOU Bladder Cancer Web Café.... ", "subforum": "17-chit-chat"}]}