{"signature": ["Dx", "TURBT", "TURBT", "TURBT", "TURBT"], "posts": [{"text": "\n\t\t\t\tBob,\nThanks for the update!\n\nYou did mention earlier that your cancer was not TCC. Do you know what kind it was?\t\t\t", "date": "2015-08-13T11:58:26+00:00", "topic": "Dx single Stage 2b, high grade bladder tumor", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Joseph,\nSorry about your diagnosis, but as Sara Anne wrote, it is as good as it can be. Answers to your unanswered questions:\nWHO stands for World Health Organization. WHO has set the standard for grading cancer.\nTumor size > 3 cm is considered large. However, size is less important. Grade is more importent. Low grade has very little risk to progress to more serious cancer.\t\t\t", "date": "2015-06-18T09:42:22+00:00", "topic": "Diagnosed this week, would love some feedback", "subforum": "3-newly-diagnosed"}, {"text": "\nlotech35 wrote: Completed 6 weeks gemcitibine,  now urine shows suspicious cells...\nAs I have been told by my uro, a false positive cytology test is very likely to see after a course of intravesical treatments with a chemo agent. The cystoscopy will give you a much more reliable picture of the situation.\n\nPlease try to enjoy the holydays and not to worry too much.\t\t\t", "date": "2016-12-20T15:25:47+00:00", "topic": "Urine culture showing suspicious cells", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nI am sorry about your dads condition but he is fortune to have you supporting him. If you look at the top of the page you will find \"treatment center finder\" under \"Help\". You are on the right track trying to find the very best available urologist and oncologist. As your dad have a very rare bladder cancer type together with the most common type, you should try to find a treatment centre with experience from that condition.\t\t\t", "date": "2016-07-08T18:28:54+00:00", "topic": "Dad diagnosed today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood article. But, as usual bladder cancer is not mentioned at all ....\t\t\t", "date": "2015-12-29T01:40:34+00:00", "topic": "Training the Immune System = BCG??", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am sorry about your experience with Mitomycin. 14 instillations of Mitomycin C has help me to be cancer free for the last 2 years.\t\t\t", "date": "2015-09-17T00:55:23+00:00", "topic": "adverse reactions to one time mitomycin c", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYour bladder needs time to heal before you start the BCG.  5 weeks waiting is normal.\t\t\t", "date": "2015-06-08T04:09:33+00:00", "topic": "When should you start BCG treatment after TURBT?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNo, I do not see how it could be related. Blc does not cause trigger thumbs, just the treatment (bcg) for it might in rare cases do.\t\t\t", "date": "2014-12-01T20:57:10+00:00", "topic": "trigger thumbs", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI  am NOT a doctor.....but IF I was, I would not rule BCG treatments out as a cause for trigger fingers. As a less common side effect, Medac, a supplier of BCG for intravesical treatment of bladder cancer in Europe, is listing joint inflammation (arthritis) and joint pain (arthralgia) as less common possible side effects. Trigger fingers could be caused by rheumatoid arthritis. Rheumatoid arthritis is an autoimmune disease, so Medacs statement make sense to me, as the BCG treatment is suppose to boost the immune system.\n\nI have not got BCG myself, but what I have read, almost everyone get some  side effects! But, for most people, it is worth it, as it is the best available treatment.\n\nlink to the Medac info (with google translate):\ntranslate.google.se/translate?hl=sv&sl=sv&tl=en&u=http%3A%2F%2Fwww.fass.se%2FLIF%2Fproduct%3FuserType%3D2%26nplId%3D20020419000099 ", "date": "2014-12-01T20:57:10+00:00", "topic": "trigger thumbs", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood news for you! I hope your TURB will be easy and with the best possible outcome.\n\nAbout shortage, MEDAC, the supplier of intravesical agents in Scandinavia, now announce that they are unable to supply neither BCG OR Mitomycin! What is going on?\n\nmedac.se/sv/nyheter/1069.htm ", "date": "2015-01-26T19:16:25+00:00", "topic": "Got complete remission for my lymphoma", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nI know how you feel. I had to wait 35 days for my first TURB a the waiting was terrible. One way to go for you could be to let the creepy one perform the TURB in Dec. and later when you got the path report go and see the other uro. The TURB (removale) is a minor surgery an a easy standard procedure. The impotent part is when the path report is back to discuss how to proceed.\t\t\t", "date": "2014-11-18T12:31:17+00:00", "topic": "How important is fast removal vs. good doc?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nLogin,\nclick on \"Your Profile edit\" (middle right)\nclick on \"Forum\" (middle left)\ntype your signature in \"Your board signature\"\nclick on \"Save\"\n\nGood luck!\t\t\t", "date": "2014-12-03T17:32:06+00:00", "topic": "how to make a signature under my posts?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nI am sorry about your situation and I am hoping the docs soon will finding a cause of the bleeding. Blood in urine should always be checked up. It could be a kidney infection, a bladder or kidney stone, an UTI, an enlarged prostate, one of some Kidney diseases, other things, or bladder cancer. You can´t really tell from the amount of blood how likely it is that it is cancer. Blood clotting is not an indication of cancer. If you bleed, you always also have blood clotting. An increase in bleeding and clotting is not a further indication of cancer and even IF it is cancer, it does not tell you anything about the type of cancer.\n\nMost of times, bladder tumors shows up on a CT scan. It is a god thing that you soon will have a cystoscopy. That is the best examination of the bladder you can have.\n\nDo you have any other symptoms beside bleeding?\n\nI do understand that you are scared. But please try to stay calm. I was in your situation two years ago. For me it turned out to be bladder cancer, but low grade. After minor surgery and treatment I am know since one year cancer free.\t\t\t", "date": "2014-12-01T17:43:57+00:00", "topic": "Blood clots in urine", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am sorry that you have to be here, but I am glad to tell you that your prognosis is the best you could have got, when it comes to bladder cancer!\nI can only second the others. There is no sign of any complication in your story. You did have an open sore in your bladder after the TURB. Where your body keeps your urine. Of course it hurts as hell! My experience is that it takes 4-5 weeks to heal after a TURB. If you get Mitomycin C afterwords, probably a little longer. When the scabs comes of, after 2-3 weeks, you will notice some blood in the urine, and it gets worse for a while before it gets better again.\t\t\t", "date": "2014-11-17T01:55:29+00:00", "topic": "complications after turbt", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe  European Organisation for Research and Treatment of Cancer (EORTC) has made a calculator for the risk of recurrence or progression of superficial tcc.\n\nwww.eortc.be/tools/bladdercalculator/\n\nIf you put in data for low grade bladder cancer in the calculator you will find that the risk for recurrence is high or very high but the risk for progression is very low, regardless of other circumstances.\t\t\t", "date": "2014-10-27T16:48:55+00:00", "topic": "recurrence of superficial tcc", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome!\n\nI am so sorry that you have to fight with Lymphoma and now possible bladder cancer. But, I am glad you have found this site!\n\nFirst, I would like to tell you that you have not been diagnosed with bladder cancer yet! It could be something else, or a non-cancerous tumor.\n\nSecond, even if I am not a doctor, I think that exophytic in this case means exophytic from the bladder surface. NOT exophytic of the bladder. \"Exophytic mass\" have been used instead of \"Papillary mass\". The mass is growing out from the surface inside the bladder. Most papillary bladder cancer is superficial, stage Ta or T1. Superficial bladder cancer is very treatable.\n\nI know, by my own experience, that the brain starts going thinking the worst possible when the doctor says the C word. My advice is to calm down and relax (even if I know you can´t). Not until after the pathology report is back after the biopsy (done during a minor operation called TURB), you will know IF you have bladder cancer, and stage and grade. Then you and your urologist can discuss how to proceed.\t\t\t", "date": "2014-10-22T17:07:40+00:00", "topic": "lymphoma patient now suspicion of tcc of the bladd", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am sorry that you even had to look for this website, but I am glad that you found it. To get the information you have got cancer is a huge shock, I know for sure, but you should know that bladder cancer is very treatable.\n\nThere are a lot of good information about bladder cancer at this website. If you can´t find an answer of ANY question, just post it here and I am sure you will get an answer.\n\nAs you have already understood, the path report from the biopsy at the TURB is the most important information for the diagnosis. Not until the report is back can the urologist make the diagnosis and make recommendation for additional treatment.\n\nWhen it comes to bladder cancer, many people reccomend to get a second opinion from another urologist. When you got the results, please feel free to share them with us, if you like.\t\t\t", "date": "2014-10-14T16:01:50+00:00", "topic": "Glad I found this website. Newly diagnosed BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGeorge,\nWhat a hart jumping day! Congratulations! and what a story to read, Well written!\t\t\t", "date": "2014-08-02T15:32:00+00:00", "topic": "Even After Six Years ... The dreaded Urologist", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nI am sorry to hear about your grandmothers bladder cancer, but it sound to me that the diagnosis is positive and the best it could be. Superficial bladder cancer is very treatable.\n\nThere is a alternative to give her intravesical treatment with Mitomycin C, instead of BCG. Mitomycin is a chemotherapy drug, and there are a few similar drugs also used. The procedure is about the same as with BCG, but the side effects are said to be less. Normally, a 6-8 week treatment once a week is given. Sometimes also maintenance treatment is given. The should be no systematic side effects, as the drug only affects the bladder.\n\nI live overseas and here is Mitomycin actually first choice of treatment for low grade superficial bladder cancer. I have hade 14 doses of Mitomycin the last year. I have not had any BGC so I can´t really compare the two treatments, but my guess is that the local side effect are about the same, but the chance of having serious side effect are much higher with BCG.\nBCG are said to be a bit more effective, especially in long term, than Mitomycin.\n\nI am not a doctor, but I think you should ask your grandmothers doctor about Mitomycin. Considering your grandmothers age, it might be a better alternative than BCG for her.\t\t\t", "date": "2014-07-09T18:16:22+00:00", "topic": "Alternatives to BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHudsongrl is pinpointing the very important thing to do. GET A SECOND OPINION. Partial removal is only an alternative in some cases, not a standard treatment. Get a second opinion from a urologist with many years of experience from bladder cancer.\t\t\t", "date": "2014-05-22T14:11:20+00:00", "topic": "From New User", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nI got my eighth and final dose Mitomycin for now last week. The side effects became worse and worse every week, but was bearable. I have had burning pain over the hips back and up toward the kidneys besides discomfort from the bladder. I'm going in for cystoscopy January 16 and if everything looks good, I will get a dose of Mytomycin every month for the next two years. Cystoscopy every three months. I am crossing my fingers this time.\n\nYes Knut, there are very few Scandinavians discussing bladder cancer at the internet. Both at Scandinavian web site's but also on english speaking web site's- One reason for that could be the high average age of bladder cancer patients. I Think the average age is the same in Sweden as i Norway.\n\nMy guess is that the treatment guidelines for bladder cancer in Norway is very simular to the Swedish. Do you know if Mitomycin or BCG is used as first choice for treatment of intermedial risk superfinial BC with high recurrency. (TaG1-2)? I know that it is not your area. I am sorry to hear that you had lost your bladder, but since it was 8,5 years ago you can be quit sure that you have won over the BC once for all.\n\nI live near Sundsvall and I am having my treatment there.\n\nNiklas\t\t\t", "date": "2013-10-26T19:05:24+00:00", "topic": "BCG, Mitomycin or nothing?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDoc, That was good news! I was a bit concern reading your post. BCG sounds like a good thing in your situation. Have you never got BCG before? Even if you have, maybe you just need some more.\t\t\t", "date": "2016-10-11T02:50:53+00:00", "topic": "Oh hell", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations Nancy! Great News, thank you for sharing with us!\t\t\t", "date": "2015-07-01T20:56:25+00:00", "topic": "8 years clear!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Diane,\nNo, I have not got any explanation but I suppose the inflammation is from the Mitomycin treatment I have got. I had also a red spot in my bladder in August. The urologist dismissed it as inflammation at that time and the spot was gone at the next cysto. I finished the treatment in June, but it looks like Mitomycin can cause inflammation for a long time.\t\t\t", "date": "2015-01-10T00:57:41+00:00", "topic": "Blood in urine", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI got the results from the path report today. It was just inflammed scar-tissue. I will have a ct-scan just to rule out something going on in the upper tracts. But, as it looks, good news!\t\t\t", "date": "2015-01-10T00:57:41+00:00", "topic": "Blood in urine", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHad my turb today. Went well. My bladder looked nice, also in blue-light, besides one red area, 1 cm in size, said the uro who performed the turb. He took samples and burned over it with margins. Most likely, it was cancer, as my cytology test four weeks ago showed G2-cells. I have to wait for the path report, but it looks like I will ask for bcg this time. It may be a sign, I was told that my hospital got a delivery of bcg this day! They have been out of bcg AND mitomycin for some time.\t\t\t", "date": "2015-01-10T00:57:41+00:00", "topic": "Blood in urine", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\nMost people at this forum that have had to deal with invasive bladder cancer have had there bladder removed. There are very few people here, if any, that have had radiation and chemo. Radiation/chemo is more frequently used in England. There is a brittish forum where you probably get more answers: community.macmillan.org.uk/cancer_types/bladder-cancer/discussions.aspx\n\nIF I have to guess, the bleeding and the clots could be a side effect from the radiation. I think you should discuss this questions with your urologist and uncologist. If you are not satisfied with the answers you get you should if possible go for a second opinion.\t\t\t", "date": "2014-12-23T22:26:13+00:00", "topic": "Bleeding after Tumor removal", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Tabby,\nI was diagnosed 21 month ago with superficial, low grade bladder cancer and I have had similar experience as you. There seems to be a widespread belief among urologists that non-invasive bladder cancer does not give any symptoms except blood in the urine. I say bullshit to that! I did have severe symptoms, pain, urgency, and a general feeling of inflammation before my first TURB. The symptoms were gone after the TURB but came back after 6 weeks, and so did the cancer, twice.\n\nI did call my clinic before my first TURB to get something for the pain. I just got paracetamol, which did not help at all.\n\nSuperficial, Low-grade bladder cancer often recurs, but the good thing is that it very rarely became invasive or spreads to other parts of the body.\n\nI am not a doctor, but IF the cancer has recurrence at your check up in October, I think you should discuss about additional treatment (BCG) after TURB with your doctor.\t\t\t", "date": "2014-09-25T20:24:29+00:00", "topic": "bladder cancer or interstitial cystitis???", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t..\t\t\t", "date": "2014-09-26T05:55:35+00:00", "topic": "--", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank´s Nancy\nWhat I saw was more like the lining were missing in a area, or was to thin to be visible. Just a redness instead of the normally more or less white lining.\t\t\t", "date": "2014-07-30T11:11:58+00:00", "topic": "&amp;quot;All Clear&amp;quot; best words I heard!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks,\nYes, I have got  intravesical therapy with Mitomycin once a week for eight weeks. The procedure is the same as with BCG therapy. Hold it for two hours and then pee it out. I will continue with maintenance therapy once a month.\n\nMitomycin is the first choice therapy for low and intermediate risk superficial bladder cancer in Sweden. I had a long discussion with my doctor about having Mitomycin or BCG therapy. Mitomycin was what he recommended.\t\t\t", "date": "2014-01-16T17:02:28+00:00", "topic": "Cysto today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Chatherine,\nIn fact this is the first step in the right direction. I am still suffering from the treatment (the last one four weeks ago), but as long as the treatment is working I can stand it.\n\nThank you for the hug. I have already got one today. On my way out from the hospital I did meet a female friend. She didn´t know about my cancer diagnosis, but we had a long talk about heath issues. And yes, she also gave me a hug. Both hugs felt great!\t\t\t", "date": "2014-01-16T17:02:28+00:00", "topic": "Cysto today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi again,\nYou are further down the route than I thought. Yes, In that case your urologist know for sure it is stage 2. Hopefully not any more.\n\nAbout the pain, could be from a uti, from the turb or from the bladder muscle, or from the cancer itself IF i has spread. Hard to tell. For how long has you had this pain? I bet it is an uti...\t\t\t", "date": "2016-05-08T03:48:20+00:00", "topic": "Does it hurt", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\nI am sorry about your diagnosis but it is good  that you found this site.\n\nFirst of all, there are no doctors here. We just share our experience as patients about bladder cancer. You should also ask your urologist all yor questions.\n\nYour urologist can't know what grade or stage your cancer is until after you have had a turb, a resection of the tumor, and the result from the pathologist is back. Actually, he can't be sure it even is cancer. Based on experience, he has made a good estimation of what to expect.\n\nBladder cancer can hurt, even it cancer cells themselves are not suppose to make pain. The pain could also be from an infection. There are a much higher risk of getting an uti if you have bladder cancer. You could have got an uti after your cystoscopy. Tell your urologist about the pain and ask if you can leave a urine sample for testing.\t\t\t", "date": "2016-05-08T03:48:20+00:00", "topic": "Does it hurt", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations, that's a great milestone!\n\nHave a good trip to the next stone.\t\t\t", "date": "2014-06-29T19:40:58+00:00", "topic": "10 years ago", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFind a new urologist. Correct percentage might be 0.9%, not 90%, but is likely much lower.\nHere is a article about bladder performation needing open surgery repair. This happens in 0.36% according to the article.\nwww.ncbi.nlm.nih.gov/pubmed/20860654 ", "date": "2017-01-06T17:41:19+00:00", "topic": "Perforation of bladder", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tThat was really good news. Congrats!\t\t\t", "date": "2015-09-09T21:31:24+00:00", "topic": "Good News on Jim's biopsy results!", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI still have my bladder so I have no experience from neo bladder. Back pain is usually from the kidneys. Tell your doctor at once about the pain. If there is restriction causing the pain, this could harm the kidney.\t\t\t", "date": "2014-11-30T01:52:27+00:00", "topic": "Back pain", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCoffee is a big source of antioxidants. From the article linked below: \"This is believed to be protective against aging and many diseases that are partly caused by oxidative stress, including cancer.\"\n\nauthoritynutrition.com/coffee-worlds-biggest-source-of-antioxidants/ ", "date": "2016-12-17T05:48:19+00:00", "topic": "A Study I Liked: Coffee is Good", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks for the report Sara Ann. I can imagine it was a very interesting visit for you. Reading about the Da Vinci device and looking at the picture, I did at first asked myself, WHO lost his bladder?...Ed? Then I did realized it was not for real...  ", "date": "2016-05-31T20:34:47+00:00", "topic": "A visit to the National Cancer Institute", "subforum": "17-chit-chat"}]}