{"signature": ["Dx", "Dx"], "posts": [{"text": "\n\t\t\t\tThe spasms are terrible. For me, heating pad help some, and sounds strange, but green tea\nIce tea help.\nKeep trying all things and find what works for you\t\t\t", "date": "2019-11-27T22:52:00+00:00", "topic": "Bladder Spasms", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy heartfelt sympathy to you and your family. I am sorry for the past time your father suffered, but knowing his loving family was by his side I am sure brought great comfort.\nCarry your special thoughts of your Dad with you throughout your life, and the memories will be carried down through the generations of your family.\n\nGod Bless,\n\nNancy\t\t\t", "date": "2014-09-04T02:42:03+00:00", "topic": "Sad News - my dad has lost his battle with BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWoohoo George!!!! GREAT NEWS!!!\nI know exactly how you felt.  I am so paranoid, any little hmmmm or expression, scares me  \nThat is great news, no relax and celebrate! I am dancing with you!\n\n\nNancy\t\t\t", "date": "2014-08-02T15:32:00+00:00", "topic": "Even After Six Years ... The dreaded Urologist", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Southwest,\n\nNow you have a lot of friends that have been faced with exactly what you are going through.  Sorry any of us have to be here, but I have found so much information, support and shear knowledge on this site.\n\nHuman nature to have self pity and of course, shock! Reading through all the history on this site will help you through this.  Nothing like reading about people that have been where you are today, and asking as many questions, or if you just want to complain, that is ok too.\n\nI can certainly remember all my emotions when I was dx'd, but after several people helped me sort things out on this site, I felt ready to beat this stupid bladder cancer.\n\nCome aboard and ask or complain, we are all here for you!\n\nNancy\t\t\t", "date": "2014-07-22T16:35:29+00:00", "topic": "Just diagnosed with BC and a bit confused", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi,\nSeveral of us on this site have had the same diagnosis : CIS with no muscle involvement and had had BCG/ 6 to start then maintenance follow up. So far we seem to be doing well. I am 6 1/2 yrs cancer free, Sara Anne and Joey are about the same time cancer free.\nBCG is the first treatment of choice for CIS\n\nWishing your husband successful treatment,\n\nNancy\t\t\t", "date": "2014-04-24T18:00:57+00:00", "topic": "Newly with bladder cis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWhen I was going through BCG a doctor had to be on the premises during the instillation. Maybe you Uro is in practice by himself?\n\nNancy\t\t\t", "date": "2013-11-25T03:39:37+00:00", "topic": "Preparing for BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAll of us are happy to hear good news!\nThank you for sharing!\n\nNancy\t\t\t", "date": "2014-04-20T22:32:14+00:00", "topic": "All clear", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome to the site.  I also live in central Fl. I was Dx'd  7 years ago, and over the course of two years, found my way to Moffitt in Tampa. I know everyone has their own opinion , but I have been very pleased with Moffitt. Dr Sexton is my doctor, but they have a large oncology/uro department.\nIf you are looking for out of state there are many top notch doctors and hospitals.\nI am sure someone will post the names and doctors across the country, but so far I am happy with Moffitt.\n\nYou will find great support and information here\n\nGood luck\n\nNancy\t\t\t", "date": "2014-01-16T00:32:14+00:00", "topic": "Focusing and Searching", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMike,\nI also live in the Tampa area, and I go to Moffitt for my care with Bladder Cancer.  My doctor is Dr Sexton, and being fives years out I am very pleased with him.  I really don't know if he is also kidney.\nThere is also a MD Anderson in Orlando and I know they have uros there.  It isn't real large but you could find info on Google.\nGood luck,\n\nNancy\t\t\t", "date": "2013-06-14T16:04:13+00:00", "topic": "confused, not knowing  how to proceed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNo, we tried lowering the dose about the 19th, but my bladder had enough of BCG, so we stopped there.  Bad news, I really wanted to get to 30, good news I haven't had a re-occurrence in 5 1/2 years.  My bladder is completely healed, so my Uro feels if need be in the future we could still go back to BCG.\n\n\nNancy\t\t\t", "date": "2012-07-21T14:20:28+00:00", "topic": "Diagnosed, removed, waiting on biopsy report", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tEveryone's bladder tolerance is different. Since BCG is a  cumulative, increasing by successive instillations as you progress through treatment. So having a severe reaction now and not during the first six is not. However, some patients can not tolerate BCG at all. This is a conversation you have to have with your Uro.\nAs was said earlier, you can cut the dose of BCG to 50%, 33%, 25% and Dr Lamm said, all the way down to 10%.  This is another conversation to have with your doctor.\nYour Uro is absolutely right not to give BCG while there is bleeding.  It is not safe!\nI can feel Toby's pain    I had big reactions to BCG,(spasms, bleeding, pain) but I was lucky enough to get through 24 instillations\nbefore that happened.\n\nNancy\t\t\t", "date": "2012-07-21T14:20:28+00:00", "topic": "Diagnosed, removed, waiting on biopsy report", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tChelsiaann,Six years ago, when I was dx'd, I wanted to hear, \"you will be cured of bladder cancer, don't worry about it, you will be fine\".\nUntil my brother said, months later, \"you will never hear a doctor say that with any cancer\".  It hit me with a sledge hammer.  Of course you will not hear that, but because you have found this site, you will see so many survivors here to support you and listen to your concerns, because mentally we have all been exactly where you are right now.\nIt doesn't matter exactly what your  diagnosis is, we all have heard \"you have bladder cancer\".\nStay positive, keep learning all you can about bladder cancer and visit us often with any concerns.\nWe are in your corner rooting you on!\n\nNancy\t\t\t", "date": "2012-11-24T14:30:33+00:00", "topic": "Fighting a Rare Bladder Cancer/Seeking Community", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI did not have nausea with any of my BCG treatments. Are you eating before you go to the doctor for the BCG? I really can't think of a reason why you would have nausea. I would think any anti-nausea medication would work. Hopefully, the nurse has returned your call or will soon.\n\nGood luck with the remainder of the BCG.\n\nNancy\t\t\t", "date": "2012-08-25T00:09:49+00:00", "topic": "Potential RC. Providence,R.I.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNow that is great news, Scot   \nGood luck with the BCG, any questions we are here for you\n\nNancy\t\t\t", "date": "2012-07-24T22:39:46+00:00", "topic": "Cowardly Urologist", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Wayne's Team\nThat sure is a scary time when they say the word \"tumor\" for the first time.  Just take a deep breath and get the TURB behind you, get the results and then plan with your Uro for the next step.\nI was dx'd 6 years ago and right now I am cancer free. I know it is easier said than done, but try to relax and stay positive.\nIf needed, we are here for you,\nNancy\t\t\t", "date": "2012-08-09T19:30:51+00:00", "topic": "My husband is newly diagnosed too", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Kevin,\nSorry you had to meet us under the circumstances, but you will find so much information here, soon you will know what to expect and how to be your best advocate with Bladder Cancer.\nI also had CIS and was so scared when I heard the word! I started out with Ta and a year later it was CIS.\nMy Uro and I started BCG, as Mike said that is very effective for CIS. After 24 BCG washes, I am going for my 5 years check up in Aug.  \nWe are here to help you when you have questions, and believe me, I had lots of questions.\nJust take a deep breath and continue to learn all you can, we are all still learning.\nGood Luck,\nNancy\t\t\t", "date": "2012-07-21T01:46:43+00:00", "topic": "Newly diagnosed  and happy that this site is here.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tUnfortunately bladder cancer does return, that is why you are having three month cystos and your Uro is keeping a watchful eye.\nFind out the results of your biopsy, talk with your Uro, do as much research on this site and the web, then go for a second opinion to a Uro that only deals with Bladder Cancer.\nI know it seems impossible right now (we have all been where you are) but the more you learn the better you will be able to deal with Bladder Cancer.\nI am happy you found us. This website has helped all of us understand Bladder Cancer, and we will be here to help whenever you need us.\nTake care,\nNancy\t\t\t", "date": "2012-06-13T12:06:56+00:00", "topic": "Trying to understand..", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome to our site. As Sara Anne said, sorry you have to be here, but you will find a wealth of information on this site.\nThere are so many well informed people and articles available through our membership that have guided us to make well informed decisions and at the same time support on our journey.\nFollow Sara Anne's suggestions, and know there are people on this site that can help you with any questions or support when needed.\nNancy\t\t\t", "date": "2012-05-09T20:25:26+00:00", "topic": "any good books?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat is great news! \n\nNancy\t\t\t", "date": "2012-02-06T19:15:47+00:00", "topic": "2nd Pathology Report", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome to our site, but sorry you have to be here.  You have the same diagnosis as I had originally. I was 62 when bladder cancer came to visit me. It is the best diagnosis you can have with bladder cancer, and sounds like they found it very early. However, you do not want to sit back and not be an advocate for your well being.\nMike is right suggesting you get a TURB and I always suggest a second opinion.\nI had given up smoking 17 years before, but stats show that:\n\nThe average interval between exposure to the carcinogen and the development of bladder cancer is 17 years. The risk of developing cancer is reduced but not eliminated by stopping. Bladder cancer, like early prostate cancer, kidney cancer, and testis cancer, generally does not cause pain.\n\nThis is from Dr. Lamm, a leading doctor and researcher for bladder cancer. Dr. Lamm's website answers a lot of questions that new patients have.You can find @ www.bcgoncology.com/cancer\nSo, I believe bladder cancer takes years to form. Eating well is always good for you, and there has been some research suggesting broccoli is especially good for your bladder.(1 1/2 cups a week)\nYou will find a wealth of information here, feel free to ask ANYTHING, we have all been where you are right now.\n\nNancy\t\t\t", "date": "2011-12-03T14:27:24+00:00", "topic": "Diagnosed this week", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSo happy all went well with your TURB. Take it easy a couple of days.\n\nNancy\t\t\t", "date": "2011-11-23T15:02:13+00:00", "topic": "Made it through the TURBT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOnce again, Pat, you are unbelievable!\n\nNancy\t\t\t", "date": "2011-09-29T12:42:42+00:00", "topic": "from italy - please give me your suggestions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agreed with you, Pat. That is why I clarified with my dx'd and suggested other places, if it is at all possible for RonFors to go to another hospital. If he can't leave the state, becuse of insurance, Orlando or Miami are an option.\n\nNancy\t\t\t", "date": "2011-09-21T22:06:43+00:00", "topic": "Newbie", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI go to Moffitt and my doctor is Dr. Sexton. I am very pleased with my care. However, everyone is different and every diagnoses is different.  Mine started out as Ta and year later CIS - treated successfully (so far) with BCG.\nIf you are looking for another TURB or opinion, there are some very experienced and highly recommended surgeons up north. You might want to check on MD Anderson in Orlando, and there is a great doctor in Miami (I think Patrica has the name)\nAs Patricia always says \" get the best doctor you can afford!\"\nThis is your life, and nothing is more valuable!\nGood luck, I'll keep you in my prayers and thoughts!\nNancy\t\t\t", "date": "2011-09-21T22:06:43+00:00", "topic": "Newbie", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCynthia,\nI guess I was one of the \"lucky?\" ones. When I had blood in my urine it was a Saterday morning. So much blood I went to ER. The Dr did a sonagram, and bingo, you could see three superficial tumors.\nYour right, I heard from several Medical Professionals that \"if you have to get cancer this is a good one\". Really???\nI did go back to the ER to thank the doctor who investigated to the source of bleeding, instead of saying it must be an infection.\nMy brother was dx'd with bladder cancer two years earlier, but I was still shell shocked. On the other hand I had a \"heads up\" on what to do, and where to get info. I found this site for him,   his doctor treated him with antibiotics (three cycles) before sending him to a Urologist.He had to get a neo bladder right away.  It has been 7 years for him - he is doing fine - I went the BCG route (since it was Ta then CIS a year later and 4 years (so far) for me. (thank heavens for the three month check ups)\nThanks again to everyone who contributes to this site!\nNancy\t\t\t", "date": "2011-07-31T21:58:13+00:00", "topic": "Improper bladder cancer treatments costing lives\\&amp;quot;", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis appeared on CBS News Friday evening 7/29/2011.\nI was surprised, so many patients are not given the correct treatment for bladder cancer.\nThis site is such a help to the \"newbies\", I think doctors should tell all their patients about bladdercancersupport.org in the beginning!\nBelow is the link:\n\nwww.cbsnews.com/stories/2011/07/29/eveningnews/main20085671.shtml\n\nPlease copy and paste if it isn't a working link. \n\nNancy\t\t\t", "date": "2011-07-31T21:58:13+00:00", "topic": "Improper bladder cancer treatments costing lives\\&amp;quot;", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news, go celebrate \n\nNancy\t\t\t", "date": "2011-07-10T03:06:28+00:00", "topic": "2nd TURBT Follow-Up", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had my slides sent to John Hopkins, and it was my Uro that sent them.  All I had to do was tell him I wanted them sent and his office took care of the mailing.\nI had the results from JH within two weeks.\nNancy\t\t\t", "date": "2011-02-13T23:30:01+00:00", "topic": "2nd opinions/pathology slides", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news!!!! I will also be watching and following along \n\nNancy\t\t\t", "date": "2011-01-19T02:13:51+00:00", "topic": "newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome Catherine  I am so happy you found us and all the supporters on this site.I think you are dong great, with everything that you have been through the last nine months! It just takes time to wrap your brain around everything.\nI went the BCG route, and I am now three years out, without a re-occurrence. Since I am on the 6 month schedule for cystos, (this is my first 6 month cycle), I can tell you, my worry is less. I do think I am cautiously optimistic. I think when you are in the three month cycle for cystos, it seems it is always on your mind.\nI am so happy everything fell into place for you. I too, had an ER doctor take time and do a sonogram and find the bladder cancer.\nBe sure to celebrate every clear cysto because it is always fun to find a good reason to party \nNancy\t\t\t", "date": "2010-10-29T01:24:20+00:00", "topic": "This year has been a blur...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Bob,\nAs everyone said, there really isn't anything you have to stay away from. I did stay away from caffeine, just because of the sensitive bladder.\nI did try to eat extra healthy. Lots of Vit. A fruit and vegies, broccoli (I still eat at least a cup and 1/2 a week)I still eat healthy, but put a little more effort into high vit. foods.\nGood luck\nNancy\t\t\t", "date": "2010-11-10T18:12:05+00:00", "topic": "Diet to offset BCG side effects", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKimberly,\nI was dx'd three years ago, this month, with Ta CIS. I went through 24 BCG Treatments, with no re-ocurrence\nThe BCG got progressively harder, as it is supposed to do, and I had some unusual side effects, but all in all the big picture is still three years cancer free \nBCG does work well with CIS, but there are a lot of great survivor stories just on this site with BCG working well.\nAs Patricia said, you would know pretty quick if it isn't working for you.\nGood Luck\nNancy\t\t\t", "date": "2010-09-28T15:54:36+00:00", "topic": "BCG -- is it really an option?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOnly the best wishes for Lori.......I know how nervous we get before our Cystos.\n\nNancy\t\t\t", "date": "2010-09-06T16:19:12+00:00", "topic": "Wife undergoing TURB tomorrow at UNC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy Uro mailed mine right to John Hopkins, when I requested. I heard from JH within two weeks - I was surprised at the quick turn around. Actually the pathology at the hospital matched John Hopkins' report.\t\t\t", "date": "2010-09-02T23:43:36+00:00", "topic": "Getting the slides for second opinion", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKimberly,\nWelcome - none of us wanted to be here, but happy we found this site filled with knowledgeable, compassionate members.\nAs Pat said, you can send your slides for a second opinion. In my case, I told my Uro I wanted them sent to John Hopkins, and his office took care of everything.\nWe all know, too well, what a shock it is to hear \"you have bladder cancer\", but once you collect all the information, I am sure everything will fall into place, and you will be able to make educated decisions and take control \nNancy\t\t\t", "date": "2010-08-28T20:12:44+00:00", "topic": "Joining a forum I never I dreamed I\\'d be joining", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat \"Welcome Letter\", George \nNancy\t\t\t", "date": "2010-08-27T16:33:07+00:00", "topic": "Welcome, Welcome, Welcome", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI like that, George  from now on when I am writing about bladder cancerI will print very small   \n\n\n\nNancy\n\nPS - I think you are funny        \n\nNancy\t\t\t", "date": "2010-07-31T01:44:19+00:00", "topic": "let\\'s do this....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJack,\nGreat news too, Jack! Let's keep it coming \n\nNancy\t\t\t", "date": "2010-07-10T22:57:17+00:00", "topic": "LATEST CYSTO", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news, Max\nI always enjoy hearing success stories. Enjoy the next six months:laugh:\n\nNancy\t\t\t", "date": "2010-07-10T22:57:17+00:00", "topic": "LATEST CYSTO", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy brother had BC - 6 yr survivor with neo - I had BC (2 yrs 8 month survivor)\nNeither parent had BC - both parents smoked, brother and I both smoked - I quit 20 yrs ago.\nLived in steel town for 60 yrs.\t\t\t", "date": "2010-05-24T21:00:13+00:00", "topic": "family members with bc", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Brenda,\nYou seem to be following my Bladder Cancer (and many others on this site). I had Ta followed 9 months later with CIS. That was 2 yrs 8 months ago.\nI went through 24 BCG treatments, so far so good.  However, Mike is correct - very close watch. I am still going every three months for a cysto.\nWe were all \"new\" at one time, but with all the great information on this site, you will soon be very well versed on the subject of Bladder Cancer \nThe best advice I can give you is to find all the information you can and question everything. Be your own advocate,which you are on the right road, by second opinions @ the top cancer center!\nI would still go to the Uro, (they should always do a urine test before BCG) the fact you have blood will  disqualify you from BCG this week, but they can also check for an infection. If you have one, they will treat it and continue the BCG as soon as you test \"clear\".\nGlad you found us \nNancy\t\t\t", "date": "2010-05-19T23:36:58+00:00", "topic": "New Dx in Atlanta with questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tEd, I know it is different for the guys, but in 2001 when I had a surgery,I had a catheter placed right after surgery, while I was still \"out\".  When I did wake up the pain form the catheter was terrible.  After complaining to my doctor, they took that one out and replaced with a different size - made all the difference in the world.  Perhaps they have the wrong size?\nMaybe some men will chime in soon.\n\nNancy\t\t\t", "date": "2010-05-14T16:23:11+00:00", "topic": "Pain from catheter", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI hope all went well today. Are you saying she had BCG today and again tomorrow?\n\nNancy\t\t\t", "date": "2010-04-14T01:30:18+00:00", "topic": "Wife begins BCG tomorrow 4/14/10", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou go girl! I am right behind you, cheering you on. \n\nNancy\t\t\t", "date": "2010-03-22T22:22:25+00:00", "topic": "I BROKE THE MACHINE TODAY!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMike,\nI didn't have any urinary retention before my diagnosis. I have only had one urinary infection in my entire life - and that was years ago.\nHowever, now I do have urinary retention due to the BCG. It is a slowly getting  better, but because of the damage from the BCG I wonder if it will ever get all better, and now wondering if the \"retention\" will increase my chances of a reoccurence?\nAfter reading one of your responses yesterday - my brother was also treated for three bladder infections and all along it was BC.\nWhen I first noticed blood, it was a Sat. and I went directly to the ER. (since I knew my brothers history). Lucky, the ER doctor ordered a sonogram and a tumor was found.\n\nNancy\t\t\t", "date": "2010-02-13T07:22:10+00:00", "topic": "Brand new here, with a stupid question.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Pat,\nI couldn't agree more with Sara Anne. I know it seems redundant to say \"stick to your guns\", because I never doubted you would \nMy last TURB, I also did not meet the anesthetist that would be with me during the brief surgery. However, I was promised once again, my records would be read by the anesthetist before my surgery (I was told this with two previous surgeries, but still awakened very nauseous (for hours), after the surgery. My last surgery, (two years ago) after being wheeled into pre-op and aware I was not given any thing for nausea, I actually demanded to see the Chief of Anesthesia. Lucky he was available, but not a happy camper. He quickly read thur my history and ordered the meds I needed. For the first time at this hospital I did not wake up throwing up for the whole day. I am sure there is an asterik next to my name, but I bet they read my chart next time \nYou are so wise not to rush into a situation you are not comfortable with.  Unfortuately, a lot of medical professionals feel they have seen everything and know all, but as a surgeon told me once - no matter how many other operations they have preformed before, this is the \"first\" time for you and you should expect (and demand) to be heard and hope for the best outcome.\nHang in there, Pat\n\nNix\t\t\t", "date": "2009-10-26T19:49:57+00:00", "topic": "What i\\'ve learned so far......???", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI would like to say \"ditto\" to all of the above (except for employer, as I am retired) and to add:\nFor my husband for being my biggest support \"shoulder\"\nThankful for my Healthcare Insurance\nesp - allowing me to all the 2,3,4, opinions I wanted.\nMy grandchildren for giving me that extra push, when I feel somewhat defeated.\nFor all the friends on this web site who understand just how I feel at times - good times and \"feeling bad for myself\" times \nAnd all the wonderful information brought to this site from very informed minds!\n\nI am sure there are a lot more, I guess the most thankful is for the 2 years with no re-occurance.of CIS..........yet \n\nNix\t\t\t", "date": "2009-11-14T16:13:17+00:00", "topic": "Thankful for list idea", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tVi\nPatricia and Mike covered all the bases.  I would also recommend a second opinion. At each crossroad I went for another opinion, with my Uro's blessing.\nI also had Ta, Papillary non-invasive BC, and you still have to keep a close watch on your bladder.  Unfortunately, BC is one of those cancers that keep returning. Nine months after my original surgery, I had Ta Papillary and CIS. That is why we keep such a close watch.  After 24 BCG I am happy to report I am two years clean, but a close watch is still warranted.\nYou certainly came to the right place, everyone is so educated and so willing to help you along.\nIt is very good news you have Ta Papillary non-invasive BC, just keep doing your research, so you are involved in your treatment.\n\nNix\t\t\t", "date": "2009-10-31T03:00:42+00:00", "topic": "Just starting the journey", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYour are right - not good news - GREAT NEWS:P Congratulations and thanks for the smiles:lol: \n\nNix\t\t\t", "date": "2009-10-06T22:08:06+00:00", "topic": "Good..no Great News again!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAmen! Well written................\n\n\n\n\n\n\n\nNix\t\t\t", "date": "2009-07-12T14:22:02+00:00", "topic": "Dear Doctor.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGator,\n\nI was dx'ed 9/07 with CIS Ta.  After 6 BCG and two maintenance (3 each) I was clear for the past year. I did not have any bad reaction to BCG - just \"spasms\" on the first day (uncomfortable) and urgency - the second day - just tired. All this says is that everyone reacts differently. There is no way of knowing how you will react to BCG. After your second opinion (which is very important) if BCG is still recommended - by all means it is worth the shot! As for surgeries - only if you have a reocurrence do you have to have a surgery - the cystos are done in th Uro's office - every three months for two years - if you remain clear - then every six months.\nRight now, everything seems very overwhelming for you, but after a second opinion and lots of reading you will be able to decide what is best for you.\nThis is a terrific site  to ask questions and get a lot of support.\nGood luck\n\nNix\t\t\t", "date": "2008-10-25T23:07:50+00:00", "topic": "bcg how do you feel", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Danny,\nI can't speak from experience, but my brother had a \"neo\" bladder four yers ago (done are Barnes St Louis) and has never looked back.  He has not had any problems so far. Good luck to you.\nNix\t\t\t", "date": "2008-09-23T22:19:06+00:00", "topic": "For Danny", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI certainly agree with the others.  All my tests,urine cytology, NMP22 and    the FISH have come back negative - even two weeks before I had CIS Flathead tumors removed.  The best offense is a good defense. I always like to error on the side of precaution.\nGood Luck\n\nNix\n\nNix\t\t\t", "date": "2008-09-18T14:52:05+00:00", "topic": "A question from tomd", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\twhile getting a second opinion from a Uro at Moffitt Cancer Center in Tampa, FL, a Uro told me he has had to remove bladders due to patients receiving so many rounds of BCG and the bladder shrinking so much, the bladder can only hold very small amounts of urine and life is miserable for the patient.  So from what he said, the bladder was removed not from the bladder cancer but from the BCG! Every body responds differently to BCG that is why we have to keep such a close watch with a good Uro.\t\t\t", "date": "2008-08-08T22:19:38+00:00", "topic": "BCG  burned bladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI know your fear, it’s hard. After having low grade tumors removed, six months later I had one removed CIS high grade non invasive. Continued with BCG (21 instillations)\nNow 10 years of clear cystos.\n12 years total after the first diagnosis.\nThis is the site that gave me courage and information to go forward well informed.\nStay the course and know it can turn around.\n\nNix\t\t\t", "date": "2019-11-29T06:32:33+00:00", "topic": "Second Biopsy Result Changed 3 Months After The Fact!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI do like to be positive, but admit when I heard CIS I was terrified!\nI had some great doctors that talked to me and laid out the facts of CIS and that helped a lot! After all my BCG I went to a large cancer center near me, and every three months had a scope. Nothing came back.\nI did drink a lot of water to flush the bladder and still do. I also ate a lot of broccoli, I was told that helps, and of course it doesn’t hurt .\nBest advice: get the best specialist you can and do as much research as you can, every step of the way.\nYou can do this!!! Keeping good thoughts your way\t\t\t", "date": "2019-01-10T02:36:01+00:00", "topic": "10 years cancer free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suda,\nI am so sorry to hear of your husbands bladder cancer, but so happy you found this forum.\nI originally had 6 BCG's and one year later had a reoccurrence diagnosed as\nCIS.\nSo went back to BCG, in total I had 23 (including the first 6) treatments  My bladder was really messed up from all the BCG's. It took two years to clear up\nfrom all the treatments.\nI can't say I had any problems with the first 6, but everyone reacts differently.\nI always advise people to get second and third opinions, with the best Bladder Cancer doctors that they can see with their insurance.\nAlso, put this out there on this forum, because you may be surprised how many patients live near you and can advise.\nBest of luck, and please keep me informed.\nNancy\t\t\t", "date": "2016-08-10T16:11:10+00:00", "topic": "Nine years Cancer Free and counting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGeorge,\nI could never forget this forum!  They brought me light during dark times, help me get a grip bladder cancer, and actually, you brought lots of smiles with your wit!\n\nThank you for being there for all of us!\n\nNancy\t\t\t", "date": "2016-08-10T16:11:10+00:00", "topic": "Nine years Cancer Free and counting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh my Joey, you have certainly been on a long journey.  I can't imagine how \"beat up\" your bladder was/is from the 33 BCG.  I had 10 less than you, and for a couple of years went thru a lot of pain and discomfort.\nCome October, I am hoping to hear all is well with the cysto and tests.\nI will be thinking of you, sending good wishes and prayers.\n\nI am now 9 years out, still keeping my yearly cysto, because I just feel better hearing \"all clean\".  After next year, if all is well, will probably have to go to two years.\n\nNix\t\t\t", "date": "2014-03-05T18:00:29+00:00", "topic": "6 year cysto good, cytology good, CT scan Questioa", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Joey,\n\nChecking in to see how you are doing?\n\nNix\t\t\t", "date": "2014-03-05T18:00:29+00:00", "topic": "6 year cysto good, cytology good, CT scan Questioa", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoey, I am so sorry that you are going through all this.  I h aven't been checking in, very often, so I was surprised when I read of your\ntroubles.\nI agree with you, getting checked every three months, and still on the fence of what to do, has to be keeping you on edge.\nI would suggest a second opinion, just to remove all doubt.\nI will be thinking of you, please keep me posted\n\nNancy\t\t\t", "date": "2014-03-05T18:00:29+00:00", "topic": "6 year cysto good, cytology good, CT scan Questioa", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Sara.\nI haven't been on here for a long while, but checking in tonight and Love, love, love I saw your post!!!\nI am sure you are helping so many newies, just by posting your good news!\nKeep up the good reports.\n\nNancy\t\t\t", "date": "2016-04-14T16:21:00+00:00", "topic": "Euphoria sets in!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThoughts and prayers are with you (also crossed fingers, toes, arms, legs & eyes!\n\nNancy\t\t\t", "date": "2014-08-22T00:43:19+00:00", "topic": "Scared", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI certainly agree with Sara Anne and Alan.  I was diagnosed with CIS, had 24 BCG treatments, with all but two being 100% BCG. Yes I had some with some side effects.\nI did not have the tiredness, but my bladder was pretty beat up from the BCG.  I had frequency and some burning, but nothing can be better than 8 years Bladder cancer free.\nI would do it all over again.\nI was told BCG is most effective on CIS, so I certainly would recommend doing the series of BCG.\n\nNancy\t\t\t", "date": "2015-09-06T19:55:58+00:00", "topic": "Husband considering not doing BCG treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think it is healthy to get nervous for checkups, we will never take our health for\ngranted, because we have all heard the dreaded word \"cancer\". Not that it makes it any easier, but we are very aware of what can/does happen.\n\nThank you everyone for all the support, wishing everyone to hear the response \"all clear\"  \n\nNancy\t\t\t", "date": "2015-07-01T20:56:25+00:00", "topic": "8 years clear!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! Keep up the good work!!!\n\n\nNix\t\t\t", "date": "2014-09-17T20:38:49+00:00", "topic": "check up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had 6 weeks BCG after my first TURB in 2006. Fall of 2007 I was dx'd with CIS - then did 6 weeks of BCG and two years of maintenance. So that was 7 yrs. of \"no cancer\" check ups.\n\nBut bladder cancer does return, so we always have to be on top of our check ups.\nPlease let us know how you are doing after your appointment.\n\n\nNancy\t\t\t", "date": "2014-09-16T18:13:56+00:00", "topic": "Second cysto and tumor found", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNo he did not use blue light, from what I have read, it is suppose to be very good.\n\nGood luck to your hubby, I will keep my fingers crossed BCG goes well for him!\n\n\nNancy\t\t\t", "date": "2014-07-30T11:11:58+00:00", "topic": "&amp;quot;All Clear&amp;quot; best words I heard!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, I saw my CIS, at the same time the doctor described it as a \"velvet looking\" patch, not a tumor.\n\nNancy\t\t\t", "date": "2014-07-30T11:11:58+00:00", "topic": "&amp;quot;All Clear&amp;quot; best words I heard!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Kathy,\n\nI also had 24 BCG and my bladder was really \"beat up\" after all that! I did have a lot of bladder pain,(took a long time to heal:( ) but I am happy to report that I have been cancer free for over 6 1/2 years!\nMy Uro did not cut back on the BCG until the 21 instillation.  He used 100% BCG from number 1 - 21. Was it the bladder pain or another problem?\nOnce my bladder healed everything else fell into place.  How long ago was your last BCG?  Did you notice during your cystos how red the lining was?  It just takes time to heal.\n\nNancy\t\t\t", "date": "2014-06-21T00:52:13+00:00", "topic": "Re:Maintenance BCG begins ... differences", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHip, Hip Hooray! Congratulations \n\n\n\nNancy\t\t\t", "date": "2014-04-11T10:52:37+00:00", "topic": "Clear scope today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo sorry to hear you are sick! Just take care of yourself, and you can move on the take care of those tumors.\nHopefully time will pass quickly for you!\n\nIn my thoughts,\n\nNancy\t\t\t", "date": "2014-02-04T01:51:51+00:00", "topic": "Getting checked", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is great news! Keep it going:)\n\n\nNancy\t\t\t", "date": "2013-11-20T01:01:49+00:00", "topic": "3 month checkup", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYea! That is great news. Now put on those dancing shoes for a Happy Dance, I will be dancing with you;))\n\n\n\nNancy\t\t\t", "date": "2013-10-10T01:27:32+00:00", "topic": "Doug's good news!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood for you! Keep the faith and maybe the spasms will go away quickly. I sure remember them,\n\n\nNancy\t\t\t", "date": "2013-06-16T14:06:30+00:00", "topic": "polyp removal in dr office?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow Joey, that is the first time I ever heard of that!  Are you on any extra BCG?\t\t\t", "date": "2013-08-15T18:36:02+00:00", "topic": "Six Years Cancer Free :)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news!  By sharing your good news, it helps everyone\nOn the website. Thanks, and here is wishing you\nMany, many more:)\n\n\nNancy\t\t\t", "date": "2013-07-21T22:59:46+00:00", "topic": "close call", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWooHoo Sara Anne!!! Five year club!!!! It gives my heart great joy to hear those precious words!\nI know what you mean about giving up the 6 month support! I am going thru that now, with my first 1 yr. check due in August.\nJust enjoy the 12 months of living without the nail biting 6 month check.\n\n\nNancy\t\t\t", "date": "2013-04-09T19:07:01+00:00", "topic": "Happy day...MY OWN THREAD", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News Ann, Celebrate and enjoy the happy dance!\n\nNancy\t\t\t", "date": "2013-04-11T22:36:32+00:00", "topic": "All Clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! Thanks for sharing with us, I never get tired of hearing success!!!\n\n\nNancy\t\t\t", "date": "2013-04-02T03:48:10+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne, So sorry for the delay, hopefully the time goes quickly and we hear very soon, \"all clear\".\nI am in my first 12 month cycle, and seems scary waiting that long!\nIt has always been routine to have urine tests before cysto.\n\nNancy\t\t\t", "date": "2013-03-20T22:56:42+00:00", "topic": "The best-laid plans..$@#%@#$", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Annebelle,\nFirst let my extend my sympathy at the loss of your son. That has to be so difficult.\nI also smoked and lived in a steel company town, during the years that the environment wasn't in our vocabulary.\nSix years ago when I was dx'd, I was told smoking is the cause of bladder cancer, however after finding this sight, I can tell you there are a lot of people that never smoked.  I quit 17 yrs. before my bladder cancer, but I am sure that was the result of smoking and environment.  Doesn't really matter, we have to deal with what is on our plate right now.\nYour BCG schedule does differ from mine.  My doctor went by Dr Lamm's schedule.  Once a week for six weeks, then after three months a cysto (to ck bladder) and BCG once a wk for three weeks.  I did 24 BCG's and other people on this site did 30.\nAs for the genetic possibility, my brother was dx'd two years before me, but we both were previous smokers and had the same environment growing up. (he is 8 years out cancer free)\nI am not a doctor, but having been on this site for 6 years, I would say you have to have a TURB to remove tumors, esp. to make sure all of the tumor has been removed and for the patient's comfort!\n\nNancy\t\t\t", "date": "2013-01-14T16:25:21+00:00", "topic": "Update BCG/ Recurrence and Questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news to share...........anytime, but especially at Christmas!\nDo your Happy Dance all thru the Holidays.\n\nNancy\t\t\t", "date": "2012-12-18T22:49:41+00:00", "topic": "Just what I wanted for Christmas", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat, Joey.........always wonderful news when all results are in, and all is well.\nI thought you would go to the one year check, since this was your 5 year cysto?\n\nNancy\t\t\t", "date": "2012-12-04T19:48:33+00:00", "topic": "Back from 5th year Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood news so far, Diane!  The TURB is over and you are feeling well.  I will keep you in my thoughts until I hear the good news on Dec. 17th \n\nNancy\t\t\t", "date": "2012-05-31T18:25:11+00:00", "topic": "Hit a bump in the road", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDiane,\nKeeping my fingers and toes  crossed for you \n\nNancy\t\t\t", "date": "2012-05-31T18:25:11+00:00", "topic": "Hit a bump in the road", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo sorry the cancer is back.....but so happy your doctor did 6 month checks after the 5 year mark.  I, too, had CIS. Did all the BCG and maintenance and so far (keeping my fingers crossed) almost 5 years clear.  BCG is exactly the way to go. I went for a second and third opinion after I finished the first round of BCG. (6 doses)Start the BCG then go for second opinion.\nGood Luck\nNancy\t\t\t", "date": "2012-05-31T18:25:11+00:00", "topic": "Hit a bump in the road", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Cheryl,\n\nDr. Sexton @ Moffitt is my doctor, and he is very respected.  I am five years out, and I am pleased with his care.\nI can tell you, if you tell him your concerns he will listen and give you his opinion. He has always answered my concerns.\n\nNormally, it is after the six week course of BCG before the next cysto.  Alan is absolutely right about the bladder needing to heal before the next cysto.  If it is inflamed the doctor really can't see much and it can be painful.  After the first 6 week dose and the cysto, then you would be on the maintenance schedule which is three doses and cysto at the three month mark.\n\nGood luck,\n\nNancy\t\t\t", "date": "2012-11-11T19:04:07+00:00", "topic": "Cysto/BCG Schedule", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Amy,\nI think everyone is nervous about BCG washes the first time.  It really isn't any thing to be afraid of, in fact, I used to try to visualize my bladder fighting off the cancer. After all my treatments......it did \nGood luck, and I just know that soon you will be passing on the same comments/advice everyone is giving you!\n\nNancy\t\t\t", "date": "2012-11-05T13:35:54+00:00", "topic": "Moving over here! :)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News! \n\n\nNancy\t\t\t", "date": "2012-09-29T00:07:49+00:00", "topic": "Good check up for Doug", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News, Sara Anne!!!! \n\n\n\n\n", "date": "2012-09-25T20:20:11+00:00", "topic": "Checkup OK....probably", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh that's right, I forgot about the recurrence. My recurrence was in 2007 and that was the only one (keeping fingers crossed).\nI will keep you in my thoughts until the day in December when you get the good news!\nYou, Ann and I have traveled  this journey together, and hopefully our posts (ups and downs) have helped others.\nNancy\t\t\t", "date": "2012-08-04T15:34:20+00:00", "topic": "5 Year Check!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi and Welcome!\nCongrats on the non-invasive. BCG effects everyone differently. Some can only do one or two treatments because their side effects are so severe, others can go all the way to 30!\nIt sounds like you had a horrible start plus the scare of being told of cancer, I think you are doing well.\nAs I am sure you have been told and have read on this forum, a second opinion is always a good idea. My Uro encouraged me to get a second opinion.\nIt is always good to know that everything has been gone over with different eyes and educated opinions.\nWe know how you feel, we have all been there.\nNancy\t\t\t", "date": "2012-07-10T03:42:55+00:00", "topic": "non invasive transitional carcinoma", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Kimberly,\nI have had many cystos and 24 BCG. During this time the catheter wasn't a problem. However, I did have a lot of pain several years ago after another surgery.  It was discovered they used the wrong size, and the nurse was not very good at inserting the tube.\nI would think \"whatever it takes\" for you to be comfortable the better.\nGood Luck,\nNancy\t\t\t", "date": "2012-06-30T02:16:24+00:00", "topic": "Am I being a total wimp? (BCG / catheter woes)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't know yet, but I would think so. Before my check up I will have CT scan to check every thing from head toe \nNancy\t\t\t", "date": "2012-06-11T15:17:32+00:00", "topic": "All Clear Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Joey! I knew you had a check up last week and I have been watching for the results. Enjoy the summer!!!\nI have my 5 year in Aug. We have been going thru this together for the past 5 years!\nCongrats\nNancy\t\t\t", "date": "2012-06-11T15:17:32+00:00", "topic": "All Clear Again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHip Hip Hooray for Jack! Great news!   \n\nNancy\t\t\t", "date": "2012-06-04T14:48:09+00:00", "topic": "All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Warren....long time no talk  Are you still in \"maintenance\" BCG? I can tell you I have had 24 total BCG treatments and I am (hopefully) coming into my 5 year mark in August. I had CIS one time 4 1/2 years ago and so far it has been effective for me.\nI guess if there is a question, I would agree with Mike - go to a top doctor and weigh your options.\nNancy\t\t\t", "date": "2012-05-01T04:05:29+00:00", "topic": "Recurrence of CIS. Treatment options", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFriday the 13th has always been a lucky day for me! Met my husband of 46 years on Friday 13th! I just know it is going to be a great day for you!\nGood Luck - crossing my fingers, eyes and toes \n\nNancy\t\t\t", "date": "2012-04-06T11:37:51+00:00", "topic": "All clear (still)!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFingers, eyes and toes crossed for all going in for cystos! Let's keep only positive thoughts!\n\nNancy\t\t\t", "date": "2012-03-28T20:19:17+00:00", "topic": "It\\'s all good!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhew! Thank you Mike, now I can rest \nI love the dancing!\n\nNancy\t\t\t", "date": "2012-03-28T20:19:17+00:00", "topic": "It\\'s all good!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRocky.....Great News, keep it up   \nNancy\t\t\t", "date": "2012-02-16T02:17:44+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Joey,\nI knew you were @ 4 1/2 years, too. Good luck and positive thoughts going to your cysto in May.\n\nThanks George, there for a minute I thought my mustache was showing   \n\nNancy\t\t\t", "date": "2012-02-04T15:42:34+00:00", "topic": "4 1/4 years and counting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks to everyone for the well wishes, it makes everything better with the support from all of you.\nAnn, I have followed your journey from the beginning, keeping my fingers crossed for you \nNancy\t\t\t", "date": "2012-02-04T15:42:34+00:00", "topic": "4 1/4 years and counting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! Now you can relax and celebrate! Stay warm \n\nNancy\t\t\t", "date": "2012-01-13T23:34:38+00:00", "topic": "Great Update on Friday 13th.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy first symptom of bladder cancer was a lot of blood when I urinated. Went straight to ER then Uro and a TURB two days later...... dx was Ta \"Non Invasive\".\n\nNancy\t\t\t", "date": "2012-01-15T23:05:37+00:00", "topic": "Blood in the urine?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is great news! Good luck with quitting smoking. I only tried to quit once and it worked - 20 years ago this year. I can hear the resolve in your writing. I know you can do it!\n\nNancy\t\t\t", "date": "2012-01-13T03:26:36+00:00", "topic": "Update from upnorth", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Annie,\nTo me, and my experience with bladder spasms, it sure sounds like you are having spasms. Once your bladder is healed, the spasms usually stop.  There are meds that can help with them.\nAs for the concern of a bladder infection, why not call the doctor and ask for a urine test to check.\nFor the bleeding and the flakes, that usually happens 10 days to two weeks after a TURB, so that is probably what you are seeing.\nBring all your concerns to the doctor, so you can discuss with him.\n\nNancy\t\t\t", "date": "2012-01-13T13:38:56+00:00", "topic": "Pain is pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Mary,\nI go to Moffitt in Tampa. I can answer some of your questions, however, I would have the appointment already set, before I arrived in FL. Once your appointment is set, you can have all the records sent, then a team of doctors meet and review your case and discuss how you should move forward.  Waiting until you get here could be a problem. If anything comes up in the meantime just cancel the appointment.\nI have been very satisfied with my care, but I never hesitate to get another doctor's opinion in the past. I have had four different doctors review my case in the past 5 years. I went to Barnes hospital in St Louis for one.  My doctors have been very supportive in my getting other opinions. (if they were not, I would have found another doctor).\nIf I can help in any way, please let me know.\nGood Luck,\nNancy\t\t\t", "date": "2011-12-09T04:06:51+00:00", "topic": "Frustrated with Doctors!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News! You did win the lottery in bladder cancer   \n\nI feel as if I know you during this journey. I am nine months behind you, and your check ups have given me hope. I go for my 4 1/2 yr cysto in Feb.\n\nYahoo,\nNancy\t\t\t", "date": "2011-12-02T12:12:39+00:00", "topic": "Five years on", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! Let's keep the GOOD NEWS BALL ROLLING   \n\nNancy\t\t\t", "date": "2011-09-01T19:23:03+00:00", "topic": "More good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne\nI am so happy you are in the 6 month check ups - that is a big step towards complete healing! (body and mind  I know, we have to stay on top of things probably forever, but because you went thru the BCG and looks like your bladder responded well, you stand a great chance of moving forward.........yea!\n\nNancy\t\t\t", "date": "2011-06-29T19:20:28+00:00", "topic": "Sara Anne\\'s Story", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, Rocky and Jimswife, I think I can see you dancing from Clearwater! Let's keep this ball rolling with more \"clear\" cystos \n\nNancy\t\t\t", "date": "2011-08-06T11:12:43+00:00", "topic": "4 years clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news, Max........helps all of us to read success stories \nMy next cysto is next Friday, starting to get nervous \n\nNancy\t\t\t", "date": "2011-07-28T17:06:12+00:00", "topic": "31/2 Year Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t\"No Cancer\".........great news!    \nNix\t\t\t", "date": "2011-06-13T00:29:09+00:00", "topic": "checkup again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIsn't that the best compliment EVER? \"You have a good looking bladder\". Who ever thought that would be the best compliment we would love to hear   \nCongratulations, Kimbery\nNancy\t\t\t", "date": "2011-06-15T13:02:45+00:00", "topic": "Another happy thread!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News, Joey!\n\nNancy\t\t\t", "date": "2011-06-08T20:48:29+00:00", "topic": "Second 6 month cysto looks good", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News........thank you for sharing,gives all of us hope \n\nNancy\t\t\t", "date": "2011-05-20T17:37:19+00:00", "topic": "Four plus years still all clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can't speak for anyone else, but once I started BCG (4 yrs ago) I haven't had a re-occurrence. Total 24 BCG's, and so far so good.  If there is another CIS re-occurrence, I don't think I can do any more, because near the end I had a lot of problems with BCG.\nI did have CIS, but it was caught very early. Maybe that made a difference?\nI guess every doctor and every patient is different. Did you get second opinions from other doctors?\n\nNancy\t\t\t", "date": "2011-04-30T03:41:49+00:00", "topic": "Confussed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHere's to Pat \n\nNancy\t\t\t", "date": "2011-03-31T17:27:11+00:00", "topic": "Big thanks to Pat", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News  Hope the good news keeps on rolling!\nNancy\t\t\t", "date": "2011-03-27T23:20:55+00:00", "topic": "Checking in after about 1-yr", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat! Now back out to the \"happy dance floor\" \n\nNancy\t\t\t", "date": "2011-02-26T01:58:54+00:00", "topic": "FINALLY Good News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWe can all sympathize with you.........we have been there, and we know EXACTLY how you feel. Try to keep your mind busy   yeah, I know, very difficult to do.\n\nNancy\t\t\t", "date": "2011-02-26T00:07:19+00:00", "topic": "check up again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoey,\nIt did get easier during the 6 month time between cystos. At first I worried that 6 months was too long between, but during that time I actually did not dwell on the BC and put it out of my mind until right before the appointment.\nStay positive, keep good thoughts and let's keep good reports going \n\nNancy\t\t\t", "date": "2011-02-05T02:44:04+00:00", "topic": "3 years, 4 months clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW, Jack - wouldn't that be great? \nAs anyone would remember - 5 years ago, I was \"shell shocked\" and sooooo scared.\nBecause of this forum, and all the support and information (actually @ the time it was called \"bladder cancer cafe\") I learned about the cancer that is taking me on a journey. I am still nervous, because I know we have to stay vigilant with BC.\nKeeping my fingers crossed for all that have a cysto in the near future!\n\nNancy\t\t\t", "date": "2011-02-05T02:44:04+00:00", "topic": "3 years, 4 months clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo sorry you have been ill and have to reschedule. Hopefully, you will be able to reschedule quickly.\nNancy\t\t\t", "date": "2010-12-18T00:08:02+00:00", "topic": "I am back", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoug,\nI am so happy for you.....two years, that is GREAT! Enjoy the Holidays \nNancy\t\t\t", "date": "2010-12-04T12:09:56+00:00", "topic": "Good news!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYahoo! Great news, Ann.    \nI am in the 6 month club - three months into my first 6 month cycle. I am no longer in the BCG club, but enjoying skipping the 3 month cysto.\nNancy\t\t\t", "date": "2010-10-25T19:25:47+00:00", "topic": "All clear, 2 years 4 months", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKimberly,\nI too was \"wigged out\" when hearing the words \"CIS is present\". After posting on this site, and getting a lot of encouragement, I did research, second opinions,sent slides off to JH, and started BCG - 6 week course and Maintenance schedule.\nHere I am, three years out being cancer free  BCG did it's job - and so far so good!\nGood luck to you, and please keep positing so we know how things are going!\nNancy\t\t\t", "date": "2010-10-07T19:37:16+00:00", "topic": "Pathology report -- signs of CIS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Ken, Good luck on the next round of BCG.  We always like to hear good news \nNancy\t\t\t", "date": "2010-09-29T01:07:42+00:00", "topic": "Post BCG cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Mike,\nI am sorry you are having such a terrible reaction to the BCG. I can only speak for myself - but after 24 BCG treatments, and having terrible spasms for over a year, I certainly had frequency but never every 60 seconds, and never a cath.\nI would suggest you get to an Infectious Disease doctor, sooner the better.  This is definately a reaction to BCG and an Ifectious Disease doctor should be able to help, or at least refer you to someone who could help.\nI would also start to look for another Uro. Everyone reacts differently to BCG, but this seems extreme to me.\nNancy\t\t\t", "date": "2010-09-06T21:23:55+00:00", "topic": "Best Bladder Cancer Hospital", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMost of us have been exactly where you are right now. Never seeing the end of BCG and three month checks - it does suck! Since 2006 my life revolved around BCG and cystos! Please don't lose light of the big picture! If the BCG works you will have saved your bladder and life will return to normal.  If the BCG fails, you will have the surgery and life will return to normal. The important thing is to get rid of the cancer and keep it away, and so far you are succeeding.......congratulation \n\nNancy\t\t\t", "date": "2010-08-12T18:32:12+00:00", "topic": "Just plain sick of it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is ALWAYS great to finish the 6 week course of BCG! Enjoy your time off \n\nNancy\t\t\t", "date": "2010-08-12T00:44:01+00:00", "topic": "Done with the first 6 BCG treats!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlan,\nGreat news! you are right about getting to the doctor asap.\nI had gross hematuria  and knowing my brother was dx'd with BC two years earlier, I went straight to ER - (it was a Sat) - Uro on Monday TURB Tues. - 34 months ago.  When the ER doctor asked how long I had noticed blood, I said \"what time is it? - One hour ago\".\nSo far so good for me BCG has helped so far, since I can't take any more. I am hoping it took care of the CIS which came 9 months later.\nGetting to the doctor earlier is ALWAYS the road to take \nEnjoy your good health!\nI go next Friday \nNancy\t\t\t", "date": "2010-07-29T17:19:09+00:00", "topic": "Another all clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow that is one bike ride! Coasting can be as dangerous as pumping up hill \nGlad you are OK.........\nNancy\t\t\t", "date": "2010-07-18T00:04:22+00:00", "topic": "I-week delay!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Ross,\nI found this on Webcafe: blcwebcafe.org/bcg.asp\n\nSex\n\nMen having this treatment can pass on BCG during sex. To protect your partner from coming into contact with BCG, you should not have sex for 48 hours after each treatment. Use a condom if you have sex at other times during the six weeks of treatment. You should also use a condom for sex for six weeks after treatment has ended. www.accv.org.au/cancer1/patients/bladder/howtreated.htm \n\nHope this helps\n\nNancy\t\t\t", "date": "2010-07-18T07:40:03+00:00", "topic": "BCG and new relationships", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBill,\nI also had re-actions to BCG. In fact, it is taking me over a year to get over my last one. (24th) And I do mean last one! My Uro and I both agree that my bladder cannot tolerate any more BCG \nSo first off:  I had reduced to 10% BCG on my last instillation\nand  still had severe problems.  But my bladder already had so much BCG, the 10% meant nothing.\nDr. Lamm also said that he \"heats\" the BCG for people that can't tolerate it any other way. (My Uro and I agree, we can't even try that)\nI did have Ofloxacin after my BCG.\nSo what do I do now that I know I can't do anymore BCG? I wait, cross my fingers and toes, and hope CIS doesn't return \nI will be three years without a re-occurrence in October  .  So if it comes back - goodbye bladder. Hopefully, the BCG already got rid of all the CIS and it won't come back!\nGood Luck - the reduced BCG does help a lot of people on this website. You can go as low as 1% - all you want is for your bladder to react.\nNancy\t\t\t", "date": "2010-07-08T21:30:51+00:00", "topic": "BCG re-start!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAtta boy, Joey........I just knew everything would be good new......a big Hip, Hip Hooray!!!!\n\n\nNancy\t\t\t", "date": "2010-06-29T18:34:31+00:00", "topic": "MRI and Cytology Results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Carol\nThe rash is a Red Flag to me. After my 15th or 16th BCG, I had a rash on my hands and feet - it itched like crazy, however once I voided the BCG it left.  I called my EX Uro, and they said it had nothing to do with the BCG - really? That was the start of the road to more and more complications to come - through number #24 BCG. I didn't run a fever, but I wish I stopped the BCG with the rash.\nI would certainly get a second opinion about continuing the BCG.\nI can't speak for your particular symtoms but I thought my history might help.\nNancy\t\t\t", "date": "2010-06-19T20:51:28+00:00", "topic": "bcg", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Jack,\nI haven't heard of stretching a bladder, because of BCG shrinking the bladder, however I have heard of bladder removal because BCG had done so much damage, and the patient was having to get up during the night 10 times:(\nThe bladder was cancer free, but still had to remove bladder. This does happen.\nI hope this doesn't happen to your friend.\n\nNancy\t\t\t", "date": "2010-06-26T00:23:57+00:00", "topic": "Original Bladder Has Shrunk", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou are right. My Internist did the \"patch test\" before I started BCG, because he said from that point on I would test \"positive\" and he thought it would be a good thing to have in my file, the \"positive\" was caused by the BCG.\n\nNancy\t\t\t", "date": "2010-06-02T17:40:04+00:00", "topic": "I did it again...and survived!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVery interesting, Mike. That would have certainly helped you out in the very beginning.\nI am sure I would have tested fine, since I did get 24 - only the 24th was a problem.  I guess my problem is because my Uro used 100% (or what they consider 100%) for at least 18 of the doses).\nWe still don't know if it is OK to start out with a lesser amount.\nOnce a patient shows too much of a reaction, Dr Lamm did tell me that the Uro can also \"heat\" the BCG.\n\nWe go as low as 1%.  You can also reduce retention to 30 minutes or less.\nI also sometimes give heat inactivated BCG to those who do not tolerate\nlive BCG.\nDon Lamm, MD\n\nThanks for writing Dr Lamm with this question\n\nNancy\t\t\t", "date": "2010-06-02T17:40:04+00:00", "topic": "I did it again...and survived!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter reading everything on Dr Lamm's website (and I am a big fan of Dr Lamm ) I decided to just try to increase my Vit A through fruits and vegies along with my multi Vit and other supplements.Fish oil,Vit E etc. I just feel your body absorbs the nutrition easier, and, gee, it tastes good and can fill you up \n\nNancy\t\t\t", "date": "2010-05-21T13:49:08+00:00", "topic": "Nutrition", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck, Vi - I will keep you in my thoughts.\nNancy\t\t\t", "date": "2010-04-30T22:28:44+00:00", "topic": "Finally have appt for 2nd opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News, Maz - let's keep the good news going \n\nNancy\t\t\t", "date": "2010-05-06T15:31:23+00:00", "topic": "YIPPEE!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News, Donna - enjoy the summer \n\nNancy\t\t\t", "date": "2010-04-29T00:23:11+00:00", "topic": "All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOK Maybe at one sitting   ", "date": "2010-04-14T19:55:02+00:00", "topic": "Cystocscopy time, again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am never surprised by what I learn on this site! I wondered why the first dose was 6 - now I know- It comes in a six pack.\nSo does beer, but you don't have to drink all six \nI thought the BCG had a very low shelf date - like a few days?\nI know my Uro always had to order the BCG right before my dose.\n\n\nNancy\t\t\t", "date": "2010-04-14T19:55:02+00:00", "topic": "Cystocscopy time, again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have also read and been told that 2% have CIS. On the good news side is BCG is most effective on CIS. I am always looking for the silver lining \n\nNancy\t\t\t", "date": "2010-04-21T21:33:45+00:00", "topic": "Statistics on CIS?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHey Pat, Is that the Birthday Girl.........how darling:)\n\nNancy\t\t\t", "date": "2010-01-24T15:10:17+00:00", "topic": "Stricture Redux", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations, Chuck \nDoing a happy dance for you!\n\nNancy\t\t\t", "date": "2010-02-20T20:50:21+00:00", "topic": "Cysto Results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tthanks for sharing your great news...........I feel a Happy dance coming on   \n\nNancy\t\t\t", "date": "2010-02-19T12:44:52+00:00", "topic": "All clear at 6 months", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know there is Mitomycin C. Some people on this site have had great response from that, wsilberstein  has been cancer free, I think, for 8 years.\nMy Uro says there are other options rather than BCG, but I don't think my bladder could take much of anything. I guess we just have to wait and see.\n\nNancy\t\t\t", "date": "2010-02-05T16:41:00+00:00", "topic": "Whew! and then Yeah!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Chuck & Joey\nI don't think my bladder would handle anything else, but I guess we will cross that bridge if we get there. I had 24 treatments, but probably would have had more if I could tolerate BCG. Hopefully, my CIS will remain a thing of the past.  I do know my CIS was found very early, because one month before I had a FISH test and cytology test and both came back negative. When I had  my next cysto - a small spot of CIS was found. I haven't had any re-occurance for 2 1/2 years, but with BC I know it can come  back at any time \nJoey I know we are on the same schedule so I will be thinking of you and waiting for your report. \n\nNancy\t\t\t", "date": "2010-02-05T16:41:00+00:00", "topic": "Whew! and then Yeah!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Chuck & Joey\nI don't think my bladder would handle anything else, but I guess we will cross that bridge if we get there. I had 24 treatments, but probably would have had more if I could tolerate BCG. Hopefully, my CIS will remain a thing of the past.  I do know my CIS was found very early, because one month before I had a FISH test and cytology test and both came back negative. When I had  my next cysto - a small spot of CIS was found. I haven't had any re-occurance for 2 1/2 years, but with BC I know it can come  back at any time \nJoey I know we are on the same schedule so I will be thinking of you and waiting for your report. \n\nNancy\t\t\t", "date": "2010-02-05T16:41:00+00:00", "topic": "Whew! and then Yeah!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am sure JH is the place to go, but if you want a second opinion near home, I go to Moffitt. Right now my Uro is Dr Wade Sexton. I do like him, but I have gone to several doctors for second opinions during my journey through BC.\n\nNix\t\t\t", "date": "2010-01-14T02:12:58+00:00", "topic": "Is this a BCG side effect?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW! Great news!! Excuse me while I do a little \"Happy Dance\" for you, Ann \n\n\nNix\t\t\t", "date": "2010-01-20T22:48:44+00:00", "topic": "And more good news/happy dancing", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! Celebrate \n\n\n\nNix\t\t\t", "date": "2010-01-19T21:39:53+00:00", "topic": "GOOD NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlan,\nMy brother had bladder cancer two years before me.  He had to get a neo-bladder right away. So first sign of blood I was off the the emergency room (it was a Sat) and it was caught while being a papiallary  Ta. So I went the BCG route. My brother is 5 years out and a \"poster boy\" for the neo-bladder.\n\n\nNix\t\t\t", "date": "2009-12-30T00:16:16+00:00", "topic": "Life between Cysto\\'s", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid\nMerry Christmas indeed! thanks for sharing such wonderful news! Let's make 2010 another good year \n\n\nNix\t\t\t", "date": "2009-11-11T19:07:11+00:00", "topic": "False positives from FISH Test?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI live in the Tampa area and recently changed doctors and went to Moffitt Cancer Center. I was dx'd three yrs ago and proceeded on the BCG path. I was very pleased with my local Uro, because he treated the cancer aggressively. That being said, I had some difficulty with all the BCG (after 24 washes)\nMy doctor at Moffitt is Dr Wade Sexton. Since it is a teaching hospital a team reviews all your records and presents the results to you. I liked the doctors so well, I am now a patient of theirs.\nI strongly agree with the others about a second opinion. Through each phase of my treatment I went for second opinions. To date I have had 4 opinions, and if need be I would go for a 5th. As stated, it is very important to learn as much as you can about BC and to be your best advocate for your treatment.\nI know it seems over whelming right now, but once you have a plan in place things will settle down, and you will see a light at the end of the tunnel\nEnjoy your holidays with your family.\n\nNix\t\t\t", "date": "2009-12-24T18:46:25+00:00", "topic": "SW Florida and need some advise", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIf the symptoms don't clear shortly, the Infectious Disease Dr will be able to pinpoint exactly what the problem is thru tests that most Uros don't do. Don't forget BCG is a live virus that is used as the bladder wash, and different people (and bladders) react differently to BCG.This is the speciality of the Infectious Disease doctors. My own case, the 24th instillation caused BCG induced Interstitial Cystitis, which my Uro did not treat at all when I began to have trouble (because he doesn't see these reactions as much as an Oncology Uro.)\nI would let your Uro know the problems and hope he can pinpoint how to treat, if there is no improvement, then I would seek help elsewhere.\nNix\t\t\t", "date": "2009-11-22T21:38:42+00:00", "topic": "Worst Pain of 30+ BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\nI know Patricia would say \"get to an Infectious Disease Dr.\" I would agre. But first, have you notified your Uro? I know with my own experience, I was doing fine with BCG - on my 23nd one, I had more reaction and a lot discomfort for 5 days, but on my 24 one, the BCG (at a reduced amount) put me over the edge.I did not run a fever but the pressure was terrible.  I am still recovering - very slowly - and it has been 6 months! \nMy new Uro has already said with this reaction, I can't have any more BCG.\nI would definitely contact your Uro, tell him all the symptoms, and ask him if you should see an \"Infectious Disease Dr? or even recommend one for you. If he says \"no, you don't need one\", and you are not any better, I would find one and go, don't let this drag on like I did.\nGood Luck,\nNix\t\t\t", "date": "2009-11-22T21:38:42+00:00", "topic": "Worst Pain of 30+ BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations! I love the good news - keep it coming \n\n\n\nNix\t\t\t", "date": "2009-11-04T03:03:18+00:00", "topic": "Time for the Happy November Club", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tEveryone is invited to the Happy October Club - the more the merrier:laugh:  ", "date": "2009-10-22T16:54:55+00:00", "topic": "I am also a member of the happy October club", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYea, time to celebrate \n\n\nNix\t\t\t", "date": "2009-10-18T20:33:44+00:00", "topic": "GREAT NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't blame you Sara Ann. I had to put my foot down (probably too late) with my ex Uro, and by the time he dropped the bcg dose down - too late, my bladder was so injured from the BCG high dose, I had BCG Cystitis.  Not something you want to experience.  You know your body better than anyone. Only do what you feel comfortable with.\nI have my 2 yr cysto tomorrow, with my new Uro @ Moffitt, so I am very nervous today \nBill Jr.-I have emailed Dr Lamm serveral times and get a response within a few days.\nThis email address is being protected from spambots. You need JavaScript enabled to view it. - he is terrific and has helped a lot with my questions and concerns with BCG.\n\nNix\t\t\t", "date": "2009-10-15T16:30:02+00:00", "topic": "Here we go again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News Doug!!!! -\nJoey, Permquid and Ann - I will be thinking of you and wishing you great news, too.  I will be following you on Friday. Maybe this weekend we can all do the Happy Dance:P\nCan't thnk of a better Birthday gift - Joey.\n\nNix\t\t\t", "date": "2009-10-11T01:11:36+00:00", "topic": "Good Check Up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCheryl,\nI loved reading your story.... there is hope, and you were kind enough to share with us.  I am hoping to be 2 years out on Oct 30 - if I am lucky enough to have a \"clean\" cysto. As peranoid as I am, if I do have a clear cysto, I am asking my Uro to continue with three month cystos for another year (I need that to feed my peranoia....honestly, I should probably visit a psychiatrist:woohoo:)\ncongratulations your husband and to you, too!\n\nNix\t\t\t", "date": "2009-10-02T00:20:02+00:00", "topic": "FINALLY!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Patricia\nOriginally, I was Dx'd with Ta. I have 5 very small tumors and all were papallary Ta. I immediately had a CT Scan. My Uro did just 6 wks BCG, even though he said it doesn't do much with Ta, he said he just wanted to cover all the bases. I still had cystos every three months. for 9 months all was clear. I had all the usual tests, including FISH (at the 6 month mark) and cytology every three months. At the first he said I would this until two year clear. Well, a the 9 month test, I had Ta CIS so all bets were off:ohmy:\n\nNix\t\t\t", "date": "2009-10-01T00:53:30+00:00", "topic": "What protocol for T1 low grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tChuck,\nI have had 23 BCG and I haven't had any discharge, but everyone reacts differently.\nI, too, had my slides sent to JH early on, and they also agreed with the reading (Ta CIS) and also said BCG and Maintenance.  So far, so good. I go for another cysto Oct 30th.\nGood Luck with the remaining 4 BCG's:cheer:\n\n\nNix\t\t\t", "date": "2009-08-13T18:32:19+00:00", "topic": "Re-occurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo happy everything came out so well - now I can un-cross my fingers:laugh:\nI have had the problem of BCG Cystitis and effects for over three months:( It can take a long time to clear, mine is finally getting better and almost back to normal. I know everyone can get different levels of Cystitis, just make sure your bladder is ALL CLEAR before the next round.\n\nNix\t\t\t", "date": "2009-08-26T20:10:13+00:00", "topic": "Not what I wanted to hear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have written to Dr. Lamm several times, in the past, with different concerns, and as always, he has given me guidance with BCG Treatments. Hopefully, this information will be helpful you.\nBelow are a few excerpts from some of the past emails.\n\nIt is important to avoid any carcinogen exposure.  While epidemiologic\nstudies have not confirmed the carcinogenicity of artificial sweeteners, I\nwould recommend avoiding excess use.  Anecdotally, some patients with a\nhistory intractable tumor recurrence report remaining tumor free after\ndiscontinuing soft drinks.  Second hand smoke, pesticides, diesel fuel and\norganic chemical exposure, as well as excessive exposure to dyes should\nalso be avoided.\nDon Lamm, MD\nReducing BCG does not generally reduce efficacy, in fact there is evidence\nit can increase it.  I would reduce your dose to less than 1/3 or so.\nYou can hold it for a short time as well to reduce side effects.\nDon Lamm, MD\nWe go as low as 1%.  You can also reduce retention to 30 minutes or less.\nI also sometimes give heat inactivated BCG to those who do not tolerate\nlive BCG.\nDon Lamm, MD\n\n\nNix\t\t\t", "date": "2009-08-12T02:38:55+00:00", "topic": "BCG Maintenance ?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne\nI don't know about the Shingles vaccine, however, last Nov. I had to get a Whooping Cough vaccine, because my we were visiting my newborn grandson. I was worried about the body'd immunity fight the cancer and the vaccine.\nI asked my Internist, Uro and Dr Lamm - all said it was fine, so I did.\nIf you are uneasy, ask your doctors or Dr Lamm.\n\nNix\t\t\t", "date": "2009-08-10T16:58:09+00:00", "topic": "Shingles vaccine?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck, Bill.  I will keep you in my thoughts and prayers.\n\nNix\t\t\t", "date": "2009-08-04T20:57:56+00:00", "topic": "Cysto moved up toTomorrow!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have my 21 month cysto on Monday and since the back wall of my bladder was so inflamed from the BCG cystitis (front wall was clear) Uro took two biopsies - results in today CLEAN! So next cysto will be the important 24 month cysto!\nWith the biopsy report was a yeast infection in my bladder. I am not surprised because I was on so much antibiotics for the cystitis. I did take Probotics with the antibiotics, but not until two week into the prescription.  So I now have Fluconazole to take for four days. \n\n\n\nNix\t\t\t", "date": "2009-07-24T20:37:22+00:00", "topic": "GOOD NEWS FOR ME, TOO", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations Ann, Let's keep the GOOD NEWS coming:laugh:\n\n\nNix\t\t\t", "date": "2009-07-20T20:54:46+00:00", "topic": "Good news--me too!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so sorry to read of your cysto. Hopefully, the grade hasn't changed. I guess we all \"Hope for the Best, prepare of the worst\", but at times I think and new bladder is the best!\nGood Luck, I will be thinking of you,\n\nNix\t\t\t", "date": "2009-07-13T21:04:37+00:00", "topic": "BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow that is great news - I feel the Happy Dance coming on \nI am right behind you - I go July 20th.\n\n\n\n\n\n\nNix\t\t\t", "date": "2009-07-10T14:12:14+00:00", "topic": "Cysto Results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI love hearing great news    Thanks for sharing it with us.  Now, I am doing the happy dance for you:laugh:  \n\n\n\n\n\n\nNix\t\t\t", "date": "2009-07-07T16:30:03+00:00", "topic": "Even better news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have already had 23 BCG Treatments. I haven't had a re-occurance in 18 months. I am hoping the BCG worked on the CIS. My Uro  said he doesn't want to do any more any more BCG because of my last reaction.  I am going to Moffitt Cancer Center (it is close to me) Aug 7th for a second  opinion and a possibility of changing doctors.\nFrom your writing, it sounds like you are doing well after your surgery? I bet you are happy to have that behind you.\nJust continue to heal, and wishing you many happy years.\n\nNix\t\t\t", "date": "2009-07-05T13:48:15+00:00", "topic": "BCG Cystitis a.k.a Interstitial Cystitis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOUCH:woohoo: I can't imagine how painful BCG would be with IC. I did not even know this IC existed until I did research on BCG Cystitis. What a terrible desease IC is.  I have followed the diet for three days now, and I have seen improvement. It could be the sterods however, I think it is the diet and steroids. Today I purchased Prelief - Have you tried that?\nSo, did you do an entire  wk course of BCG or are they trying another approach?\n\nThanks for the info\n\nBest of luck to you:)\n\nNix\t\t\t", "date": "2009-07-05T13:48:15+00:00", "topic": "BCG Cystitis a.k.a Interstitial Cystitis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia,\nI did email Dr Lamm, and here is his response:\n\nNancy,\n\nIt sounds very much like you have BCG cystitis.  It is typical not to be\nable to culture the organism.  We treat based on the temporal relationship.\nI treat such patients with a fluoroquinolone such as Cipr0 500mg twice\ndaily.  You can also use, with perhaps more efficacy, Ofloxacin 200mg twice\na day.  We add isoniazid 300mg/day.  Treatment response is slow and you\nlikely will need to be on double (or triple) antibiotics for at least 3\nmonths.  Prednisone is sometimes needed to speed the response.\nIt should respond, but it does take a long time.\nBest regards,\nDon Lamm, MD\n\nSo I took this to my Uro and I am doing all that he suggested. I know it takes a long time, I am hoping to see what other patients have done for their BCG Cystitis. I am now watching my diet as UT Patients do, because if my bladder is inflamed diet would help make a difference?\nI am improving in baby steps, but it is always helpful to read what others have done.\n\nNix\n\nNix\t\t\t", "date": "2009-07-05T13:48:15+00:00", "topic": "BCG Cystitis a.k.a Interstitial Cystitis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t1. Know that Superfical Bladder Cancer is not minor because of the word Superfical.\n2. Know that BC runs in my family - my brother was Dx'd two years before me.  He has a neo-bladder because by the time he was Dx'd  it was stage 4 CIS. Because of his history, the first day I saw blood in my urine I RAN to the doctor - so after lots of BCG, so far, I have my own bladder.\n3. Know what BCG Cystitis is and find a doctor that listens to you when you explain what is going on in your body. Took the Uro 3 1/2 wks to agree I have BCG Cystitis.\n4. Know that this site gives great advice and caring people respond.  ", "date": "2009-07-02T14:43:20+00:00", "topic": "5 things I wish I knew at dx?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am happy this is behind you and it went so well, Lady Jane:laugh:\nThank you for the update, Jack.\n\nNix\t\t\t", "date": "2009-06-26T21:24:31+00:00", "topic": "LadyJane\\'s Turbt", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoes Doug have any other symptoms - frequentcy - pressure any thing that should have cleared up since the last BCG? I did not have the fever, but I did have other symptoms. BCG Cystitis does not always return a \"positive\" urine culture. Mine did not show a positive reading, but I sure have BCG Cystitis and because it was not pick-up, and my Uro wouldn't listen to me, I was delayed 3 1/2 weeks of treating the cystitis.\nAnd as Patricia said, any fever this long can certainly be a problem stemming from the BCG.\nGood Luck\n\nNix\t\t\t", "date": "2009-06-12T23:16:46+00:00", "topic": "BCG\\'s and how we react", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am not an expert on BCG by any means, but a fever for three weeks just doesn't sound right. Does his doctor know? I have only had a brief fever for a few hours, and have not read anything about carrying a fever for three weeks because of BCG. Doug, you must be worn out.\n\nNix\t\t\t", "date": "2009-06-12T23:16:46+00:00", "topic": "BCG\\'s and how we react", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree 100%, Sara Anne:)\n\nNix\t\t\t", "date": "2009-06-17T20:58:43+00:00", "topic": "BCG (Tired &amp;amp; exhausted)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOK - I did see the Uro today, (was not going to be denied).  The first thing he said was \"you look tired\" - gee, you think - 16 nights getting up every hour - oh well.  He did a visual sonagram - and said it is inflammation. Sending the urine out for a culture and gave he an antibiotic, an yet another med for frequent urination (which I don't think will work until some of the inflammation goes.\nSo we are off to Vermont to see grandbabies, if I don't notice some improvement in a couple of days - call and he will call in another antibiotic.\nThank you to all for your support\nWishing all of you clean cystos and happy days\n\nNix\t\t\t", "date": "2009-06-05T15:15:09+00:00", "topic": "Yes, once again BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you, I will try ditropan.  I have tried other spasm meds but they don't seem to work too well.  I have always had spasms, but during my last two maintenance rounds, I also get a LOT of pressure, which takes several days to go away. My best guess is that my bladder is so sensitive t0 BCG after 24 doses, it is very inflamed and takes time to heal. I do take advil (which does help somewhat)When I have my next Cysto July 13th, my bladder wall will still be very red.\nI even had two red small areas 6 months after the last round. It is uncharted area how anyone will react with each treatment.\n\nNix\t\t\t", "date": "2009-05-16T13:47:08+00:00", "topic": "10% BCG Effective?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Donna, Good luck on Monday, I will keep you in my thoughts - it is easy to worry before the cysto, and a great reason to celebrate after the all clear sign.\nNix\t\t\t", "date": "2009-04-29T00:28:46+00:00", "topic": "A Cytoscopy quetstion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Diane - I guess we are all in this together! We just have to keep up on \"dancing\" \n\nNix\t\t\t", "date": "2009-04-20T20:45:22+00:00", "topic": "Keeping my fingers crossed!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, Joey\nSeems we are on the same schedule.........I go for BCG next Monday, Next cysto three months from last week\n\nNix\t\t\t", "date": "2009-04-20T20:45:22+00:00", "topic": "Keeping my fingers crossed!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack, I see where you also have had plenty of BCG. I will be @ 25 after this maintenance round.  I checked Dr Lamm's protocol and see as long as BCG is working after two years of 6 month maintenance - years 4,5,6 - once a yr then yrs 8,10,12 Once every two yrs.  Are you on that schedule? I don't think I have read anyone on all that - however - if it works I am good to go!\nThanks for your support - It is great the know you are not the only one on this roller coaster.\n\nNix\t\t\t", "date": "2009-04-20T20:45:22+00:00", "topic": "Keeping my fingers crossed!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoe\nI am sooooo happy for you:) Celebrate!!!!!!\n\nNix\t\t\t", "date": "2009-04-10T21:47:48+00:00", "topic": "Recent Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Suzi - I am in Clearwater, FL. not too far from you...\n\nNix\t\t\t", "date": "2009-04-05T00:49:22+00:00", "topic": "a message from YOSARIAN", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy Uro was also reluctant to reduce the strength of BCG - until the 21st dose. At that one time (the last dose of the maintenance series) he reduced it to 50%. I could barely hold the BCG for more than 45 minutes. I did receive an answer to my email from Dr Lamm - he said dose could go down to !/3.\nDr Lamm's response:\n\"Reducing BCG does not generally reduce efficacy, in fact there is evidence\nit can increase it.  I would reduce your dose to less than 1/3 or so.\nYou can hold it for a short time as well to reduce side effects\"\nDon Lamm, MD\n\nNix\t\t\t", "date": "2009-03-29T13:21:48+00:00", "topic": "Can I safely skip 6th treatment?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news:lol: Time for the \"happy dance\"\nCongratulations!!!\n\nNix\t\t\t", "date": "2009-03-17T22:04:15+00:00", "topic": "Good report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck on your next Cysto. I have had 21 BCG washes so far and each series has more side effects than the last. I have had infections and a very inflamed bladder for 2-3 months. But like you I have had clean cystos so I don't like to harp on the side effects - so far working!\n\nNix\t\t\t", "date": "2009-01-26T20:58:02+00:00", "topic": "Mitomycin side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you to everyone:laugh: I know I gain strength by reading success stories - even though we know with BC you are never \"out of the woods\" - sometimes it is just good to hear that BCG does work for some/and or for some of the time. Of course, in three months I will be worried again - but the next 90 days will be fun!\n\nNix\t\t\t", "date": "2009-01-01T06:00:03+00:00", "topic": "Cysto Scorecard", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBobby,\nI am happy you are getting relief. It would be a great idea to set something up with Dr Lamm. I have also emailed him several times in the past and he always answers - amazing!\nHave a good trip\n\nNix\t\t\t", "date": "2008-12-28T17:36:37+00:00", "topic": "BCG side effects? Need Help!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou do have a plan Warren, and that alone should give you some relief.Hopefully, you will have a vacation from the pain to enjoy your daughter's wedding, and cross the next bridge when the celebration is over. Hang in there.............\n\nNix\t\t\t", "date": "2008-12-22T18:30:41+00:00", "topic": "Self Catheterization", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\nThanks for the thread.........I thought the same thing about the antibiotic, but I was also puzzled that the reaction o BCG would stop immediately, once I voided the BCG. I am printing out the info and taking to my doctor. As Warren said on another Post - My Uro might not have had a patient have the same response and so we have to be our own warriors.\nAs always, thanks for your wealth of information:)\n\nNix\t\t\t", "date": "2008-12-31T15:12:45+00:00", "topic": "Yet another BCG question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI recently finished my 21st BCG. Honestly, each one is an adventure: this last time after the instillation, I took my antibiotic before leaving the office as I always do, on the way home my hands and feet and where the  catheter was inserted started itching terribly. After passing the BCG the itching stopped completely. Could the BCG have caused this? or the antibiotic - neither have done this in the past. Just wondering if any one else has had this reaction:unsure:\nAnyway, Happy New Year to all who have been such a blessing to me and others on this site.  Wishing everyone a HEALTHY NEW YEAR:laugh:\n\nNix\t\t\t", "date": "2008-12-31T15:12:45+00:00", "topic": "Yet another BCG question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack - I am just ahead of you, I am cancer free for 14 months, next scope is 2/7/09. I have another installation of BCG to finish my 4th maintenance - and hopefully after another clean cysto 6 months until my next BCG. Not complaining only because it is working so far.\nWishing everyone a happy HEALTHY BC \"FREE\" year!\n\nNix\t\t\t", "date": "2008-12-25T15:51:13+00:00", "topic": "I am so thank-ful!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's what we like to hear - Merry Christmas\n\nNix\t\t\t", "date": "2008-12-19T11:52:14+00:00", "topic": "good news today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Craig\nI certainly don't know of a neo-bladder surgeon in your part of the country, we are almost opposite ends of the US. It sounds as if you have made your choice, and maybe someone on the forum will know a good connection.\nHave you tried BCG?  BCG is effective with CIS. It is the treatment of choice.  Just something else to consider. Best of luck with whatever you decide:)\n\nNix\t\t\t", "date": "2008-12-13T06:09:34+00:00", "topic": "Recommendation for Neobladder Surgeon", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon,\nI think we have all been there - sometimes enough is enough. I my last two cystos also had red spots - he biopsed during the cysto and it was just from the BCG. I have found that if it is on my mind, better to get it done that think about it all the time.\nGood Luck\nNix\t\t\t", "date": "2008-12-11T16:03:14+00:00", "topic": "Just Venting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuzi, Congrats! That is ALWAYS good news for all of us to read!\n\nAnn,\nMy schedule is the same as yours. I guess not everyone follows the same schedule. If I have three more clean cystos then I can move to 6 months for three years - that is fine with me!\n\n\nNix\t\t\t", "date": "2008-12-09T21:19:37+00:00", "topic": "Good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI really don't worry about \"holding\" the BCG much over an hour since my second maintenance. Since I have had three maintenance, the side effects get stronger every time. As for the reduced dosage quoted from Dr Lamm  \"When patients begin to have increased symptoms following BCG instillation, the dose can be reduced to 1/3, 1/10, or 1/100th as needed to prevent significant side effects with subsequent treatment. Never give BCG if symptoms from previous BCG administrations are still present, and never instill BCG if the catheterization is traumatic or bloody. Nothing is lost by postponing BCG treatment if patients have symptoms, because symptoms are evidence of continued immune stimulation. Excess BCG administration is associated with increased side effects and suppression of antitumor immune response.\"\n\nNix\t\t\t", "date": "2008-12-02T13:21:28+00:00", "topic": "Bladder Spasms", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon,\nI agree with you. I guess because my doctor does not have the spasms, he doesn't understand how severe they can be. However, this time I think he knows. It is the first time I had spasms straight through 17 hrs - without any relief.\nSince this was number 13 with the original 6 and now third maintenance round, I am sure my bladder has become more sensitive.\nthank you for interest!\n\nNix\t\t\t", "date": "2008-12-02T13:21:28+00:00", "topic": "Bladder Spasms", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon,\nI have mentioned this to my Uro in the past. He said that since I did not have any severe side effects from the full strength he would prefer to stay with that. This time I feel it was a severe reaction. Last evening and all night all I could do was walk the floor. This afternoon I am getting some relief, hopefully by tomorrow I will be back to normal.(then in five days - here we go again) I did call the Uro today and suggest we cut the strength; Hopefully, you will sail thru:cheer:\nNix\t\t\t", "date": "2008-12-02T13:21:28+00:00", "topic": "Bladder Spasms", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara\nThis is also \"kind of\" an anniversary for me also.  Two years ago, the Monday before Thanksgiving I was dx'd with Ta and had a TURB. a year ago I was dx'd with Ta CIS another TURB. One year later, 6 weeks BCG and two maintenance rounds and ready to start next maintenance on Monday - here I am also. Full of hope (13 months All Clear:) and very thankful for this forum.\nThanks to all\n\nNix\t\t\t", "date": "2008-11-26T16:42:05+00:00", "topic": "An anniversary, of sorts", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClaudia,\nI am sure your Dad will be fine.  We have the 3 month cystos to keep tabs on our bladders and to catch anything early. (which is what your Dad is doing) Good luck and let us know how everything comes out.\nNix\t\t\t", "date": "2008-11-24T00:52:22+00:00", "topic": "nervous about dad\\'s turb on tuesday", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, after reading Warren's response, and talking to my URO and Internist I received a DPT today, and feel confident that all will go well with the BCG and the DPT. Thank you so much Warren for your insight and Patricia for your thoughts!\nWe all have a lot to be thankful for this Thanksgiving, and at the top of my list is this Forum:)\n\nNix\t\t\t", "date": "2008-11-22T18:15:49+00:00", "topic": "Does DPT vaccine hurt the immune system?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't think so, I was told I would just make it under the wire, so it must be @ 65 they don't give the shot - 64 must be inclusive.\n\nNix\t\t\t", "date": "2008-11-22T18:15:49+00:00", "topic": "Does DPT vaccine hurt the immune system?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia,\nEverything changes so fast. I was at the birth and helped care for my Granddaughter just two years ago, and this was not mentioned. If I had heard this a month ago - no problem, I was between the BCG's. Oh what we do for our wonderful grandchildren!!\n\nNix\t\t\t", "date": "2008-11-22T18:15:49+00:00", "topic": "Does DPT vaccine hurt the immune system?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWarren,\nThank you so much for taking time to give me an educated answer. After reading  your response (several times) I do have relief if I decide to receive the vaccine. One other fact I did not mention is I am 64 1/2 yrs young and I had a DT vaccine 2 1/2 yrs ago. I can't help to think that 6 months from now this would not be in question, since I would be that \"magic\" age of 65:) My PCP said I would have more of a \"local\" reaction because I still have antibodies in my system.\nThank you so much for your time and effort you put forth your help on this subject! Any other advice is always appreciated!!!!\n\nNix\t\t\t", "date": "2008-11-22T18:15:49+00:00", "topic": "Does DPT vaccine hurt the immune system?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news, John ..........enjoy your \"time off\"\n\nNix\t\t\t", "date": "2008-11-06T19:37:27+00:00", "topic": "BC reoccurence with/without hematuria", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOK - I am just guessing here, but maybe since they are talking about an injection (thru the blood stream) and not a \"bladder wash\" that the BCG vaccine should be stopped.\nDoes that make sense?\n\nNix\t\t\t", "date": "2008-11-11T03:25:43+00:00", "topic": "More on BCG-Induced Arthritis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Ann\n\nWOW! Take a deep breath and give yourself a big hug! That is great news:)\nI go Monday for my cysto and of course, I am very nervous.\n\nNix\t\t\t", "date": "2008-11-11T02:39:24+00:00", "topic": "CIS Detection", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClaudia,\nWe all have bad days, and you came to the right place. That is why we have 3 month check-ups the first two years, so our doctors can catch the sneaky BC early. Is he on BCG? If so, they will probably repeat that. Don't push the \"panic button\" until you have all the facts and results.  It could be a number of things that can range from an infection to irritated  spots from BCG.\nHang in there, I pulling for you:)\n\nNix\t\t\t", "date": "2008-11-11T00:20:30+00:00", "topic": "having a bad day", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am happy that is behind you and all is well.  Hopefully the BCG will work and the paths come back with no surprises:)\nNix\t\t\t", "date": "2008-11-07T20:16:26+00:00", "topic": "I had my surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRo\nLet me chime in - I thought you were blonde - your hair looks so soft and shiny - I just thought you were a natural blonde - if you want to go back to red - go - life is too short not to do what we want:)\t\t\t", "date": "2008-10-19T13:25:20+00:00", "topic": "Dr Lamm\\'s Nutritional Suggestions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMoonerj\nI have never heard of monthly treatments.  How many months will you have the BCG?\nNix\t\t\t", "date": "2008-11-02T17:48:22+00:00", "topic": "BCG Failure", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMax - Great news on your cysto! I love to hear great news - it gives all of us hope:)\nIt is great you go to the Derm and stay on top the skin cancer, I hope all goes smoothly.\nNix\t\t\t", "date": "2008-10-20T22:29:10+00:00", "topic": "Good News &amp;amp; Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne\nI asked my doctor the exact question last year at this time - I got the flu shot in October and had my first 6 BCG in November.  I didn't have any problems with the shot or the BCG:)\n\nNix\t\t\t", "date": "2008-09-30T18:25:32+00:00", "topic": "BCG and the Immune System", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI get very tired the next day - and once I had a slight fever. Other than urgency, the symptoms leave within two days. I know everyone reacts differently but  I think it would be good to talk to your doctor and shoot off an email to Dr Lamm.\n\nNix\t\t\t", "date": "2008-09-24T16:28:11+00:00", "topic": "Symptoms of BCG reactions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid,\n\nI am so happy all ended well!! Enjoy your Holiday...........\n\nNix\t\t\t", "date": "2008-09-25T16:20:26+00:00", "topic": "Just back from cysto...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne,\n\nI am so sorry you have to go thru this. It is hard enough to deal with Bladder Cancer and everything that goes with it! Over a year ago, when I was to start my BCG, my Uro's nurse was new.  I really liked her, however, when I heard she had never done BCG before, I told my Uro, I didn't want to hurt her feelings, but since he had several partners, I wanted one of the other nurses that had BCG experience, to administer the BCG. His reply was \"she has to learn sometime\" - I agreed, but she wasn't going to learn on me:) I think her feelings were hurt at first, but I didn't care and she did get over it. Now for all my maintenance I have the same nurse.  I do think experience makes a difference.  My nurse always streams the BCG slowly to help with the spasms. I still get spasms, but maybe they aren't as bad as they would be.  It is hard to stand our ground, but unless the professionals have had Bladder Cancer themselves they can't know exactly how vulnerable we feel.\nHopefully, this past one will be OK and you can ask for another nurse next time.\n\nNix\t\t\t", "date": "2008-10-04T00:03:19+00:00", "topic": "The perils of BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIan,\n\nA split penis - it sure sounds like a big deal to me! Makes me happy to be a girl  I dread my cystos, but you must absolutely hate yours! You should certainly go to a Uro you can communicate with.  Do you only have a choice between the two - the first one and this one? Maybe you could get another recommendation? Is there a cancer center near you? Maybe they would be better since they deal with this more frequently.\nI am sorry I can't be of much help, but I too am happy you have the good news of the low grade BC.\nWhen is your next cysto?\nGood Luck,\nNix\t\t\t", "date": "2008-10-01T23:27:57+00:00", "topic": false, "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatrica,\nThanks for the article.\n\nNix\t\t\t", "date": "2008-09-24T20:01:30+00:00", "topic": "Dr. O\\'Donnell\\'s take on BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is great to hear good new  Have a great weekend!\n\nNix\t\t\t", "date": "2008-09-24T16:55:42+00:00", "topic": "Cysto Looks Good!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck on your Cysto - I know the feeling - can't wait to get it over with but at the same time \"fear\" the results.\nPlease let us know how everything goes - try to enjoy your weekend.\n\nNix\t\t\t", "date": "2008-09-15T20:30:01+00:00", "topic": "Whew!! Good News :)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSusan,\nI have been dealing with Bladder Cancer for only two years......so I am not and expert by any means.\nOf course when I heard the word Cancer I was very upset. Since mine was Ta it was removed and I thought all is well.  I guess I thought you just took care of the cancer and moved on - nine months later CIS was removed and I felt my world turned up-side-down.  After reading everything I could and getting second and third opinions I had the 6 BCG and so far 2 maintenance rounds.  Just passed my one year clear mark.\nI think in the beginning I thought I would get \"you are cured\" from the Uro - after understanding that just does not happen - it is a process.\nThe Bladder Cancer road has been a continuing journey for me, since I am type A personality, I like to get things done and move on and it will not happen with this, it just doesn't work this way.\nSo on days when I am scared (right before cystos) I thank God for my husband, children and grandchildren - prepare for the worst and hope for the best.\nI am indeed grateful that we can  be watched closely and any bumps in the road  acted upon ASAP.\nAs I said before, this is a journey.\n\nNix\t\t\t", "date": "2008-09-20T16:17:05+00:00", "topic": "I need input from you all", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI love to hear good news! Congratulations - do something special this weekend.\nAre you now on 6 month cystos? - if so that is a great place to be!\n\nNix\t\t\t", "date": "2008-09-19T22:43:24+00:00", "topic": "Good result just a quicky", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoey, Very interesting.  I also had a FISH test and it was negative - that was right before my CIS was Dx'd. Hopefully, this new process that Rosemary educated us with, will help.  I really thought CIS would show in a cytology. That is one reason why I was so floored when it was found I had CIS! My scope is 9/2 - I am taking all the information with me - I will let you know what my Uro has to say.\nNix\t\t\t", "date": "2008-08-05T22:48:59+00:00", "topic": "Clear Urine Cytology Test", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary,\nWhen I go for my next \"cysto\" I am taking all your information for my Uro. Every Cytology I have ever had - for two years - comes back negative. Even my first one , and I had 5 Ta - and then when I had CIS dx'ed I also had a negative cytology.Altought it is great to hear negative, I want the whole story. Thanks again for the info. I really appreciate it .\nNix\t\t\t", "date": "2008-08-05T22:48:59+00:00", "topic": "Clear Urine Cytology Test", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLynn, I am glad you are going to have another cysto to find out just exactly is there. Better to know, than to worry for three months.  Hopefully, it is just scar tissue or something else that is not of concern. Good luck and let us know the results.\t\t\t", "date": "2008-08-13T17:53:17+00:00", "topic": "Cysto results- good, maybe?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJon,\nI have only had a little blood pass on my first day of BCG's. I am sure it is fairly common. You did the right thing to report it to the doctor.  Do they do a urine test before every BCG? Make sure they do, and if all is clear they will do the next treatment.\nNix\t\t\t", "date": "2008-07-24T14:50:23+00:00", "topic": "6 days after first BCG and some blood", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWay to go - Congratulation!!!! Go have some fun.\n\nNix\t\t\t", "date": "2008-08-03T01:37:52+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSusan,\nI know,it took me quite a while to wrap my brain around the whole BC thing! One doctor actually said \"Doctors used to say 'here comes long term money' because BC is a life long desease\". Believe it or not, that actually made me feel better, because I know a lot of cancers that are swift and deadly. So, everytime I have to start BCG Maintenance, I am thankful that I don't have to do chemo (with drugs in our blood stream) and marvel that so far BCG is working . Rosemary is so right, as long as you feel you are doing all you can, it gives you a handle on the road ahead. Rosemary has helped me so much on my journey.\nJust know, we are all with you - with BCG - and the good times of the all clear scopes!\t\t\t", "date": "2008-07-25T04:51:19+00:00", "topic": "I was wondering something", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLynn,\nI think we are all in the same boat - good for 2 1/2 months then start getting nervous! I try to keep busy and pray that all is well. Please let us know how everything goes...........I will be thinking of you.\t\t\t", "date": "2008-07-25T16:24:33+00:00", "topic": "One week until next cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTommy, Good news. although, I am nearly two years into this, I love to read the about the clear cystos! thanks for sharing.\n\nNix\t\t\t", "date": "2008-07-22T04:15:09+00:00", "topic": "Cysto is OK!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations Max, It is always great to hear good news  ", "date": "2008-07-20T18:38:19+00:00", "topic": "Words of encourgement", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood for you! Enjoy your time \"off\"!\t\t\t", "date": "2008-07-20T05:40:57+00:00", "topic": "Monday and then that is it!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am very interested in your BC since I am only two years into this. First I had Ta and nine months later dx CIS - flathead multi focal. Had it removed and came back no invasive CIS.  I have had 6 BCG and two maintenance (3X each) So far all clear:).\nMy Uro led me to believe that if another occurrence of CIS I would have to have my bladder out.\nSo after reading your post, I think I understood you to say you had CIS return and just had more BCG? Is that right?  Did the BC then respond to the BCG?\nThank you for any insight you could share with me.\t\t\t", "date": "2008-07-11T03:54:03+00:00", "topic": "Recurrence while on BCG maintenance", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI also have papillary - Ta and CIS.  My papillary was found in Nov 06 - I was clear for 3 Cystos then on the forth - red velvety patches were biopsied and sure enough CIS. So I would have to say, according to my history  they are independent.  Some people just get a papillary Ta once and it is removed - then nothing else comes back .  I have never had another tumor - just the red patches.  Of course, I am not happy about\nthe CIS, however BCG does work well on CIS and not just Ta.  I guess I am looking for a silver lining to the cloud !\t\t\t", "date": "2008-07-08T19:45:08+00:00", "topic": "Papillary and CIS...relationship?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the link, Patricia.  It is a very good article that covers all the ins imfomation about BCG.\t\t\t", "date": "2008-07-08T04:33:13+00:00", "topic": "Re-TURB and intravesical therapies....good article", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDr Lamm does recommend cutting the dose, however my Uro said, since I have not had any bad reactions, he has been using the full strength.  So far, so good.  If I do run into any problems down the road - he will cut back.\t\t\t", "date": "2008-07-01T02:57:21+00:00", "topic": "third bcg treatment  ugh", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs you know already, everybody reacts differently.  As for my Maintenance BCG, The reactions was a little more pronounced, but certainly bearable.  I have had two maintenance so far, and three clear cystos - so hands down it is worth it - so far.........\nGood Luck\t\t\t", "date": "2008-07-01T02:57:21+00:00", "topic": "third bcg treatment  ugh", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news, Slabman! Thanks for posting the results.  I had my third, and last, BCG maintenance yesterday, but I did ck to see how your cysto results were.\nAre you doing the maintenance now?\nNix aka NancyS\t\t\t", "date": "2008-06-28T22:43:52+00:00", "topic": "First Poke and Peep", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Sara Anne! I did find I had a few more side effects with maintenance, but nothing severe. Everyone is different with reactions to BCG - just cross that bridge when you get to it.\nHave fun tonight - you have earned it!\n\nNix\t\t\t", "date": "2008-07-01T23:37:34+00:00", "topic": "First Poke and Peek post BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know, Susant, sent a \"help me\" email about the same concern yesterday, haven't heard anything yet.  I know it is hard to get everything \"up and running\", but I hope we can view and read the same a Webcafe.\t\t\t", "date": "2008-06-28T05:06:18+00:00", "topic": "I\\'m confused here", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW! That is a great outcome! Congrats! Thank you for posting, it gives us hope!Wishing you smooth sailing!\t\t\t", "date": "2008-06-28T14:28:15+00:00", "topic": "Two years and still clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\twhat was your original dx? stage? number of tumors? Thanks for any background you can share.\nNix\t\t\t", "date": "2008-06-28T14:28:15+00:00", "topic": "Two years and still clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had debris in my urine during and after my maintenance BCG. I am in the middle of my second maintenance (of three)and here I go again.  My Uro does, of course, do a Urine test before every BCG, but I wonder if other people have debris floating around  for aleast 3-4 wks? Is this normal?  So far the BCG has done its job - 2 clean cystos.\nthanks for any input.     \t\t\t", "date": "2008-06-20T16:43:25+00:00", "topic": "debris  after BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News - keep doing what you are and don't forget to celebrate the great results!!!\nNancyS\t\t\t", "date": "2008-06-15T09:30:32+00:00", "topic": "So who·s superstitious ?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck with your cysto - I will be waiting to hear..............\n\n\nNancy\t\t\t", "date": "2008-06-09T21:30:15+00:00", "topic": "Good News Today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my third clean (cancer free) cysto today!So far - BCG is my hero! I have had 6 wks and three maintenance and now I do three more maintenance and another cysto in September.\nOf course, I have a few side effects from the BCG (small fever, bladder spasms, and complete tiredness the next day, but small price to pay for a good clean cysto.\nThanks to everyone who has hung in there with me, believe me, I say a prayer everyday for all that are in the same boat with this BC.\n\nNancy S \t\t\t", "date": "2008-06-09T21:30:15+00:00", "topic": "Good News Today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSusant,\nOf course it is normal to have all those feeling. Once we hear the word cancer, the fear is instant. Once I did a lot of reading and research, then I started to calm down and focus on beating this.  I think it helps to know everything you can about your new enemy - BC and be vocal with your Uro, every step of the way - that way you are in control not just the doctor! Hopefully, your Uro is open to working with you - if not find another one. There is a lot of hope out there, and this is just the place to read about the sucess in treatment for BC.\nGood luck - take a deep breath and move forward.\n\nNancyS\n\n", "date": "2008-06-10T02:09:50+00:00", "topic": "Am I Doing ok", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGina,\nFor sure I would request (or demand) an antibiotic on the day of the BCG.  Any time you have a catheter there is a chance of an infection.\nI can't promise it is worth it - however I can tell you so far so good for me.  I have had the initial 6 wks and two maintenance (3 wks each) so far it looks good, and this is the best proven course to follow.\nSo just hope for the best - Good Luck\nIf I can help in any way please ask!!\n\nNancy S\t\t\t", "date": "2008-04-18T01:49:35+00:00", "topic": "need input!! plz.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Gina,\nI have a urine test before each BCG and Cipro for two days after each installation. If I have an infection, we hold off on the BCG for a week until it is cleared.  Cipro will not affect the BCG. Did you receive any antibiotics on the day of BCG?\n\nNancy S \t\t\t", "date": "2008-04-18T01:49:35+00:00", "topic": "need input!! plz.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSlabman,\nJust as Dan said, they will do a cystoscopy.  None of the doctors want to do a cystoscopy during bcg. I went for my second opinion (to Barnes St Louis) right after my doctor did a cysto after my frist 6 wks of BCG.  Then I felt four eyes are better than two!\nGood luck\nNancy\t\t\t", "date": "2008-05-06T22:25:32+00:00", "topic": "Second Opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid,\n\nWhat great news!!!! I am so happy for you, and it gives hope to all of us.  Just stay on top of BC like you have been.  Celebrate every day!\nNancy S\t\t\t", "date": "2008-03-05T21:55:16+00:00", "topic": "Cystectomy Needed for Recurrences of TA, CIS Non-Invasive BLC?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGina\nHappy you are all most thru with the initial BCG, however, keep a close watch on your fever.  Make sure your doctor knows that you had a fever and how high.  You really don't want to ignore that.  After running low temps. (one time 101) my Uro suggested I take Tylenol every four hours on the day I receive my BCG.  Tried that the last time and it worked.  I just had a brief time (about 30 min) that I had chills.\nGood luck - hang in there.\nNancy S   \t\t\t", "date": "2008-04-10T07:15:26+00:00", "topic": "Fatigue Anyone?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSlab,\nMy BCG are always at 10 AM - I eat breakfast - cereal and yogart - but I never have coffee on BCG day.  You may have a normal appitite on BCG days, or you may not feel like eating much.  I do drink a lot of water  after the two hours of holding the BCG. It seems the more water I drink the faster I get back to normal.  I forgot to mention, one of the side effects I have noticed since my maintenance  is being really tired the day after the treatment.\n\nNancy S\t\t\t", "date": "2008-04-08T04:23:47+00:00", "topic": "BCG Treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSol,\nI can only speak of myself, as I am not a authority on BCG - however, I am learning more and more.  During my initial 6 WKs of BCG, I had to postpone one (for a week) due to an infection.  I then completed all, have had 2 scopes and clear.  I just completed my maintenance 3 BCG) and also had to postpone the last treatment 5 days, due to another small infection and the URO wanted to be careful.  I am not sure I would have postponed except unless the URO reccommeded.  I like to get thru the treatments as scheduled.  But that is just me.  Good Luck\nNancy S  \t\t\t", "date": "2008-04-03T04:00:55+00:00", "topic": "SKIPPING BCG FOR A WEEK", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou are something else, Patricia! Thanks so much - I did read the article and I will  to store the info in my info.\nThis forum is sooo enlightening!\t\t\t", "date": "2008-03-20T03:13:12+00:00", "topic": "new trial of drug for those that don't respond to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI did mention the \"blue light\" diagnostic tool that I read about on the forum, however he seemed convinced about the study he was explaining. Hope he is right!\t\t\t", "date": "2008-03-20T03:13:12+00:00", "topic": "new trial of drug for those that don't respond to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPatricia,\nThank you so much for the info on the new study.  Although, so far BCG seems to be working, it is comforting to know new treatments are still being tested!\nMy Uro mentioned, in conversation,that Europe is studying a treatment with a \"light\"? He said it looked very promising, as they have been doing studies the past few years.  Have you heard of this? Something like - they give you a wash/or IV that \"colors\" the cancer cells and the light \"kills\" all of them! It sounds too good to be true, so maybe I misunderstood him. Perhaps, I am thinking of a SciFi movie  ", "date": "2008-03-20T03:13:12+00:00", "topic": "new trial of drug for those that don't respond to BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGina,\n\nWe are all scared, however with time you will learn to put your worries in their place and live in between the cystos. Just learn as much as you can, ask a lot of questions and get second, third and forth opinions - if need be.  This forum has helped me so much, I am sure it will also help you.\n", "date": "2008-03-18T13:08:41+00:00", "topic": "Bladder Spasms from BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck, Joe - I hope every nook and cranny is clear!\t\t\t", "date": "2008-03-18T13:08:41+00:00", "topic": "Bladder Spasms from BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGordo and Craig\nI don't have much bleeding, just a drop - however my Uro told me not to take Ibuprofen, since it can cause bleeding. So since my dx I have used Tylenol. I do get a fever for a few hours, but other than that so far the only problem are the spasms. I guess so far I am lucky, I have one more maintanace to go thru next Mon.\nI called my Uro and he suggested I try Detrol LA. So I take one pill a   day during BCG. I don't know if it will work this time, since I am only taking it for 5 days before BCG. If it works I will let you know.\nMy spasms have very slowly progressed with the BCG - this last time they were more intense and lasted much longer. If this does not work, I am going to suggest a smaller dose of BCG\nThanks for the info,it is good to know we are not alone during all this treatment!\n", "date": "2008-03-18T13:08:41+00:00", "topic": "Bladder Spasms from BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWarren\nWishing you a \"speedy recovery\" and congrats on the good news of \"no cancer\"\n\nNancy S\t\t\t", "date": "2008-02-19T00:47:19+00:00", "topic": "Back on the Merry-Go-Round", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tdavid,\n\nI am sorry the BCG wasn't the medicine for you.  I am hoping it works forme - so far I had 6 wks clear cysto - next on on Monday - if all clear 3 wks of BCG - I guess I have to keep hoping it will help.  My Dr did say if I had any return I would have to consider having a cystectomy.  One of my 2nd (3rd?) Opinions from the Cancer hospital near me, said there are other treatments - however, I have heard BCG is the best shot. It sounds like you ave a good plan with MD Anderson. We are our best advocate for our health - Education and Follow-Thru!\nGood Luck!\nNancy S\t\t\t", "date": "2008-02-12T16:42:55+00:00", "topic": "FISH Test on urine specimen?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid,\nI read that you had 6 wks of BCG - did you have BCG maintenance also?\n\nNancy S\t\t\t", "date": "2008-02-12T16:42:55+00:00", "topic": "FISH Test on urine specimen?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Rosemary,\n\nHow many BCG's have you had?  I know with my CIS it is a different ballgame - but I am (hopefully) having maintenance BCG if my next scope is clear.\nAs everyone suggested on the forum, I did go to Moffitt Cancer Center and meet a great Dr.  - He said my Uro was doing exactly what he would do - and hopefully I will continue to get clean cytos.  Of course, I am very worried right before each cysto. My last appointment to get the results of the byopsies was @ 4 PM - I thought  the time would never get pass - fortunately, it was good news - from now on I will go early in the day!\nNancyS\t\t\t", "date": "2007-10-19T00:16:56+00:00", "topic": "Tired of Doctors and another stupid test tomorrow", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the link - I do eat a healthy diet, but have wondered if I should take a supplement while fighting Bladder Cancer. I am sure I get the daily dose with my diet, but still pondering adding more. ???\t\t\t", "date": "2008-01-19T02:54:13+00:00", "topic": "Familial Bladder Cancer?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Everyone,\nBrief history, 11/06 diag. with BC Ta - TURB and 6 wkds BCG.  Three clean cystos - DISH neg - forth showed velvety red and diag Ta CIS 10/07. Dr said BCG is more effective with CIS so had Intro (6 wks) BCG.  A lot more reaction this time - bladder spasams, a little bleeding, low fever - once, urine urgency  and just general overall blah! Had cysto last week - negitive! - Dr said my bladder really reacted to BCG - entire walls were  inflamed - he took 9 biopsys to be sure - all negitive.  So now I have three months to push this back in my mind and get ready for the next stressful cysto.  If all clear  I will have 3 wks of maintenance BCG.  I know (if I am lucky) BC is always there with the fear of the next cysto - it is just learning to live your life with BC and not let it take over ALL your thoughts and lives.\nThank you to everyone who has helped me so much in the past, and I am sure in the future.\nAnd thank you to everyone who posts on the site, as it sure helps to gather information quickly when you feel desperate.  Everyone is so kind and supportive!   \t\t\t", "date": "2008-01-16T14:28:18+00:00", "topic": "Update on Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Rosemary,\n\nI just had my third intro to BCG (I had six wks a yr ago after Ta was found.  Now with CIS I am starting again also with maintenance in three months.  Last yr I did not have any side effects.  This time I had some bleeding and a slight fever 99.9 for a few hrs. Is this normal.  The bleeding stopped in a few hrs also.\t\t\t", "date": "2007-11-01T23:15:03+00:00", "topic": "Slight bleeding post-BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tdmartin12358,\nthank you for the information - for sure I will be on the phone with the Moffitt Cancer Center tomorrow at 9AM Sharp!\nthank you to everyone who took the time to write, I do not know how I would have gotten thru this weekend without all of you  \t\t\t", "date": "2007-10-05T19:23:47+00:00", "topic": "Help! Shellshocked once again!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tthank you fearandfight for your listing. I have Moffitt cancer center on my schedule to call tomorrow morning. Do you feel it is better going thru a cancer center rather than a general Uro?\nAnd also = thank you for your patience. I am just a little spastic right now - I really don't want to sound like a whinner.\nNancy \t\t\t", "date": "2007-10-05T19:23:47+00:00", "topic": "Help! Shellshocked once again!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWendy,\nI am trying to get names of dr in my tampa area for second opinions now.  We are not real familiar with this area, haveing just moved here three yrs ago. Up to now I am pleased with my dr however, I know it is important to have more insight than one dr.\nThank you for your kindness.\nNancy\t\t\t", "date": "2007-10-05T19:23:47+00:00", "topic": "Help! Shellshocked once again!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Mystic\n\nDid you have the basic 6 BCG after the first surgery?  I had Ta, but my Uro strongly suggested at least 6 treatments.  I did all six  - one a week for 6 weeks - no problem.  For 24 hrs I had urgency - but other than that I was fine.  I am a little concerned if he wants me to have three more, because from what I have read here, those seen to get a bit nasty.\nThis board has helped me so much - the people are great!! - We are all in the same boat   ", "date": "2007-08-04T19:26:11+00:00", "topic": "ACCEPTANCE &amp;amp;amp; KNOWLEDGE", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlice,  No wonder you are second guessing yourself, Alice .  you have certainly had a \"full plate\" and then the insurance problems on top of everything else.  I know it sounds easy to say - just try to find the best doctor you can and if you have to travel 2 or 3 hrs - just do it.  But some circumstances hold us back.  I will tell you to keep looking until you find a doctor that you trust and of course one that will listen to you.  I wasn't thrilled with my URO, until I flew to St Louis for a second opinion, from a doctor I respect.  He was very supportive of the treatment my URO choose and that was very comforting.  Maybe, you could find a local doctor, and then pick one for a second opinion, just to give you peace of mind.  if you have to travel once for a second opinion  just to double check your doctor - it would be well worth it.\nI know the next several days will go slow for you, but you will be in my prayers and thoughts.  Hopefully, everything will be fine and you can relax for a while.  \t\t\t", "date": "2007-07-11T15:55:03+00:00", "topic": "What are the chances of a Person being wrongly Diagnosed?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you, Patricia\nThere is such a wealth of information on this website.\t\t\t", "date": "2007-07-21T07:10:55+00:00", "topic": "Cancer,BCG &amp;amp;amp; me", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI also was diagnosed in fall 06- Mine was Ta 2 1/2 mm all low risk.  My URo suggested BCG (six) just as procaution.  I had no side effects except the usual urgency and a little burning for a 24 hr period.  When I went for a second opinion - that URO said he would not have done BCG however since it was over and all was well - it was insurance.  Then my URO did a FISH test.  Have any of your doctors done that?  Mine came back neg - but I did not hear of it until I had it and then did some research on the FISH.\nI go for my third cysto end of sept - then my doctor will decide on any more BCG.\t\t\t", "date": "2007-07-21T07:10:55+00:00", "topic": "Cancer,BCG &amp;amp;amp; me", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSince my brother went to Barnes/Dr. Bullock, I have nothing but praise for the Doctor and Hospital.  My brother is celebrating 11 years with his neo bladder, he was 69 at the time of surgery.  He has not had to \"self-cath\" but some of the others do, it does not seem to be a problem either way.\nGood luck, and you found the right site to help you, everyone is so informative and helpful.\nWe have all been down this road called Bladder Cancer, and there are a lot of positive outcomes.\n\nNancy\t\t\t", "date": "2016-05-19T12:52:21+00:00", "topic": "Seeking input on diversion options", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am late reading this, but I might be able to help.  My brother @ age 69 had a neo bladder at Barnes, Dr. Bullock was his surgeon.  Since that time he hasn't had any problems, however, I have read some patients do have some problem.  He does not have to cath, but that does not mean your husband will not have to.\nI am sure a surgeon will tell you what is best for your husband's particular case.\nGood Luck, I hope this helps\n\nNancy\t\t\t", "date": "2016-05-19T12:52:21+00:00", "topic": "Seeking input on diversion options", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh Catherine!  I am so happy for you. You bet \"now is the time to celebrate\" \n\nI haven't been checking in as often, due to other concerns, but it is ALWAYS great to hear good news.\n\nI am celebrating with you \n\nNancy\t\t\t", "date": "2015-02-26T01:23:06+00:00", "topic": "Best Anniversary Ever", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so happy to hear your GREAT news! The words \"cancer free\"\nAre the best words to hear!\nCelebrate!\n\nNancy\t\t\t", "date": "2014-02-26T01:16:30+00:00", "topic": "4 Year Anniversary Today", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHope you are doing better, happy to hear the test didn't show any mets or cancers.\nThinking of you,\n\nNancy\t\t\t", "date": "2014-02-05T15:57:04+00:00", "topic": "Snowed in In Boston", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat great news! S U R V I V O R has such as sweet ring to it!\nPut on those dancing shoes and enjoy!\n\nI also did the extra year of 6 month check ups.\n\nNancy\t\t\t", "date": "2013-06-07T15:39:40+00:00", "topic": "Five Years!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike,\nYou have found a good plan, with many doctors working on a successful finish, along with ALL thoughts and prayers for you and your family coming your way, I don't doubt for a minute the cancer\n picked the wrong person!\nYou have always been an inspiration to all,  \n\n\nHugs,\nNancy\t\t\t", "date": "2013-02-19T15:24:24+00:00", "topic": "PET scan results", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDitto what George said, he says it so much better than I can.\n\nNancy\t\t\t", "date": "2013-02-05T03:50:11+00:00", "topic": "Here we go again?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Warren,\nYou have given me so much information and support when I was dx'd six years ago. I\nam so sorry you have to go thru this, but knowing your resolve in the past, I know you will come thru this with flying colors!\nPlease keep us posted, so we can \"root you on\" thru this process \n\nNancy\t\t\t", "date": "2013-01-27T19:02:46+00:00", "topic": "I'm back", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSix years ago when I was dx'd, I had a lot of blood. It was like I was just passing blood instead of any urine. Because it was a Saturday morning, I went to the ER. Thankfully, the ER doctor did a sonogram and the tumors showed up.  I am very grateful to that doctor, because I was told by some top Urologists that most ER doctors would just think it was an infection and prescribe an antibiotic.\nTwo days later I had a cysto and, that was when I found this site.\nI understand your worry.  Why not call the doctor's office tomorrow and tell them of the heavier bleeding?  Maybe he can see you sooner?  I am sorry that he had you wait a month for the cysto, the waiting time can seem unbearable.\nGood Luck,\nNancy\t\t\t", "date": "2012-10-25T18:12:55+00:00", "topic": "Much blood in urine- should I go to ER?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Mike! Now you can celebrate!\n\nNancy\t\t\t", "date": "2012-09-13T06:14:02+00:00", "topic": "Urine cytology after neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow that is GREAT NEWS!    \nGet your dance shoes on and start the Happy Dance!!!!\n\nNancy\t\t\t", "date": "2012-08-14T21:36:54+00:00", "topic": "3 year mark!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is great news, Herb! An entire year!!   \n\nNancy\t\t\t", "date": "2012-01-20T00:41:58+00:00", "topic": "16 Months Cancer Free", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news, Duke! The wait is terrible but results are wonderful!\n  \n\nNancy\t\t\t", "date": "2011-11-27T21:13:42+00:00", "topic": "Here we go again, or not?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo happy your life is getting back to normal, and you are feeling so much better. \nNancy\t\t\t", "date": "2011-06-22T18:29:15+00:00", "topic": "Happy Fistula Update on Melodie", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGREAT NEWS!!! I never get tired of reading ALL CLEAR stories.\nThanks for sharing!\nNancy\t\t\t", "date": "2011-06-09T12:59:59+00:00", "topic": "Anniversary", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat News   \nNancy\t\t\t", "date": "2011-04-04T23:10:19+00:00", "topic": "Clean Cysto Today", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations, Catherine!\nWhat a wonderful report and just before Thanksgiving! Enjoy.....\nNancy\t\t\t", "date": "2010-11-24T00:35:46+00:00", "topic": "A+ Cysto Report Card", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHang in there, Holly - you are on the road to recovery \n\n\nNancy\t\t\t", "date": "2010-11-03T20:14:55+00:00", "topic": "Neo  to Ileal for Msnoregrets/Holly", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! One year plan for cystos  Keep dancing....you have earned it!\n\nNancy\t\t\t", "date": "2010-05-08T07:31:38+00:00", "topic": "Happy Day !!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoey,\nWhat a wonderful addition to our family! Already, you have brought hope and caring. Welcome!\nNancy\t\t\t", "date": "2010-08-05T22:57:42+00:00", "topic": "New user with bag since he was 9", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is funny, I have said \"if this were your Mother, what would you do\"?  I left out \"asshole\" but I probably would have used that too, if I had thought about it! Next time I will try that \n\n\nNancy\t\t\t", "date": "2010-04-04T15:36:42+00:00", "topic": "My idea for letter to a local urologist....", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so happy for you!    \n\n\n\n\nNancy\t\t\t", "date": "2010-02-05T20:25:56+00:00", "topic": "Check up.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so sorry you have to go thru all this ugh!I am happy you are going for a second opinion. A wise lady once told me to be SURE to ALWAYS get a second opinion...Oh wait that was you!  I am sure what the doctor charges insurance and co pay will be enough to get a new shirt.\nHope you get some relief soon,\n\nNix\t\t\t", "date": "2009-07-23T22:58:02+00:00", "topic": "Further Adventures of Colonoscopy with Pat", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDearest Mike,\nYou are such an inspiration to all of us! With your journey\nYou have shown us hope, wisdom, love and above all laughter!\nYou continue to teach all of us!\nWords fail for my sadness, but please know\nYou and your family are in my thoughts and prayers.\n\nNancy\t\t\t", "date": "2014-03-28T18:07:28+00:00", "topic": "Progression of mets faster than expected", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKathleen, you are sure an inspiration to all of us. I am wishing you a good report in April and I will be thinking of you. Please keep us updated.\nNancy\t\t\t", "date": "2011-10-12T21:45:22+00:00", "topic": "Chemo update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tYea! I am so happy for you!\n\nNancy\t\t\t", "date": "2011-11-03T01:03:56+00:00", "topic": "Good News on CT", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tMel,\nMy thoughts and prayers are with your father and your family\n\nNancy\t\t\t", "date": "2010-02-19T17:42:53+00:00", "topic": "It doesn\\'t look good....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tMel,\nMy thoughts and prayers are with your father and your family\n\nNancy\t\t\t", "date": "2010-02-19T17:42:53+00:00", "topic": "It doesn\\'t look good....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tGood for you Betsy Mae, Wishing you many sunny days ahead \n\n\nNix\t\t\t", "date": "2009-12-02T21:01:06+00:00", "topic": "More on Betsy Mae", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tGood for you! Congratulations!!! It is the first step towards total recovery.\nAs said before, stay on top of everything, and get on with your life! We all know that it is easier said than done, but you are past the first hurdle.\n\n\n\n\n\n\n\nNancy\t\t\t", "date": "2013-08-20T23:26:50+00:00", "topic": "3 month checkups", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tGreat News, Julie.........Congrats!\n6 more great months ahead for you!    \nNancy\t\t\t", "date": "2011-04-14T22:35:41+00:00", "topic": "great news!! 6 month all clear!!!", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI have to wear Poise Pads, not because of surgery, but because of severe side effects from BCG. At first I was worried about having to wear a pad and being scanned, then I thought, \"why do I care, TSA agent has not walked in my shoes, or taken my journey\". I did get scanned twice, and really don't know (or care  ) if my pad was visible.\nI doubt that it does show up on the scanner, but if so, so what?\nWomen have an advantage with the outlook of wearing any pads, because of all the years past we had to!\n\nNancy\t\t\t", "date": "2011-02-04T04:40:56+00:00", "topic": "TSA Scans &amp;amp; Incontinence Pads", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tHoly Cow, that is scary  I had never read that fact before! Here is hoping more research gets done and we can change that fact.\n\nNancy\t\t\t", "date": "2010-07-20T17:30:06+00:00", "topic": "Female bladder cancer: Incidence, treatment, and o", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tAnn,\nA little frustration and \"Yankee ingenuity\"\n\nNancy\t\t\t", "date": "2010-03-31T15:52:25+00:00", "topic": "Woman cleanup after BCG", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tPlease don't feel awkward, that is what is so great about this website \nI always \"set up\" my bathroom before I left for the Uro's office. 1 Large bottle of Clorox, Cottonelle wipes, 1 spray bottle filled with water.\nAfter voiding I would spray, wipe with toilet tissue, then wipe with the \"wet wipe\" - pour two cups of clorox in the toilet let stand (at least 15 min) then flush.\nGood luck with your BCG.\n\nNancy\t\t\t", "date": "2010-03-31T15:52:25+00:00", "topic": "Woman cleanup after BCG", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tJust stopped by George. Happy to see you did also!\nI am 13 years out and 11 cancer free! I would not have made it this far, without the support and Knowledge of this site!\nI still go every 18 months for a cysto (for peace of mind)\nStill love this site, such great info and caring people\t\t\t", "date": "2020-04-16T23:49:59+00:00", "topic": "Hello! It’s been a while", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tGreat news!!! Love to hear the successful results!!!!!!\nCelebrate!\n\n\nNancy\t\t\t", "date": "2015-09-09T21:31:24+00:00", "topic": "Good News on Jim's biopsy results!", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI know how you feel, George , my 7 yr check up is Tuesday!  Although not as intense as the first and second check, still there and more nervous as time creeps closer!\n\n\nNancy\t\t\t", "date": "2014-07-15T22:56:21+00:00", "topic": "Another All Clear", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tSo sorry, I did not read the whole string.  I thought George was the starter thread.\nHappy for you, Jim's wife.  All clear gives the newbies so much hope!\nCongrats!\n\nNancy\t\t\t", "date": "2014-07-15T22:56:21+00:00", "topic": "Another All Clear", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHere is some info I found a couple of weeks ago when this thread started. www.everydiet.org/1001/sugar-and-artificial-sugar-facts\nI found a wealth of info just going thru Google and asking questions about sugars.\nNancy\t\t\t", "date": "2010-09-21T21:14:20+00:00", "topic": "Cancer Diet", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tNow that is really good news! Brings home the message....never be a spectator with your diagnosis! Own it and learn everything you can!\nWay to go, Betsy\n\nNancy\t\t\t", "date": "2012-02-17T22:19:57+00:00", "topic": "Another Life impacted by cancer", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tDiane,\nI am so sorry you and your family are going through this at this time. I felt the same way when my mother was dying of cancer - I didn't want her to suffer anymore. It is hard to \"let go\" but a piece of you father will be with you always.\nGod Bless,\nNancy\t\t\t", "date": "2011-08-18T05:54:18+00:00", "topic": "End Stage Symptoms?", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI agree that it is certainly not the cure or even the magic bullet for bladder cancer. I do think anything you can do to improve your immunity can' t hurt.\nDr Lamm does recommend the Vit A he sells, and I don't like taking high doses of Vit.\nMaybe eating lots of the yellow/orange helped the immunity maybe not, but I felt I was being proactive. Maybe it just helped mentally, could be:)\n\nNancy\t\t\t", "date": "2013-08-27T01:41:44+00:00", "topic": "Fruits/veggies reduce risk bladder cancer 4 women", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThank you for posting this. When I was going through BCG, I didn't want to take the Vit A that\nDr. Lamm suggested. I sent an email and asked if it was effective to eat a lot of Vit. A\nFruits and Vegetables.  His answer was \"absolutely\" ,  he preferred that, but some patients\nfind it easier to take the pill.\nI really ate a lot if the yellow and orange fruits and veggies plus at least 1 1/2 cups of broccoli\na week. Still faithful to the broccoli , but have not kept up on excessive amounts of the Vit. A\nfood.\nI better get back to that,\n\nNancy\t\t\t", "date": "2013-08-27T01:41:44+00:00", "topic": "Fruits/veggies reduce risk bladder cancer 4 women", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tVery hopeful article. It is nice to know there is some headway for several cancers! Deep down I believe they are very close to unlocking the puzzle of cancers!\n\nNancy\t\t\t", "date": "2013-05-26T13:38:48+00:00", "topic": "Interesting new article", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks for posting the  both site, Pat. I found both to be very interesting. I guess it is \"human nature\" to hope that easy accessible vitamin supplements can help keep all kinds of undesirable illnesses away......even though it is almost always proven (later) that it is not the case, and the very supplements taken, can cause great harm.\n\nNancy\t\t\t", "date": "2010-09-17T13:50:15+00:00", "topic": "Intravenously administered vit.C as cancer therapy", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks Patricia, I am printing this out and taking with me on Tuesday. I sure hope I don't go through the \"prep\" for nothing. With the holiday weekend, I can't contact them ahead of time.\n\nNancy\t\t\t", "date": "2010-05-28T22:32:29+00:00", "topic": "FDA Drug recall..Propofol(Diprovan) &amp;amp; prolan", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tJack,\nThank you so much for sharing this article. It is the most comprehensive article I have read dealing with Ta/CIS and BCG. You are right when you said to print it out, I have read through the article twice and I am still finding more points I passed over the first read \n\nNancy\t\t\t", "date": "2010-02-27T22:04:48+00:00", "topic": "Management Of Non-Invasive Bladder Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tPatricia\nThis is very interesting and hopeful. Thanks for sharing.\n\nNancy\t\t\t", "date": "2010-02-09T23:29:03+00:00", "topic": "Phase III trials -Virus to kill cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tGreat.........does this mean I should eat more bread?  \n\n\n\n\nNancy\t\t\t", "date": "2010-02-05T19:28:42+00:00", "topic": "Bakers Yeast..the mice get all the good stuff", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThis is very exciting news!\n\nNix\t\t\t", "date": "2009-08-08T19:56:24+00:00", "topic": "A concise gene panel for outcome prediction", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tYou are right! Very good news! Thanks for sharing.............\n\nNix\t\t\t", "date": "2009-08-03T23:30:45+00:00", "topic": "Scientists discover bladder cancer stem cell", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tIf the stat is fact - it does blow my mind. I guess VA would be a place to start for environmental causes. Agent Orange or any other chemicals used.\nThe research would have to come from the outside - I doubt if the VA would open that can of worms.\n\nNix\t\t\t", "date": "2009-06-06T16:53:18+00:00", "topic": "Interesting..VA Health care or lack of", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tPatricia\n\nThanks for the link - very interesting. I have heard of this method for other cancers, with good results.\nIs it just me - or does Bladder Cancer seem to be at the bottom of the list for research here in the States?\n\nNix\t\t\t", "date": "2009-02-10T18:16:36+00:00", "topic": "Individualized study for non-invasive", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tJohn,\n\nI quit smoking 17 years before I had Bladder Cancer. When I was first diagnosed, 10 years ago, I found a doctor on line that I contacted, and much to my surprise, he answered many questions for me.\nIn his writings, he suggests that up to 17 years after smoking bladder cancer can be the result.\nMy brother also had bladder cancer before, he was a smoker at the time, but we also grew up in a steel town, during the 40,50,60,70,80'sLots of air and ground pollution, an city used well water at that time. No surprise there is a lot of\ncancer in that town.\nMy brother had a neo bladder 12 years ago, is 80 yrs old and doing very well.\nI caught mine very early, because of my brother, I had BCG, and I am 9 years cancer free.\nMy past caught up with me, but because I quit smoking I feel I had a chance at a cancer free recovery.\nGood luck, congrats on not smoking, I do know how hard that can be!\n\nNancy\t\t\t", "date": "2016-10-08T16:51:59+00:00", "topic": "Smoking.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCynthia , please accept my sincere sympathy.  I am so sorry for your sorrow.\n\nGod Bless,\n\nNancy\t\t\t", "date": "2014-06-26T01:24:44+00:00", "topic": "Coping", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Anniversary! Let the good times roll,\n\n\n\nNancy\t\t\t", "date": "2013-08-05T00:37:56+00:00", "topic": "Happy Anniversary Doug and Anita!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGood for you Mike! I know how hard it is, I quit over 20 years ago.\nActually, I felt better instantly (must have been the relief I quit  )\nWishing you many, many smoke free years.\n\nNancy \n\n\n\n\n", "date": "2012-08-27T01:30:59+00:00", "topic": "One year as a non-smoker", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that is a great picture and a great bladder cancer success story!!    :)Nancy\t\t\t", "date": "2013-05-06T00:20:43+00:00", "topic": "Doug was diagnosed 12 years ago..", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that isn't good news that is GREAT NEWS!\nYour positive attitude has a lot to do with the great outcome.\n\nYahoo!\n\nNancy \n\n\n\n\n", "date": "2012-10-08T18:25:15+00:00", "topic": "Life After cancer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWOW! That is great news! Straping on my dancing shoes, again.\n\n\n\nKeeping my fingers, toes and eyes crossed for you, George.\n\n\nNancy \n\n\n\n\n", "date": "2012-10-08T23:30:24+00:00", "topic": "Good Report Today", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Sara Ann,\nNo I went to the second one. I will post tomorrow\nThanks Sara Ann and Cynthia\n\nNancy\t\t\t", "date": "2012-09-13T00:58:39+00:00", "topic": "FOR NIX", "subforum": "17-chit-chat"}, {"text": "\n   \nNow that was funny!\t\t\t", "date": "2012-08-14T20:30:11+00:00", "topic": "Technology!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tso funny, thanks for the laugh \nNancy\t\t\t", "date": "2012-08-07T22:53:10+00:00", "topic": "No bladder cancer found on Mars so far..", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat Picture and Great Caption, Mike  ", "date": "2012-07-16T03:05:12+00:00", "topic": "Live like someone left the gate open!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Happy Birthday, Anita............and many, many more     \n\nNancy\t\t\t", "date": "2012-05-30T21:19:22+00:00", "topic": "Birthday alert!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWelcome, Beau - nice to have you here \n\nNancy\t\t\t", "date": "2012-02-09T21:45:28+00:00", "topic": "ABLCS Hires New Staff Member", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe do live 5 miles from the Gulf of Mexico, but we don't have the beautiful mountains you do \n\nNancy\t\t\t", "date": "2012-01-14T21:16:04+00:00", "topic": "Nice pic Sara Anne!  You too Nix (Nancy)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMike, you are sooooo tan! Do you live near a beach?\t\t\t", "date": "2012-01-14T21:16:04+00:00", "topic": "Nice pic Sara Anne!  You too Nix (Nancy)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tPatricia,\nThat is great news  I I just know it is the first of many to follow!\nSorry I am so late in seeing this, we are in Vermont with children, helping to get them ready to move to FL - only three miles from us    \n\nNancy\t\t\t", "date": "2010-06-10T20:48:29+00:00", "topic": "Living Will", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tFrom a child's mouth........thanks for posting\n\nNancy\t\t\t", "date": "2010-05-11T17:37:14+00:00", "topic": "Lauren\\'s Poem", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGirls' Night Out\n\nSome 40-year-old girlfriends discuss where they should meet for dinner.\nFinally, they agree to meet at the Ocean View Restaurant, because the\nwaiters are cute and buff.\n\n10 years later, at 50 years of age, the women once again discuss where they\nshould meet for dinner. Finally, they agree to meet at the Ocean View\nRestaurant, because the food is very good and the wine selection is\nexcellent.\n\n10 years later, at 60 years of age, the girls once again discuss where they\nshould meet for dinner. Finally, they agree to meet at the Ocean View\nRestaurant, because they can eat there in peace and quiet, and the\nrestaurant has a beautiful view of the ocean.\n\n10 years later, at 70 years of age, the women once again discuss where they\nshould meet for dinner. Finally, they agree to meet at the Ocean View\nRestaurant, because the restaurant is wheelchair accessible, and it even\nhas an elevator.\n\n10 years later, at 80 years of age, the girls once again discuss where they\nshould meet for dinner. Finally, they agree to meet at the Ocean View\nRestaurant, because they have never been there before.   ", "date": "2010-05-07T19:33:07+00:00", "topic": "thought this would bring a smile.........", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLooking back to my first dx'd, I can't believe how far I have come - from feeling \"shell shocked\" to knowing what I have learned in the past 3 1/2 years is unbelievable.  Learning what to research and how to start the journey is from this website and the wonderful people who encourage and explain.\nI have so much respect to everyone on this website.\nThank you to all \n\nNancy\t\t\t", "date": "2010-02-04T14:32:05+00:00", "topic": "Pay it Backwards", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe live in the Tampa FL area and this year we are freezing \nToday it was 55 and predicted to be cold thru the next 8 days. I know, 55 sounds good to all northern states, but here the homes are not built as well as our home was up North.\nMy son in Philly would gladly send their snow to anyone who wants it, and my son in Middlebury Vt would gladly take all the snow \nI guess we are all creatures of habit and want our weather back - be it snow or sun \n\nNancy\t\t\t", "date": "2010-02-11T02:40:22+00:00", "topic": "snow,  Snow and more Snowwww  !!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tVi,\nI was a Preschool Teacher for 20 years, and I always had such a fun time with my students \nKids are so literal, I am happy you had  a smile from this.\nI'll bet you are a great teacher \n\nNancy\t\t\t", "date": "2010-02-03T00:07:35+00:00", "topic": "Remembering a great icon .........", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tPlease join me in remembering a great icon of the entertainment community.\n\nThe Pillsbury Doughboy died yesterday of a yeast infection and trauma\n\ncomplications from repeated pokes in the belly.  He was 71.\n\nDoughboy was buried in a lightly greased coffin. Dozens of celebrities\n\nturned out to pay their respects, including Mrs. Butterworth, Hungry Jack,\n\nthe California Raisins, Betty Crocker, the Hostess Twinkies, and Captain\n\nCrunch.  The grave site was piled high with flours.\n\n\n\n\nAunt Jemima delivered the eulogy and lovingly described Doughboy as a man who\n\nnever knew how much he was kneaded.  Doughboy rose quickly in show\n\nbusiness, but his later life was filled with turnovers. He was not considered\n\na very smart cookie, wasting much of his dough on half-baked schemes.\n\nDespite being a little flaky at times, he still was a crusty old man\n\nand was considered a positive roll model for millions.\n\n\n\n\nDoughboy is survived by his wife Play Dough, three children: John Dough, Jane\n\nDough and Dosey Dough, plus they had one in the oven.  He is also\n\nsurvived by his elderly father, Pop Tart.\n\n\n\n\nThe funeral was held at 350 for about 20 minutes.  If this made you\n\nsmile for even a brief second, please rise to the occasion and take time to\n\npass it on and share that smile with someone else who may be having a crumby\n\nday and kneads a lift.\t\t\t", "date": "2010-02-03T00:07:35+00:00", "topic": "Remembering a great icon .........", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLooking at the positive side - everything is new again - can watch re-runs, read the same books etc \n\nNix\t\t\t", "date": "2010-01-27T20:23:46+00:00", "topic": "The Reunion", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLoved this, thanks for the smile \nGuess I know what to look forward to, then again, I will probably forget \n\nNix\t\t\t", "date": "2010-01-27T20:23:46+00:00", "topic": "The Reunion", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat News\t\t\t", "date": "2009-12-03T01:17:03+00:00", "topic": "A little good news today", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks to everyone who helps on the site, this is a God-send for all of us \n\nNix\t\t\t", "date": "2009-09-14T01:44:43+00:00", "topic": "The NEW LOOK", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for sharing such an inspirational true life story.\n\n\n\n\n\n\nNix\t\t\t", "date": "2009-07-20T08:08:55+00:00", "topic": "Some inspiration and perspiration!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLoved this, Pat\n\nNix\t\t\t", "date": "2009-04-27T03:12:08+00:00", "topic": "Girlie Wisdom", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWelcome Home! That would be one great vacation! Wouldn't be nice if just our Uro's had one of those toilets? Almost fun to do a urine sample:)\nIt would certainly help out after BCG and all the urgency runs, too!\n\nNix\t\t\t", "date": "2009-05-18T15:22:56+00:00", "topic": "I\\'m back!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHey, it must be 5:00 somewhere!\t\t\t", "date": "2009-05-17T18:03:09+00:00", "topic": "Women\\'s Health Issue", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI will be happy the try this \"trial\" at home as soon as I get the blender out:)\n\nNix\t\t\t", "date": "2009-05-17T18:03:09+00:00", "topic": "Women\\'s Health Issue", "subforum": "17-chit-chat"}]}