{"signature": ["TURBT", "Dx", "TURBT", "BCG", "Dx", "BCG"], "posts": [{"text": "\n\t\t\t\tGeorge,  have you been watching that 40's movie channel again.  invoking Bogey and Bacall, whistling, and zyphers in rapid succession are tell tale signs!  But, as Patricia would say - \"You need to get a second opinion\" just to be sure that permanent reversion to the \"good ole days\" isn't lurking around the corner. \nJim\n\np.s.  My preference runs to the old war moview: bad guys, good guys, pretty girls and a real story line!\t\t\t", "date": "2010-09-11T16:26:25+00:00", "topic": "Support Groups", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThere is already a \"class act\" working very diligently to make Little c's life as miserable as possible - The American Bladder Cancer Society and all of its wonderfully caring and knowledgeable people!\t\t\t", "date": "2010-10-18T22:09:15+00:00", "topic": "NOTICE OF EVICTION FOR \\&amp;quot;LITTLE c\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNO KIDDING - I CAN'T WAIT TO SEE THE RESTITUTION ORDER!!!\n\nJIM\t\t\t", "date": "2010-10-18T22:09:15+00:00", "topic": "NOTICE OF EVICTION FOR \\&amp;quot;LITTLE c\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAshish,\n\nMy Uro has prescribed Oxybutynin (generic Detrol LA) for me.  I take the timed release version in 10 mg dosage.  I was originally taking it one time per day until just recently.  I just finished my second round of six instillations.  after the third session, I began to have the symptoms that you are describing.  My Uro suggested that I take the Oxy twice per day (every 12 hours).  It made a great deal of difference - I went from the 10 - 15 minute sprints to actually sleeping between 2 -3 hours at a time.  The other pill is the Pryidim (sp?) that turns the urine orange.  It is supposed to help with the pain.  My problem with that one is that being a HUGE Oklahoma Sooner fan, and orange being one of the colors used by our agricultural school (Oklahoma State University) I can't determine if it really works because it is so painful to even look at the color orange!\nI hope the information and the attempt at a little humor help.\n\nJim\t\t\t", "date": "2010-08-26T09:26:50+00:00", "topic": "frequency of urination after BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't think I could have vented any better if I had done it myself.  I take advantage of the opportunities to mostly lurk in the background and read posts from everyone.  A couple of things have come to mind while doing this:  first, I now realize that I am not the first to be suffering the indignities and pain of this insidious parasite; second, I can keep up a good face for my family and others and still have the understanding, space, impathy, and out and out tolerance from the kind souls I have met here that actually have the capacity and the ability to really understand the frustration and sometimes the absolute need to scream as loud and the type-set will permit.\n\nI am in the process of finishing the second round of six bcg's (number 5 is this Friday) and I agree with you that examining the bottom of a comode or urinal each and every time I go is not exactly what I had in mind for my \"golden years\" (come to think of it, I'm not sure what, exactly, I did have in mind for those years - or for that matter if I am even in those years yet - I think the scale has slid to the right while I wasn't looking - but I digress).  I also agree that waiting to see what little chunks of me get passed through my body after being subjected to a procedure that no one can explain why it works or exactly what strength or duration of exposure is sufficient is maddening.  I keep thinking that at some point, the whole damn bladder is going to come shooting out the end of my penis!\n\nThere is nothing even remotely pleasant about any of this and yet, I justify enduring all of it because it means an opportunity to survive and cheat cancer of its prize.  When I think about the number of times I have been subjected to the pain of bcg, I need only look at the number of times some of you have endured and it makes me more resolved than ever that I too can tough it through (I do believe that if anyone going through what we all are enduring was not a \"type - A\" personality when diagnoised, you most certainly are now) just to prove I can do it if for no other reason.\n\nI started this diatribe as a short note to empathize with you, it appears that I had some venting to do myself, thanks for listening.\nJim\t\t\t", "date": "2010-08-12T18:32:12+00:00", "topic": "Just plain sick of it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats Nix,\n\nThat is wonderful news.  I can't wait until I can make a similar announcement.\n\nJim\t\t\t", "date": "2010-08-07T22:40:58+00:00", "topic": "More Cysto News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n Here we go again!  I started my second round of six instillations last Friday.  My Uro said that even though I got an \"all clear\" she wants to make absolutely sure that nothing is hanging around if at all possible.  While I appreciate her \"scorched earth\" policy, I think I am the one getting scorched  I can now personally verify that BCG symptoms are somewhat cummulative  \n\nOh well, a little burning, bleeding (clotting), frequency, urgency, fatigue, and all around just feeling lousey are small prices to pay in exchange for giving cancer a swift kick in the pants!  \n\nOne down and five to go!\n\nJim\t\t\t", "date": "2010-07-13T21:14:57+00:00", "topic": "\\&amp;quot;NO RECURRENT CANCER\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy heartfelt thanks to each and every one you.  I am actually enjoying peaceful, restful sleep for the first time this year.  My mother had been hospitalized since the first of January and passed away in mid-January, then noticed blood in urine in mid-February, diagnoised at the beginning of March - and holding my breath ever since.  Again, thank you all for your thoughts, encouragement and advice.\n\nHave a wonderful weekend,\n\nJim\t\t\t", "date": "2010-07-13T21:14:57+00:00", "topic": "\\&amp;quot;NO RECURRENT CANCER\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations Ann, good news is always a boost for everyone.\nJim\t\t\t", "date": "2010-07-12T18:37:45+00:00", "topic": "All clear (2 years now)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\nThanks for all the information, now I have even more questions....\nDo I have to contact the pathologist that has examined the biopsies from my first two cystos, or will my uro take care of that?  What about all of the other lab work?  I haven't had a complete physical in about five years.  Should I get a complete examination prior to requesting a second opinion? Or is it better to let the second opinion folks do their own if they deem it necessary?  What other preparations, if any, should I be taking care of before the scheduled appointment?  How many days should I be planning to be off to get this done?\n\nI have had a couple of operations in the last year and a half: in July of 2008, a very large hernia repair in my groin area, and a TURP in August of 2009.  I can get all of the medical records from those two events if they would be necessary. Am I making this more difficult than necessary?\n\nIf anyone else has comments or opinions, please feel free to join right in, I only addressed this to Pat because we have been conversing since my first post (well mostly Pat, Mike and Sarah).  But, the more viewpoints, the better.\n\nThanks,\nJim\n\nJim\t\t\t", "date": "2010-06-11T16:19:25+00:00", "topic": "BCG sessions and other fun things to do in your spare time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLori,  This came from Urotoday.com\n\nwww.urotoday.com/images/british/bju1_2010_07.swf\n\nIt discusses situations after BCG failures where RC is either not an option or maybe not the option you are looking for.\n\nI hope it is usefull,\nJim\t\t\t", "date": "2010-06-29T22:26:02+00:00", "topic": "CIS - need your opinions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI found this article on guidelines to be very informative.  For those of you that are way ahead of me on the guideline learning curve, are there any significant differences between these and the guidelines used on this side of the pond?\n\nwww.uroweb.org/?id=218&gid=1\n\nOnward, through the fog!\n\nJim\t\t\t", "date": "2010-06-29T15:25:01+00:00", "topic": "Guidelines on TaT1 (Non-muscle invasive) BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis looked interesting:\n\nwww.urotoday.com/index.php?option=com_content&task=view_ua&id=2231632\n\nPart of the Article:\n\nOur pre-surgical study allowed for immunological studies to be conducted on both tumor tissues and blood samples. We initially reported an increased frequency of T cells expressing the inducible costimulator (ICOS) molecule in patients treated with anti-CTLA-4.(1, 8) An increased frequency of ICOS-expressing T cells has also recently been reported in breast cancer patients treated with another anti-CTLA-4 antibody known as Tremelimumab.(9) We demonstrated that ICOS-expressing T cells are effector cells that are capable of recognizing tumor antigens and producing IFN-g.(1, 8, 10) We also correlated an increase in ICOS-expressing CD4 T cells (CD4+ICOShi) with survival benefit in a small group of patients with metastatic melanoma who received treatment with anti-CTLA-4.(1) Taken together, these data implicate ICOS-expressing T cells as a possible biomarker of clinical benefit that can be monitored in patients receiving anti-CTLA-4 therapy.\n\nIn summary, our pre-surgical study with anti-CTLA-4 led to encouraging data regarding ICOS-expressing T cells as a novel biomarker that could be monitored for potential correlation with clinical benefit and use of anti-CTLA-4 as a possible new treatment strategy for patients with bladder cancer. These ideas should be explored in future studies\n\n\nJim\t\t\t", "date": "2010-09-17T14:10:35+00:00", "topic": "Pre-surgical Study With Encouraging Results", "subforum": "31-articles-of-interest"}]}