{"signature": ["Dx", "TURBT", "TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tLarry (and FYI my name is Rich - i.e. Richard) - good question.  I don't recall any groin or leg pain before the TURBT but I did have it afterwards; my urologist said that was just a consequence of the procedure since the musculature is pretty \"tightly connected\" down there.  What I recall before the TURBT (and even before the diagnosis of cancer - before the CT scan found it) was a feeling of fatigue and listlessness, which the doctor also told me was not uncommon when you have a tumor growing inside of you.  Sorry I can't shed any more light on that subject!\t\t\t", "date": "2015-10-14T07:28:10+00:00", "topic": "Now yet diagnosed. Have 6 cm tumor. TURB  10/30", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSorry that I did not notice the date of the TURBT in your title line - 10/30, so 16 days from now.  For what it is worth, my tumor was found by imaging 8/14 and I had my initial TURBT 8/21, a week later.  May I ask, which VA medical center is doing the surgery, and how experienced are they (and your urologist) in doing them?  The key is always to get an experienced, knowledgeable urologist and facility, that has done many of these procedures not just a few.  Your tumor size is relatively large so that argues even more for a very experienced doctor and facility.\t\t\t", "date": "2015-10-14T07:28:10+00:00", "topic": "Now yet diagnosed. Have 6 cm tumor. TURB  10/30", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tVery sorry to hear about your condition, but you are in the right place, the key now is to get the transurethral resection (TURBT) done as soon as possible so that the tumor is removed and can be evaluated (low or high grade), and the staging of the tumor can be evaluated (superficial or invasive and if so, to what degree).  I am a veteran too so I know the VA can be difficult to deal with at times; honestly, the sooner the better to get that surgery (the TURBT) done.  You will be anesthesized so will be fully \"out.\"  I have gone through two of these in the past two months so (sadly!) am a \"veteran\" of this too, just like almost everyone else on this forum.  Take a look at my posts on this subject (I started a thread under \"newly diagnosed\"), it recounts my experience in some detail, hopefully that will be useful to you.  And as always, ask questions, we are here for you.\t\t\t", "date": "2015-10-14T07:28:10+00:00", "topic": "Now yet diagnosed. Have 6 cm tumor. TURB  10/30", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news and very happy it turned out so well for you!!\t\t\t", "date": "2015-10-09T12:40:12+00:00", "topic": "Not yet diagnosed but have questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTodd - yes and you definitely should do what the urologist said - get a CT scan and if necessary, a cystoscopic exam.  Don't read too much in to this until those are done, they will tell the story.  But get them done as soon as possible.  Let us know the results.  Hopefully will just be benign bleeding, that does happen.  Good luck to you, we are pulling for you.\t\t\t", "date": "2015-10-09T12:40:12+00:00", "topic": "Not yet diagnosed but have questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood question; it all boils down to the doctor himself or herself.  When I reviewed the bios of the docs, the ones in NYC seemed to have a bit more experience and involvement in oncology research, but that is just my subjective reading.  And as for procedures themselves, no question the ones in NYC do more than in NJ - higher density of patients for one thing.  When I went in to Sloan Kettering in NYC, there were more people in the waiting room than I ever remember at my urologist in NJ - by a large factor even on a per doc basis - virtually an assembly line lol.  Again, I say this not to disparage the NJ docs - I like them a lot and for \"routine\" care I use them and am happy with them.  But if I had a complex situation like cystectomy, then I would definitely use Sloan Kettering in NYC.\n\nMy two cents worth!\t\t\t", "date": "2015-10-07T06:49:46+00:00", "topic": "urethral stricture preventing BCG treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGiven that your situation is potentially complex, if you can conveniently get to Sloan Kettering, then yes I would use them, although I have to say that the care I have received at Robert Wood Johnson has been superb. FYI from Raritan using the Raritan Valley line, they have a direct train from Raritan to NY Penn Station in the mid mornings and late afternoons (no transfer at Newark Penn Station needed); about 75 minutes.  Then subway or Uber to Sloan Kettering ($20 one way uber ride).  Needless to say - good luck to you!!\t\t\t", "date": "2015-10-07T06:49:46+00:00", "topic": "urethral stricture preventing BCG treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGiven that your situation is potentially complex, if you can conveniently get to Sloan Kettering, then yes I would use them, although I have to say that the care I have received at Robert Wood Johnson has been superb. FYI from Raritan using the Raritan Valley line, they have a direct train from Raritan to NY Penn Station in the mid mornings and late afternoons (no transfer at Newark Penn Station needed); about 75 minutes.  Then subway or Uber to Sloan Kettering ($20 one way uber ride).  Needless to say - good luck to you!!\t\t\t", "date": "2015-10-07T06:49:46+00:00", "topic": "urethral stricture preventing BCG treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJim - one other thought out of the blue - if you are taking Plavix (owing to coronary artery disease and stenting) or any other blood thinner, that can also promote spontaneous bleeding.  Just FYI.  I have been on Plavix since 2006, and when I first showed blood in urine, the urologist thought that might be the cause, but of course the CT urogram showed otherwise.\t\t\t", "date": "2015-09-24T16:41:01+00:00", "topic": "Cystology and FISH before Cystoscopy?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tUnderstood and obviously hope that (benign situation) is your outcome as well; I was more pessimistic about my situation (as was the urologist) since the radiologist gave 90/10 odds it was malignant just based on the nature of the CT results.  And she was (unfortunately) correct in her judgment.  When one is pessimistic, one is rarely disappointed lol!  Comes with being an engineer....\t\t\t", "date": "2015-10-06T23:13:17+00:00", "topic": "On The Brink", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOne final point I forgot to make in my earlier e-mail: my tumor was also discovered on a CT urogram.  The urologist scheduled a cystoscopy AND if needed a TURBT at the same time - so, he went in with a cystoscope, saw it was a tumor, and immediately went in with the larger device to perform the TURBT.  So it was not cystoscopy one day, TURBT at a later date - it was all at once.  An I was anesthesized for the entire process (propofol).  FYI.  Again, good luck!!\t\t\t", "date": "2015-10-06T23:13:17+00:00", "topic": "On The Brink", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThose are excellent questions and he should definitely ask his urologist about that; I start BCG next week and what my urologist told me (because I had very similar questions) is this (but again - it may not apply to your father so he should ask his urologist):\n\n1.  Obviously try to urinate only into the toilet or a urinal; and then put two cups of bleach into the toilet for 15 minutes before flushing (and put some in the urinal as well - 1/2 cup suffices).\n2.  Wear white clothing so that if there is some \"seepage\" onto the clothing (underwear, whatever), it can be washed with bleach; whoever does the washing needs to use gloves to avoid contamination.\n\nI did not ask about Depends so I don't know what the proper protocol would be for decontaminating them.\n\nCertainly wish your father the best, I hope everything works out for him (and you)!\t\t\t", "date": "2015-10-06T20:21:01+00:00", "topic": "BCG and Incontinence", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYour schedule of events is almost identical to mine - what a coincidence!  (First TURBT 8/21, second 9/25, similar diagnoses).  I start BCG next week.  I defer to others who have already gone through it, but my urologist said that as long as you take precautions, it should not pose a serious risk to your family.  Specifically: (a) designate one bathroom for you to use and no one else; (b) put chlorine in the toilet after you urinate, let it sit 15 minutes, then flush (2 cups of chlorine bleach per flush); (c) wash hands thoroughly (I also plan to use iso alcohol on them in addition to wash).  Only have to do that for the first 24 hours; after that all of the pathogens have been \"peed out\" (drink plenty of fluids to ensure that).  As for immunizations, ask your doctor but I can tell you that my wife does not intend to get one - for what it is worth.  Good luck to you - actually to both of us lol!!\t\t\t", "date": "2015-10-05T02:31:05+00:00", "topic": "BCG Treatment and Family + clinical trials", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI strongly second Sara Anne's advice.  I got a second opinion on my cancer from Sloan Kettering and it actually differed from the original pathology report - in a good direction - but when I asked my urologist about this, he told me that pathology is often as much an art as a science.  So I would encourage a second opinion on any pathology data.  To make that happens does require the slides be provided to the second pathologist, which can be a bit of a logistics effort but it is well worth it.\n\nNeedless to say - best wishes to you and your husband on this!!\t\t\t", "date": "2015-09-30T21:01:15+00:00", "topic": "Please help with this diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCraig - let me just add that I was diagnosed with transcell carcinoma six weeks ago and after two transurethral resections, the tumor was removed with no evidence of any residual cancer; I start BCG in the next week or two myself.  I am 64 so I know exactly how you felt - when first told I had a mass in my bladder, my reaction was \"of all the organs that would do me in, my bladder was last on the list, behind my heart, stomach, liver....\"\n\nBut the good news, as Sara Anne indicated, is that bladder cancer is indeed eminently treatable, you just have to stay on top of it.  It is more like a chronic condition that with proper treatment is very unlikely to kill you.\n\nNeedless to say, I wish you the best of luck.  Of course, if are only a few doses left of BCG owing to a shortage, I may have to arm wrestle you for them....but hmmmm, you would win that hands down, so I better start pumping iron NOW just to be ready lol!!\t\t\t", "date": "2015-09-30T17:33:29+00:00", "topic": "CIS Diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWilliam - very sorry to hear of your tumor; you are going through exactly what happened to me six weeks ago - blood in urine, CT scan revealed mass, then TURBT exactly four weeks ago.  And no appetite owing to the apprehension.  My only recommendation to you is NOT to wait four weeks for the TURBT.  When my urologist told me about the CT scan results, he said he wanted to operate on me the following week but could not owing to other surgeries - would have to wait two weeks.  I went to see a second urologist and he said he could do it in two days - so, after some due diligence on him (younger but very good, excellent med school and reputation), I went with him.  Thus only one week elapsed between CT scan diagnosis and the TURBT, and even during that week I worried about the cancer spreading (which it did not).  So I would encourage you to see if there is any way to get it done sooner - for your own peace of mind if nothing else.  Needless to say - best of luck to you - hope everything comes out well!!\t\t\t", "date": "2015-09-15T21:01:02+00:00", "topic": "I'm worried and been diagnosed to have BT", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNeedless to say I defer to your doctors, but my understanding from my discussions with the docs I am seeing is that to be detectable by cytology, there has to be cells shed into the urine, and CIS may or may not shed cells, hence normal cytology results do not necessarily mean there is no CIS.  But again, I defer to your docs or to others on the forum who are more knowledgeable than I.  Good luck to you - hope all turns out well for you!\t\t\t", "date": "2015-09-18T04:26:58+00:00", "topic": "sensitivity of urine cytology  to bladder CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI recently asked a very similar question of my urologist and separately a pathologist at Sloan Kettering because I wanted to know what predictive value urine cytology has - e.g., could I avoid a cystoscopy?  From what they told me, cytology can be useful if there are cancer cells in the urine itself, but often times the urine contains what are just called \"atypical\" cells which means cells with unusual nuclei (\"hyperchromatic\") which could be precancerous or just normal for you.  And if the urine contains nothing abnormal that does not mean there is no tumor or growth - just means whatever is there may not be shedding evidence into the urine.  Doing a one-time cytology study thus may not tell you much; doing the same study over time does allow changes to be detected and that is more useful.  But bottom line is that cytology is almost always done in conjunction with other techniques to help refine the diagnosis.\n\nAll that having been said - please understand that is my interpretation of what the doctors told me; not being a doctor myself, of course I encourage you to talk to your doctors who are the experts in your specific situation.  Good luck to you!\t\t\t", "date": "2015-09-18T04:26:58+00:00", "topic": "sensitivity of urine cytology  to bladder CIS", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am also sorry about your reaction to mitomycin, I had it instilled in me four weeks ago after my TURBT, and I too have developed cystitis as a result, but despite that, it is standard protocol for cancer surgery in the bladder and I am glad the urologist did it to protect against residual cancer cells.  I would do it again even with the post-operative discomfort.  Some people do have very adverse reactions; that is true with any drug.  But if a drug creates a very adverse reaction in some people, does that mean the drug should be unavailable to everyone?  By all means make the regulators aware of the problems you have suffered, but you will find many people (including me) who do not agree a ban on this drug, the medical research is very clear that it saves lives.\t\t\t", "date": "2015-09-17T00:55:23+00:00", "topic": "adverse reactions to one time mitomycin c", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHeartfelt congratulations Bama, that is wonderful news, may it continue indefinitely into the future!\t\t\t", "date": "2015-08-31T17:16:44+00:00", "topic": "Great news", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSorry for the late response, but let me just add that I have had multiple lung nodules over my life (still have them), and as Cynthia said, the probability that they were cancer is pretty low.  Of course that probability depends upon several factors - e.g., smoking, asbestos exposure, etc.  But bottom line is that it is not cancer until the doctor tells you it is cancer.  Pursue the matter expeditiously to get an authoritative answer to that.  And - best wishes to you and your husband, I hope and pray it is benign.\t\t\t", "date": "2015-09-22T00:34:53+00:00", "topic": "now a lung nodule", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tExcellent news indeed, congratulations and may such news continue going forward!!  As to the probability of recurrence, when I spoke to the specialist at Sloan Kettering, I asked whether there was any way to genotype high grade tumor cells to better establish \"the worst of the worst\" so to speak and thus better identify probability of recurrence.  Answer I got was \"not at the moment,\" not enough data yet.  Apparently the average recurrence rate at five years varies from 30% to 50% assuming you go through BCG immunotherapy; somewhat higher if just mitomycin-C therapy.  The size of the tumor at first diagnosis apparently is one of the factors in predicting recurrence - the larger it is, the higher the probability.  Anyway - just passing that on to you.  I am in the same boat - having my second TURBT in three days (first one 4 1/2 weeks ago, T0 or T1 high grade (two pathologists graded it differently as T0 or T1 lol) for the same reason as you cited - to confirm it is all gone (fingers crossed!).  Learning more about bladder function than I ever wanted to know lolololol.....\t\t\t", "date": "2015-09-22T14:53:44+00:00", "topic": "My story may help others", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnthony - thanks you and indeed I had not thought about that possibility; the \"retail\" price of anesthesia is indeed probably high but I get the \"wholesale\" price (if the insurance does not cover it) so that is manageable.  It is probably a \"phobia\" as psychologists would describe it but I personally think it is more of a post-traumatic stress syndrome since the trauma I went through when I was nine years old is almost as vivid today as it was then - and that was 55 years ago.  Some things one just does not forget.  Anyway - you have a beautiful country, have been there several times on business, to Sydney and Canberra, never Brisbane but perhaps some time in the future.  Thanks again and very best to you!\t\t\t", "date": "2015-08-15T17:28:48+00:00", "topic": "Advice to newly diagnosed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnthony - thank you so much; indeed I take your point, but I am a victim of psychological distress from an early age; when I was nine years old, I had blood in my urine which turned out to be benign, but I had a cystoscopy which to be frank, left me in such pain and discomfort for almost two months that I never fully recovered psychologically.  There are three parts of my body which I just have trouble with the doctors manipulating - the eyes are two of them, and you now know the third lol.  Colon exam?  No problem.  Heart catheterization and stenting?  No problem - four of those already inserted.  But the urethra?  Gah....  So I have spoken to my urologist and he will indeed put me under for each of the BCG treatments.  I expect to have some interesting arguments with the insurance companies over this, but ultimately if they refuse to pay, I will pay out of pocket, it is that important to me.\n\nI also discovered from the procedures I have been through that I appear to have some BPH because Flomax and Alfuzosin definitely make it easier to urinate, so that condition may also be contributing.  Oh well, yet another lesson learned.\n\nAnyway - thank you again for your input, I do genuinely appreciate it!\t\t\t", "date": "2015-08-15T17:28:48+00:00", "topic": "Advice to newly diagnosed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLoljole - for what it is worth, I was just diagnosed ten days ago and had my TURBT last Friday (21st), what Sara Anne said about the normal course of treatment is 100% aligned with what my urologist told me.  I am waiting for the pathology report to see what I need next but I too would want to know the nature of any growth before deciding on further action.\t\t\t", "date": "2015-08-25T11:24:24+00:00", "topic": "in office fulgeration", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy bet would be the ureters and possibly from there, into the kidneys.  The only \"up\" from the bladder is into the kidneys which feed urine into the bladder.  So perhaps the doctor wants to investigate what is going on either with the kidneys or the ureters themselves, to see if there is any evidence of infection.  (Each kidney has a ureter that drains into the bladder; not to be confused with the urethra which is what drains the bladder through the prostate to the penis to the outside.)\n\nHope your father feels better; tell him \"Ich wuensche Ihnen Gesundheit!\" (\"I wish you good health!\").\t\t\t", "date": "2015-10-10T14:30:17+00:00", "topic": "Can someone please explain what this means?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRD - it sounds like indeed you have thought about this very deeply - wish I could add something substantive.  Are there any goals that your husband may have - e.g., looking forward to another grandchild, seeing everyone over the holidays, etc. - that might motivate him to \"get prepared\" for those events?  I know that is very easy to say and very hard to do, it has to \"come from within.\"  Perhaps set up a LCD TV by the pool so he can watch a movie while he swims?  I know that sounds a bit weird!  Again - sorry I don't have any other ideas on this, I know that if I were unable to walk, I would have a hard time finding an exercise regimen that would allow me to use my arms on my laptop while exercising the rest of my body - argh.  Needless to say, I wish you and him well - you will be in my prayers!\t\t\t", "date": "2015-10-10T21:50:24+00:00", "topic": "Fatigue or depression?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tIt was my pleasure Sylvia.  You are correct that BCG is normally for high grade Ta and T1 staged bladder cancer, but it can be used for T2 as well although with T2, my urologist told me that cystectomy is more likely to be recommended.  But it also depends upon whether the cancer is single focus (i.e. one place only) or multi-focal (many places - indicating that the entire bladder is a ticking time bomb).\n\nAgain, good luck to you and I will indeed report my experience next week.\t\t\t", "date": "2015-10-06T17:50:44+00:00", "topic": "size of tumor", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tConcur with Sara Anne and then some.  Has been three weeks since my TURBT and still have considerable discomfort starting urination (up to 30 seconds of bladder pain - and have to \"push\" to get the stream started, once it starts it flows well so I know there is no blockage per se), less so during urination.  Urologist told me most likely it is cystitis induced by the use of mitomycin-C which was put into the bladder after the TURBT to kill any residual cancer cells.  Regardless, I know that it is not pleasant going through the pain every time you urinate.  Hopefully your condition has resolved by now (let us know if it has - that would be a good sign!).  I have searched for meds to help reduce the pain but other than pyridium (which is not usable consistently - can damage the liver) not much to find.  Over the counter analgesics do not help.  Tried marshmallow root tea as homeopathic, appears to help some people but did not help me.  I have another TURBT in two weeks so I am sure things will get worse before they get better lol...\t\t\t", "date": "2015-08-07T20:27:39+00:00", "topic": "Time for bladder to heal after TURBT.", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCarla - needless to say, very best wishes to you and your husband.  As others have commented, seeing nodules in a lung is not unusual; having them appear suddenly requires investigation as your husband is doing, but may I ask, is it possible that the resolution of previous scans was not as high as in this latest scan (i.e., the nodules were there, just not previously seen)?  A few years ago, I went from a standard chest Xray to a 32 slice CT scan (for other reasons) and the latter showed 5mm lung lesions (\"nodules\") that the former did not.  Also, if the latest scan is very high resolution, sometimes the radiologist can tell whether the edges of the nodules are irregular which is more suggestive of a malignancy.\n\nSincerely hope it all turns out well for you and your husband.\t\t\t", "date": "2015-08-06T20:59:51+00:00", "topic": "I am terrified", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCertainly hope everything comes out well for your mother.  Your questions are good ones, they should be posed to her doctor(s) who are in the best position to give medical advice and diagnosis.  If she can feel a lump in her breast, definitely she needs to tell that to a doctor as soon as possible.  I had all of those questions myself - e.g., how quickly can bladder cancer spread (metastasis) - and my docs told me that that is very rare if the cancer is stage T0 or T1, usually has to be T3 (i.e. into the lymph nodes or fatty tissue under the muscle layer).  Normally you get followup imaging after a TURBT (in my case a chest XRay to see if there is any spread to the lungs (they are one of the most common sites if there is a metastasis)).\n\nAgain, hope your mother is o.k., but strongly recommend she seek guidance from her doctors on this matter, and quickly.\t\t\t", "date": "2015-09-19T01:31:15+00:00", "topic": "My beloved Mother....", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome back Sara, but I couldn't tell whether the \"ate a lot too\" referred to the reindeer or other food lol!  Hopefully Rudolph will still be around for Christmas this season lololol!!\t\t\t", "date": "2015-10-03T17:29:48+00:00", "topic": "Back Home Again!!", "subforum": "17-chit-chat"}]}