{"signature": ["TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tI, too, had a small bladder growth--found on cystoscopy after I'd experienced bleeding and had a scan that showed \"something.\" As others have said, these kinds of tumors are not normal in the bladder and do need to be removed and biopsied. You can see from my signature information what happened with me. I just had annual check-up and remain all clear. You may be more familiar with colon polyps, which are quite common and most often benign.  Bladder papillomas are another thing altogether.\t\t\t", "date": "2018-03-04T21:58:07+00:00", "topic": "papilloma in bladder-Isn'tthat normal- Why remove", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWonderful news! From my experience, getting used to annual check-ups isn't at all difficult. Due to the type of bladder cancer I had, I only had one initial CT scan prior to my first diagnostic cysto, and have never been recommended to get any since that time.\n\nWe are glad you have joined us in the annual check up club.\n\nAnn\t\t\t", "date": "2014-11-07T16:43:41+00:00", "topic": "Clear Annual Check", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOnce you have more information from the biopsy of your tumors, you will have a better idea of what's happening and where to go from here. There will be three pieces of information you'll need to know and should be given: (1) type of tumor e.g., transitional cell (the most common type) and its form, e.g., papillary (sticking out from the bladder wall, like a little mushroom); CIS (carcinoma in situ, flat on the bladder wall). (2) Grade: how abnormal the cells look-low grade are close to normal cells, high grade are very \"deranged\" and abnormal looking. (3) Stage: how far the cancer has penetrated the bladder wall. You should also find out how large the tumors were, as that can also influence treatment recommendations. There is a lot of information on this site that explains all this in more detail.\n\nThe procedure for removing tumors is called a TURB or TURBT, and involves excising the tumor from the bladder wall. I'm not quite sure why the term \"scrape\" is used, which makes it sound something like shaving, which it really isn't. The Dr. will often excise an area surrounding the tumor, and will try to go deeper than he thinks the tumor has progressed. Getting good \"margins\" both allows for better diagnosis, and also makes it a bit more certain that the Dr. has gotten out everything he/she can. It is common (and often advised) that a second TURB be done some weeks later, to make sure everything was removed, either by the same Dr. or another one if you are seeking a second opinion.\n\nAs to the \"chemo\" the Dr. was going to instill in your bladder, it was not the type of chemo given in other cancer treatments, but most likely something like mitomycin which is often given to stimulate the bladder's immune response. It's not the end of the world you weren't able to get it, but the reason sounds a little odd to me. I can't quite imagine a urologist excising a tumor to the depth that it would potentially compromise the bladder wall and cause leaking of the mitomycin.\n\nI'm not sure how your urologist would know you've had this bladder cancer for a long time. Maybe you should ask him when you go for your follow-up appointment. Xrays would not show bladder cancer; if the tumors are flat (CIS) and they aren't looking closely for them, I'm not sure they would show up on MRI either, but I'm no expert. I presume some of these xrays and MRIs were done in connection with the kidney stones. I had a papillary tumor which was suggestive in an ultrasound exam; followed up with a CT scan which revealed it more clearly; and confirmed by cystoscopic exam. Cystoscopy is really the best way to diagnose bladder cancer. Tests of urine for abnormal cells is also sometimes done, but is less accurate than direct visual examination.\n\nPlease come back here after you've learned more. There is a lot of information on the site, and people here who can help with your questions. Even if you just want to \"vent\" or worry, folks will lend a sympathetic ear since so many of us have gone through what you are going through.\n\nAnn\t\t\t", "date": "2014-09-13T15:50:55+00:00", "topic": "Newly diagnosed and new to the forum.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongratulations! Here's hoping your October check-up goes well. Are you going to get maintenance BCG treatments? I know there are slightly different schedules for that, but research strongly suggests that at least some kind of maintenance treatment is helpful for a period of time after receiving the initial 6 instillations. One protocol (the one I was on) had maintenance of 3 weekly treatments at varying time intervals (every 3 months the first year; every 6 months after that, etc.). It is usually a lot easier when you don't have to have treatments 6 weeks in a row, let me tell you!\n\nAnn\t\t\t", "date": "2014-09-13T15:54:13+00:00", "topic": "5th and 6th treatment done!!!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tVery moving and heartfelt words about your father. It's just so sad when someone has to go through so much, and you as a loved one feel so helpless in the face of it all. My husband and I were with both my mother and with his mother when they passed away, and it was a much more peaceful and less frightening experience than we would have thought. It's good you were all able to be with your father in his last days, and I'm sure he was aware of your presence even when he was unable to respond. When my mother was dying, the wonderful CNA who was with us in the room told us to keep talking to my mother, that hearing is the last sense to go and that people who appeared to be unconscious could very likely hear,understand, and be comforted. May you and your family find peace and comfort down the road.\n\nAnn\t\t\t", "date": "2014-09-04T02:42:03+00:00", "topic": "Sad News - my dad has lost his battle with BC", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHope by now you've had treatment #5. I do think that for some people that first bunch of 6 treatments is the worst because your poor bladder doesn't get a break. Are you doing the protocol where you go back at 3 month intervals and get maintenance treatments for 3-week stretches? That can be a lot easier. As others have said, drink lots of water, starting about 1/2 hour before the time is up for holding in the BCG. That dilutes it and also gets it out of your system faster.  Best of luck!\n\nAnn\t\t\t", "date": "2014-08-23T02:59:07+00:00", "topic": "4th BCG treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIn pathology reports you'll also see terms such as \"papillary\" or \"papilloma.\" That refers to the appearance of the tumor as a protrusion from the bladder wall, sometimes looking like a mushroom or even a little cauliflower. This is the most common type.\n\nAnn\t\t\t", "date": "2014-07-30T12:55:37+00:00", "topic": "Just curios if this could mean more..", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI used to have a lot of pain even following cystoscopy, and did successfully complete a full round of BCG. Besides taking some pain medicine and an antispasmodic before procedures, I found that sitting in a hot bath immediately after getting back from the Dr.'s office was a big help. I also had a reduction in the BCG dose to 1/3rd, which was done after I had a pretty high fever after one of the treatments.\n\nIt would certainly be worthwhile for you to let your Dr. know about the continuing pain. They can skip or postpone a BCG treatment if the bladder is very inflamed. Best of luck!\n\nAnn\t\t\t", "date": "2014-08-20T18:15:08+00:00", "topic": "Pain following TUBRT then continuing following BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI don't think amount of blood seen correlates with size or number of of tumors. I had what seemed like a lot of blood to me, even some clots, several times in one day, and then nothing after. The tumor ended up being quite small, and fortunately low grade. I had a recurrence a couple of years later, spotted on my regular 3-month cystoscopy, but had  no bleeding that time.\n\nBest of luck.\n\nAnn\t\t\t", "date": "2014-01-30T14:54:44+00:00", "topic": "Gross hematuria - any info or indications?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm so glad to hear that nothing has shown up in your testing.You must feel very relieved.\n\nWhen I had bleeding I was fortunate that my primary care doctor right away started the testing needed and lined me up with a urologist. I believe they first did a sonagram, which looked suspicious enough that they recommenced CT. Even though I had a very small tumor, it showed up on both, which was confirmed by the urologist during cystoscopy.\n\nAs to the cause of your bleeding, you don't by any chance take aspirin or other nsaids such as ibuprufen, or any prescription \"blood thinner\"? Urinary bleeding is a fairly common side effect of taking medications such as these, especially if you have been doing certain kinds of exercises. (My husband, who is on a medication to prevent clotting, recently had urinary bleeding which I suspect was related to doing sit-ups! He ended up getting a cystoscopy exam, and all looked fine, no cancer.)\n\nAgain, I'm very happy to hear your good news.\n\nAnn\t\t\t", "date": "2013-05-03T06:15:05+00:00", "topic": "Starting with tests", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongratulations on the pathology report--it could hardly be any better!    I had the same type of tumor as you did 6 years ago.  I did have a recurrence of the same type 2 years later, but have been tumor-free ever since.  Here's hoping your your future is equally \"uneventful.\"\n\nAnn\t\t\t", "date": "2012-07-31T19:42:03+00:00", "topic": "path report", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWonderful news! As another person who had a low grade diagnosis, I know you still have to be cautious and have your checkups, but as my urologist says at this grade and stage he considers it just a \"nuisance cancer.\" Hope you have a wonderful spring and summer with this good news in mind.\n\nAnn\t\t\t", "date": "2012-04-05T10:22:12+00:00", "topic": "Waiting for full results but wont let it beat me", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy urologist is in a solo practice and is super busy; his office does not have any PAs.  We live in a small city of about 40,000 people, so smaller than where you are. When I have a cystoscopy check-up, or when I've had the two TURBTs, I try to ask him any questions I have. At first, my husband came with me, so there were two of us to ask questions and two of us to hear the answers. It's all gotten so routine for me now that my husband no longer comes along, though he does offer to do so. The suggestion of writing things down ahead of time is a good one, though something may always come up in the visit that you hadn't anticipated, and you may have addiitonal questions as a result.\n\nMy BCG treatments are done by a great nurse, but she will call in the urologist if she has any problems.  She can only do the BCG treatments when the urologist is in the office. I think the urologist did it himself just a few times, once when the nurse was out sick and a couple of times when she had trouble getting the catheter in (due to my anatomy, not her lack of skill). The office used to only have the one nurse (female) but I see they now seem to have a guy as well (possibly he's a PA, but I've never had him).\n\nSo long as the urologist is available in the office and will answer questions the PA can't, I wouldn't rule out seeing the PA.\n\nAnn\t\t\t", "date": "2012-02-08T19:54:14+00:00", "topic": "Physician Assistant instead of Doctor", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPST--\n\nFirst, congratulations on the pathology report results! It's difficult to deal with the emotional roller coaster when you are first diagnosed and starting the bladder cancer \"journey.\" But, at least you have your good news before the holidays, and can perhaps begin to relax a bit now.\n\nIt sounds to me as though your urologist is following the standard and solid protocol for tumors of this stage/grade and number. I initially had a single tumor of the same type as yours, and it was only when I had a recurrence of 2 very tiny tumors 2 years later that my urologist recommended BCG. I was doubtful about that since I'd read BCG wasn't considered all that useful for low-grade tumors. I called my cousin, a radiologist specializing in the urinary tract, who works at a major NY teaching hospital. He concurred with my urologist's BCG recommendation.  Since the recurrence was in a different area of the bladder than the original single tumor, the way my cousin worded it was that \"the recurrence indicates your bladder lining wants to grow tumors.\"  I've just completed the full treatment protocol for BCG, and am doing great.\n\nHope your future check-ups are \"all clear,\" but know that if you do have a recurrence BCG may be the way to go\n\nAnn\t\t\t", "date": "2011-11-29T18:08:15+00:00", "topic": "My TURBC is over", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYes, the \"Lamm protocol\" changed mid-way through our treatments. Ask your uro about it. You, too, might be almost done.  \n\nAnn\t\t\t", "date": "2011-12-01T21:13:49+00:00", "topic": "6 month Cysto Today - Good news", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongrats to Diane and Joey!\n\nJoey, you and I are almost \"BCG twins.\" I just finished #25-26-27 yesterday and am all done.\n\nAnn\t\t\t", "date": "2011-12-01T21:13:49+00:00", "topic": "6 month Cysto Today - Good news", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had my first TURBT under light general anesthesia (outpatient), and had no need for a catheter. I went home in a few hours.  However, my tumor was smaller than yours. In addition, after the surgery the urologist was 99% certain it was low grade and noninvasive, which was confirmed later by the pathology report.  One thing to keep in mind is that a second TURBT is highly recommended, after you've healed somewhat from the first one, in order to make sure the initial surgery got the whole tumor and also to verify the original pathology report. (Unfortunately, it's not uncommon for bladder cancer to be \"understaged\" at the time of the initial TURBT.)\n\nBest of luck!\n\nAnn\t\t\t", "date": "2011-11-19T14:43:22+00:00", "topic": "what to expect", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tFirst, best of luck to your husband,and to you.\n\nSome additional causes of hematuria can be exercise and also use of some over the counter medications that can contribute to easy bleeding (by reducing clotting abilities); these include aspirin and various nsaids such as ibuprufen. Prescription anti-clotting drugs such as warfarin (coumadin) can contribute to bleeding.\n\nEven if no cancer is detected, your urologist may recommend having your husband go back to more frequent cystoscopies than annually. The general practice is cystoscopy every 3 months for the first 2 years, then every 6 months for the next 3 years, and if all remains \"all clear\" (no recurrence) at the 5-year point, then the cystosopies are done annually, unless there is some reason to continue more frequently. It sounds from your post that your husband was already on the annual exam schedule, though he's barely past the 5-year mark.\n\nAnn\t\t\t", "date": "2011-10-29T02:51:34+00:00", "topic": "Under 30 recurrence?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI think 10 days is fine to start the BCG, not too soon, unless there has been continued bleeding to indicate the area of the TUR is not fully healed. I'm almost done with a full course of BCG treatments (close to 3 years); my urologist has me wait 1-2 weeks after even a  cystoscopy before doing the BCG, just to be on the safe side.\n\nBest of luck to your father.\n\nAnn\t\t\t", "date": "2011-09-29T12:42:42+00:00", "topic": "from italy - please give me your suggestions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWe're wandering a bit off topic here, but I want to chime in with my hatred of golytely/halflytely. For my first colonoscopy, I had the concentrated stuff that tastes like pure salt syrup (was that the magnesium citrate?)and it was tolerable. I, too, had major trouble with the golytely due to the sheer volume, and couldn't finish the last 10-12 ounces. Pharmacist said they no longer use whatever the other stuff was due to the very high sodium content. I say, bring on the sodium--I promise to drink a lot of water afterward!\n\nAnn\t\t\t", "date": "2010-10-11T23:13:44+00:00", "topic": "Had Appt With Dr. Smith", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongrats Max, love to hear the good news!\n\nI've got my cysto coming up in a couple of days, which will be at the 2-year mark since a recurrence; hopefully I'll join you in continuing to be all-clear.\n\nAnn\t\t\t", "date": "2010-07-10T22:57:17+00:00", "topic": "LATEST CYSTO", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI live in Maine and haven't had to research this, but concur that it's best to go to where the best people are and definitely for RC that's not likely to be Maine.\n\nMainers tend to think of Boston as THE place to go for any kind of complicated medical issues, plus it's a lot closer than NY. (I come from NYC originally, so of course would be more than happy to go there. In fact, my elementary school was right across the street from Memorial Sloan Kettering.)\n\nAnn\t\t\t", "date": "2010-06-20T18:43:15+00:00", "topic": "From Maine looking for Dr", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy dad had bladder cancer, but he was an older male smoker (typical profile); I was diagnosed with bladder cancer at a younger age than he had been, and I've never smoked but was exposed to a lot of second-hand smoke growing up with 2 smoking parents in a small NYC apartment.  Dad lived to be 84 and died of lung cancer unrelated to the bladder cancer (though of course smoking was a common denominator in both).\n\nAnn\t\t\t", "date": "2010-05-24T21:00:13+00:00", "topic": "family members with bc", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tVi--\nLike you, I really trust the people here, and I've never felt the need to \"take a vacation\" from reading the forums. I think people are so different in how they cope with medical issues, that there's no one size fits all solution.  I know that for me, doing extensive reading and research is how I cope, but for others, doing extensive research or reading about others who are in \"bad shape\" may lead to unproductive anxiety rather than to having more sense of control of the situation. I know people who'd rather have a spouse, other loved one, or close friend be the one to do the research or have the extensive knowledge, and to have that person fill them in kind of on a \"need to know\" basis.\n\nAnn\t\t\t", "date": "2009-12-21T00:24:58+00:00", "topic": "Diagnosis for spreading?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tFrom my understanding, the fact of having tumor recurrence, even though low-grade, could reasonably warrant starting on the BCG. I had a similar concern about the need for BCG, in that I had recurrence of only low-grade tumors, and that was after two years (not the short 6 months). However, my urologist recommended it, so I started BCG back in 2008, and am now on 6-month maintenance dosing.\n\nAnd, based on my limited knowledge, the \"PUNLMP\" designation for tumors is not so common any more. If I had to guess, I'd suspect that the initial tumor and recurrence were both the same type, i.e. TA, grade 1  (at least as it sounds from the reports you've typed in).\n\nAnn\t\t\t", "date": "2009-12-09T18:17:35+00:00", "topic": "Newbie Here - When to Start Chemo", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat news!  Wishing you many more \"all clears\" to come.\n\nAnn\t\t\t", "date": "2009-03-30T00:52:17+00:00", "topic": "My Pathology Report came back AND.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree that 5 weeks to surgery is not too long a wait, especially if there is a strong likelihood of a single not high grade tumor. When I had my first symptoms (gross hematuria), I think it was about 6 weeks from my first visit to my primary care doctor until I had the TURB.  However, this was considered very fast, as they managed to get me into the urologist quickly (we have a shortage of urologists where I live) and the urologist was kind enough to squeeze me in as soon as he could for the TURBT because we had a trip planned to Europe.   Two years later (early this past June) I had a recurrence when I went for my 3-month cysto, and had the TURBT done about 5 weeks later.\n\nBesides the cysto, has your husband had any other testing, e.g. urine cytology?  Usually evidence of possible bladder cancer does not show up in the urine if the cancer is low grade, but does if it's higher grade. If his cytology was negative, all the more reason for at least some reassurance that  what he has is low grade. (Before having my initial cystoscopy, my regular doctor had had cytology done and a CT scan; cytology was negative, but the small tumor was visible on the CT. Flat tumors -- CIS --wouldn't be visible on the CT, however.)\n\nBest of luck to your husband.\n\nAnn\t\t\t", "date": "2008-12-12T15:33:21+00:00", "topic": "Risk of 5 Week Wait for Surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPat--\nThat link just went to Dr. Josephson's page. However, I'm guessing from what you said in that last e-mail, that the \"P\" prefix might be used when reporting the stage findings from a post-cystectomy pathology exam? And would \"T\" be used for staging that is done through cystoscopy and TURBT pathology results? \n\nAnn\t\t\t", "date": "2008-09-24T16:53:45+00:00", "topic": "experience with re-turbs at MSK", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAbsolutely do the cystoscopy and biopsy. CIS (carcinoma in situ) is flat and not likely to show up on a CT scan. Cytology is almost always negative for lower grade tumors. You have risk factors for bladder cancer (male, smoker); the aspirin may have made bleeding worse, but I suspect that may not have been the root cause (but I'm no medical expert). Under the circumstances, it would be very wise to proceed with the scheduled cystoscopy and biopsy\n\nI'm not in a high risk group for bladder cancer (female, non-smoker, no chemical exposure). However, after one bout of gross hematuria, my doctor got me right in for tests (CT, cytology--negative) and to a urologist for cystoscopy. Had a single papillary (low grade) tumor removed. That was 2 years ago, and I had no recurrence during that time, but recently had two tiny new tumors (same type) removed, and have just completed 6 weeks of BCG treatment to slow up future recurrences or progression. Bladder cancer may be one of the more easily controllable types of cancer, but you have to be vigilant in getting checked and in being treated for any recurrence.\n\nAnn\t\t\t", "date": "2008-09-18T14:52:05+00:00", "topic": "A question from tomd", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLes--\n\nThat is indeed wonderful news! If your Dad had such a strong reaction to the BCG, I can understand why his poor bladder must have looked very raw and inflamed, and why it lost capacity to hold urine. But, as I understand it, in a situation such as this the bladder lining heals, and apparently your Dad must be on the way to healing if the catheter was removed.  On the bright side, think of all the potential cancer cells that must have sloughed off in the process!\n\nI think some of us were also concerned about what happened with your Dad because  we either have had BCG, or (in my case) are in the middle of treatment. The thought of someone losing his bladder due to BCG treatment rather than the cancer itself was pretty scary.\n\nBest of luck to your Dad. \n\nAnn\t\t\t", "date": "2008-08-08T22:19:38+00:00", "topic": "BCG  burned bladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had a small (.5 cm) papillary tumor, low grade, non-invasive removed in May 2006; I got complacent after almost 2 years of no recurrence, even knowing the statistics. On Friday the 13th (June), my uro spotted 2 tiny (\"pin-head size) tumors, in a different spot than my initial tumor. So, I'm going in today to have them out, in-office procedure. The first time I had it done in outpatient surgery under mild anesthesia, as I really didn't want to be awake.  However, this time I'm giving a try at having the procedure done in the office; I've been given ativan and vicodin to take a little ahead of time, and hope those plus local anesthetic will do the trick.  Uro is sure the recur is going to be the same type, stage and grade as the first, but we'll see what the pathology  report comes back with.\n\nI'm not really worried, more just mad that I'm back to square one for another 2 years of 3-month cystos. Compared to what a lot of other people are going through here, I know I'm one of the luckier ones (so far at least), but I'm still annoyed. As someone phrased it in one of the forums, you're \"living your life in 3-month chunks.\" I wish it were now 6-month chunks, but at least I know things will be watched and kept under control. Because of my anatomy, I have an above-average amount of discomfort during the cystos, and bladder spasms after for several hours.  Uro gave me an anti-spasm medication sample (urelle) and that seemed to help, and he's also found out that tipping the table slightly helps as well.\n\nMy dad also had bladder cancer (in his 70's), with one recurrence, and I can well remember how pleased he was when he got to the point of having annual check-ups.  I hope maybe I'll follow in his footsteps in that regard.  (He had smoked heavily, and ended up dying at age 84 from lung cancer. I never smoked, but was exposed to a lot of second-hand smoke from both parents, while growing up in a small NYC apartment.)\n\nWish me luck!  ", "date": "2008-07-16T13:15:33+00:00", "topic": "Recur after 2 years \\&amp;quot;all clear\\&amp;quot;", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust had my annual cystoscopy, and continue to have \"unremarkable bladder.\" Yay for unremarkable!  It's now been almost 13 years since my initial diagnosis, 11 years since my one (and only) recurrence, and all is well. I have a new urologist since we've moved to another city, and he had some interesting news about new guidelines for check-up frequency. He said that since I had small, low grade tumors, and the recurrence was several years after the intial tumor, that is now considered low risk by the new guidelines. He also mentioned the fact that I'd had the full course of BCG, though I'm not sure what, if any, influence that has on categorizing risk and check-up frequency. The new guidelines mean I could switch to cystoscopy every 2 years instead of annually if I'd like. My dad had bladder cancer (no recurrences), and I'm cautious, so told the doctor I'd stick with annual for now.\n\nI'm glad to be joining my \"cohort\" here in remaining cancer-free.\t\t\t", "date": "2019-02-13T20:54:13+00:00", "topic": "All clear, almost 11 years now", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't hang out here much these days since I've been all clear since 2008, but I'm stopping by with good news. Just had my somewhat delayed annual cysto and i'm still all clear. We moved in September to another city in our state, and it took a while to get set up with a new urologist and to have my annual cysto--was supposed to be in October but ended up being in February.  Moving from the home we'd been in since 1979 (and the are we'd been in since the late 1960s) has been an adjustment. However, we are now close to several of our children and grandchildren, so that's nice, and being in a condo with other people responsible for plowing and mowing is nice too!\n\nWishing \"all clears\" to my old friends and newcomers alike.\n\nAnn\t\t\t", "date": "2018-03-05T23:48:46+00:00", "topic": "My annual check-in (and check-up): All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm only on here rarely these days, but am just writing to report that my recent annual cysto exam showed that I remain all clear of any tumors. To those of you who are just starting on this bladder cancer journey,there is certainly hope for many years of cancer-free life. Wishing you all the same good news.\n\nAnn\t\t\t", "date": "2016-10-27T03:05:27+00:00", "topic": "All clear annual check-up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlways good to hear from you and to hear the continued good news. I'm rarely on the discussion forum these days, but have several posts I follow--yours among them. Like Sarah, I'm following along behind you in recurrence-free years, having been all-clear since 2008. Next annual cysto is coming up in October.\n\nHere's to many more good years!\n\nAnn\t\t\t", "date": "2015-09-22T15:44:05+00:00", "topic": "A update to give hope and comfort ..A Continuation", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats on another good year. I go for annual myself next week. Have been on annual for several years now.\n\nI haven't been on this site in a long time, but it looks as though it isn't as active as it was back some years ago. Still nice to hear the good news though!\t\t\t", "date": "2015-09-22T15:44:05+00:00", "topic": "A update to give hope and comfort ..A Continuation", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tEdward--\n\nGlad to hear things don't sound too dire in terms of the bladder cancer. It's understandable not to remember everything that's said, what with all the terminology being thrown around, the stress, etc. At the beginning my husband always came with me to uro appointments, and I would try to write things down as well.\n\nGood luck, and hope the fatigue passes. I don't know where you live, but we are in New England and it's tiring being cooped up in the house during this harsh winter and not being able to get outside much and get some fresh air and sunshine.\n\nAnn\t\t\t", "date": "2015-02-24T17:57:56+00:00", "topic": "Low grade cancer!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm not sure if the low grade bladder cancer would contribute to your fatigue, and it may just be a coincidence. My husband has afib and high blood pressure, and he gets very fatigued due to his blood pressure meds, one of which is also used for his afib (beta blocker?). Dr. is trying to change dosages, change time of day he takes the various meds, etc., to try to resolve the fatigue. (My husband isn't the one who's had bladder cancer; I am.)\n\nI'm a little confused by your saying you had a cystectomy, and that your cancer has returned. Normally \"cystectomy\" means surgical removal of the bladder. Maybe what you had before was TURBT (removal of the tumors) or possibly you had a partial cystectomy, which I don't think is too common. In any case, I'm sorry to hear about the recurrence. CIS, carcinoma in situ, is often treated with BCG. CIS is generally considered a higher grade type of bladder cancer, so I'm puzzled by the report that you have \"low grade cells\" and that it's CIS. \"Wait and see\" is not usually suggested as an option for CIS, where BCG is highly recommended. On the other hand, \"wait and see\" rather than BCG for low grade papillary cancers sounds reasonable given your other medical conditions. Are you absolutely sure the Dr. said you had CIS? CIS is a flat type of tumor on the bladder surface, while papillary tumors stick out from the surface like little mushrooms or broccoli stalks.\n\nI had BCG treatments because I had a recurrence of low grade papillary bladder cancer, and though I tolerated it well, not everyone does. BCG treatments can contribute temporarily to a feeling of fatigue, and to having flu-like symptoms, bladder discomfort and bleeding, etc.\n\nWishing you well as you face your various medical \"woes\" and now this recurrence of bladder cancer\n\nAnn\t\t\t", "date": "2015-02-24T17:57:56+00:00", "topic": "Low grade cancer!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVery glad to hear your good news. Been there, done that, and want to tell you it gets better over time, with each \"all clear\" check-up. Will you be having maintenance BCG treatments for a period of time? There are several different protocols for that.\n\nAnn\t\t\t", "date": "2014-11-02T03:22:17+00:00", "topic": "after my first round of bcg treatnents no sign of.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks very much for the kind and supportive words George, and all. Like George, I had replied before when the site went down, so will try to repeat what I said then. I just want to say that I honestly don't think about my bout with bladder cancer, and never even get worried any longer when cystoscopy date looms (maybe a little worry when the scope is actually in). I don't think of myself as a survivor or warrior, because those words now seem dramatic for what I actually have experienced. There are others here, and some who are no longer with us, who went through much more than I did and to whom those terms more accurately apply. I'm a generally optimistic person, and though I know bladder cancer has a high rate of recurrence, I don't think about it and figure I'll cross that bridge if I come to it. Every all clear year that goes by the better. Have had 4 grand-daughters in the last 5 years, and hope to have many years of spoiling them.\n\nAnn\t\t\t", "date": "2014-10-25T14:37:40+00:00", "topic": "All clear, annual check-up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've read here (and elsewhere) reassuring comments that reaction to BCG means it's working, which may well be true. Not having a reaction doesn't necessarily mean it isn't working, however. I had milder reactions to BCG than many others here have reported, was able to complete the full course of initial treatments and follow-ups, and have remained all clear of bladder cancer for 6 years. Part way through the course of treatment, I did get a pretty high fever one time. That was enough for my urologist to drop subsequent treatments to 1/3rd dose. If your husband develops severe reactions to the BCG, e.g, very bad bladder irritation, the dose can be dropped to 1/3 or even 10% and still be effective.\n\nBest of luck to your husband, and to you.\n\nAnn\t\t\t", "date": "2014-09-04T20:16:19+00:00", "topic": "bcg treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy BCG maintenance schedule changed while I was on it, due to changes recommended by the current literature. I had been expecting to go out to 30 months (from the start), but ended up not having to have the last treatment (YAY). By now the BCG is just a distant memory, and come June I'll be at the 5-months cancer-free mark.\n\nAnn\t\t\t", "date": "2013-01-10T17:44:10+00:00", "topic": "BCG Maintenance Schedule -- has it changed?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBelated congratulations on 7 years clear! It's great for you to post to give hope to others just starting on the BC journey.\n\nAnn\t\t\t", "date": "2014-01-06T21:54:26+00:00", "topic": "All Clear 7 Years Now", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust had my 6-month cysto exam, and remain \"all clear.\" It's been 5 years with no recurrence so I'm now an official member of the one-year check-up club, which I'm happy to join.\n\nAnn\t\t\t", "date": "2013-10-24T21:27:50+00:00", "topic": "All clear-five years!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news--so happy for Doug.\n\nAnn\t\t\t", "date": "2013-10-10T01:27:32+00:00", "topic": "Doug's good news!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm really glad to hear that the pathology report came out so well. Although this was a low grade and stage, you still need to be vigilant with checkups and talk to your urologist about additional treatment options when you have a recurrence such as this. My urologist recommended I undergo BCG treatment under similar circumstances. I was a bit hesitant since my tumors, like yours, were low grade and stage, but decided to do the treatment and have been all clear for 5 years now.\n\nAnn\t\t\t", "date": "2013-06-16T14:06:30+00:00", "topic": "polyp removal in dr office?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNancy--\n\nHaven't been on the site for quite a while, so just caught up with your great news. Glad all is well, and all clear.\n\nAnn\t\t\t", "date": "2013-08-15T18:36:02+00:00", "topic": "Six Years Cancer Free :)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHOORAY SarahAnn! Five years is a wonderful milestone to achieve.  It is a little scary after all those years of 3-month checks, BCG, and 6-month checks to go to annual.\n\nI'm following along right behind you, as usual, and hope I have the same result. I have cysto tomorrow, actually. My 5 years is up in June. I had thought we could consider this April check up the 5 year mark and call it good and go to annual therafter. However, uro says it can't hurt to have one more 6-month check in October. (In my own mind, if tomorrow I'm all clear I'm going to count myself as being 5 years cancer free.)\n\nAgain, congratulations!\n\nAll my best, Ann\t\t\t", "date": "2013-04-09T19:07:01+00:00", "topic": "Happy day...MY OWN THREAD", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations--so good to hear your good news.\n\nAnn\t\t\t", "date": "2013-04-25T10:05:20+00:00", "topic": "Another All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't have anything to add, as I've never head of calcification like this, but just wanted to say I live in Maine too (Bangor). I've just been treated by a local urologist, as I've got a very uncomplicated situation with regard to bladder cancer.  However, if I were in your shoes I wouldn't hesitate to go out of state to get some answers.  Best of luck finding out the source of this and getting rid of it.  Is calcification of this type something that happens only in the bladder, or does it occur elsewhere as well?\n\nAnn\t\t\t", "date": "2012-10-27T19:30:39+00:00", "topic": "Bladder plaque calcification", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVery glad to hear the good news. Hooray!\n\nAnn\t\t\t", "date": "2012-09-29T00:07:49+00:00", "topic": "Good check up for Doug", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations on your all clear! (My urologist is Indian, and says \"nice and clean,\" which is a bit graphic but still wonderful to hear.)  I second what Mike says about anxiety.  The anxiety before the check-up really does get better with each successive all clear. I'm on the 6-month check-up schedule (for one more year), and must say I don't get anxious at all now and haven't for quite a while. However, I'm optimistic by nature and know everyone is not like me!\n\nAnn\t\t\t", "date": "2012-10-09T19:13:14+00:00", "topic": "Wish Me Luck!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWonderful news--couldn't happen to a better person.\n\nAnn\t\t\t", "date": "2012-09-25T20:20:11+00:00", "topic": "Checkup OK....probably", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGodd luck Rocky! We're going on a transatlantic voyage on the Queen Mary 2 from NY to Southampton, England, our first cruise ever. We'll spend a week in England, visiting Cornwall and London, and take the Eurostar train from there to visit our son and daughter in law who are livng in the Netherlands for several years. they  have a car, and we'll go with them to the Franch Alps. It's our 4oth anniversary, and now we also have my 6 month \"all clear\" to celebrate too.\n\nAnn\t\t\t", "date": "2012-04-06T11:37:51+00:00", "topic": "All clear (still)!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI  haven't been on the website for almost a week, and just saw your good news. Congratulations, and wishing you many more all clears.\n\nAnn\t\t\t", "date": "2012-02-16T02:17:44+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNice to hear the news, Nancy.  You and I are close to being \"in synch\" with checkups and BCG, so it makes it especially meaningful to hear your good news.  (I have my next 6-month check in May, which will be at about the 4-year point since a recurrence.)\n\nHappy 6-months!\n\nAnn\t\t\t", "date": "2012-02-04T15:42:34+00:00", "topic": "4 1/4 years and counting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI love the idea of an \"all clear\" mascot! We could use the image on t-shirts, etc.  All I can think of is a clear glass of water, maybe with a smiley-face on it.\n\nAnn\t\t\t", "date": "2012-01-16T19:24:42+00:00", "topic": "checkup", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSorry to hear of your continued pain. I'd definitely not try to \"tough it out\" by going off medications, though possibly you may need something different prescribed for you at this point. I used to suffer a lot from bladder spasms, even after just getting a cystoscopy, let alone a TURB; as you describe, they were worse at the end of the pee than at the start. You are still healing, and your bladder is likely still mad at you for what it's been through!  As well as anti-spasm medication, I used to find sitting in a hot bath very helpful for spasms. Now that I've had so many cystoscopies, 2 TURBTs, and a full course of BCG, I find that my spasms are way less, and very short-lived; I did, however, have to get the BCG concentration reduced to 1/3rd part way through the maintenance treatments.\n\nAs to the sleep problems, you may be having to wake up to urinate when you are at critical points in your sleep cycle, making it harder to get back to sleep.\n\nAnn\t\t\t", "date": "2012-01-13T13:38:56+00:00", "topic": "Pain is pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo happy for you!\n\nAnn\t\t\t", "date": "2011-12-12T15:52:02+00:00", "topic": "All Clear 6 Month Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKitts-\n\nI'm 68, and have been having BCG treatments for 2 years (will be done at the end of this year). I do think it might be better for your mother not to ride in the car for that hour; even if she has no problem \"holding,\" I think just the peace of mind of staying in a hotel, knowing that she is near a bathroom, may be helpful.\n\nOne thing to be aware of is that they can reduce the concentration of BCG down to 50%, 10%, and possibly lower if there is a severe reaction at any point in the treatment cycles.  I've been on 50% for the last several maintenance cycles, and symptoms are much more manageable; when I did have symptoms (primarily fever and spasms after I'd been having the BCG for a while), they were not as bad as some people have experienced.\n\nMy doctor never said it was necessary to do all the rotating that I've read about being recommended. I think as the bladder fills with urine over the course of the several hours of \"holding\" the BCG, all parts of it get \"bathed.\" I do try to alternate lying down, sitting, walking around, etc., but have never bothered with the rotating. Sometimes I run errands right after the BCG, as a distraction and to keep myself occupied while waiting, but usually try to be  home for the last hour or so. To reduce symptoms, a helpful hint the nurse who administers the BCG told me is to start drinking a lot of water the half hour before the hold time is up, and to keep drinking a lot of water for at least several hours. That helps get the BCG (and its potential side effects) flushed out as quickly as possible.\n\nBest of luck to your mother, and to you as caregiver.\n\nAnn\t\t\t", "date": "2011-04-21T19:49:13+00:00", "topic": "my 87 yr old mom about to start BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWarren--\n\nI had pretty mild reactions at the outset, and it wasn't until\nI was into my second year that I had a stronger reaction, with a fever that lasted several days, and some pretty severe spasms (in my urethra it felt like). Never had any bleeding. I've been on 1/3rd dose for my last two maintenance treatments, which are now at 6-month intervals, and that seems to have done the trick. It does seem to be better when you get to 6 months between sessions rather than 3. I've had 21 instillations so far, and two more batches of 3 to go this year and I'm done.\n\nYou're such a \"veteran\" to me on the board, that it seems strange to be \"ahead\" of you on this!\n\nAnn\t\t\t", "date": "2011-01-10T22:51:47+00:00", "topic": "After 10 years it\\'s CIS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think you'll find that once you get through having the BCG every 3 months, the 3-month cysto check-ups don't seem so bad. The first year of BCG treatments, it seemed like I was forever at the uro's office, what with the 6-weeks induction, 3-weeks maintenance every 3 months, and the cystos every 3 months. It seemed there was barely a week free of being reminded about bladder cancer. Once I got on the 6-month BCG schedule, and now on 6-month checkups, I hardly think about the blc at all. I hope that's how it goes for you as well, and best of luck in your treatments and check-ups.\n\nAnn\t\t\t", "date": "2011-03-02T15:58:21+00:00", "topic": "3-month cysto was clear--why am I Debbie Downer?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've been on the BCG protocol you describe, sometimes called the Lamb protocol (after Dr. Lamb), which originally extended out to a total 30 instillations (initial 6, then the 3 maintenance every 3 months, then 3 weekly maintenance every 6 months, as you describe). While I've been undergoing this, my uro's office has said that the revised protocol drops that last treatment, so it's now a total of 27.  Therefore, I'm loking forward to being done in 2011--3 weeks maintenence in May and 3 in November. Yay!\n\nAnn\t\t\t", "date": "2011-01-06T17:43:43+00:00", "topic": "New protocol for maintenance BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWonderful news. Three years sounds so good.\n\nAnn\t\t\t", "date": "2011-01-11T20:17:36+00:00", "topic": "3yr cysto..no tumors", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow--Lots of good news from people these last several weeks. I'm very glad to hear you are among them, Jack! I've been cancer-free since June 2008, so am with you in the \"6-month\" cysto club, and just have two more rounds of maintenance BCG in 2011 and I'll be done with that.\n\nAnn\t\t\t", "date": "2010-12-06T15:48:48+00:00", "topic": "All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations and happy holidays!\n\nAnn\t\t\t", "date": "2010-11-30T15:28:48+00:00", "topic": "Clear After One Year", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnother tip the nurse doing my BCG told me about, which can reduce some of the burning and pain when voiding, is to start drinking a lot of water about 1/2 hour before the two-hour \"holding\" time is up.  She said that helps flush the BCG out more quickly. I usually drink fluids normally for up to about 2 hours before the BCG instillation, and I've always managed to hold the BCG without too much discomfort for the full two hours. However, since coffee and tea supposedly have a diuretic effect, I do cut down on those on BCG days. If my treatment is in the morning, I just skip the coffee altogether, but if it's in the afternoon, I do have one cup in the morning.\n\nFor spasms, I'd been given prosed to take beforehand (turns the urine a lovely shade of blue), and they've now switched that to vesicare. I also take ibuprufen sometimes. Because I started having more severe side effects by about treatment 15 (fever, pain), I'm now getting the BCG at 1/3rd dosage and the symptoms are definitely better.\n\nBest of luck with your treatments.\n\nAnn\t\t\t", "date": "2010-11-06T17:26:32+00:00", "topic": "Okay, get me ready for BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know this is your first appointment so you'd want to have someone with you. For what it's worth I've always gone by myself and am none the worse for the wear. However, my uro's office is literally 4 minute's drive from my house. My first BCG appointment was scheduled when my husband had something urgent he couldn't postpone or skip, and though I wanted him there, once I saw how easy it was I decided I didn't need him to be there for subsequent treatments. He does still offer to come, but I always turn him down. He used to come with me for my 3-month cystoscopies, but somewhere along the line we stopped that too (I think it was sometime after I'd had my second TURBT). I never thought I'd consider my check-ups as something routine, but believe it or not, that day may come for you, especially if you receive a series of \"all-clear\" results as I have.\n\nSorry about the snow storm!  Hope all goes/went well.\n\nAnn\t\t\t", "date": "2010-11-14T20:07:01+00:00", "topic": "Breakfast or not on morning of BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI completed my 3 weeks of maintenance BCG yesterday at the 1/3rd dose, and all seems to be fine. I just had some burning and frequency, but it's very manageable.  Urine has started looking a little cloudy about 14-16 hours after the treatment, and I don't know what that's about, but I feel pretty OK so am not going to worry (or should I?).  Next check-ups are July and October, and next BCG isn't for another 6 months (November) so I'm looking forward to a good summer.\n\nAnn\t\t\t", "date": "2010-05-09T13:06:41+00:00", "topic": "Lowered dose BCG - so far so good", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWonderful news! And it's interesting that your uro doesn't think you need the continued maintenance BCG because you're doing so well. I don't think I've ever heard about BCG and the bladder \"shrinking,\" though I know people do have strong reactions and can get irritation and infections. The maintenance protocol allows for greatly reduced concentrations of BCG when people suffer from strong side-effects. (I'm going to 1/3rd concentration myself this time.)\n\nAnn\t\t\t", "date": "2010-04-29T00:23:11+00:00", "topic": "All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne--\n\nThat's great news! And now we will be back to almost being in sync with each other in terms of schedule, as I start my 1/3rd dose BCG in two weeks and you in three weeks. We'll need to keep each other posted!\n\nAnn\t\t\t", "date": "2010-04-14T19:55:02+00:00", "topic": "Cystocscopy time, again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've had two TURBTs, first under anesthesia as outpatient procedure; no catheter, went home in a couple of hours, and only problem was bladder spasms for about a day or so (single tumor, and small). Second was done under local in Dr.'s office (2 very tiny, pinhead-size tumors); again, no problems other than spasms. I can't remember what meds I might have taken, but I vaguely remember some kind of painkiller the first time, and that plus an anti-spasmodic the second time. I do think size and number of tumors may make a big difference, and I'm wondering if gender (i.e., presence of enlarged prostate common in guys as they get older) might also play a role in the degree of pain/symptoms after TURBT.\n\nAnn\t\t\t", "date": "2010-04-13T03:40:39+00:00", "topic": "An unofficial poll!  Please read!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust a follow-up on my husband and his urinary bleeding. He had a CT scan, and all looked fine on that (kidneys, bladder, etc.). He saw the urologist for a cystoscopy today, and bladder and prostate look fine -- no signs of cancer anywhere. The urologist had done a prostate \"reaming\" procedure on my husband some years ago, an outpatient procedure using microwave(TUMT), which worked really well. However the prostate is still enlarged on the outside and rather vascular. The urologist said that exercise and the medication my husband is on (coumadin and aspirin) could cause small vessels in the prostate to rupture and bleed, throwing clots into the urine.\n\nWe suspected that the blood-thinners and heavy exercise had a lot to do with the bleeding, but needless to say we're quite relieved at the official clean bill of health.  \n\n(A couple of the staff at the office were quite confused to see me there this morning, as I'd just been there myself last week for a 3-month cystoscopy check-up -- which was all clear.)\n\nAnn\t\t\t", "date": "2009-12-30T13:23:58+00:00", "topic": "bladder polyps?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm not sure on what basis the doctor mentioned polyps; I think possibly she was trying to tell my husband not to jump to the most \"dire\" diagnosis. Her advice to him for the moment was to drink a lot of fluids and \"don't worry.\" When I had hematuria, I saw a different doctor (in the same practice) and she immediately mentioned the possibility of cancer to me -- and she was right. She had said that urunary bleeding in post-menopausal women had a fairly high likelihood of being cancer, but that men sometimes had blood in the urine for harmless reasons such as exercise.  Since my husband is on coumadin, and had been doing some fairly vigorous activity a day or so before (dragging and burning brush, inclding some fairly large trees)we're hoping his bleeding is related to that.\n\nMy Dad had bladder cancer, and had one reccurence which was termed a \"benign polyp\" after it was removed; this was in the late 1970's, so I'm not sure diagnosis was the same then as it is now.\n\nAnn\t\t\t", "date": "2009-12-30T13:23:58+00:00", "topic": "bladder polyps?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news Jack!  So far, everyone posting with January check-ups have been pleased with the results (mine was two days ago and I'm still all clear).  You and I seem to be on the same schedule -- looking forward to going to 6 month checks if our next 3-month check-up goes well.\n\nAnn\t\t\t", "date": "2010-01-22T14:38:24+00:00", "topic": "All Clear Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations Nix! Maybe we October all-clear folks should get t-shirts or hats made up saying \"Happy October Club Member.\"   (But maybe that would be tempting fate.)\n\nAnn\t\t\t", "date": "2009-10-22T16:54:55+00:00", "topic": "I am also a member of the happy October club", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm very glad to hear you've joined the October good news club. I'm not sure how many of us there are, but the more the merrier.\n\nAnn\t\t\t", "date": "2009-10-18T20:33:44+00:00", "topic": "GREAT NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne--\n\nCongratulations on the good news.  You have every reason to be happy with your uro! Hope things will clear up so you can continue BCG treatment, hopefully with a reduced dose to avoid a repeat of the cystitis. As I recall, you and I are on close to the same BCG schedule, so I follow your posts closely. (My next check-up is in early October, followed several weeks later by 3 weeks maintenance BCG.)\n\nAnn\t\t\t", "date": "2009-08-26T20:10:13+00:00", "topic": "Not what I wanted to hear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tEveryone has pretty much covered what I would have liked to know, but I'm adding a couple more somewhat specific ones, that could perhaps be incorporated in the content of more general questions:\n\nHow do you interpret pathology reports? When I did on-line research when first diagnosed, I read about grading and staging, but the pathology report from my first TURBT did not at all use that language so I had no idea what it meant. Also, in the path reports there is a major difference between \"muscle tissue is not identified\" (i.e., uro did not go deep enough to get a muscle sample)and a statement that cancer cells are not identified in the muscle tissue (i.e., it's not muscle-invasive). How about publishing some typical path reports with \"translations\" that convey to readers how the reports relate to grades and stages, and to expected outcomes?\n\nRegarding treatment, if a single dose of Mitomycin C now seems to be highly recommended after TURBT, why do many uros still not use it (mine included)? (After my second TURBT, 2 years after my first, I had done some research so asked about Mitomycin and was told they only used it for patients who couldn't tolerate BCG.)\t\t\t", "date": "2009-07-02T14:43:20+00:00", "topic": "5 things I wish I knew at dx?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBecause they try to keep you as close to a 3-month interval as possible for cysto check-ups, after the first 6 weeks of BCG the cysto would in fact be about 6 weeks later.  When you get to the maintenance BCG, which is 3 weeks long, the next re-check would be approx. 9 weeks after the end of the 3 weeks BCG.  The re-check cysto also has to be timed with the next BCG in mind, as they like to wait at least a week between the cysto and the next round of BCG.  It sounds confusing,   but now that I'm into it I think I have the hang of what's happening in terms of timing. (So far I've had the 6 weeks BCG, last August-Sept., recheck in December, 3 weeks maintenance January, now scheduled for a recheck around April 1, then a week after that another 3 weeks maintenance.)\n\nAnn\t\t\t", "date": "2009-03-25T22:11:16+00:00", "topic": "Timing for recheck cysto following BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats!  Hope you have gone/will go out to celebrate. We'll be looking for news on how the BCG goes (there seems to be a big \"club\" of us here doing maintenance BCG).\n\nAnn\t\t\t", "date": "2009-03-17T22:04:15+00:00", "topic": "Good report", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news. Time to celebrate!\n\nAnn\t\t\t", "date": "2009-01-01T06:00:03+00:00", "topic": "Cysto Scorecard", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWonderful news.  Happy (ALL CLEAR) holidays!\t\t\t", "date": "2008-12-19T11:52:14+00:00", "topic": "good news today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMaybe we should start a cysto schedule club here.  My next one is on January 5th.  Good luck to all you December folks!\n\nAnn\t\t\t", "date": "2008-12-11T04:13:55+00:00", "topic": "It has been a while since I been here", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFrom these posts, it looks as though there are people whose doctors are moving them to cystos every 6 months after one year of all clear 3-month check-ups. Or, am I misreading the posts? My doctor does cystos every 3 months for two years, before switching to every 6 months for the next 3 years, then annual after that (assuming all clear all that time). I thought this was the standard. I was unfortunate enough to have a recurrence at exactly the 2-year mark from the initial tumor (low grade, non-invasive), just when I was looking forward to going to check-ups every 6 months. So, as of June 2008 my 2-year clock started all over again, and I'm still on 3-month cystos.  (Plus, the BCG protocol for about 3 years.)\n\nAnn\t\t\t", "date": "2008-12-09T21:19:37+00:00", "topic": "Good news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had an initial small papillary TCC tumor (low grade, non invasive) in 2006, then a recurrence (2 tiny ones, same type, stage and grade) in 2008. Finished 6 weeks of BCG in mid September, and go for cystoscopy the end of October, then maintenance BCG in December. I'm by nature an optimistic person, and though I was disappointed in the recurrence, I was glad it was the same type, and that there was a relatively long interval between the first diagnosis and the recurrence. As others have said, in spite of high recurrence rate, blc is very treatable.\n\nIn some ways, I try to think of it the way I would low grade skin cancer, though the checkups are certainly more unpleasant! After my first diagnosis and treatment, I generally went in for my 3-month check-ups with the assumption that there would NOT be a recurrence, and of course the more all-clear checkups I had, the more optimistic I got. Because of this optimism, I was perhaps more upset at the recurrence than I would have been if I had been more pessimistic. However, I've adjusted to the \"new reality,\" and am resigned to several years of  BCG maintenance. I had been looking forward to shifting to 6-month check-ups, but as someone else said, better to have to put up with frequent check-ups and to sty on top of any recurrences.\n\nWhen I first met my urologist, he did say we would get to know each other very well, and he wasn't kidding!\n\nAnn\t\t\t", "date": "2008-10-10T16:15:01+00:00", "topic": "Worried about recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClaudia--\n\nGlad to hear the good news on your Dad's biopsy, and hope the second one comes out equally well. I'm sure you folks can have a happy thnaksgiving now!\n\nAnn\t\t\t", "date": "2008-11-24T00:52:22+00:00", "topic": "nervous about dad\\'s turb on tuesday", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can relate to both sides--child and parent.  My dad had bladder cancer when he was in his 70s, back when the treatment was just removal of the tumor (no BCG or mitomycin yet). He had one recurrence, and of course we were all worried to pieces. As it turned out, that was all he had, and he died in his 80s (from metastisized lung cancer, unrelated to the blc, but related to smoking); he had been clear for some time of bladder cancer, and was on just annual blc check-ups at the time of his death. I had a first tumor in May 2006, lowgrade & non-invasive, removed via TURBT. At the two year mark this past June, the urologist found 2 even tinier tumors (pinhead size), which he removed. Now I'm on BCG, and have had one all-clear check-up since the initial 6 weeks of BCG.\n\nIn terms of what the urologist says he sees in your Dad, as others have said there are other possibilities besides a new tumor, including changes due to the BCG itself. I forgot if you've mentioned it, but how long was it from the time of the last BCG treatment to the current cystoscopy? Some people's bladders react more strongly, and the lining can stay abnormal-looking for awhile. And, as others have said, even if it's the start of a new tumor or other abnormal cells, it sounds as though the urologist is right on top of it.  I'm afraid with bladder cancer, it's generally not a question of \"if\"  you are going to get recurrences but \"when\", how many, and what type. I'm resigned, and so long as any recurrences I have are the same type and grade, there are not a lot of tumors, and the interval between recurrences is not too short, I'll be happy (and if something changes, I'll deal with that when the time comes).\n\nBest of luck to your Dad.\n\nAnn\t\t\t", "date": "2008-11-11T00:20:30+00:00", "topic": "having a bad day", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLadyJane and Moon--\n\nWelcome to the forums. I've found information here to be very helpful, and the people are extremely kind, knowledgeable, and supportive. I'm a \"neighbor, so to speak (Maine). It sounds to me as though there may be a different \"standard\" BCG protocol in Canada than in the U.S.  I'm on the \"Lamm\" protocol, with an initial 6 weeks of BCG, then 3 months later 3 weeks of maintenance, 3 months after that another 3 weeks of maintenance, then 3 weeks maintenance every 6 months, out to 3 years from the start. I believe it's a total of 30 BCG instillations.\nblcwebcafe.org/drlammsprotocol.asp\nSo far I've just had the first 6 weeks with 3 weeks scheduled for January; I was all clear on my scope last week, after completing the 6 weeks in mid-September. However, my urologist said if I had recurrences during this 3-year period while on BCG, we should consider other options. BCG+interferon may be an option if recurrences are continuing while on the regular BCG schedule. Mitomycin is another option. I'd definitely check out other treatment options in face of such frequent recurrences.\n\nAnn\t\t\t", "date": "2008-11-02T17:48:22+00:00", "topic": "BCG Failure", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI understand that the issue about flu shots was not so much side effects, but whether the interaction of the flu shot and the BCG might render one or the other less effective. I seem to recall that having a flu shot while receiving BCG made the flu shot less effective (something related to the immune response induced by the BCG?).\t\t\t", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI know there had been a discussion in one of the forums here about BCG and flu shots, so thought I'd pass on what I just learned. When I was at the urologist today I asked about timing of flu shots. I'll start 3 weeks of BCG maintenance in early January, and had finished the 6 weeks in mid-September. He said that it was OK to have a flu shot 2 weeks after completing a cycle of BCG, or up to two weeks before starting a cycle. So, if I get one this week or in November I'll be fine.\n\nAnn\t\t\t", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFirst, I'm very happy to hear about the all clear.  About the skin cancer -- My husband had a similar cancer on the back of his ear removed via conventional surgery, but it recurred within a year, so his dermatologist sent to him to another specialist who does the Mohs procedure. The Mohs worked like a charm, and he's had no further problems. You are right about it being a \"subtle\" type of skin cancer -- my husband's initial manifestation was a  tiny red line that didn't heal, and the recurrence was just a rough slightly itchy area near the scar from the first surgery. Best of luck with your procedure.\n\nAnn\t\t\t", "date": "2008-10-20T22:29:10+00:00", "topic": "Good News &amp;amp; Bad News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI wonder if it makes a difference if you get the flu shot during or shortly after the BCG treatment, as opposed to having already had the flu shot before starting treatment as you did Nix? I just finished my first 6 weeks of BCG in mid-September, so assume a  flu shot some time in November might be OK, but SaraAnne has me wondering. Assuming my late October cysto is OK, my first 3 weeks of maintenance BCG will be in December.\n\nSorry to hear of your diarrhea, SaraAnne.  Given how busy I know I'm going to be in December, I sure hope my 3 weeks of maintenance is as uneventful as the initial 6 weeks -- but I do remember you mentioning you had also sailed through the 6 weeks, so I'm not counting my chickens!\n\nAnn\t\t\t", "date": "2008-09-30T18:25:32+00:00", "topic": "BCG and the Immune System", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSaraAnne--\nI also recently had an experience with BCG running out,which my uro thinks may have been due to defective tubing. I knew the catheter was all the way in, and the instillation had just started when I felt it running out, so only about 1/4 or less of the BCG had been used. The nurse who was doing the instillation (my 5th in the 6-week series)felt terrible and went to got the Dr. right away, but first cleaned me up really well, and also inserted a betadine swab in my female \"lower regions,\" which the Dr. had told her to in a case such as this. The Dr. said it was OK to do a full instillation after this, which he did, as not much had been used in the first batch, and it seems as though most ran out.  The nurse called me later in the afternoon to check up on me, as she said she'd worry about me all weekend otherwise. I had no ill effects at all from this episode, though did wash up again when I got home to be on the safe side.\n\nI have my next cysto at the end of Oct., then 3 weeks maintenance starting in early Dec. Hope I steer clear of the symptoms you had! \n\nPlease let me know what you find out about flu shot timing.\n\nAnn\t\t\t", "date": "2008-10-04T00:03:19+00:00", "topic": "The perils of BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSusan--\nI'm probably about at more or less the same point you are in terms of bladder cancer, so can't really speak from years of experience. Maybe I'm overly optimistic (or self-delusional) but right now I truly believe I'm going to live a full and long life in spite of having bladder cancer (granted, I'm already 65, but I'm otherwise very healthy and have long-lived family members on both maternal and paternal sides). Not to play amateur psychologist, but I think one's personality (and support system) plays a role in how one reacts to cancer. All of us have times when we feel blue, angry, frustrated with having blc. But, my own way of coping with illness or other \"bad\" things happening in my life or my family's life is to try to cope with it and move on as if it wasn't there, at least on a day to day basis. Again, it's perhaps easier for me to do this as my cancer is (knock wood) the \"best\" kind of blc one can have.\n\nMy dad had blc in his early 70s (was a smoker), had one recurrence at some point, then was all clear until his death at age 84 from unrelated lung cancer. This was back in the days when the only treatment was TURBT.  When I had my first tumor in 2006 (low grade, non invasive), I got it in my head that I was going to follow in my dad's footsteps. Therefore, I was really shocked (and mad) when I had a recurrence of two tiny (pinhead size) tumors at the 2-year point. I was more upset then than I ws at the time of the initial diagnosis. My uro has put me on the BCG protocol (6 weeks, just completed, no side effects), with maintenance therapy thereafter. I read all I could, and questioned whether I really needed BCG at this point for low grade tumors which hadn't showed up until 2 years after the initial tumor. I called my cousin, who is a research radiologist specializing in the urinary tract to ask him what he thought. He said that the BCG was not a bad idea now, as the new tumors were in different parts of the bladder, and neither was in the same place as the original one. He said, \"What this shows is that your bladder lining wants to grow tumors.\" Both he and my uro refer to these low grade papillary tumors as \"nuisance cancers.\"\n\nAlthough I was initially hesitant about the BCG, my feeling right now is that if BCG can indeed slow up the rate of recurrence (so I won't need too many TURBTs in the near future) and if it reduces the likelihood of progression, I'm all for it. On the other hand, if my uro (like yours) had said \"let's wait and see,\" after removing the two new tumors, I'd have been perfectly OK with that as well.\n\nI guess my advice to you is to go with what your uro is recommending for now. If you have a recurrence in the near future (3 months, 6 months) or if a recurrence is different than what you've had (bigger, more tumors, different grade or stage) then definitely another course of action should be considered.  I think there's some research that suggests that immediate TURBT or \"zapping\" may not be warranted for single small, low grade papillary tumors, but just \"watchful waiting.\" (Repeated TURBTs and fulguration can do damage to the bladder, and possibly in the long run reduce the capacity to hold urine.)\n\nFinally, helpful as this Website and forum are, I think you can get yourself overly worked up by reading about dire things happening to others. Those who are chugging along without invasive or metastatic cancer, not having recurrences, or getting an occasional recurrence and having it treated, are way less likely to be active participants on the forums. Statistics are in your favor (and mine), but it's much harder to relate to statistics than to personal stories; and certainly a number of the folks on this forum are living with (or have gone through) some pretty serious stuff.\n\nAnn\t\t\t", "date": "2008-09-20T16:17:05+00:00", "topic": "I need input from you all", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm glad to hear your procedure went well.  Did you ask your urologist about doing a biopsy? Or, did he  just \"zap\" without taking a sample first? Although it costs more to have the biopsy and pathology report, I feel a lot better knowing that this is done (maybe easy for me to say, since I have insurance and just a $20 co-pay for the in-office procedure).\n\nYou mention that your procedure was costly. If you do not have insurance, some doctor's offices are willing to charge patients on a sliding scale based on income. It might not hurt to ask. If you do have insurance, some insurance plans will pay for procedures done in the hospital (outpatient surgery) and won't pay for the same thing if done in the doctor's office.  Since it's more expensive to have procedures done in the hospital, I can't understand why companies would do this. Our healthcare system is surely in need of a major overhaul!\t\t\t", "date": "2008-09-09T22:35:11+00:00", "topic": "hi again", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOK--I asked the nurse at my uro's office today where they were getting their mitomycin, and mentioned that some of you folks posting in these forums mentioned that your doctors were having trouble finding it. She did say that there had been a shortage for awhile, and that they had switched distributors. The brand they now have is \"Novaplus.\" She kindly looked up the invoice for their recent order,and it's from: Florida Infusion, 1053 Progress Court, Palm Harbor, FL 34083. There wasn't any phone number on the invoice, but it shouldn't be hard to find.  Hope this is helpful.\t\t\t", "date": "2008-08-30T01:22:21+00:00", "topic": "Mitomycin Availability", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've been getting BCG (last 6 week treatment this Friday-YAY), but I see bottles labeled mitomycin at my uro's office (in Maine) so he obviously is not having trouble getting it.  Would anyone like me to ask at the office where they are ordering the mitomycin?\n\nAnn\t\t\t", "date": "2008-08-30T01:22:21+00:00", "topic": "Mitomycin Availability", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAdding my voice to those advising you to seek a new urologist. For what it's worth, I just recently also had two tiny (\"pinhead size\") new tumors, after being clear for 2 years since an initial tumor. My urologist did biopsy on one, and removed both via fulguration; and, because of the recurrence, he's started me on BCG, even though the initial tumor and the 2 new ones were all low grade and non-invasive. You mention that you've already had some BCG treatments.  Are you on the BCG maintenance schedule now? (as recommended in Dr. Lamm's protocol)? If you are having recurrences (even low grade ones) while on BCG, I think there are some other things that can be tried, but I'm a \"newbie\" so am not sure what these might be. I do know that some of the literature suggests that BCG does not work as well for low grade tumors as for higher grade ones and CIS, but my urologist is nonetheless using it on me.  (Maybe I need a second opinion too!)\n\nBest of luck, and hope you can get some answers and get set up with someone who you can continue with long-term. My urologist said to me when I was first diagnosed, \"We're going to know each other for a very long time.\"  I think he was mainly trying to reassure me that low grade bladder cancer is very treatable.\t\t\t", "date": "2008-08-20T21:08:27+00:00", "topic": "cannot go on right now", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBarb--\n\nThat's fabulous news! Now you can focus on your upcoming move with a lighter heart.\n\nAnn\t\t\t", "date": "2008-08-12T00:56:36+00:00", "topic": "Wonderful news.......I\\'m clean", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHope all went well today. You've already been through a lot, so hopefully things will run more smoothly for you, and you'll have many \"all clear\" check-ups ahead.\n\nAnn\t\t\t", "date": "2008-08-11T01:09:12+00:00", "topic": "3 month checkup tomorrow", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCynthia--\n\nThat was extremely well put, and I hope those who have been reluctant to post will do so. My blc is in the category of non-invasive and low grade, but I found this forum and started posting just recently when I had a recurrence. Therefore, I agree with you that those who post are in some ways a self-selected bunch and don't necessarily represent the full gamut of bladder cancer survivors. Truthfully, I still don't have my head around the notion that I'm a blc survivor.\n\nThe other day I was driving somewhere by myself for a couple of hours, listening to nice classical music, and getting extremely melancholy, thinking about my children, future grandchildren, leaving everybody, etc. I realize that one of the things making me melancholy was that I've been reading in all the threads, invasive, metastatic, etc. I don't know how many others are like me, but I tend to over-research on medical issues (for anyone I know, not just myself).  I prefer to know what might be in store, even if it's unlikely.  I now realize that I may have been putting an undue burden on myself by reading all the threads so closely.  For those of us with non-invasive and/or newly-diagnosed blc, maybe it would be better to focus our posting and reading more on \"our\" threads, and the types of worries and questions and feedback we can offer to those who are at the same point in the bladder cancer \"journey.\"  Fortunately, many of us will never move to one of those other \"roads\" down which others here have traveled or are traveling. And the folks with invasive blc likewise may not want to dwell in the land of the mestastatic just yet.\n\nI've posted in the past on the ACOR blc e-mail list, and, while I like the set-up here better than there, some of the new folks here might want to look into that venue as well for posting questions and concerns. I know some of the people here are on there as well, including you (Cynthia). In fact, I think I found this site from something posted in the ACOR list.\n\nKeep up the good work--you're doing a great job, and are addressing people's concerns very quickly as they come up.\n\nAnn\t\t\t", "date": "2008-07-28T16:47:50+00:00", "topic": "Posting concerns", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLauren--\nI ran across something in my searches that related to insurance and bladder cancer.  If you do a search on something like \"insurance underwriting and bladder cancer,\" you might turn up something.  People with low grade, non invasive papillary tumors are apparently not considered high risk by insurance companies, at least from a mortality point of view. I think even for health insurance, if there's been a fairly long period since the last recurrence, coverage should not be a big problem -- but I'm no expert, so you'd need to check on that. My urologist did say that bladder cancer is considered one of the post treatable (non-fatal) cancers, but also one of the most expensive because of the need for lifetime monitoring, and the high rate of recurrence.\n\nMarne--\nI think I'm most likely going to go ahead with the BCG, as recommended by my urologist, though I haven't spoken to him since the surgery last week and the receipt of the pathology report. He said BCG couldn't be started for at least 2-3 weeks to allow healing to take place\n\nAnn\t\t\t", "date": "2008-07-16T13:15:33+00:00", "topic": "Recur after 2 years \\&amp;quot;all clear\\&amp;quot;", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDave--This will be my first 6-week course of BCG, as the first tumor was small, low grade, and non-invasive so BCG was not recommended 2 years ago. Even though the 2 new growths were of the same type, apparently just the fact of having a recurrence is setting me on the BCG \"path.\"  I like your idea of doing the BCG in the morning, so you can hold off on liquids from the night before up until the treatment and hence be able to hold the solution longer. I was figuring I might try for Friday mornings, and if I end up with side effects or not feeling well, I can have the weekend to recuperate. I'm fortunate to have a flexible job and plenty of sick time. And,I tend to be pretty \"hardy,\" not prone to undue pain or illness, and have no other complicating disorders (except for my age, which is 65), so I'm just going to hope/assume that I will get through BCG just fine.  Power of positive thinking!\t\t\t", "date": "2008-07-07T20:37:43+00:00", "topic": "Starting BCG next week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDave--\n\nThanks for sharing your experiences. I just had a first recurrence after my initial tumor 2 years ago, 2 tiny low stage non-invasive \"bits,\" same stage and grade as the initial small tumor.  Uro recommended BCG because of the recurrence, so I'll be following close behind you on the BCG schedule. I had the tumors out last week and he said I needed to wait 2-3 weeks before starting the BCG. I'm working full time, and will be teaching a course (college) one day per week this fall, so have to figure out how to schedule the BCG to be least bothersome in terms of my work schedule. (I'm pretty flexible in my job duties, so other than the teaching day, I can work at home if I have to--assuming I feel up to it!)\n\nBest wishes for a continued uneventful BCG experience.\t\t\t", "date": "2008-07-07T20:37:43+00:00", "topic": "Starting BCG next week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGeorge--\nSo happy you've joined our April all clear club.  And hopefully next year at this time we'll be in the one-year check-up group!\n\nAnn\t\t\t", "date": "2012-04-13T16:55:06+00:00", "topic": "Friday the 13th", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm so glad to hear your good news, Herb.  Isn't it great to think you have a whole year ahead with no check-ups?\n\nAnn\t\t\t", "date": "2012-01-20T00:41:58+00:00", "topic": "16 Months Cancer Free", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWonderful news!  Your cautious young doc may have caused you anxiety, but better safe than sorry.\n\nAnn\t\t\t", "date": "2011-11-27T21:13:42+00:00", "topic": "Here we go again, or not?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had urine cytology (looking for cancer cells in the urine) done when I first had bleeding, as part of the diagnostic workup looking for bladder cancer or other possible cause of the bleeding; they also checked then to see if there was a bladder infection. However, I was told even at that time that cytology rarely shows anything in the case of low grade tumors.  Because my initial tumor, and later recurrence, were low grade non-invasive tumors, they've never done cytology again, as cystoscopic exam is the best way to keep on top of things.\n\nThere is another type of diagnostic test, which I know numbers of people here get, called FISH for short; I believe it checks for specific celluar DNA changes associated with bladder cancer. This is supposed to be more accurate than \"conventional\" cytology.\n\nAnn\t\t\t", "date": "2011-11-18T04:19:36+00:00", "topic": "Test for cancer cells in urine", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo glad to hear the good news George! And all the snow ended up our way (Maine). We got over 12 inches where we live. To make maters worse, our plow guy accidentally plowed up a big hunk of the asphalt in our driveway, out where it hits the street, and then proceeded to plow up part of the lawn.\n\nI go for my 6-month cysto later this month, and hope (plan) to join you in the good news group.\n\nAnn\t\t\t", "date": "2011-03-29T14:51:22+00:00", "topic": "Two and One Half Years! Not 2 1/2 men", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCathereine--\n\nThat's wonderful news, and I'll bet your Thanksgiving will be that much happier!  In terms of schedules for check-ups, the usual cystoscopy protocol is every 3 months for two years; if all continues to look good, then it's every 6 months for 3 years, then yearly after that. If you're just on your 3rd 3-month cysto, you aren't yet to the one year mark. I guess 4 months to the next is OK, but I'd be hesitant to go to the 6-month schedule after just a little over a year. Maybe you could ask your uro next time why he thinks you could go to 6 months.\n\nAnn\t\t\t", "date": "2010-11-24T00:35:46+00:00", "topic": "A+ Cysto Report Card", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy cousin is a very senior radiologist specializing in the urinary tract, and he's at Columbia Presbyterian, and on the staff at the Medical School. Want me to ask him?\n\nAnn\t\t\t", "date": "2010-03-30T14:26:38+00:00", "topic": "post surgical testing", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSounds like your son is on the road to an uneventful recovery. Trip to Switzerland with the scouts sounds like fun! Our son is feeling much better, no more pain medicine needed, but still on oral and topical antibiotics to be on the safe side; he went back to work last Friday.\n\nAnn\t\t\t", "date": "2009-07-20T14:55:08+00:00", "topic": "CT scan", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSo glad to hear things are going so well right now, and hope Cynthia continue to heal uneventfully. It's just unbelievable that she's out of the hospital so fast. How long will you folks stay in your Chicago before heading home? Please send Cynthia best wishes from me (a fellow New England resident) and tell her she's not missing any good weather here! \n\nAnn\t\t\t", "date": "2009-01-26T14:13:46+00:00", "topic": "Ed and Cyndi’s excellent adventure in Chicago", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnne--\nThat does indeed sound like good news, if anything about cancer can be considered \"good.\"  At least you'll have a much bigger crowd of fellow survivors with the breast cancer than you do with the blc. (Here in the U.S. we have all kinds of funding, support and community awareness for breast cancer, and none to speak of for bladder.)\n\nBest of luck with the additional surgery.\n\nAnn\t\t\t", "date": "2008-10-30T21:42:43+00:00", "topic": "Latest update.....................................", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations on the good news! Some years ago when I was being evaluated for an upcoming hysterectomy (fibroids, not cancer, fortunately) they spotted what looked like an ovarian cyst on the scan.  Since I was already in my 50s, they said it was best to have ovaries out as well as uterus.  When they operated -- lo and behold, no cyst. If you are not totally past menopause, apparently some things that look like cysts on scans are just normal monthly swelling of egg follicles (some are larger than others) and they don't show up on repeat scans.  And, my sister-in-law when she was in her ate 30's had what looked like a cyst but was in fact found to be just extra tissue from her having endometriosis.\t\t\t", "date": "2008-07-16T14:36:01+00:00", "topic": "Relief - for now anyway!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLike others, Mike, I don't know what to say. You are truly an inspiration, example, and guiding voice for us all.\n\nI hope you and your family might like this poem, which reminds me of you. It was written by Theodora Kroeber, a novelist and poet and daughter of one of the 20th century's most influential anthropologists, Alfred Kroeber. Kroeber had taken under his wing one of California's last \"wild\" Indians, Ishi, who came down out of the hills in N. California at age 49, when the last of his little band had died. Ishi lived out his days (5 years) in a building on the Berkeley campus where Kroeber was on the faculty. en.wikipedia.org/wiki/Ishi  This poem is written in the \"voice\" of Ishi.\n\nPoem for the Living\n\nWhen I am dead\nCry for me a little.\nThink of me sometimes\nBut not too much.\nIt is not good for you\nOr for your wife or your husband\nOr your children\nTo allow your thoughts to dwell\nToo long on the Dead.\nThink of me now and again\nAs I was in life\nAt some moment\nit is pleasant to recall.\nBut not for long.\nLeave me in peace\nAs I shall leave\nyou, too, in peace.\nWhile you live\nLet your thoughts be with\nthe Living.\n\n—Theodora Kroeber\t\t\t", "date": "2014-03-28T18:07:28+00:00", "topic": "Progression of mets faster than expected", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tMike--\n\nI've not been through chemo, but have been following the blog postings of a young woman with leukemia that are posted in the NY Times (\"Life Interrupted\").  She had a very interesting piece a while back about food, and mentions that associating certain foods with chemo makes them very unappealing. later(similar to what Cynthia wrote here about chicken and spinach). She therefore says she tries \"not to mix nausea and my favorite foods — because I have found that it confuses not only the taste buds, but also the emotion and memory of eating itself.\" well.blogs.nytimes.com/2012/12/13/life-interrupted-my-mothers-cooking/\n\nWishing you the very best in your onward journey, hopefully back to full recovery.\n\nAnn\t\t\t", "date": "2013-03-12T13:03:03+00:00", "topic": "Ready.....Set....", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tAnne, as others have said, I'm at a loss for words. You are one of the first people I \"met\" here, and one of the first with whom I chatted. When I read your news, all I could think is IT'S NOT FAIR! You are too young, you have fought so hard, gone through so much. You mean so much to the community here, and I'm sure to your family and all who know you. I wish you comfort, peace, and the best and most meaningful experience in the time that remains to you.\n\nAnn (the other one, without the \"e\")\t\t\t", "date": "2010-06-24T21:39:52+00:00", "topic": "Update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nwww.nytimes.com/2008/08/19/health/19brod.html?_r=1&em&oref=slogin\n\n\"In Cancer Therapy, There Is a Time to Treat and a Time to Let Go\"\nBy JANE E. BRODY\nPublished: August 18, 2008\n\nAlthough I myself am not facing any treatment decisions of the type reported here, I thought this article might be of interest for some of you. I hope this link will open up without you having to sign up for the NY Times online (which is free).\n\nI well remember when my Dad had lung cancer, for which he was fairly successfully treated with chemotherapy and had a good year, with good quality of life, following the treatment. However, it had metastasized to his liver, and after just a couple of new rounds of chemo they stopped and told him he wasn't strong enough for more \"right now\" (which I think was not true, but was a way of stopping without having him give up hope). Ironically, he'd had bladder cancer over 10 years earlier, with just one recurrence, and was down to bladder check-ups once a year when he died of the lung cancer (age 84). I'm sure his many years of smoking was a major contributor to both the bladder and the lung cancer (though for what it's worth I never smoked and have bladder cancer).\n\nAnn\t\t\t", "date": "2008-08-19T15:37:47+00:00", "topic": "NY TImes article about cancer treatment", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI'm no medical person, but my impression is that there's been a fair amount of progress in the last 20 years in treating bladder cancer. I think the immune-stimulating treatments (BCG, mitomyicin) have been increasingly refined and work well in certain kinds of instances. i think newer diagnostic procedures are also helpful (e.g., FISH, which I've never had). I've not had to have a stent, but did seem to have a very \"reactive\" bladder in terms of spasms for the first couple of years when I had 2 TURBTs and of course the 3-month cystoscopies. The Dr.'s office gave me anti-spasm medication to take before my check-ups, plus I took over the counter pain meds; both seemed to really help, and eventually I got to the point where the discomfort was really minimal. My innards got used to all the prodding I guess!\n\nIn terms of bladder sparing, I'm not sure there's much new that could logically be done. Once the cancer is invasive, the bladder has to come out, and I don't foresee that changing. Unless there's metastasis, I think the survival rate after that is very good. New types of reconstruction have been developed, when before the only alternative was the external bag.\n\nI do agree wholeheartedly that bladder cancer doesn't get the respect it deserves form the general public. I know I shouldn't get annoyed, but the constant fund-raising and drum-beating about breast cancer gets a little old.\n\nHope things look up for you.\n\nAnn\n\nP.S. My dad had bladder cancer too, with one recurrence, back in the late 1970s-early 1980s. He lived 10 more years (age 84) with no more blc recurrence and died of something unrelated to the bladder cancer.\t\t\t", "date": "2014-01-28T19:41:14+00:00", "topic": "Does stent after TURBT spread cancer cells", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tNever smoked, never worked with dyes. However, my dad had bladder cancer when he was in his 70s and was a smoker. He had one recurrence but was up to annual checkups at the time he died at age 84 due to lung cancer (unrelated to bladder cancer except for the connection of smoking to both). Both my parents smoked and I was exposed to second hand smoke growing up and of course later as well since there was smoking was everywhere back in the \"old days.\" Had first tumor when I was 64. How about you? Smoking? Family history?\n\nWhere we are in Maine: I'm in Bangor and we have family in Portland.\n\nAnn\t\t\t", "date": "2013-11-14T02:11:37+00:00", "topic": "3rd time for surgery", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tAnnie--\n\nI'm very glad to hear your good news. Best wishes for continued good results in the future, and good luck with the BCG. I've recently completed the full course of BCG treatments, and have posted here about it. If you want to contact me via private message, please don't hesitate to do so.\n\nI've been taking Oncovite for a couple of years, but not in the high doses sometimes suggested. I generally only take one per day. I was a bit leery of taking larger doses of it in light of literature on the potential side effects of \"mega\" doses of some vitamins. I just consider it as a \"souped-up\" version of a multivitamin, and figure it can't hurt and might help. I've been purchasing ot online at reasonable cost from drugstore.com as it wasn't available at local pharmacies in my area.\n\nAnn\n\nP.S. I'm called Annie by a few people. Ann and Annie aren't common names these days, but when I was in kindergarten (back in the dark ages!) there were four of us named Ann in my class of about 25 kids.\t\t\t", "date": "2012-01-06T19:05:15+00:00", "topic": "How lucky can a gal with BC be?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI can well understand your frustration, and the delay can certainly be worrisome when you want a diagnosis. However, I think it is quite normal for urologists to have a meeting with you first, to go over your prior test results with you and discuss your situation. I, too, wondered why the cystoscopy wasn't scheduled for my first appointment. I'm not sure how busy your urologist is compared with mine, but I WILL say that the cystocopy was scheduled only a week or so after the time of the first appointment. One thing the urologist wanted to discuss with me was whether he might want to do a biopsy at the same time, which he decided he wouldn't do after going over my test results.  And, the TURBT surgery to remove the tumor he verified on the cystoscopy was scheduled a few weeks after the cysto.\n\nBut by all means seek a second opinion if you aren't thoroughly satisfied with the way you are being treated.\n\nGood luck!\n\nAnn\t\t\t", "date": "2011-11-30T00:35:06+00:00", "topic": "Lots of ????\\'s...", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tPat--\nAlmost everyone in the world except the U.S. writes dates with day-month-year format, so his aunt's surgery will be Dec. 7.\n\nAnn\t\t\t", "date": "2010-12-02T11:03:19+00:00", "topic": "Surgery or Chemotherapy is for Bladder cancer", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tNancy--\n\nThe spray bottle is a great idea! Did you come up with that yourself, or did someone recommend it?\n\nAnn\t\t\t", "date": "2010-03-31T15:52:25+00:00", "topic": "Woman cleanup after BCG", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tHaving not had a RC, I can't comment on what some of you gals have experienced, but I did have a total hysterectomy (uterus and ovaries) back in 1995 (becasue of bad fibroids and heavy bleeding, not cancer). I've experienced some of the same things you report, due to the sudden \"menopause\" and anatomical changes. I did take estratest (estrogen with a small amount of testosterone)and that helped some symptoms, though not libido. I stopped taking it about 5 years ago, as I'd been on it for almost 10 years and had turned 60. So, now I just use topical estrogen cream. Have any of you tried that? Works for dryness, and I think some may absorb through the skin as well to give some systemic benefit. I'm fortunate to have a supportive and young-for-his age husband to whom I've been married for almost 37 years, so I really feel bad for those of you who have been hooked up to such jerks.\t\t\t", "date": "2009-02-05T02:33:10+00:00", "topic": "Hold on gals til March l2th for that neobladder", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tWhile I've not been through anything like what you have, I found what you've written to be both moving and inspirational. I think others will as well.\n\nBest wishes for you in your \"new life\" after bladder cancer.\n\nAnn\t\t\t", "date": "2012-01-03T17:15:27+00:00", "topic": "I\\'ve Turned the Corner", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI've kind of wondered about having the well water at our summer home tested for arsenic, which is not uncommon in well water in Maine.  We've spent a lot of time there over the last 37+ years, including 2 years living there year round  There's a very high rate of all types of cancer in Maine, and a lot of people get water from wells. There's also a lot of naturally-occurring radon in homes.\n\nAnn\t\t\t", "date": "2012-10-01T16:49:21+00:00", "topic": "Arsenic and bladder cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI wasn't sure whether to post here or in chit-chit, as this isn't exactly earth-shaking. The article is in the NY Times Business Day section, under \"Media and Advertising\": \"A Feminine Approach to Incontinence.\" www.nytimes.com/2011/08/18/business/media/a-new-shape-for-incontinence-product.html\n\nAnn\t\t\t", "date": "2011-08-18T15:04:27+00:00", "topic": "new products for females", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tReally scary to contemplate.    ", "date": "2011-02-20T00:47:02+00:00", "topic": "Difference between Clinical &amp;amp; Pathological staging", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI caught the broadcast this evening--not bad. Featured one of old-time CBS newsmen (Bob Schiefer I think) who had bladder cancer 5 years ago; Schiefer noted his first symptom of blood in the urine, and that he'd been a heavy smoker. The voice-over mentioned that 50% of bladder cancer is associated with smoking.  Dr. Bochner from Memorial Sloan Kettering was on too, stressing the importance of early detection. The segment also stressed that people who've had RC can have reconstructions and lead entirely normal lives.\n\nGood publicity!\t\t\t", "date": "2010-08-05T01:35:27+00:00", "topic": "August 5, 2010 --CBS News With Katie Couric...BC", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tCynthia--\n\nI haven't yet read what you posted in the links, but why would anyone want to develop an \"incontinent\" urinary diversion? That sounds like an external bag to me, though apparently the route to the \"outside,\" so to speak, would be formed by something grown from one's own bladder cells. Is that correct? (Maybe I should read what you posted!)\n\nAnn\t\t\t", "date": "2010-03-23T20:15:17+00:00", "topic": "Trial doing RC using tissue  from your cells!!!", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tFYI, I went on the Website and could not sure if I met eligibility criteria or not; they mentioned being done with chemotherapy and radiation treatment as being a criterion, but I'm on maintenance BCG and wasn't sure how that fit in their scheme of things. You had to sign up and give personal information (which is to be maintained in strictest confidence) even to take the on-line screening survey. So, I instead e-mailed them to check about my eligibility -- told them I'd had one recurrence of BLC, was on maintenance BCG, and still getting checked every 3 months but soon to go to 6  months. They replied and said I did NOT meet eligibility criteria because of the recurrence and the fact that I'm still getting check ups. They didn't mention anything about the BCG, which in fact was what I thought might be a deciding factor. By their criteria, it would seem that virtually no one with BLC who stil has a bladder would qualify; after all, even people with no recurrences are still going to be getting checkups for the rest of their life (albeit some may be getting them annually).\n\nAnn\t\t\t", "date": "2010-03-16T15:32:16+00:00", "topic": "U of Hawaii internet based study", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tSolitary cystic cerebral metastasis from transitional cell carcinoma of the bladder\n\nwww.urotoday.com/index.php?option=com_content&task=view_ua&id=2227196\n\nArticle reporting a rare brain tumor metastisis from bladder cancer-with a good outcome.\t\t\t", "date": "2010-02-09T15:59:00+00:00", "topic": "Article: rare brain metastisis - attention Leigh", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tPat--\n\nThanks for posting. I subscribe to uro today so had already read that articles -- it is indeed quite eye-opening to have the need for second opinion so strongly confirmed.\n\nAnn\t\t\t", "date": "2010-02-02T19:19:48+00:00", "topic": "The role of CORRECT pathology in BLC", "subforum": "31-articles-of-interest"}, {"text": "\nwww.nytimes.com/2009/11/29/nyregion/29cancer.html?pagewanted=1&_r=1&partner=rss&emc=rss\n\nNice NY Times article about MSK rec. room. Might be a good idea for other cancer centers to have something like this as well.\t\t\t", "date": "2009-11-30T15:31:52+00:00", "topic": "Memorial-Sloan Kettering Cancer Patient Rec. Room", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI concur--very helpful presentation. If I knew my uro's e-mail address I'd send the link to him. If I ever need another TURBT I want to make sure he knows about the guideline for immediate instillation of mitomycin at the time of TURBT. I had asked him about this last year some time, just out of general interest (I was just having a check-up, not a TURBT), but was told they only used mitomycin as a longer-term therapy for those who couldn't tolerate BCG.\n\nAnn\t\t\t", "date": "2009-11-05T15:45:33+00:00", "topic": "AUA NY 2009 Management of non-muscle invasive", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHere's another version of the same story: news.yahoo.com/s/nm/20090803/hl_nm/us_cancer_bladder_cell_1 ", "date": "2009-08-03T23:30:45+00:00", "topic": "Scientists discover bladder cancer stem cell", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tSo true! I asked my uro about mitomycin after reading about a single instillation being used immediately after TURBT, and he said he did not do that, and used it only for those who didn't tolerate BCG. (I'd already had the TURBT a while previously, so it was just an academic question on my part.) If I need another TURBT, maybe I should get a little pushy about it.\t\t\t", "date": "2009-06-17T13:31:24+00:00", "topic": "Do US Uro\\'s Practice Evidence Based Medicine?", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tAs a \"Maina\" (Maine resident) I knew that Maine has the highest cancer incidence rate per 100,000. No one knows exactly why, but one htought is that we also have the oldest average age in the country.  I'd like to see age-adjusted incidence rates. There's los a high incidence of radon in Maine granite, and there's some suggestion that radon in people's homes may be a factor. (Radon testing is required for any real estate sale to go through, and there are ways to mitigate (by venting).\n\nAnn\t\t\t", "date": "2009-02-09T04:40:53+00:00", "topic": "incidence of BLC by States in 2008", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI know one case doesn't really count, since we're talking population statistics here, but my dad had allergies and also had both primary bladder cancer and some years later primary lung cancer. I think in his case both were caused by long-term smoking, which most likely over-rode any possible \"benefit\" of allergies. Interesting idea, nonetheless.  I wonder if people with auto-immune disorders (e.g., arthritis, lupus, etc.) might not be studied to see their incidence of bladder and related cancers.\n\nAnn\t\t\t", "date": "2008-11-12T00:52:18+00:00", "topic": "Allergies just may help prevent blc???", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tSounds like a great trip! I've been gone from the board for so long that I didn't even know you were gone, but a belated welcome back.\t\t\t", "date": "2015-10-03T17:29:48+00:00", "topic": "Back Home Again!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI can find what I think you mean by the breadcrumbs, but possibly they weren't up yet when you posted. There are a couple of purple bars (shorter ones, below the main header). The first purple bar has white print, and is the broad categories: Recent Topics, New Topic, My Topics, Profile, and Categories.  The next bar below that has blueish print, not easy to read against the purple in my opinion.  that is the breadcrumb bar I think you are looking for. For example, the one I see now has: Forum > Forum Threads > Chit Chat > Where are the \"Breadcrumbs\"? > Reply Topic.  Click on \"Chit Chat\" takes you back to that thread, click on \"Forum Threads\" takes you back to the list of all the thread categories.\n\nHope this helps.\n\nAnn\t\t\t", "date": "2013-02-04T01:52:22+00:00", "topic": "Where are the &amp;quot;Breadcrumbs&amp;quot;?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThis must be one heck of a big company. I received notices about this from THREE different companies I do business with, one (scarily) the one with whom I have my employer-sponsored pension plan. so far, I haven't actually received any scamming e-mails, so far as I can tell. (I have several different e-mail addresses for work and personal use.)\t\t\t", "date": "2011-04-04T17:30:01+00:00", "topic": "Be on the lookout for scam emails!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRocky--\n\nI live in Maine, so if you make it that far, maybe we could get together some place. I live in Bangor, so if you make it to Katahdin (end of the trail, Baxter State Park) we're not to far away; you'd go through Bangor on I-95 heading home!\n\nI cannot imagine doing that trek, and really admire you. I do know people who have done the trail in segments over the course of several seasons, so if you don't make it to Maine this year, maybe you wil next time.\n\nAnn\t\t\t", "date": "2011-02-16T03:31:53+00:00", "topic": "hiking the at trail", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThose are great! We just got done with our big multi-group Christmas concert (at the University where I work), and we always end with the Halleluja chorus. So, it was fun to see it in such an unlikely venue.\n\nAnd what a patient kitty. Our two would have been long gone.\n\nAnn\t\t\t", "date": "2010-12-08T20:52:08+00:00", "topic": "Best holiday videos I\\'ve seen so far ...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAn acquaintance is going through treatment for multiple myeloma (chemo, stem-cell transplant) and is going to have to spend a lot of time in relative isolation due to immune suppression. I think she's in the hospital for a total of 18 days right now, and then will at home with very little contact with \"outsiders\" right though until about December. She would prefer to keep an upbeat environment, and I'm wondering if anyone has any movie (or old TV show) recommendations to help her pass the time when she's feeling up to it? I know they've been watching old Mary Tyler Moore TV shows and like those.\n\nAnn\t\t\t", "date": "2010-07-13T16:59:34+00:00", "topic": "Movie recommendations needed (light,uplifting )", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI live in Maine. We don't live in any of the towns along the Appalachian Trail, but if you do get to Maine I'd love to meet you somewhere along the way and maybe even walk with you for a day or so. (Though I know I couldn't possibly climb Mt. Katahdin, which is the trail's end point.) I think September or early October would be a great time to be in Maine -- cooler weather, black flies and mosquitoes largely gone, and the start of autumn foliage. Spring tends to be wetter walking, and BUGGY!\n\nGlad to hear you don't need surgery, but what you have sounds pretty uncomfortable to me nonetheless.\n\nAnn\t\t\t", "date": "2010-05-10T02:52:59+00:00", "topic": "torn rotatorrcuff", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCongratulations! Are you going to post a picture for us to see? Julianna is such a nice name, too. My step-daughter is Julianna, and my step-son's daughter is Julianna.  (Julianna was my husband's grandmother's name and he has a niece named Melissa.)\n\nAnn\t\t\t", "date": "2010-04-11T12:36:38+00:00", "topic": "The new baby!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI had to chuckle at your post, though am sorry your internist has prostate cancer. My husband recently had to have a cystoscopy when he had some bleeding for about a day. We go to the same urologist, very nice guy. Hubby didn't even have to take his pants all the way off, had no discomfort, and was all clear. He kept his eyes open the  whole time and even  picked his head up to watch the proceedings. The urologist didn't have the TV monitor on, but offered to let my husband look in the scope to see how nice and clear his bladder was, which my husband did (male anatomy being what it is, and given the use of the flexible cystoscope, this was not difficult). I was jealous, because I still have some discomfort during cystoscopies and for a bit of time afterward (due to my own particular anatomy). \n\nAnn\t\t\t", "date": "2010-02-04T00:28:35+00:00", "topic": "A Physician sees the other side", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAnd hear! hear!\t\t\t", "date": "2009-12-24T16:00:14+00:00", "topic": "Miracles (I wish you hope)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJulie--\nRe clutter: Maybe we could start something the equivalent of a \"chain letter\" for clutter.   I'll come help you deal with your clutter, someone else will come help me with mine, etc.--a chain of \"decluttering\" across the country. Of course we'd each pay our own way to fly to different neat destinations around the country to do this, so it would be like a vacation. (Julie, you're in Arizona, right? I've always wanted to see Arizona.) Anyone for a trip to Maine? I'll treat for lobsters.  \n\nSeriously, I'm happy to hear your mom is doing OK.\n\nAnn\t\t\t", "date": "2009-11-06T07:07:42+00:00", "topic": "Stressed", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tStill thinking about H1N1 vaccine, anybody? I find the guidelines increasingly confusing. In part I think it's because there's a vaccine shortage, so there are higher and lower priority groups even among the high priority groups. So (1)cancer is on the list of conditions putting people into a higher risk category (so one would be on a higher priority for getting the vaccine), but (2)older folks (over 60 or 65) are being told not to get the vaccine now, cancer or no cancer. I have a friend in her early 60s who's been told she SHOULD get the vaccine now because she's diabetic.\n\nI did get the seasonal flu vaccine, and will wait on the H1N1 decision until I'm done with my maintenance BCG next week. (Maybe I'll ask the urologist what he advises.) Given that there's a major vaccine shortage, I'd just as soon let all the kids, young people and pregnant women go to the head of the line. The university where I work had a student clinic scheduled next week, and were expecting 6,000 doses; they've had to cancel, with no reschedule date, and only have enough doses to vaccinate those who self-identify as being high risk (pregnant, etc.).\n\nAnn\t\t\t", "date": "2009-10-07T17:49:58+00:00", "topic": "Pro’s, Con’s H1N1 your thoughts?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI think my flu immunity is pretty high, as I had the \"Asian flu\" (I think it was called) back in 1957-58 when I was in high school and I've never had any kind of flu since. I think that strain was H2N2, and it caused a major pandemic. I finally decided to start getting seasonal flu shots maybe about 10 years ago, but am not sure I really need the H1N1, at least not right away. By age, I'm in a low risk group (66).\n\nI have 3 weeks of BCG coming up, starting October 22, so I want to get through that before putting any more into my body.  (Last year, I had asked my uro about the seasonal flu immunization and BCG, and he said there was no problem having the flu shot while on BCG, but I think I got mine after I was done the BCG just to be on the safe side.)\n\nAnn\t\t\t", "date": "2009-10-07T17:49:58+00:00", "topic": "Pro’s, Con’s H1N1 your thoughts?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSince our photos disappeared with the changeover to the new site, I decided to upload the \"real me\" instead of our cat, which I'd had previously. (He's a lot cuter than I am, but I thought since I like seeing the faces of who's posting I'd out my mug up as well.)\n\nAnn\t\t\t", "date": "2009-09-19T00:38:36+00:00", "topic": "The \\&amp;quot;real me\\&amp;quot; as avatar", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tUnpleasant as diverticulitis is, at least you are on the mend and it wasn't as severe as you'd had previously. Having to drive yourself back and forth to the ER must not have been any fun, not to mention potentially unsafe!\n\nOn another topic, we had had some communication awhile back about Madison, WI. We had the pleasure of going out there in mid-May for our son and his fiancee's graduation (Ph.D.s in Psychology). It was a gorgeous weekend, and we had a wonderful time.\n\nHope your recuperation continues on an uneventful path.\n\nAnn\t\t\t", "date": "2009-06-09T06:07:45+00:00", "topic": "Home after 9 hours in the ER", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI sent this to one of my cousins who's a doctor (pediatric neurologist), and she loved it.  Here's what she said:\n\nI roared...... whoever said that sentence structure, or even spelling, was part of the entrance exam to med school?\t\t\t", "date": "2009-02-11T13:24:38+00:00", "topic": "As written on hospital charts by Doctors!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMy Dad, born in 1905, had bladder cancer when he was in his 70s. He served in the Army in N. Africa and Italy (field artillery) in World War II (actually from 1940-1945, since he was unfortunate enough to be selected in the first peace-time draft in 1940). He was a smoker, and I suspect that was a major contributing factor in his BLC. He only had one recurrence of the BLC, and at the time of his death at age 84 due to lung cancer (unrelated to his BLC), he had been clear of BLC long enough to be on annual check-ups. Since I, too, have BLC but have never smoked, I suspect there may be a hereditary component too.\n\nAnn\t\t\t", "date": "2009-01-13T17:42:13+00:00", "topic": "Bladder Cancer and Military Service", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI understand that the issue about flu shots was not so much side effects, but whether the interaction of the flu shot and the BCG might render one or the other less effective. I seem to recall that having a flu shot while receiving BCG made the flu shot less effective (something related to the immune response induced by the BCG?).\t\t\t", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI know there had been a discussion in one of the forums here about BCG and flu shots, so thought I'd pass on what I just learned. When I was at the urologist today I asked about timing of flu shots. I'll start 3 weeks of BCG maintenance in early January, and had finished the 6 weeks in mid-September. He said that it was OK to have a flu shot 2 weeks after completing a cycle of BCG, or up to two weeks before starting a cycle. So, if I get one this week or in November I'll be fine.\n\nAnn\t\t\t", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI just read that Tony Hillerman has passed away. He was the author of wonderful mysteries featuring Navajo characters and settings. I mention this because I just found out in the death notice that he was a bladder cancer survivor. His cause of death was respiratory failure. It sounds as though he remained active and writing in spite of several infirmities. news.yahoo.com/s/ap/obit_tony_hillerman\n\nAnn\t\t\t", "date": "2008-10-27T15:51:28+00:00", "topic": "Tony Hillerman: mystery author &amp;amp; blc survivor", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tZucchini Soup\n\n1 package Knorr's leek soup\n5 cups water (or 3 c water and 2 c chicken or vegetable stock)\n5 cups sliced zucchini (can add more if desired)\n1/4 - 1/2 cup chopped green pepper\n1/4 cup snipped or chopped parsley\n1/4 - 1 teaspoon curry powder\nsalt and white pepper to taste\n1 teaspoon sugar\n\nPrepare leek soup in 4-5 qt. pan.  Add zucchini, green pepper and parsley. Stir until boiling. Reduce heat and simmer, partially covered, for 20 minutes.  Pour into blender (or food processor), 3 cups at a time, and blend until smooth. Add curry powder, sugar, and salt and pepper to taste. Chill overnight if desired (tastes better if you do this).\nVariation:1 cup half and half before serving.\n\nFreezes well; defrost and blend again before serving. May be served hot or cold.\t\t\t", "date": "2008-07-28T01:09:27+00:00", "topic": "We cleared out the chat room talking recipes!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI'd better not even click on any link that may lead me to something addictive on line! I'm already \"addicted\" to poppit, and even to this ABLC Website, which I check several times daily these days. (But maybe I'll take just a leeeetle peek at the mini-golf site. . . )\t\t\t", "date": "2008-07-26T18:43:59+00:00", "topic": "Play 18 Holes Of Miniature Golf Online", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAbsolutely adorable grandbabies! I'll bet you spoil them (as grandparents should). Going to the beach with kids is definitely one of life's pleasures. I went to our nice town beach (here in Maine) yesterday with my sister in law while the guys played golf, and the water was actually warm enough to go in and stay in, which is rare for around here. Water temp was posted as being 64.\t\t\t", "date": "2008-07-20T11:44:23+00:00", "topic": "My grandbabies at the Beach", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tPeople in my family have also used craigslist pretty extensively for housing -- finding rentals, looking for real estate, etc.  Help wanted ads are sometimes very good leads. It even has discussion sections on various topics.  Here in Maine, we have a great little publication called \"Uncle Henry's,\" which is now online as well as in print.  It comes out once  week in print, and is cram full of all kinds of stuff to sell and trade, including even farm animals and such. I once managed to get rid of an old one-horse sleigh that a renter had left in the garage at my parents' cottage, and never retrieved, by advertising it on both craigslist and Uncle Henry's.\n\nI do think you can sometimes make more money by going online than by doing a yard sale, and you don't have to put up with the bother of standing around in the hot sun,haggling, dealing with unwanted \"early birds,\" etc.\t\t\t", "date": "2008-07-14T17:45:10+00:00", "topic": "Make Some Extra Money, Clean out the house", "subforum": "17-chit-chat"}]}