{"signature": ["Dx", "TURBT", "TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tFrozen, such a tough time for you.  Glad you are reaching out, and so glad your partner was looking out for you!  Since you are so young you may not get too many responses from people your age so you might also want to try the BCAN support group pages (also they have a wealth of good info on their site, and also a support type site called Inspire.  I am 66, diagnosed in April this year, still trying to find my way through.  Best to you.  Don’t forget to breathe!\t\t\t", "date": "2020-08-10T17:19:39+00:00", "topic": "New, Awaiting Pathology", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks sara Ann, that was my thinking but haven’t heard of anyone going there.  I have to travel from Alaska and any non-stop city will do so I was thinking Mayo.  They’re rated right after John’s Hopkins if I remember correctly.\t\t\t", "date": "2020-08-10T18:13:41+00:00", "topic": "Mayo docs", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI am a female, 66, researching options for RC.  Any experience with docs at Mayo in Rochester?\t\t\t", "date": "2020-08-10T18:13:41+00:00", "topic": "Mayo docs", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tSo glad you are following up on this!  Scary but important.  I found the cystoscopy to be uncomfortable for a minute but not painful. Once the scope is in the bladder I hardly felt it.  The cool thing was being able to look inside your own bladder.  Be sure you can watch on the screen!  In my case, three tumors were immediately evident and even though I Was completely shocked, I was Likely more in denial and found the tumors quite beautiful, like coral in the ocean floor.  I hope you don’t have the same experience of seeing tumors, but the signs and symptoms you are having make it important to check.  Best of luck to you\t\t\t", "date": "2020-06-15T22:42:57+00:00", "topic": "Cystoscopy in a few days", "subforum": "10-women-and-bladder-cancer"}]}