{"signature": ["TURBT", "Dx", "BCG", "BCG", "TURBT", "Dx", "BCG"], "posts": [{"text": "\n\t\t\t\tMy provider has BCG, but due to COVID, won't be treating right now.\t\t\t", "date": "2020-07-09T15:09:52+00:00", "topic": "Shortage of BCG?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNever experienced a stiff neck post-BCG.\t\t\t", "date": "2020-02-22T07:20:44+00:00", "topic": "BCG - Stiff Neck", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI've always thought there was only one  BCG manufacturer for the USA- Merck. I guess with a study they get around that?\t\t\t", "date": "2020-02-14T07:55:56+00:00", "topic": "Anyone else getting Tokyo BCG?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongrats for surviving the journey Ely  !!\t\t\t", "date": "2019-11-15T08:23:28+00:00", "topic": "New comer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDue to the BCG shortage, my provider has made a decision to replace BCG treatment for some patients with Gemzar.\n\nHere are the definition of both:\nBCG: is used for BC as an Immunotherapy, applied directly into the bladder, and it forces the body's own immune system to attack the cancer cells.\n\nGemcitabine (Gemzar): Is a Chemo, that yes, can be used for BC as an Immunotherapy, applied directly into the bladder, however, Gemcitabine attacks the cancers cells themselves, and doesn't rely on the bodies immune system to do the attacking.\t\t\t", "date": "2019-08-08T12:37:01+00:00", "topic": "BCG and hair loss", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYes, I made it through my 6 week induction and have had noticeable even  \"thinning\", but not a complete loss as you would see with Chemo. This was on BCG.  I will be starting maintenance on Gemzar.\t\t\t", "date": "2019-08-08T12:37:01+00:00", "topic": "BCG and hair loss", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIt's hard to read medical journals and articles that seem to conflict with each other. Even Doctors give different names for some of the same terms.\n\nBCG: My understanding of BCG, is that it is used for BC as an Immunotherapy, applied directly into the bladder, and it forces the bodies own immune system to attack the cancer cells.\n\nGemcitabine: Is a Chemo, that yes, can be used for BC as an Immunotherapy, applied directly into the bladder, however,  Gemcitabine attacks the cancers cells themselves, and doesn't rely on the bodies immune system to do the attacking.\n\nIs this correct?\t\t\t", "date": "2019-06-03T17:28:19+00:00", "topic": "BCG shortage", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHere is my providers approach that is being taken in regards to the BCG shortage (via my Cystoscopy appointment last week).\n\nI will forego Maintenance for the moment, while Kaiser Permanente comes up with a bigger plan to treat while the world continues to experience the BCG Shortage.\n\nThe treatment that is probably 2-3 months away from reality is: Gemcitabine Chemo Therapy, injected just like BCG, directly into the Bladder. Oh, and the Maintenance treatment using Gemcitabine would be once a month, not 3 treatments 3 weeks in a row every 3 months.\t\t\t", "date": "2019-05-29T01:21:31+00:00", "topic": "Still No BCG!", "subforum": "3-newly-diagnosed"}, {"text": "\ntgrocky wrote: Yes, I finished my last BCG treatment (number 6)  and on May 31st I will be getting scoped to see if the treatments worked or not.\ntgrocky\nI'm 10 days ahead of you Rocky \nI go in for my 1st post-TURBT/post- 6 BCG treatment scope on the 21st.\t\t\t", "date": "2019-04-07T15:19:31+00:00", "topic": "BCG Treatment #3", "subforum": "3-newly-diagnosed"}, {"text": "\nJjbrown wrote: Hello all,\nI have been doing some reading online about the new blue light cystoscopy and how it can see cancer so much more clearly than the standard cystoscopy.\nWhen I went to my post-TURBT appointment with my Urologist 2 weeks ago, I had my list of questions as we were preparing to start BCG (to treat my CIS). One question I did ask was about future scopes/TURBT and use of Blue light. Being that I'm at a large HMO (Kaiser), they do not use the blue light (at least in my city), and although a very brief discussion was held on its use, in Summary, the advantages do not justify the time and expense (I beg to differ and wonder if it could help me and others). As is, it takes up to 6 weeks for a TURBT from the time of Cystography.\n\nI'm a big fan of any technology to diagnose to help treat or prevent.\t\t\t", "date": "2019-02-10T01:20:33+00:00", "topic": "Blue light cystoscopy", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTURBT complete by 5pm last night. Went well, weekend of recoup now.\n\nTumor removed (cancerous) and \"red patches\" removed assumed by Dr. to be non-cancerous.\n\nThanks for the support, next status - pathology.\t\t\t", "date": "2018-11-18T06:35:21+00:00", "topic": "Greg,  newly diagnosed Kidney Stone and Papillary Tissue", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Alan. What I was really trying to ask is -\nWhy does there seem to be a judgement from my Dr. that my papillary tumor \"is\" cancer, just not sure of stage and grade ...\nbut ...\n\nAll I've read online is that a Tumor is not automatically cancerous? Have I missed something?\n\nThanks\nGreg\t\t\t", "date": "2018-11-18T06:35:21+00:00", "topic": "Greg,  newly diagnosed Kidney Stone and Papillary Tissue", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust got back from my TURBT Pre-Op with the Surgeon. All questions answered, but one answer caught me off-guard.\n\nFrom everything I've read, the long wait is the post-TURBT pathology report to signify - is it cancer, what is the stage, and grade.\n\nI specifically asked the Dr. \"we won't know it's cancer till the pathology report?\",  and her response was - \"It is Cancer just a matter of Stage and Grade\". I had all my questions printed up and gave her a copy, and she marked comments on my paper. The below list of staging was printed on my questions paper. She jumped right over T0 and commented that \"most likely\" I will fall into Ta/Tis/T1, but yes, without the TURBT and pathology, they won't know exactly how deep and grade.\n\nStaging\ni. T0: No evidence of cancer\nii. Ta: A non-invasive papillary (finger-like) tumor\niii. Tis: A non-invasive flat carcinoma (carcinoma in situ)\niv. T1: Infiltration of the lamina propria\nv. T2A: Infiltration of the inner muscle\nvi. T2b: Infiltration of the deep muscle\nvii. T3: Extending beyond the bladder wall\nviii. T4a: Involving the prostate gland or seminal vesicles\nix. T4b: Involving the pelvic wall or abdominal wall\t\t\t", "date": "2018-11-18T06:35:21+00:00", "topic": "Greg,  newly diagnosed Kidney Stone and Papillary Tissue", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPre-op Thursday, I have my list of questions ready for the Surgeon \nSurgery scheduled for Friday afternoon (1/4/19), estimated at 5-6 hours as out-patient.\t\t\t", "date": "2018-11-18T06:35:21+00:00", "topic": "Greg,  newly diagnosed Kidney Stone and Papillary Tissue", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNot something I've had to deal with, but good luck to you on your procedure!\t\t\t", "date": "2018-12-15T22:32:27+00:00", "topic": "5 Weeks out", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\t57, have CIS, been through 2 TURBT, Induction, and numerous Maintenenace.\n\nI had a pretty strong reaction during my 6 Induction, and since then - almost nothing. A slight fever here and there, but not bad. I wondered the same thing, and asked Urologist , she confirmed - doesn't mean anything to not have side effects (except lucky).\t\t\t", "date": "2020-06-08T21:58:45+00:00", "topic": "No side effects from BCG  5th week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats on the Milestone !\t\t\t", "date": "2020-02-29T07:12:40+00:00", "topic": "Number 4 of 6 BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI start another round of Maintenance on April 10, so I'm in the same boat - waiting it out. I have had other appointments changed from in-person to phone calls.\t\t\t", "date": "2020-03-17T18:33:36+00:00", "topic": "COVID-19: Delay BCG Treatments?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCystoscopy clear !!\n\nBack on BCG Maintenance  ", "date": "2019-01-13T06:45:14+00:00", "topic": "Here we go - CIS &amp;amp; BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tReporting back - Completed BCG re-Induction a few weeks back, 6 of 6, and no major Cumulative side effects. (Total 15 BCG treatments)\n\nNext Cystpgraphy Feb 28, fingers crossed.\t\t\t", "date": "2019-01-13T06:45:14+00:00", "topic": "Here we go - CIS &amp;amp; BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nKnifedealer wrote: if your \"induction\" was a standard 6 treatments and the most recent Jan. 3 was re-induction (maintenance?) #4 (out of 6) then I'm puzzled how you arrive at \"Re-Induction (#13 total).\" I'd assume you've written #12 total (6 plus 6 reinduct) or #10 (6 prior plus 4 re-inducts in the bag already, so to speak). Granted, my math skills, like my memory, aren't what they used to be, if I remember correctly \nThis should help you out with your math....   \n\nI'm on Re-Induction;  After TURBT #1, 6 Induction, then a clear Cystoscopy, then 3 Maintenance, then a Cyctscopy which revealed something, we performed TURBT #2 which came back as additional CIS.\n\nSo a re-Induction (6 more in a row) was called for by my Urologist.\t\t\t", "date": "2019-01-13T06:45:14+00:00", "topic": "Here we go - CIS &amp;amp; BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLatest update:\n\nBCG #4 of 6 Re-Induction (#13 total) - Had treatment on Friday 3 January, 2020. A welcome ZERO side affects, which is very odd, considering the Cum side affects have hit me every time.\n\nIt makes one wonder if the body can build a tolerance that quick to something such as BCG.\t\t\t", "date": "2019-01-13T06:45:14+00:00", "topic": "Here we go - CIS &amp;amp; BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nAlan wrote: If you haven't had any stiffness until 4 months post I'd guess the BCG is not the culprit. However, there have been posters that have had your problem and it probably was caused by the treatment caused. -20 degrees is certainly a possibility and barometric pressure affects many in their joints. Who really knows? I would certainly keep your medical team in the loop.- But it certainly couldn't hurt to move somewhere warmer  ", "date": "2020-02-05T19:37:08+00:00", "topic": "Followup with a few questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGREAT to hear Shacky - good luck!\t\t\t", "date": "2020-01-12T16:47:11+00:00", "topic": "Second TURB after TURBT", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\ndoglover wrote: I have heard that some people experience fever. Has that been an issue for you?\nI was one of those who had some side effects from BCG during Induction. Sessions 1-3 really had little to no side effects. Sessions 4-6 I had a fever that progressed with each treatment. By #6 my fever lasted ~appx 4 days.\n\nThis was followed by 3 Maintenance sessions where I had a minimal fever for a day.\n\nI am now going back for another 6 re-Induction, so I'll pass on my experiences.\t\t\t", "date": "2019-11-23T04:05:02+00:00", "topic": "Pathology results from Recurrence of tumor", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDo you stay in one position, or roll, or walk?\nI did the rotate 1/4 turn each 15 minutes, and can tell you that when it came to laying on my stomach, that really added pressure and I felt like I had to go right away.  Near the end of my 6 Induction, I would cut my stomach 15 minutes short, so I could then last the 2 hours easily.\n\nFor me, I could stop drinking 2-3 hours before the treatment, and survive 2 hours each time.\n\nThe RN does drain your bladder with the catheter prior to inserting BCG? The RN stated to me that this is done because the catheter can clear out more urine from the bladder than our body can.\t\t\t", "date": "2019-08-14T16:00:55+00:00", "topic": "Holding the BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCONGRATULATIONS !!!!\t\t\t", "date": "2019-04-23T00:16:49+00:00", "topic": "One more down!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara Anne - Your past experience quoted below and mine are very close. Upon Scope, my Tumor was 3d (mushroom type papillary growth). The initial TURB was performed, and pathology came back with CIS. So I just finished my Induction 6 BCG and await Scope #2.\n\nIf CIS continues to just show as irritation on the surface and doesn't then grow outward, from your years on the forum, does this then prompt additional TURB to see if the CIS is growing inward to rule out invasion?\nsara.anne wrote: Hi there, Mareens!\n\nJust a few words about second TURBs.  The purpose of a TURB is twofold.  The first is to obtain tissue samples to be sent to the pathology lab so that an exact diagnosis can be made.  The second is to remove any solid tumors.  Unfortunately CIS does not present as a solid tumor  but instead is more like a rash on the surface of the bladder lining.\n\nA second TURB  is indicated if there is any uncertainty about a diagnosis .   My situation is a good example   The first TURB  showed that I had papillary carcinoma which is like little mushrooms growing up from the bladder lining and these were removed.   The pathology report indicated that these were low-grade bladder cancer but the report also said that there were areas of irritation with some abnormal cells .   Therefore my urologist recommended a second TURB to try to determine what this might be.   During the second TURB he paid special attention to the area where the so-called irritation was found and took multiple samples which were found to be CIS which as you know is high grade.   I then had BCG treatments similar to Nancy and have been cancer free for almost 11 years .\n\nWhile a TURB can remove something like papillary tumors it cannot remove CIS so your doctor is correct.  If the cancer is still noninvasive BCG would be the most likely recommended treatment.\n\nSara Anne ", "date": "2019-01-10T02:36:01+00:00", "topic": "10 years cancer free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI too have been on Metformin for > 15 years, 1000 mg twice a day (the max). It should be noted that I also smoked heavily up until 25 years ago, and also worked in Industry that included chemical interaction that could have contributed to my BC.\t\t\t", "date": "2011-05-05T12:31:14+00:00", "topic": "Does anyone take Metformin?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis is not your normal post, from everything I have read.\n\nCIS Diagnosis via TURBT on 4 Jan 2019. 1st BCG a week ago, tired and fatigued, but I'm thinking the stress of the unknown added to that.\n\nBCG #2 this past friday, Saturday, felt great, today (Sunday), also feeling great. Actually, feeling better than I've felt in months. What in the world. Not that I'm looking a gift horse in the mouth, just seems to go against the norm.  ", "date": "2019-03-10T18:44:42+00:00", "topic": "Feel GREAT after BCG #2 (CIS)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs my example (I've only been through 1 BCG so far, last week).\n\nBCG once a week for 6 weeks (Induction)\n6 weeks of a break/bladder healing\nCystography\n\nIf nothing show on Cryptography, go into Maintenance\nBCG 3 weeks every 3 months\n6 weeks of a break/bladder healing\nCystography\t\t\t", "date": "2019-03-06T21:51:53+00:00", "topic": "bcg", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nGolfer wrote: He is wondering about recovery time for golf?  I'm thinking 6 months.\n  Not bladder related, but .... In-between my last TURBT, BCG treatments and an upcoming Cystoscopy, I had Rotator Cuff surgery for torn tendons and bicep. That was one of my first questions to my Physical therapist as an Amateur Hobby golfer - how long till I can swing a club again     (5 months for me)\t\t\t", "date": "2020-02-03T18:15:10+00:00", "topic": "Neobladder recovery at home", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nRich360 wrote: It's a \" high grade / superficial \" cancer.\nI just spoke with the dr and he seems to not be worried. It has been about 8 weeks which is the \" norm\".\nCIS ?  (carcinoma in situ)\t\t\t", "date": "2019-11-06T13:35:07+00:00", "topic": "Waiting for bcg", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tMy provider has started to receive more BCG shipments, and are administering, I believe, based on highest priority.\n\nRich, if I may ask, what Stage/Grade is your cancer? From my short stint in dealing with BC, a lot of treatment options come down to the type and grade.\t\t\t", "date": "2019-11-06T13:35:07+00:00", "topic": "Waiting for bcg", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nJacko wrote: Hi all,\nI was diagnosed with High Grade CIS in June 2018; had 2 TURBS followed six weeks later by 6 weekly BCG treatments in Sept/Oct. The cystoscopy/cytology in Dec 2018 showed all was clear and so I had 3 maintenance BCGs in Feb 2019. In May 2019 the cystoscopy/cytology was all negative; the suspicious area was pink. My next inspection in Aug had showed 'negative' for tissue samples but one 'suspicious' urine sample with the suspect area looking red so we have just completed the process on 30 Sept. This time the cytology shows 'positive' for cancer cells in one of the 3 samples, the tissue pathology still to come. The suspicious area was back to red. My Uro thinks that the cancer has returned....to be confirmed by the pathology.\n\nMy question is; do any Forum members have any experience of the effectiveness of BCG following the return of CIS?\nI don't have an answer, but I am following your progress, as my situations seems somewhat close to yours.\nTumor found\nTURBT performed (Jan 19)\n6 weekly BCG performed (Apr 2019)\nCystography performed - all clear (May 19)\nCystography performed  (Aug 19) - Red area noticed, but Urologist decided to watch vs TURBT\n3 weekly Maintenance BCG performed - Sept 19\nCystography  - End of October 2019\t\t\t", "date": "2019-10-01T09:27:44+00:00", "topic": "How effectiveness is BCG if High Grade CIS returns?", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tNice article\n\nMedscape Article (Oct 24, 2019) Treatment of Bladder Carcinoma In Situ\n\n\n\tTreatment of Bladder Carcinoma In Situ \n", "date": "2019-11-21T04:15:24+00:00", "topic": "Medscape Article (Oct 24, 2019) Treatment of Bladder Carcinoma In Situ", "subforum": "31-articles-of-interest"}]}