{"signature": ["TURBT"], "posts": [{"text": "\n\t\t\t\tIt's been somewhere around six months since I posted about the GI problems I have been plagued with.  This is off topic, but I really wanted to let those of you who were concerned about this know the final diagnosis.  I hate mysteries with no ending!  Before the doctors found that the bladder cancer was confined to the bladder my gp thought the daily nausea was a symptom of cancer that had spread.  I was lucky that it wasn't that.  I finally went to Indianapolis to a specialist and finally have a firm diagnosis of what is causing the GI symptoms.  I have gastroparesis.  \"Paralyzed Stomach.\"  It makes me feel like I have the stomach flu every day and has been going on for over a year now.  I lost 60 pounds in six months but my weight has stabilized now, thank goodness!  I don't have the usual risk factors for it so I go to the University Research Hospital in October to see if they can determine the cause and give me some sort of prognosis.  My doctor says it is more than likely permanent since it has not improved in over a year.  I do have blocks of time when the nausea isn't so bad so I am able to do more now.  I am relieved to finally have a diagnosis, at least.  I am on an extremely limited diet- little fat and no fiber and meds to make my stomach contract.  The doctor says that for unknown reasons the meds will stop working in a couple of months and I will be back to square one.  But by then I will be up for my appointment with the Research Hospital.  Mainly I aim writing about this to thank all those who listened to me belly ache, (no pun intended    ).  You were all so good at keeping my spirits up during those months that I had no idea what was wrong with me... I just knew I was terribly sick.   Especially Rosemary, with her kind words and Wendy, who has been a lifesaver to me.  Thank you all for the support you gave me through the months of worry.  elaine\t\t\t", "date": "2007-08-30T06:59:28+00:00", "topic": "Update on My Other Problems", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe section on sexual function sounds promising...       Good chance for Mr C to be ok.     : ", "date": "2006-11-26T12:49:24+00:00", "topic": "100 Questions and Answers About Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm so glad you have that doctor!1      I just reread his biography.  Sounds like you are going to be in great hands.  It is a good book.  I think I got it on amazon and it came within a couple of days. If they are back ordered let me know and I will send you my copy.  rugrat    ", "date": "2006-11-26T12:49:24+00:00", "topic": "100 Questions and Answers About Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKathy,  hope you get along well and I'm looking forward to hearing from you one this site.  Good luck and speedy recovery.  elaine the rugrat...  ", "date": "2006-11-27T16:59:09+00:00", "topic": "Thanks to the blcwebcafe", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWife, thanks for the heads up. Should be pretty simple to get checked for that.  I was really relieved there was no colon cancer or crohn's or anything.  I don't know what he is doing biopsies for.  A friend told me possibly a type of microscopic colitis, but that is just a guess.\n\nGreg, as always, thanks for reminding me to be careful with diet. I was a bit irritated after the colonoscopy because the doctor's only advise was to take more motrin and more reglan. I came home mad and cut my nose off to spite my face and ate some stuffing.  Ended up sick in bed for a day and a half.  Not going to do that again!!  Mr Rugrat went to the store today and got me some more gluten free, fat free, low fiber type stuff.  It is in the crock pot now and the blender is on the counter handy.  Thank you.... Down to 123 pounds... uggghhh  I think, as you've said, I have to keep my focus on my diet and keeping my weight up and forget about what the doctor is doing.  I'll just show up with my body when he wants it.   ;D I told Mr Rugrat that from now on he is to do all the talking because I can't seem to get him to hear me.\n\nWendy, thanks for the research tips.  I didn't know reglan was used for nausea.  I knew it was an anitanxiety drug and my hubby has used it for years to empty out his stomach faster so the acid doesn't build up and irritate his barrett's esophagus.  So far the neurontin is controlling the bipolar quite well but I did find out after a couple of years sometimes it just stops working.  Will cross that bridge when/if it comes.\n\nYou guys are great support and I really appreciate your time and concern.  Everybody.....\n\nDecember 18 is my bladder recheck and Dr. dugan is going to have a fit that I have gotten so much worse in three months time.  Maybe he'll suggest an Indy doctor!!   ;D\n\nRosemary, thanks for asking about me... i am doing better today.  Will go back and look at the pictures of Kaely and my little Addison.  And the hills of the great smokies. Hope your pain is letting up...\n\nTake care and thank you.  I'll write more when I am on my feet a little more.. I just wanted to check in now.  BTW... the garden boy is working out well in the shop.  so far...  ;D  ;D  ;D Thanks, elaine\t\t\t", "date": "2006-11-10T00:29:15+00:00", "topic": "update on my other problems", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI think the dr was blinded by the light!  ;D  Ok, The colonoscopy... No signs of major disease!     But strange things are happening. After the colon cleanse, I got up yesterday morning and, (this gets gross, you may want to stop reading... :-[ ),  passed a bunch of green bile looking stuff.  The dr photographed pools of this green stuff in my colon and gave us the pictures.  No explanation.. he is just doing tests.  Is it normal to have that much bile in you after a colon cleanse and no food for a day and a half?  I am elated that there was no cancer or crohn's or anything like that but the fact is I am still very sick and Mr Rugrat is getting insistent that they come to a conclusion soon.  I wake every morning sick, nausea.. bad.  I start getting watery diarrhea and after a couple of hours of that the nausea goes away.  I eat an egg for breakfast and do pretty well for a couple of hours then it all starts over. Wednesday I had diarrhea 10 times between 6am to 5pm.  Lots of it.  I have a fair amount of pain on my right side where the gall bladder scars are.  I have a golf ball size hernia on the top incision.  The dr wants to do a barium swallow next week to rule out problems in my small intestine.  If that is clear we are down to the gall bladder surgery the first of July.  There is a naturally occurring diarrhea you can get after gall bladder surgery called bile salts diarrhea.  There is a sickness you can get if the bile duct was injured during the surgery.  The dr told me to take more reglan.  It is a drug that empties the stomach and intestines out faster.  He would not comment on why it helps even at Mr Rugrat's questions.  We just aren't getting any answers... just more tests.\n\nGreg, I am always impressed with your research and common sense.  I'm not saying that to stroke your ego..  ;D  ;D  If you have any knowledge you would want to share with me I would be very grateful.  The 'eat often and small' has helped a bunch.\n\nWendy, I was very interested in your research on antidepressants. I don't know where you find this info. If you wouldn't mind would you expound on that.  I was on wellbutrin, lithium and zyprexa but stopped taking them when I got sick.  I am on neurontin now.  You know where to look where I don't seem to know.   \n\nI am not depressed and definitely not willing to give up and live like this if I don't have to.  I am determined to get to the bottom of this.  Mentally I am doing quite well.  I am happy, I laugh, but I am getting frustrated and angry at being sick with no answers.  i guess I have one answer... after all these tests I know I am health!   ;D  Just sicker than a dog!   :-/  All three doctors, the gall bladder surgeon, my gp, (dr of osteopath), and now this gastro guy are all members of the same medical group.  Mr Rugrat is thinking maybe I should get out of this group and find someone independent that will be more open as far as findings and possible reasons for this excess bile.\n\nMy cystoscope on my bladder is in 18 days.  The trip to Indy will be hard if I don't get well by then.     (poor me    )  As always I am very grateful to you all for the support through the days of bladder cancer scare and now with your continuing support and wealth of knowledge and investigative power!  Thank you for listening. elaine the rugrat...   : ", "date": "2006-11-10T00:29:15+00:00", "topic": "update on my other problems", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreg,  Mr Rugrat isn't too worried now because the garden boys can out run me!  Two steps and I'm pooped!  ;D He is interviewing one of the boys today and the kid is the son of a guy who worked for us 21 years ago.  The boy was born when his daddy was employed here!!  Makes Mr Rugrat and myself a little dated!   ;D  But hey,  I'm not growing up yet.  I'll still take Russell Crowe.    Only if Rosemary is bored with him, yet.    elaine\t\t\t", "date": "2006-11-25T21:30:59+00:00", "topic": "Mr Bubbles Is Home!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI hate to be a pig... but I'll take Keven Kostner AND Russell Crowe. As the little old lady I used to take care of... until she die a year ago today...  :'(  always said... they can put their boots under my bed anytime!!   ;D  However... come to think of it... I think she was referring to Cary Grant.  She was quite a classy lady but she had an hornery streak to her.  I took care of her four years.       rugrat\t\t\t", "date": "2006-11-22T15:13:13+00:00", "topic": "Bongs Bubbles &amp;amp; Carpentry Kits!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMrs C,  I just wanted to say that I am thinking of you all.  sorry your Thanksgiving was so horrendous.  I hope things get better in a hurry.  Keep the bong for now.  Greg has me walking the straight and narrow until I regain my strength!     Good luck to you.  elaine the rugrat...\t\t\t", "date": "2006-11-23T19:32:13+00:00", "topic": "Mr Bubbles is back in the hospital", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI know this isn't bladder cancer but I thought I'd just update you all since all these problems came up at the same time the bladder cancer did.  The two meds I am on for the stomach problem are helping alot.  I got out yesterday for the whole day and enjoyed it imensely.  My stomach doctor told me that when the new meds don't work or if the nerve damage continues to worsen he does use medicinal marijuana, for \"break though episodes,\" (marninol),  so I guess my mother in law wasn't too far off base after all.  That would only be used if we can't get it under control with other meds.  I am wondering if smoking that would increase the risk of recurring BC, though.  I assume it wouldn't be an every day thing like cigarette smoking.  I won't worry about it now but I sure don't want to do anything that would make a tumor resuface.  Thanks, elaine\t\t\t", "date": "2006-09-08T22:25:57+00:00", "topic": "I'm at the very beginning and am confused", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreg, you sound like you know!  Does dope show up in a urnine test for cancer cells?\n\nThe nausea is terrible.  After I eat my food sits in my stomach for up to six hours.  Possibly due to nerve damage in the stomach from the gall bladder surgery.  I am on meds now to try to get it to empty like it should.  The weight loss has been unreal.  At first I liked it... .  But then it started to get scary.  I look like I should be in a concentration camp!  Mornings aren't too bad but as the day goes on it gets to the point I just want to get doped up and sleep through it.  At times I want to give up... it has been so long now.   I try to think of all the illnesses so much worse than this.  I don't have it so bad.  If the ovary problem isn't cancer... they don't think it is... then I don't have a lot to worry about.   Just have to keep plugging.  I have good doctors now and we are working for a solution I can live with.\n\nYour sense of humor cheers me up.  I enjoy your posts.  Later,  Elaine\t\t\t", "date": "2006-09-08T22:25:57+00:00", "topic": "I'm at the very beginning and am confused", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI'm so sorry for not updating everyone.  I have still been very sick; from other health issues.  I came out pretty well with the bladder cancer.  I don't know the stage or grade but am working on getting that information.   I do know that it had not penetrated the bladder muscle and it was not sessile as the original ultrasound reported.  It was papillary with a very unusually thick stalk, in the doctor's words.  It was 5cm.  After the first week and a half I got along pretty well and it is doing quite well now.  I can make it most the night without having to get up for the bathroom.   I did not have to have treatments so I presume it was a low aggressiveness.  Is it unusual not to have treatments if it is definately cancer???????  I go back in December for another cystoscopy and urine test for cancer cells.  The doctor warned me sternly that it needs to be watched and can come back.  \n\nMy other health issues continue.  I have lost 53 lbs since May and am nauseous most every day.   My mother-in-law is suggesting to me to smoke dope to calm the nausea and put some weight back on me.  I am 5'7\" tall and down to skin and bones.  Would that show up in the urine tests for the bladder cancer??????  I made it through the late 60's and early 70's hippie movement without smoking so it would be weird to start now.  The nausea meds I am on are meds they give to cancer patients and they don't even phase it especially in the evening.  Have had many tests done and it is looking like the continued nausea may be due to complications to the difficult gall bladder surgery I had in July.  The surgeon had to leave part of the gall bladder in me becuase it was adhered to my liver and the walls calcified and it was full of stones as well as stones in my bile duct.  Also have unresolved complex, septated, bilateral cysts on my ovaries that need to be addressed soon.  Will be going in Nov 7th to have that looked at.\n\nIt has been quite a year.  I couldn't have gotten through the anxiety of the bladder cancer without this web page, this group of people and all the suport and information I have gotten here.   I turned 50 on October 8th and have just fallen apart physically.  I know bladder cancer is dangerous even though I have had people tell me it is no big deal.  It is still cancer and it can come back.  I am so glad I found a great urologist/oncologist in Indianapolis to keep an eye on this.  Thank you all for your support and I welcome any more posts.  Elaine\t\t\t", "date": "2006-09-08T22:25:57+00:00", "topic": "I'm at the very beginning and am confused", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIs there any way to get your husband on disability?  It would be worth a try.  What about contacting a lawyer to put pressure on his work place since it is high risk for bladder cancer?  \t\t\t", "date": "2006-09-22T12:19:51+00:00", "topic": "No insurance, husband refusing treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tFred, my tumor was 5cm cubed and I think noninvasive, low grade.  I'm checking on the path report.  The doctor said the stalk on it was unusually thick so there was a lot of scraping and cauterizing. He did not recommend treatments at this time or any other tests so we are waiting to rescope in December.  He was educated in England and Mayo Clinic and graduated first in his class.  Seems to be a very intelligent guy so I am trusting him.  Hope this helps you feel better.  Thanks, elaine\t\t\t", "date": "2006-10-08T22:12:57+00:00", "topic": "Newly Diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI think things are under control now.  The pain is bearable with codeine and I am stretching the dose out some.  Motrin helps a lot.  I am scheduled to go to the urologist Tuesday for the results of the TURB and am very nervous.  I find myself dwelling on it more than I should.   I am still having differing degrees of nausea but I assume it may be due to something other than the bladder cancer.  I just want to thank everyone here for all the support, suggestions and help that you have given me since I first posted.  You people have really helped me get through this.  I hope and pray that Tuesday will be better news and we can get on with finding results for the rest of my physical problems!  I sat outside today for a bit and found it a little surreal.  The last time I can remember feeling well was last spring, planting flowers in my garden.  Now the sugar maples are showing signs of red leaves!!  Thank you all and I will let you know what I find out Tuesday.  Wish me luck and special thanks to Linda  and Roni.  Elaine\t\t\t", "date": "2006-09-12T00:36:18+00:00", "topic": "at the beginning- had surgery today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOk.  Thanks to you all, the pain in my bladder is under control.  Still on pain killers but they are working now.  Nurse said to also take motrin in between to get rid of inflamation.  I got constipated from the pain pills and was getting more pain in my mid abdomen.  Finally took some ex lax and got things moving today.  However,  it is VERY tender to the upper right of my bladder along my right hip bone.  Swollen all across my abdomen from hip bone to hip bone.  Just under my belly button.  The nurse said the doctor had to do extensive scraping and cuaterizing... could this pain in my abdomen just be from trauma of that?  Or from the constipation?  I'm almost out of pain pills so I have to call the nurse tomorrow, (today... it is 2am now), because I don't want to go the weekend without any.  Should I mention this other pain by my hip bone?  I don't understand what about a TURB could make other areas of my abdomen hurt too.  Did anyone have such a rough first TURB? ........  Lauren, I'm not going to worry about the size now.  I hope it turns out as well as yours.   Thanks to each of you for responding and making me feel like I have help... Elaine\t\t\t", "date": "2006-09-12T00:36:18+00:00", "topic": "at the beginning- had surgery today", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tthe spot was gone.   ;D  but he still won't let me go six months.  I have to go back in three.  thanks for everything... until next time.  \t\t\t", "date": "2007-08-21T00:05:28+00:00", "topic": "new spot", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am going in today to get the new spot looked at.  Hopefully it is gone and that will be that.  Please say prayers and wish for luck.  I am nervous about this but it is surely nothing.  Thank you all for your support.  Elaine\t\t\t", "date": "2007-08-21T00:05:28+00:00", "topic": "new spot", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for all the info.  I have a dumb question.  I'm not really worrying but just so I'll be prepared for all scenarios,  if this is a cancer spot, and it has been in there since my last cystoscopy almost three months ago, if it is still there next month will they just take it out in the office?  and then would I have to have some kind of follow up treatment?  I really don't think it would be cancer again since mine was low aggresive and non invasive but am I fooling myself into thinking I'm all safe?  I just like to be a little prepared and I haven't taken the time to read up on all this.  Thank you, elaine\n\nRosemary, CONGRATULATIONS on the new grandbaby!!  elaine\t\t\t", "date": "2007-08-21T00:05:28+00:00", "topic": "new spot", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBTW,  where did she have to 'sniff' you to know you don't have bladder cancer??     rugrat...................   : ", "date": "2006-10-23T03:32:29+00:00", "topic": "A Good Sense of Humor Helps!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWildbill,  I've seen documentaries on tv about dogs they are training to 'sniff out' skin cancer on people... maybe your friend should go enroll in the training programs!!  rugrat\t\t\t", "date": "2006-10-23T03:32:29+00:00", "topic": "A Good Sense of Humor Helps!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you, everybody... elaine  ", "date": "2006-10-31T11:45:41+00:00", "topic": "bladder ct scan", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy primary care doctor called yesterday late and said the last ct scan I had showed that the walls of my bladder had thickened.  He said it may be due to the surgery but he didn't know much about that.  Does anyone know what that is about and will it cause me trouble of any kind?  thank you all.  elaine\t\t\t", "date": "2006-10-31T11:45:41+00:00", "topic": "bladder ct scan", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClair, thanks... go to story board.  Rosemary has the instructions under there.  Can't wait to see.  take care,  elaine    ", "date": "2006-11-26T14:42:30+00:00", "topic": "this is me, if this works right..", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMrs C or rosemary, how do I get my picture on my profile?  rugrat\t\t\t", "date": "2006-11-26T14:42:30+00:00", "topic": "this is me, if this works right..", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks, Kim... Isabel is the best dog I've ever had.  She is just a mutt but she is such a loyal friend.  Take care, Elaine\t\t\t", "date": "2007-12-08T14:31:31+00:00", "topic": "Ginger, here is me in camoflauge", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIsabel is three years old and was beaten and abused for the first four months of her life until I took her in.  Her previous owner was getting ready to take her to the country and shoot her because he said she was so ugly that no one would take her off his hands.  She was terrified of everything when I brought her home but she hasn't left my side since she realized that I wasn't going to beat her.  She is still afraid of men.  She is even, after almost three years of living here, still a little afraid of my husband.  And they say dogs can't remember anything past fifteen minutes!!\t\t\t", "date": "2007-12-08T14:31:31+00:00", "topic": "Ginger, here is me in camoflauge", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGinger, we have at least a quarter inch of ice this morning, (hubby says a half inch), so the camo won't do me much good today!  I can't go out until it melts off cuz the doctors are worried about my bones thinning and I could fall.  I am going to have to find a bird feeding apprentice to help me out on days like this.  I get upset if they aren't fed cuz they depend on me now.  I can't wait to see you pics.  Here is my nurse/dog, Isabel.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2007-12-08T14:31:31+00:00", "topic": "Ginger, here is me in camoflauge", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n", "date": "2007-12-08T14:31:31+00:00", "topic": "Ginger, here is me in camoflauge", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI love the sky... I'm still working on getting good sunset pics.  I'll PM the moon shot trick to you.  thanks Elaine\t\t\t", "date": "2007-12-17T01:37:08+00:00", "topic": "Moon over Bugtussel ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tps.. if anyone wants to take moon shots it is pretty easy with a plain telephoto lens... I can explain how to do it if you are interested.  My husbands cousin is a professional photographer and we exchange tricks.  Thanks, elaine\t\t\t", "date": "2007-12-17T01:37:08+00:00", "topic": "Moon over Bugtussel ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks, Clara.  I really don't care what the neighbors think. hahaha.. I just am taking pics to keep my mind off of my health concerns.  Besides I enjoy it so much.  The best part is sharing them though.  I really enjoy each email I get after I send my pics.  I get a lot of heartwarming stories from people and it makes me think I am making a difference even though I am not doing as well as I wish.  The critters have been very good to me.  Thank you again, Elaine\t\t\t", "date": "2007-12-05T22:49:38+00:00", "topic": "It snowed today.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGinger,  I have camoflauge from the tip of my head to my ankles!  I have rabbit fur boots so I guess to the critters I look like a bush with two bunnies sitting under it.  I will try to get my husband to take a pic of me in my outfit.  I can't wait to see you pics.  I don't get out much so seeing all the photos on this chit chat is a real joy for me.  Thank you, Elaine\t\t\t", "date": "2007-12-05T22:49:38+00:00", "topic": "It snowed today.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThank you, Clara and Ginger.  I get so much enjoyment just watching my critters and taking photo and reading books about them.  But most of all sharing them.  I am geared from top to bottom in camoflauge now.  The neighbors think I'm nuts... but that is ok because it is worth that to get so close to these creatures.\n\nGinger, I'm in Indiana and we are to get a couple of inches also.  Must be heading your way.\n\nClara,  are the pics coming in ok on email?  I was at the hospital yesterday morning for a test, then spent the afternoon outside and before I knew it I had skipped my daily offering.  I am sending more pics of the Carolina Wren today.  Is will be too cloudy with the snow coming to take new photos anyway.\n\nThank you so much, Elaine\t\t\t", "date": "2007-12-05T22:49:38+00:00", "topic": "It snowed today.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for being here, Rosemary.  You are wonderful.  Elaine\t\t\t", "date": "2007-12-03T23:03:29+00:00", "topic": "Congratulations and thanks to Rosemary", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2007-11-04T11:05:31+00:00", "topic": "Sharp-Shinned Hawk", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n", "date": "2007-11-04T11:05:31+00:00", "topic": "Sharp-Shinned Hawk", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n", "date": "2007-11-04T11:05:31+00:00", "topic": "Sharp-Shinned Hawk", "subforum": "17-chit-chat"}, {"text": "\ni3.tinypic.com/80myn91.jpg\n\nthis is the Krider's Red Tail Hawk that ate my squirrel.  These pics aren't that good because I didn't have a very good camera at the time.  I was able to get pretty close to him.\t\t\t", "date": "2007-11-04T11:05:31+00:00", "topic": "Sharp-Shinned Hawk", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRocky, I love your story.  If you don't mind I'd like to use it in my e-mag.  You put a big old grin on my face with that.  Isn't nature just wonderful?  Yes, it was a tad hard the first time I saw a hawk hunting my feeders but I came to a great appreciation for the hunting skill of the bird after awhile.\n\nLast Feb I had a Krider's Red Tail, which is about three times the size of the Sharp shinned and twice the size of a Cooper's, capture and eat one of my squirrels.  He came back three days in a row before finishing with the carcass.  I have some great photos of it.  I know I will get hate mail over this, but after I watched the splendour of that bird right outside my windows I was enamoured by hawks.  I can't bring myself to kill a fly, but I found myself 'seeding' the open area of my lot with shelled corn to coax the squirrels out into the open and thus easier prey for the Krider's.  To my knowledge the Krider's didn't get another squirrel and it wasn't too many days after that we had a major spring thaw\n\nOnce the snow cover melted the hawk retreated back into the open fields.  I am hoping he will come again this winter.  I have a much more powerful camera and lens this year so I am drooling at the thought of the pics I could get.  thanks so much for your story.  It's things like that that make it all worthwhile for me.  Elaine\t\t\t", "date": "2007-11-04T11:05:31+00:00", "topic": "Sharp-Shinned Hawk", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n", "date": "2007-11-28T12:26:39+00:00", "topic": "Sleepy Squirrel", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2007-11-28T12:26:39+00:00", "topic": "Sleepy Squirrel", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n", "date": "2007-11-28T12:16:00+00:00", "topic": "someone photo shopped one of my pictures", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\t[img]http://[img]http://i4.tinypic.com/72rnmnp.jpg[/img][/img]\t\t\t", "date": "2007-11-28T12:16:00+00:00", "topic": "someone photo shopped one of my pictures", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\t[img]http://<a href=\"http://tinypic.com\" target=\"_blank\"><img src=\"http://i4.tinypic.com/72rnmnp.jpg\" border=\"0\" alt=\"Image and video hosting by TinyPic\"></a>[/img]\n\nSomeone took my pic off of my space and photoshopped it.   ;D  Absolutley funny.  My son in law started a my space page for me over thanksgiving weekend and I've been posting pics on there.  I laughed pretty hard when I saw this one show back up from someone.     Elaine\t\t\t", "date": "2007-11-28T12:16:00+00:00", "topic": "someone photo shopped one of my pictures", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks, Joe.  Hey, you didn't create a monster.. I've been a monster for years and years...     I'm glad you like the pics.  Take care, elaine\t\t\t", "date": "2007-11-25T02:39:39+00:00", "topic": "young squirrel", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks, Rosemary, you are right.  He had that guilty look as if I had just caught him getting into something.  You'll probably see him again on the e-mag in a few days.  Elaine\t\t\t", "date": "2007-11-25T02:39:39+00:00", "topic": "young squirrel", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2007-11-25T02:39:39+00:00", "topic": "young squirrel", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIt's nice to meet you Max.  Good picture.   elaine\t\t\t", "date": "2007-11-24T19:08:43+00:00", "topic": "ME", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tand to you, also.  elaine\t\t\t", "date": "2007-11-23T00:26:48+00:00", "topic": "THANKSGIVING", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat made ma laugh out loud!  No! I don't mind you posting that picture!  The only turf I ever claim is my house and yard.  I'm pretty protective of that.  ;D  Addison is just a year old now.  They are home this week and it has been a joy.  They live in Georgia.  My duaghter teaches 2nd grade in a public school down there and her husband is an engineer at Catapillar there.  He travels a lot so Mandy and the baby are home alone quite a bit so she has a hard time with her work and being a mom now but she is doing a great job.  My son in law is a super guy.  Real laid back and easy going and we love having them home.  We are planning a big Thanksgiving dinner this year... although becuase of my diet restrictions it will be almost no fat.  No fun, either.  hahaha... (I will fix some fat things for the kids... what is Turkey day without fat?)\nHow old is your grandbaby in this picture?  I bet the two of them could have quite a time together.  Does she live close by?  I am thinking you said they were a distance away... but my old brain can't remember for sure.  Thank you for sharing.  Maybe we can get a whole bunch of babies posing like that on this thread.  How cute would that be?     elaine\t\t\t", "date": "2007-11-19T00:19:13+00:00", "topic": "my grandbaby girl", "subforum": "17-chit-chat"}, {"text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "date": "2007-11-19T00:19:13+00:00", "topic": "my grandbaby girl", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat was great!!  George has a way with words.  Thanks, elaine   ;D ;D\t\t\t", "date": "2007-11-02T21:31:21+00:00", "topic": "a little wisdom from George Carlin whose wife just passed", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\thow did you get involved with the magazine?  Did you have an interest in boats?  If you went to the web page about the older woman I took care of you see a pic of her the last time she and I sailed.  Her son and Chris actually did the sailing... Mitzi and I were just along for the ride. elaine\t\t\t", "date": "2007-11-08T20:05:09+00:00", "topic": "My own personal cancer cluster", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tlooking out the south window..\t\t\t", "date": "2007-11-08T12:23:15+00:00", "topic": "another one", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\ttry again..  [img]http://[img]http://i4.tinypic.com/6og1rvo.jpg[/img][/img]\t\t\t", "date": "2007-11-08T06:16:52+00:00", "topic": "I found this little guy hiding ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\there he is...http://tinypic.com/view.php?pic=6og1rvo&s=1\t\t\t", "date": "2007-11-08T06:16:52+00:00", "topic": "I found this little guy hiding ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI found this little guy hiding in a rotted tree limb. [img size=412]http://localhost/images/attachments/vXn2tL2c__IMG_20001.jpg[/img]\n", "date": "2007-11-08T06:16:52+00:00", "topic": "I found this little guy hiding ", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWhere is Church Island?  That is so beautiful! My trees are just yellow this year.  Thanks for sharing.  elaine\t\t\t", "date": "2007-11-07T00:24:24+00:00", "topic": "Autumn Foliage", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tZach, I read your blog.  You write very well.  You took me through a range of emotions and insight as I read of your chemo journey.  I also appreciated your thoughts of always thinking of someone who has it worse than you.  I have tried to keep that in my mind as I go through this treatment for the gastroparesis.  There are so many people who have it worse than I.  I have great empathy for them.\n\nOne really neat thing is that you brought back a memory from my childhood.  Not a real pleasant memory, but one I and my older siblings have chuckled over for forty-five years.\n\nOne night many years ago my two older brothers and old sister were babysitting when my parents went out.  They turned the tv on and we watched Twilight Zone! Rather, they watched while I cowered behind a chair in the dark!  When my parents came home they found me terrified to go to bed.  Of course my siblings never fessed up to making me watch a scary program so mom and dad weren't sure what to think. My brothers and sister teased me insesantly for months and even years after becuase I was terrified!  That was the only episode I ever watched!\n\nNow I can't wait to talk to them becuase after following your link to the wickapedia site I know the exact date of the episode and the details of the story, (which parts of the episode were not in my memory since I was covering my eyes through much of the program).  Anyway, I am planning to give them much grief over it, all these years later.  If my parents were alive I would consider tattling on them but maybe it's better than I didn't then and can't now becuase they would make me pay dearly!  They love to raze me to this day!  I was 5 and a half years old when that episode aired!  I'm emailing the link to them!  My brother, Rick, will especially love this!!  Thank you for your story and thank you for bringing back a dear memory for me!   elaine\t\t\t", "date": "2007-11-03T19:11:40+00:00", "topic": "Shin pain one year after cystectomy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI fell for it hook, line, and sinker!!  ;D ;D ;D  too good!!  thanks, elaine\t\t\t", "date": "2007-11-03T19:11:40+00:00", "topic": "Shin pain one year after cystectomy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI wrote a short essay several months ago and entered it in a contest.  I didn't win.. didn't really think I would  ;D  but I thought I'd post it here.  The essay is a true story about an elderly woman who I took care of for three and a half years until she died in 2005.  She taught me a great deal about life even though she was ill herself.  I miss her terribly. This essay is my tribute to her and if you all want to vote you still can just click on the stars at the end of the essay.  The awards were decided by judges rather than the popular vote becuase they wanted stories that had to do with the Great Lakes.  My story is more about my friend than the lake itself.  Maybe I'll get lucky and they will give me an honorable mentoin since I think I got the most popular votes.  ;D ;D ;D  That isn't my purpose, I just want to share her story.  I took the photo of her that is posted by the essay the last time she went sailing with us.  I hope you enjoy it.  Thank you, Elaine\n\nwww.healthylakes.org/stories/general/2007/06/14/a-friendship-forged-on-lake-michigan ", "date": "2007-10-31T19:09:38+00:00", "topic": "The elderly woman I took care of...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tPriceless!!  I love them.  Thanks for making me laugh this morning!!\t\t\t", "date": "2007-10-31T15:41:00+00:00", "topic": "2 Dogs for the price of one lol &amp;amp;amp; Cat Paws", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tTruly awesome!!  Those poor little deer!  Thanks for posting it.  Elaine [img size=256]http://localhost/images/attachments/w9nuRnlX__IMG_088x1110001.jpg[/img]\n", "date": "2007-10-30T00:20:57+00:00", "topic": "Fire Photo-Check It Now", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\ta couple more.. [img size=425]http://localhost/images/attachments/UAd0DYVk__IMG_6280a111.jpg[/img]\n[img size=375]http://localhost/images/attachments/nnwzvBd7__IMG_7352a111.jpg[/img]\n[img size=400]http://localhost/images/attachments/hicZ8kL9__IMG_8962m111a.jpg[/img]\n", "date": "2007-10-28T18:28:00+00:00", "topic": "Rosemary, a couple of my photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJoe and Zachary,  thank you for helping me out posting the pics.  I will try to learn how to do it better!    ;D  thanks, elaine\t\t\t", "date": "2007-10-28T18:28:00+00:00", "topic": "Rosemary, a couple of my photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI laughed for a good ten minutes!  Loved it!! ;D\t\t\t", "date": "2007-03-22T18:49:36+00:00", "topic": "Having A Bad Day", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMrs. C,  How are you and Mr.C?  Doing OK?  I've been thinking about you.     Were you able to find the web page?  As I said, we are in the process of redoing everything and I am not sure it will work.  Our son-in-law manages it and he has little time to keep up with it.  I can't nag him about it.  ;D   :  Hope you are both well.  elaine\t\t\t", "date": "2006-11-28T12:42:24+00:00", "topic": "web page", "subforum": "17-chit-chat"}]}