{"signature": ["TURBT", "BCG", "Dx"], "posts": [{"text": "\nmikequestions wrote: Hi Lintay59,\n\nThe BCG treatments were way less difficult for me than recovery from a turbt. It was not exactly a joyride, but was certainly less troublesome than I expected. Remember, most people who breeze though BCG don't post anything about their experience.\n\nMike\nI agree 100% with the above quote.\n\nRecovery from TURBT was the hardest part for me, but, in the grand scheme of things, it was nothing compared to the alternatives.\n\nThe BCG treatments, while never listed under \"fun\" things to do, were not that bad.  I have had no symptoms now for four and a half years.\t\t\t", "date": "2021-01-22T15:18:51+00:00", "topic": "TURBT- what to expect", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWhat I wanted to add was my doc said if my c returns and they catch it early enough they may be able to scrap it out.  Maybe that's what your dad is having done?\t\t\t", "date": "2019-07-03T17:54:48+00:00", "topic": "92 yr old dad newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI don't know what your dad is having done or what your mom meant.  I wish your dad the best though.\t\t\t", "date": "2019-07-03T17:54:48+00:00", "topic": "92 yr old dad newly diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood luck.\t\t\t", "date": "2019-02-19T21:07:58+00:00", "topic": "I’m scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI can only tell my own story.  When I was diagnosed with Stage 1 and a big tumor, I asked my doctor how long I would have if left untreated.  He said probably about 18 months.  (I would be gone by now.)  But, again, that was Stage 1.  I can't say how long I would have had if my cancer had spread.\n\nPeace to your mother and your family - and to you.\t\t\t", "date": "2018-03-02T15:38:17+00:00", "topic": "90 year old mom in law with metastatic bladder cancer had severe stroke", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI don't know how slow or fast they grow but looking back I would say that my tumor was probably growing in the summer of 2012.  I know this because of the signs I was having but didn't realize they were signs until after I was diagnosed in August of 2016.  I had a very large tumor, so I am sure it was growing in 2012.\t\t\t", "date": "2018-02-25T17:45:34+00:00", "topic": "Are tumors of the bladder generally slow growing?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAll I can tell is my own story.  I was a 58 year old smoker and I went to my doctor the next day after first seeing blood in my urine.  He tested my urine and the results were that there was no trace of microscopic blood in my urine (despite my urine being fire engine red!).  I read all the Internet information that said most blood in urine does not turn out to be a symptom of bladder cancer, and that's true, no doubt.  But after the blood continued on and off for about nine months, I went back to my doctor and this time he sent me for more tests and the result was that I did indeed have bladder cancer.\n\nSo, the morale of my story is that if the blood in urine continues on and off either tell your doc that you want more tests or go get a new doc.\t\t\t", "date": "2017-12-03T18:42:56+00:00", "topic": "Blood in Urine", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYup, mine is put in my bladder then I go home and hold it for two hours.  I sort of roll around but I read what Sara said about that and I do think that sounds right, although sometimes I just lie in bed and turn from side to side a few times just in case.  Then I do the bleach thing in toilet as other said.  I only have two more rounds of BCG treatment (3 does each round) and I can't wait as I am really beginning to hate the treatments.  I feel all chemically for days after each one.\t\t\t", "date": "2017-11-14T16:54:30+00:00", "topic": "BCG treatments", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI've been through a six rounder and two three rounder's (I think, I've lost track) and, yes, the side effects are cumulative for me too.  I don't get fatigue so much as I have frequency and urgency and lack of control.  It is horrible for a few days after each treatment and just when I'm getting everything back to normal I have to go in for another dose.  After about a week or so after the last round I'm as good as new.  Another side effect that I've been having is I get sickly in my body as if I am pumped up with chemicals.  It goes away in a few days but it is grosser and grosser each time I have a treatment.  But I'm done until February and believe me the memory of the ill effects fades away rather quickly so hang in there.\t\t\t", "date": "2017-10-11T15:11:27+00:00", "topic": "Fatigue - 4th/6 BCG completed - 62yrMale", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI missed what the negative impact BCG was having.  I have my last round of three this coming Tuesday and then I go to 3 rounds every six months (as long as I stay C-free) and I am so glad as I'm starting to really get a gross feeling from the BCG.  I can't explain it other then just blah.  I remember Sara Anne, I believe, saying that the negative feelings means the BCG is working.  I don't remember if she meant that in regards to the bad feelings but I always use her statement to comfort myself during the BCG treatments.\t\t\t", "date": "2017-08-07T22:23:05+00:00", "topic": "Three month check-up after six weeks BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am heading into my third round of BCG in a week or so.  The only issue I have with BCG is I have urgency and little control of urination for a few days and then in a week or so after the last one I'm back to normal.\n\nI've also had blue light.  They did it during the same procedure as a TURBT so I was knocked out.\t\t\t", "date": "2017-07-31T16:40:23+00:00", "topic": "Starting BCG treatments what should I expect.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood luck. I guess the ACA open window for getting insurance is over now, hey?\t\t\t", "date": "2017-04-19T17:46:20+00:00", "topic": "Diagnosed 4/19/17", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI have no advice but I am glad to hear that they don't think you have bladder cancer.  Hopefully it stays that way.  Mine wasn't diagnosed for maybe eight months because the doc (my former doc, by the way) didn't think blood in urine for a 58 year old smoker male was worth investigating beyond a simple urine test that came back negative.  Guess what?  The test was wrong.\t\t\t", "date": "2017-04-24T22:44:29+00:00", "topic": "Would Appreciate Guidance", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI can only offer you my good wishes.  I'm still fairly new to all this and I haven't had to make the decision you are facing.\t\t\t", "date": "2017-04-07T03:40:04+00:00", "topic": "Desparate for some input", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMy doc keeps saying that because I'm young I have a good chance of a full recovery and I'm 59!\t\t\t", "date": "2017-03-28T05:57:29+00:00", "topic": "bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had no side effects.  Absolutely none.\t\t\t", "date": "2017-03-14T23:41:09+00:00", "topic": "Just had cancer removed am starting onBCG treatment next week. What side affects", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLeon,\n\nI hope you have a speedy and complete recovery.  Good luck.\t\t\t", "date": "2017-02-06T01:57:02+00:00", "topic": "Am I moving to fast?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI would never disagree with anyone who has decided on a treatment plan.  While we all are on the same path that doesn't mean we all walk in the same shoes.  (Too poetic?)\n\nIn any event, good luck no matter what you ultimately decide.\n\nI too had a very large tumor.  I go back in April to see what's what.  I'm hoping for the best but also thinking about what I'll do if the news is the worst.\t\t\t", "date": "2017-02-06T01:57:02+00:00", "topic": "Am I moving to fast?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI have no grandchildren or children so I don't have anything to offer except to say good luck.  That must have been a shocker when your doctor told you that.\t\t\t", "date": "2017-01-29T23:46:28+00:00", "topic": "Newbie to forum.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Joanne.\n\nI was diagnosed about the same time as your husband (late August) but he's already into his BCG treatment.  My second TURBT isn't scheduled until early November.  My doctor said because my tumor was so big that he wanted to give my bladder time to heal.  My tumor was over 6 cm x 6 cm x 1.5.  If you don't mind my asking, how large was your husband's tumor?\t\t\t", "date": "2016-10-07T17:58:35+00:00", "topic": "T1 G3 and BCG treatments", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am in the same boat as your husband (T1HG).  I guess we are the class of 2016.  I go for my second TURBT Nov 2.  Hopefully they will start BCG soon after that (if they don't find any remaining or new cancer).\n\nGood luck to you and your husband.\t\t\t", "date": "2016-10-07T17:58:35+00:00", "topic": "T1 G3 and BCG treatments", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI went to Johns Hopkins (to a bladder cancer specialist, as recommended by this group).  He recommended that he go back in and take a look inside my bladder to see if there is any more cancer (he is going to put some kind of dye in there that lights up if cancer is present) then, if all clear (which I hope), I'll begin six weeks of BCG.  He doesn't think I need to wait any longer for my bladder to heal, although treatment doesn't begin until early November.  I'll keep you posted.\t\t\t", "date": "2016-09-17T19:51:07+00:00", "topic": "Newly diagnoised with questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you everyone for the information.  I have an appointment with Hopkins.  I'll keep looking at the site (and contribute information when I can) and I will certainly keep you updated on my own story.\t\t\t", "date": "2016-09-17T19:51:07+00:00", "topic": "Newly diagnoised with questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks again, Sara.\n\nI had a specific concern (that he wasn't giving me BCG fast enough) but your opinion on that made me feel better and now I feel like I probably should hold off on getting a second opinion.  I was going to have the slides sent to Hopkins.  That's the way they do it.\n\nI guess it wouldn't hurt getting a second opinion but I think Hopkins is going to say the same thing my doc said (and your opinion confirmed).\n\nNow I'm confused.\t\t\t", "date": "2016-09-17T19:51:07+00:00", "topic": "Newly diagnoised with questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you so much, Sara.  That is a relief.\n\nI'm getting a second opinion from Johns Hopkins.  Do you think it is too early for a second opinion?\t\t\t", "date": "2016-09-17T19:51:07+00:00", "topic": "Newly diagnoised with questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am bumping this person's topic up since it is more recent than mine.  I said thank you on mine and it went to top.  I don't think that's fair to this person.\n\nGood luck with everything, Pamm.\t\t\t", "date": "2016-09-21T22:13:40+00:00", "topic": "BCG Treatments - Is this common?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's great news for you guys and for the rest of us hoping for similar good outcomes.  I am done BCG and into the cysto's every three months.  I go back in early January.  I do have one minor issue that I'll write about on open forum.\t\t\t", "date": "2018-11-22T00:01:21+00:00", "topic": "Husband has been fighting BC for almost twelve years", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just started BCG today and I have no side effects.  But after reading this forum I see that I may not be so lucky as the treatments progress.  That will be okay with me as long as this works.\t\t\t", "date": "2016-09-12T00:11:04+00:00", "topic": "BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am on a similar treatment plan as Sara Anne.  I am at 18 months and just got an all clear cysto today so I start another three rounds of BCG.  Then, in August, if I am still clear, I'll start my last three rounds of BCG.  That would be my two year mark.  Then I do cystos every three or six months probably for another three years.\t\t\t", "date": "2018-02-23T17:00:44+00:00", "topic": "Has anyone else followed this BCG maintenance schedule?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm so sorry to hear this news.  Your type of story is in the back of mind all the time.  When I'm really enjoying life the thought will slip in that \"it\" can always come back and with BC, the chances it will are pretty high.\t\t\t", "date": "2017-12-11T23:09:08+00:00", "topic": "Rediagnosed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just had my three month cysto on Monday, Nov 13th, and I'm all clear!  So I can relax for another three months.\n\nMy plan of action according to the doc is cysto every three months between now and August, 2018, with two rounds of BCG, one in Feb and one in Aug, 3 treatments each time.  Then, because of the size of my tumor, my doc said I might need a cysto every three months for the rest of my life, maybe every six months if I'm lucky.  I'm not happy with that part but I do like knowing I'm C-free!\t\t\t", "date": "2017-06-20T15:10:03+00:00", "topic": "Three  Month Cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've had like three rounds of BCG (I've lost track) and I always have bleeding and urgency but never fatigue.  But I think it accelerated my hair loss.  I don't know if anyone else has had that or if it's my imagination but I've gone from a bald guy to a really bald guy.\t\t\t", "date": "2017-11-14T00:54:50+00:00", "topic": "Does the bcg treatments  make me lazy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you.\t\t\t", "date": "2017-08-12T02:58:02+00:00", "topic": "One year down!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tApparently everyone is different with BCG.  I just had my fifth of six treatments today and, again, no side effects at all - no aches, pains, fever, etc.  Now I hope it actually works.  I didn't know the 75% success rate.  That gives me hope.  I knew BCG helped but I didn't know that good.\t\t\t", "date": "2017-01-05T00:31:50+00:00", "topic": "Worried about BCG side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\ndtat60 wrote: Did you have any ill effects during your treatment?\nDave, my first go round with BCG (6 treatments, once a week for six weeks) was easy with no ill effects.  I'm in my second round (3 treatments, once a week for three weeks) and this time it's rougher.  It's not unbearable, mind you, just a tad bit rougher.  The day of treatment isn't too bad.  I have urgency and frequency.  But by the second day I am wiped out almost like the flu and urgency and frequency is accompanied by burning.  It's very uncomfortable.  I can't drive to the corner without having to use the restroom.  Day three isn't as bad as day two but not great.  By day four I'm bouncing back.  By day five I'm back to normal.\n\nI have one more round on Monday and then that's it for this cycle!  I'm glad too.  I'm really glad.  Then in three months it all starts over again (cysto, then, if cancer free, 3 round, etc., for the next two years).\t\t\t", "date": "2017-02-10T00:05:36+00:00", "topic": "Cystoscopy - post initial BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's great!\t\t\t", "date": "2017-04-04T02:55:35+00:00", "topic": "Good news again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a wait too (I forget how long).  I too was worried but the folks on this forum assured me my wait was in the normal range and a second opinion confirmed that.  But every story and person is different.  If you think you are being told to wait too long don't wait, get a second or third opinion.\t\t\t", "date": "2017-02-23T01:15:43+00:00", "topic": "BCG delayed again, WORRIED.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood news!  That's great.\t\t\t", "date": "2017-01-16T00:57:16+00:00", "topic": "Good checkups!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm so sorry to hear this.  Your original tumor was large like mine was.  I'm into the BCG.  I keep telling my wife that it's fine to be hopeful but, because of the grade of my cancer and the size of my tumor, there is a chance it will come back.\n\nI don't know you but I know what you're going through.  I wish you the best.\t\t\t", "date": "2016-11-25T17:07:12+00:00", "topic": "First cysto post BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had the Bluelight but chose general anesthesia.  The idea of being conscious during these procedures is a bridge I'm not willing to cross yet.\t\t\t", "date": "2016-12-01T20:16:32+00:00", "topic": "Anesthesia for Bluelight Cysto/Biopsies", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had blood in my urine and I was incredibly tired (not sleepy) at times and I knew they were signs of bladder cancer based on information I found out on the Internet.  I forget the exact time frame of events, but the day it was officially told to me I was lying there getting a cystoscopy  and the doctor was saying to the nurse \"do you see how irregular it is on that side?\".  I knew then that something was up.  After the procedure he called me into his office and said I had a very large tumor in my bladder that had to be removed.  I said \"do you mean I have cancer?\" and he said yes.  He then told me all the information I needed.  I asked him how long I would have if I did nothing and he said maybe 18 months.  Well, the long story made short is that I had the tumor removed and I had treatment and I am still cancer free (as of today), over three years later.\n\nI don't think my doctor should have talked to the nurse like that but he turned out to be a good guy and that is just his mannerism.  The poor guy actually had to stop practicing because he had a major heart attack.\n\nGood luck with your mother-in-law.  I hope everything goes well.\t\t\t", "date": "2019-09-28T14:10:27+00:00", "topic": "Learning you have cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tlotech, I can't believe how you are handling this.  I stand in awe.\t\t\t", "date": "2017-03-14T00:44:50+00:00", "topic": "STARTING THE PATH TO  RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNo but good luck.  I hope everything is going good.\t\t\t", "date": "2017-01-20T13:28:57+00:00", "topic": "Stage4 non-muscle invasion bladder cancer", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI hope everything is going good for you.\t\t\t", "date": "2017-04-16T19:18:51+00:00", "topic": "reoccurance of TCC", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tJust got back from latest cysto - cancer free and no more BCG treatments!\n\nYes!\n\nI am learning to relax and enjoy life in between cystos.  I don't have cancer now and that's all that counts.\t\t\t", "date": "2017-10-05T23:10:46+00:00", "topic": "Working of BCG in bladder", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI am sitting her now with a bladder full of BCG.  I have a few more minutes to go...  This is round one of three weeks.  I have one more round of treatment in August if I remain C free.  I hope, I hope.\t\t\t", "date": "2017-10-05T23:10:46+00:00", "topic": "Working of BCG in bladder", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\t\"Hope all of you here get better and never have to deal with cancer again.\"\n\nAmen to that!\n\nI hope your brother stays healthy.\t\t\t", "date": "2018-03-21T04:34:36+00:00", "topic": "New Here with question", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI read the symptoms of bladder cancer before I was diagnosed and I had the visible blood in urine, frequent urination and trouble urinating.  But the two things that stood out most with me besides the fire engine red urine was\n\n1.  How incredibly tired I was.  Not sleepy, but wiped out tired.  I'd get up from an eight hour sleep and feel like I could collapse.  I don't have that any more.\n\n2. Another symptom I had (close your eyes if you don't want to read something of a sexual nature) was the intense orgasms I was having.  I believe it was caused by the size of my tumor.  I have not read anyone else having that and I've never read it anywhere else.  But I thought I had to pass that on as it may be useful to someone else.  Without getting into much detail I am sad to report that that symptom has cleared up since my tumor was removed.  It's the one thing I miss about my cancer, if that's possible.\n\n(I edited this to tone it down a bit.)\n\nEdit (03/2718):  My doctor asked me today how I was doing and did I have any pain, stinging, etc., etc.  And that reminded me that when I would have an orgasm, it would sting, in addition to it being intense.  This began happening years ago (maybe 2012 or so).  I used to dread it, yet enjoy the intensity.  It was starting to get a little weird, the whole pleasure and pain thing.  But, my point of bringing it up is to make note of the stinging sensation as a possible very early sign that I, at least, had bladder cancer.  This is not a known medical sign as I've never heard anyone else discuss it before.  Maybe it was just me and maybe it had nothing to do with my bladder cancer.  I may never know and I hope it never repeats itself for me to find out.\t\t\t", "date": "2017-11-15T22:31:20+00:00", "topic": "Some other symptoms I had that I feel I must pass on.", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI finished my six BCG treatments a few weeks ago and I too had no side effects or discomfort.  I did have minor bleeding after the last two, but it didn't hurt or anything and it was gone after the first voiding after the two hour wait.  And I too wondered if my lack of side effects meant that the BCG wasn't working.  I thought that maybe they didn't refrigerate it correctly, although I had no evidence to support that fear.  On each visit my doc asked me how I  handled the last round and I always said no problems and he would just say good.  So I stopped worrying.  I hope the BCG worked and I hope that I get to have more rounds (because that will mean the cancer has not returned) and I hope I keep not having side effects.\t\t\t", "date": "2015-12-12T02:48:35+00:00", "topic": "No reacton to 6 week BCG treatments", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tYes, Jack, I read that study.  I believe it was NIH.  The study showed that continuing smoking after diagnosis increases chance of recurrence.  I asked my doc at Hopkins if it helped if a 40 year smoker like me has been \"quit\" for only a few months or so before starting BCG and he said \"yes!\"\n\nAnother NIH study said using any nicotine (patches, gum, etc.) has been shown to lessen the effect of BCG.\n\nNicotine and tobacco are powerful.\t\t\t", "date": "2016-12-17T05:48:19+00:00", "topic": "A Study I Liked: Coffee is Good", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks Alan.\n\nI had a colonoscopy and there were seven polyps, six of which were precancerous and one of those was rather large and almost to the point were the doctor couldn't remove it.  I would have had to have some of my colon removed if that were the case.  But the doctor did nip them and sent them for tests.  None of them were cancerous.  But because one polyp was very large and aggressive, the doctor wants me to have another colonoscopy in a year.  That's not too bad.\n\nSo, in short, Cologuard may have prevented me from losing some of my colon or even developing cancer.\t\t\t", "date": "2018-12-29T19:34:31+00:00", "topic": "Cologuard positive test result.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI have been bladder cancer free for over two years now and my next cysto is scheduled for early January.  I'm hoping that the good news continues.  I do have one blip on my radar screen.  I did the Cologuard colon cancer screening  test and it came back positive.  My doc wants me to have a full blown colonoscopy to \"see what's going on\".  My doc said it doesn't mean that I have colon cancer and I read that there is about a 14% false positive rate with the test; and I feel fine and I don't have any colon cancer symptoms, so I am not too worried, but...  We'll see what's up soon enough.\t\t\t", "date": "2018-12-29T19:34:31+00:00", "topic": "Cologuard positive test result.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSorry, I accidentally deleted my first post.  It just said that I was diagnosed with  Basel cell skin cancer, which is really nothing to worry about, but, as my doctor said, no cancer is good.\t\t\t", "date": "2019-07-03T20:40:20+00:00", "topic": "Other cancers", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI didn't know that.  My personal patron saint of BC is Jack Lemmon.  I loved Jack Lemmon and didn't know he died of BC until I had BC and came across it during my research.\n\nBut my favorite survivor story is that of Patti Hansen, famous model and wife of Rolling Stones guitarist Keith Richards.  She has a neobladder.  I think she also had breast cancer at some point.  I'm not sure about that though.  And she still survives!\t\t\t", "date": "2017-12-04T01:26:40+00:00", "topic": "Who knew that the Scarecrow from the Wizard of Oz died of bladder cancer?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMerry Christmas everyone and Happy Holidays.  I hope everyone has a healthy New Year too.\t\t\t", "date": "2017-12-08T15:01:52+00:00", "topic": "HO HO HO Merry Christmas", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGood work.\n\nI feel a special closeness to this group for the obvious reason and because my Dad's side of the family came from Dalton.  Tully, Pender, Silver, all family names from Dalton.\t\t\t", "date": "2016-12-04T19:29:24+00:00", "topic": "Journey to Dalton....and some Exciting News", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for replies.\n\nFYI - I'm using my real name now. I was using a nickname but then I realized that I had nothing to hide.\n\nThanks.\t\t\t", "date": "2016-09-25T15:33:46+00:00", "topic": "Not diagnosed for almost a year.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDuplicate.\t\t\t", "date": "2016-09-25T15:33:46+00:00", "topic": "Not diagnosed for almost a year.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks dani.\n\nI've since gone to Johns Hopkins and the nurse there told me that the amount of time between my first seeing blood in urine until the day they removed the tumor (it turns out it was just one large one) is about standard, at least for men.  She said the doctor did the normal tests and while he could have told me to come back if the blood returned, the fact that he didn't isn't beyond the pale with this sort of thing.  Many doctors will give antibiotics and send you on your way, the nurse said.\n\nBut the lesson I am passing on to others is if you see blood in urine it is not normal!  No way, no how!\t\t\t", "date": "2016-09-25T15:33:46+00:00", "topic": "Not diagnosed for almost a year.", "subforum": "17-chit-chat"}, {"text": "\nNix wrote: My brother had a neo bladder 12 years ago, is 80 yrs old and doing very well.\nI caught mine very early, because of my brother, I had BCG, and I am 9 years cancer free.\nNancy, thanks.\n\nYou and your brother are inspiring.  My thought at this time is that if I have to have my bladder removed I'll just start doing what I want when I want (smoking, eating, whatever) since the game is basically over.  But you (and other stories here) show me that that is wrong.  Live goes on and can still be enjoyed.  Thanks for that.\t\t\t", "date": "2016-10-08T16:51:59+00:00", "topic": "Smoking.", "subforum": "17-chit-chat"}, {"text": "\nJack R wrote: A much cited NIH document found that \"50 percent of all cases of bladder cancer are found in smokers\". What ??? 50% of bladder cancers then are found in Non-smokers.\nI read the same document and thought the same thing!\n\nThanks for thoughtful response.\t\t\t", "date": "2016-10-08T16:51:59+00:00", "topic": "Smoking.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI searched the forum and I don't see any thread on the specific topic of smoking.\n\nAs many us find out at some point, bladder cancer is the second leading cancer for smokers and smokers have a higher rate of bladder cancer than non-smokers (although non-smokers certainly make up a fairly large number of those with the disease).\n\nI am a former cigarette smoker.  I say former because I stopped soon after I was diagnosed with T1HG bladder cancer in late August.  I don't like that I am not a smoker but I understand that the chance of recurrence is higher if I continue to smoke.  That's what I've read anyway and my doctor at Johns Hopkins confirmed the accuracy of the information.\n\nI started smoking probably around 14 or so (middle school).  By the time I graduated high school I was probably up to a pack a day and I stayed there until I was in my late 30's when I started decreasing the amount I smoked.  For the last 10 or so years I've been down to about 6 a day.  All in all I've been a cigarette smoker for about 44 years.\n\nI always said to people that I loved smoking (and I did...do...did) but that I wouldn't be surprised if I was told that I had cancer at some point in my life.  As it turns out, I was surprised when I was told I had bladder cancer, but I wasn't shocked or in any kind of denial.  It made perfect sense to me.  I didn't have any \"why me!?\" moment.  And, while my bladder cancer may have nothing to do with my smoking, it very well could.  I'll never really know.\n\nI don't blame myself for having bladder cancer, even if it could be directly traced to my smoking.  I don't feel sorry for myself either.  I just feel kind of numb.  I am hoping I will regain my enthusiasm for life if I get the all-clear after my second TURBT and BCG treatments.  Right now I just feel like my life is on hold and, I hate to say it, I'm thinking that I might as well smoke again until I know I'm in the clear.  But I also know that smoking seems to interfere with BCG treatments, so I'm in a real fix.\n\nI've thought about vaping or some other alternative form of nicotine delivery, but I know it would lead me back to smoking cigarettes, my true love.  I've thought of just smoking cigarettes but not inhaling, which I used to do for much of my cigarettes anyway in an effort to cut down.  But I know I'd start inhaling a drag or two and would sooner or later be back up to five or so a day in no time.  I thought of smoking again and giving myself a longer period to cut down.  I only gave myself a day or so notice when I quiet in August.  But that plan wouldn't make sense.  Why go back to smoking after not smoking since late August just so I can stop again?  That's insane thinking.  In the end I won't smoke.  I just won't smoke.\n\nIn any event, I just wanted to post something about smoking since I'm sure it has been a subject of interest to many members of this forum and may be of interest to any future members.\t\t\t", "date": "2016-10-08T16:51:59+00:00", "topic": "Smoking.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks Sara.\n\nIt seems like some tumors begin growing in the muscle, for example, and some don't.  Is that correct?\n\nThe reason I ask is because, as you know, one of my tumors was very large and, because of this and the fact that I had two of them, there is a good chance I will have a recurrence episode.  From what I've read the chance that it can come back at a higher stage is a distinct possibility.  So I'm just wondering if a recurrence can be a stage 2, 3, or 4 without being a stage 0 or 1 first?\t\t\t", "date": "2016-09-17T20:15:19+00:00", "topic": "Question on how tumors grow, etc.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI didn't know where to put this question so I thought this would be as good a place as any.\n\nI am puzzled on how bladder cancer tumors develop or grow...I'm not sure how to word my question.\n\nI have read a lot of stories from people with bladder cancer.  One person may not discover a tumor for many months after the first symptoms appeared and the tumor turns out to be a stage 0, low grade.  Another person may find the tumor very quickly and it is a stage 2, high grade.  That is very confusing to me.\n\nI understand the staging of BC, but, for example, can a tumor be a stage 4 without every being a stage 0?  And, can a stage 0, if left untreated, become a stage 4?\n\nThank you for any information on this.  I have been very confused by it.\t\t\t", "date": "2016-09-17T20:15:19+00:00", "topic": "Question on how tumors grow, etc.", "subforum": "17-chit-chat"}]}