{"signature": ["Dx", "TURBT", "BCG"], "posts": [{"text": "\n\t\t\t\tBerta, I can agree with all those likely side effects Pat mentioned.  The problem here seems to be a lack of education amongst the Docs administering it.  I know mine doesn't seem to think there are any of these and told me so....but I still know otherwise.......\n\nI can report that those arthritic side effects with treatments #13-15 didn't pose anywhere near the same discomfort as treatments #6-12.  Got through it pretty well and now my arthritic back symptoms seem to get better all the time, so I remain optimistic.  But I still have another issue which I will post separately so as to not hijack this thread.  Hang in there....hopefully things will get better.\t\t\t", "date": "2009-06-30T00:01:16+00:00", "topic": "Cysto shows no growths", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI haven't been a very frequent visitor to this board since finishing my 15th BCG almost 4 weeks ago and hitting the road again.  Surprisingly, I didn't get much of an arthritic reaction with these last 3 treatments......wondering if the 6 months between the 12th and this last series was the biggest factor?  I still have the chills and am resigned to the fact I'll never get back to where I was earlier, but can live with that.\n\nWe're now traveling through So. California, passing through and camping in desert areas where temps have been up to 110.  Even higher, I imagine, when we get to Death Valley.   I figure there is always good and bad with everything, but for me, I will be having no issues with that heat while the Wife suffers immensely.  More heat????  Bring it on!!!!!\n\nYes, I'm enjoying the good health I've been blessed with but know our travels can end very quickly with the next cysto.  My hope is that each and every one of you can experience the best of health with your particular BC circumstances and live the kind of lifestyle you desire.  And Britt...my heart especially goes out to you...NO ONE should have to go through what you are experiencing, much less a guy who has given what you have for our Country.\t\t\t", "date": "2009-05-22T05:52:57+00:00", "topic": "Just Checking In.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBritt, I've had one TURB, 4 cystos and 15 BCG's and have experinced a lot of your symptoms, so I don't think you're the exception here.  I did have an enlarged prostrate issue before all this, with frequency and difficulty in urinating.  My Doc said we'd address that later.  Well, after all this poking and probing, I think he's enlarged the \"pipe\" by a great margin, so I don't have a flow problem, but cannot hold much volume at any time.  I believe his nurse said my bladder was now not as elastic as before, so that will be an issue going forward. Yeah, it's frustrating, but then I consider the alternative and suddenly I feel better about these issues.\t\t\t", "date": "2009-05-05T11:32:46+00:00", "topic": "A question for our other male members?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYeah, my Doc seemed to be a bit low key about the exact date, but recommended\nI do it within the next week.  So since he was at the hosp. the following day, he'd fit me in...and he did!  Wonder what else was going on that he didn't see the urgency?\n\nThinking back on that ultrasound, the tech looked at me...then brought the Radiologist in and he looked on the screen, saying \"move it around to here, etc.\" and it seemed like a long time they were looking.  Then he left, apparently satisfied he had seen enough.  So they called the Uro immediately and I went over to his office that same day.  We didn't waste any time on this...guess I'm glad I did.  Gee, one knows nothing about these things the first time, so we rely on our docs to steer us down the right path.  Apparently your Doc had other thoughts?  What other information became available months later when the decision was made to remove it?\t\t\t", "date": "2009-04-15T20:00:27+00:00", "topic": "blood and/or clots.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBritt, all they did to me was an ultrasound and I can remember the tech saying to me \"I'm sorry\".  That was all I needed to know even if she couldn't give me the diagnosis.   I know it was a tumor and the Doc later confirmed it.  I had the thing taken out the next day.  Resection is, I understand, just a word for \"slicing\" both the blood mass and the tumor into pieces so they could be flushed out.\t\t\t", "date": "2009-04-15T20:00:27+00:00", "topic": "blood and/or clots.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust got back from my 12 month cysto...all clear, so I live another 90 days! ", "date": "2009-03-25T18:57:12+00:00", "topic": "Cysto Tomorrow", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI've decided if the Doc doesn't want to reduce the strength, I'm going to reduce the dwell time myself...out of self-preservation.  I'm thinking I might just race home, roll around on all sides while gulping a couple glasses of water and let nature take its course.  Anything wrong with this approach?\t\t\t", "date": "2009-03-29T13:21:48+00:00", "topic": "Can I safely skip 6th treatment?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTo those who have experienced increasing side effects with progressive treatments...have any of you discussed with and received from your Doc a diluted mix of BCG?   Dr. Lamm feels a diluted dosage is the way to go in these instances and, in fact, has said the efficacy may be even better.  I need to discuss this with my Doc for my upcoming treatments, but I know he doesn't subscribe to my complaints of arthritic side effects.  All I know is I am suffering more and more from this.\t\t\t", "date": "2009-03-29T13:21:48+00:00", "topic": "Can I safely skip 6th treatment?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBritt, this is so typical of Gov't-run facilities.  Scares the h--- out of me about what's coming with this talk of Nationalized Medicine.  I still think you need to find another opinion, be it inside the VA or in private practice.  But the thought of hearing \"we don't got yer records\" or somesuch is very depressing for a patient to hear.  You are personally going through way to much as-is and don't need to hear THAT!\t\t\t", "date": "2009-03-16T16:27:17+00:00", "topic": "VA", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tChuck, I have not had MMC, rather, 12 treatments of BCG.  The last was in Oct. '08 and shortly after that I began experiencing constant chills to a degree I have never seen before.  Also, fatigue began before the BC diagnosis and continues to this day, although at a reduced rate.  So perhaps the BC itself is the cause as opposed to the treatments?  What have others experienced?\t\t\t", "date": "2009-01-26T20:58:02+00:00", "topic": "Mitomycin side effects", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFWIW...My Uro left the catheter in for a full week after the TURB.... He said 3-4 days is more normal, but he's found the healing is better if you don't subject the bladder to too much work too quickly after the procedure.  I seem to remember a quick and easy healing process, however, it was a real PAIN keeping that thing in there the extra few days. A REAL PAIN!!!!!! \n\nHow long are others leaving their catheters in?\t\t\t", "date": "2008-12-17T07:02:07+00:00", "topic": "WELL POOPOO", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBobbi, I know how reactive that BCG can be, as I've written before.  I was unable to do anything physical without paying for it for two days...and was thinking life just wouldn't ever be the same.  Then about 4 weeks after discontinuing the BCG, I suddenly recovered from all this arthritic stuff.  In fact, I mentioned it to my Uro and I don't think he wants to admit to the cause and effect of this....we've heard other Docs don't see this either.\n\nHere's hoping you will experience the same recovery once the BCG is terminated.\t\t\t", "date": "2008-12-28T17:36:37+00:00", "topic": "BCG side effects? Need Help!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoug, how in the World were you able to sit still long enough to eat a great dinner like that?  I'd have never been able to finish my \"Outback Special\" steak if I were you.\t\t\t", "date": "2008-12-23T10:03:22+00:00", "topic": "Time for more BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSapie, looks like you and I are on the same schedule.....with the same diagnosis too!  I've had the initial 6 treatments of BCG, followed by two maint. rounds.  No bleeding, but it did trigger a bad arthritic event which I just got over from.  So just keep in mind we all react differently to this.  You might discuss with your Doc the possibilities of taking a break from BCG for a 3 month interval, ala Dr. Lamm's protocol.  Might give your bladder time to heal?\t\t\t", "date": "2008-12-18T13:02:45+00:00", "topic": "BCG maintenance complications", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWarren-you pulled that thing out yourself?  What a tough cookie you are!  Yeeeeeeeow!  ", "date": "2008-12-02T17:39:26+00:00", "topic": "Here we go again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy next cysto is Dec 29....shall we make it a threesome?  ", "date": "2008-12-11T04:13:55+00:00", "topic": "It has been a while since I been here", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSame for me.....I had those red spots at the tumor location on the two follow-up cystos following my TURB.  I don't think you are out of the norm on this.\t\t\t", "date": "2008-12-11T16:03:14+00:00", "topic": "Just Venting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tINTRON?  Is that a new one?  I don't remember hearing much about that protocol on this forum...or have I been sleeping?  Anyway, thanks for the headsup, Suzi.  Might be helpful if you'd post the link...\t\t\t", "date": "2008-11-21T15:02:57+00:00", "topic": "Hi - just diagnosed with High Grade Non Invasive", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIf you've asked all the questions you can and have not received satisfactory answers, maybe its time to seek a second opinion?  ", "date": "2008-12-07T23:35:40+00:00", "topic": "2 BCG Treatments Down - 1 To Go", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't think a lot of these Docs use the reduced dosage method, but they should listen to the patient IMHO.  My Doc wanted to do the initial 6 BCG's, followed by three more maint. rounds of 3 over the next 9 months.  But after I did 12 total, I convinced him my arthritic side effects were rendering me useless and he agreed to move the last 3 to the one year anniversary of the original TURB-same as Dr. Lamm recommends.  I plan of hitting him up for a reduced dosage, but if not, I just may shorten the holding period to an hour or so instead of the usual 2 hrs.  That might help, I'm thinking.  Any thoughts?\t\t\t", "date": "2008-12-02T13:21:28+00:00", "topic": "Bladder Spasms", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMany of you have read my story of having back surgery followed by a staph infection followed by a bladder tumor.  I can tell you the past 2 years of have not been good for me at all.  About the time my back began to feel a bit better, we found this nasty thing in my bladder.  In March of this year I had my TURB, followed by 6 weeks of BCG, then two 3 week maintenance treatments which finally ended Oct 21.  Since initiating the BCG, I have experienced severe sciatica with pain down my leg, an very painful arthritic shoulder and swollen joints in my hands all during the time of treatment over the past 7 months.  I have had my pain mgmt. Doc prescribe a neurological medicine to trick my brain into thinking there was no pain.  But because of all the side effects I stopped taking that foul medicine a week ago.  My wife told me I looked and moved like I was 85 yrs. old....and I felt even older than that.  I couldn't do anything around the ol' motorhome without needing a couple days in bed to recover from all the back pain.  Last week an ortho. surgeon told me he couldn't offer me anything to improve my back/sciatica pain.  Really? I was wondering how I would spend the rest of my life with these conditions. \n\nOn Monday I woke up feeling \"different\" and as I moved about I began to wonder what happened to the chronic pain down my leg and in my back?  As I went through the day only a little pain returned, probably mostly due to fatigue.  On Tuesday things improved even more and have done so each succeeding day.  I can tell you I feel like I'm 10 yrs younger today than, say a week ago and have maybe only 5% of the pain I used to experience....certainly something very livable.  My shoulder feels much improved and as I type this my fingers feel back to their normal selves with no swelling or tightness in the joints. \n\nSo what happened?  I don't know for sure.  But I didn't go to one of those faith healer guys in a circus tent or anything like that.  I have been off the BCG about 4 weeks now and I honestly believe that is the only thing I can attribute this to.\n\nSo what does this all mean?  I would say to those who have experienced the arthritic effects we've been discussing here lately....just hang in there because better days must be ahead, if my experience is any indication.  I'm not saying everyone will experience what I have, but I wish each of you as much of a return to \"normal\" as possible after you get through your BCG treatments.  Now I wonder how I'll react to the longer-term maintenance BCG's at 12, 18, 24 months, etc.\t\t\t", "date": "2008-11-21T05:43:11+00:00", "topic": "Arthritic Effects?...You won\\'t Believe This", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tVery informative and complete article.  This also what caught my eye.\n\n\"Patients who develop a fever of higher than 39°C (102.2°F) and those who have gross hematuria, severe irritative symptoms lasting more than 72 hours, a urinary tract infection, elevated liver enzyme levels, arthritis, epididymoorchitis, or acute prostatitis should not receive additional BCG vaccine therapy until these findings have resolved. If BCG vaccine must be resumed, a half or a quarter dose can be administered. These are symptoms of a systemic BCG vaccine reaction, and further administration is unnecessary, immunosuppressive, and potentially lethal.\"\n\nNot sure I understand this, but is it saying one should just completely discontinue BCG when these conditions occur?  Is it then saying no more is needed since the BCG has done its job?  ", "date": "2008-11-11T03:25:43+00:00", "topic": "More on BCG-Induced Arthritis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tClaudia, I'm probably closer to your Dad's age, so can more directly relate to his seemingly more even-naturedness about all this.  See, you are sensing you could well lose your Dad and you are not prepared to let that happen.  That's understandable...and I can tell you it's happening in MY family as well.\n\nYou have to remember where your Dad and I are in our life's progression.  We have lived through a lot and if this event is to be fatal, well, that's the way it'll have to be.  But we'll go down fighting the best we can and the younger ones will have to go on without us.  So if you can't motivate him to do something you think he should do regarding this matter, try to support him in his decision...he likely knows the score.  However, in all probability, this will be \"nipped in the bud\" and you'll have nothing further to worry about.  Not a fun time in your life is it?  Isn't for me, either....but hang in there.\t\t\t", "date": "2008-11-11T00:20:30+00:00", "topic": "having a bad day", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongrats!  I say have two Margaritas NOW and you can always have that glass\nof wine when he gets home.  ", "date": "2008-10-27T21:10:17+00:00", "topic": "All clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, FWIW...I just had a flu shot right in the middle of my latest 3 BCG's and didn't feel any effects other than the usual more arthritic effects, stomach and lower abdominal pains and tiredness.  Other than that...nuthin!  ", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGuess I must be lucky.  I had BCG #10 yesterday and when emptying out, didn't even have the burning sensations we usually get.  This morning I woke up more refreshed than usual, with no symptoms whatsoever.  So this seems to show each of us is diffferent.\t\t\t", "date": "2008-09-24T16:28:11+00:00", "topic": "Symptoms of BCG reactions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW!, Ian, I can imagine what you're going through...I think.  MY plumbing was a bit closed off after the initial TURB, so the Doc had to use those rods they use on women to dialate my penis opening. And the initial BCG caths also posed problems, so my nurse ordered smaller catheters just for me (She's great!)  Now those caths seem to go in just great and I even think I could use a std. size.  but why bother?  Seems to me like the smaller it is, the less damage one would incur to the urethra.\t\t\t", "date": "2008-10-01T23:27:57+00:00", "topic": false, "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my second cysto today and the Doc says all looks fine, so will begin BCG treatments #10, 11 and 12 in a couple weeks.  As a lot of you know, I'm riding another \"high\" for the next few days.\t\t\t", "date": "2008-09-24T16:55:42+00:00", "topic": "Cysto Looks Good!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTommy, you beat me to it.  Brilliant? minds think alike. ", "date": "2008-08-05T20:55:48+00:00", "topic": "A Question on BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh, GREAT!  Another way of patronizing the FRENCH!  ", "date": "2008-07-21T20:37:55+00:00", "topic": "BCG and dealing with catheter pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDavid, you can count me in on the urethra stricture list.  I've been dialated a couple times over the past 4 months, so I know how you feel.  Somehow a piece of skin or ? gets in the way of the \"pipe\" opening and flow is reduced, along with entrance of that catheter.\n\nJon, I asked my nurse about this at my treatment yesterday and she told me no one was doing this lube thing in the past  (That was HER talking), so after seeing it with the cysto procedure, she thought \"Why not do it with catheterization?\" So I guess she figured it out on her own.  She used a #10 again on me, but this one was a clear color-not a red one like in the past.  The red is too flimsy and can get bent or caught up going \"down the chute\", so this stiff, clear one was her preference. (Wonder which one was French?)  Other then initially getting past my \"restriction\", I felt nothing and the BCG flow took only two minutes....no more.\n\nBecause each office orders these supplies on their own, they may not have any #10's lying around.  I'd certainly call and ask if this is a stock item they have available at all times.  Ditto for the lube.  This should be a piece of cake procedure and they are making things way to miserable for you.  Sorry for that, Jon.\t\t\t", "date": "2008-07-21T20:37:55+00:00", "topic": "BCG and dealing with catheter pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDave, I'll be doing #9 next week and can tell you for me, the side effects DID NOT get worse....actually better.  But that feel of constantly having to go, well, is nerve wracking.  It lasts into the second day for me.  Don't let it get you down.\t\t\t", "date": "2008-07-07T20:37:43+00:00", "topic": "Starting BCG next week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAt least most of us are \"oldies\" here, but if I had this at age 27, well, I really can't imagine how it would affect the rest of my life.  My heart goes out to you in having to deal with this at such a young age.  Congrats!  Let's hope you never have to see this thing re-occur.\t\t\t", "date": "2008-07-17T15:00:19+00:00", "topic": "9 month cysto!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhile we all would love to go 6 months between cystos, I don't think I would be comfy either, given your history of events.  I guess he thought that, with a 4 month interval and all clear, why not go 6 months?\t\t\t", "date": "2008-07-16T03:16:00+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuz, isn't it great to see where you are now, compared to how nervous you were at the beginning of all this?  I hope members of this board were able to provide the comfort you needed....NOW you're a pro and can help others.  And I do hope you get a clean result with that cysto...you deserve it, girl!\t\t\t", "date": "2008-07-10T14:26:55+00:00", "topic": "5th treatment  on Monday hooray", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat article brings up the question of how members of this board are receiving their treatments.  While I start my first of 3 maintenance treatments next week, I am under the impression my Doc wants a 6 week interval between the 3 instillments.    However, this article speaks of quarterly treatments, meaning there would be 9 weeks in between the 3 treatments.  Sooooo....what are others on this board doing?\t\t\t", "date": "2008-07-08T04:33:13+00:00", "topic": "Re-TURB and intravesical therapies....good article", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNix, does your Doc use a less concentrated form of BCG on those maint. treatments?  I though Dr. Lamm recommends a lower doseage for these vs the initial 6 treatments.\t\t\t", "date": "2008-07-01T02:57:21+00:00", "topic": "third bcg treatment  ugh", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWHEW!  I feel like the warden just came in and commuted my sentence.  Had the cysto this afternoon and all looks good.  This Margarita tastes sooooo good!\n\nFor those of you still facing that first one, I thought I'd offer a little perspective.  The scope used is not unlike what a plumber might use to check plumbing, but a little smaller of course.   A little light on the end of the probe, which swivels and bends at the tip so he can get a good look-see.  I watched the thing penetrate by looking at his little color monitor and could see it going down the \"pipe\", so to speak, and then entering the bladder.  The bladder walls were still a little reddish, likely a result of the BCG he said....and the tumor removal.  The area where he removed a golf ball-sized tumor 3 months ago had a couple pieces of skin dangling, probably bladder wall material, along with some signs of skin healing. All in all, he didn't see anything of concern and \"finally\" pulled the thing out.  The time doing the looking was only about a minute.  Some blood afterward and a little pain/discomfort, but overall I think a pretty trouble-free procedure.\n\nSo if you have that initial poke and peep upcoming, understand that you will be very apprehensive prior, but after the procedure and if all goes well, you'll be celebrating like I am.  Now where'd I put that bottle of Tequila?\t\t\t", "date": "2008-06-28T22:43:52+00:00", "topic": "First Poke and Peep", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara, I know how you fell since I felt the same way yesterday after my P&P.   As for celebrating, I wiped out my supply of Tequila and Triple Sec and even had to go out to get some more Marg. mix, but it was great fun!  Now we need to get back to normal....well....maybe in a few more days.....\t\t\t", "date": "2008-07-01T23:37:34+00:00", "topic": "First Poke and Peek post BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW!  Sounds like we just need to hang in there 'till this process becomes clinically available and maybe some of us  can avoid that dreaded bladder removal.  ", "date": "2008-06-28T08:19:20+00:00", "topic": "Synergo up for approval in the USA!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW!  Sorry about the news, David.  That IS a bummer!    Let's hope the MMC zapped anything remaining in there.  But it only goes to show you those famous words \"I got it all\" don't really mean anything.  That is why the follow ups are so important.\n\nI'm having my initial 90 day look-see next Monday and now, after reading of your results, am becoming very apprehensive about the outcome.  \t\t\t", "date": "2008-06-16T22:18:17+00:00", "topic": "Side effects from single MMC installation during TURBT?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think i am low on oil though . Smiley\n\nSuz, you took the words right out of my mouth.  Don't we ALL feel that way somedays?   ", "date": "2008-06-22T20:51:52+00:00", "topic": "are there any of you out there who's uro doesnt ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuz, the more you drink, the faster you'll get that stuff out of your bladder.  Remember, you need to get to bed and don't want to be up all night with this annoyance.  If you are experiencing a little burning, that should drop off tomorrow.  If some joint aches, you can take a couple Tylenols.\t\t\t", "date": "2008-06-17T01:46:57+00:00", "topic": "I did it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAaaaaaw Right!  Told 'ja so!   ;D  I knew you could do it...you just needed a little pushing you over the ledge, so to speak.  So congrats to you for your courage.\t\t\t", "date": "2008-06-17T01:46:57+00:00", "topic": "I did it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIf they are not checking the urine before EVERY treatment, they are just lazy and don't know what they are doing.  All they need is the sample and a test strip.  How tough is that?   ???\n\nSee, you do not want that treatment if you already have an infection brewing....your condition will likely get worse.  It appears to me they either don't care and are lazy or they are not clued-in on the std. protocol.  Yes, I'd seek help elsewhere if I were you.\t\t\t", "date": "2008-06-16T16:17:30+00:00", "topic": "Hi, after 5 days have past since my 5th BCG, now it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter my 3rd, I developed a fever about 4 days later and it turned out to be some king of bladder infection.  So get back to the Doc ASAP with this.  You do NOT want that infection to develop further!\t\t\t", "date": "2008-06-16T16:17:30+00:00", "topic": "Hi, after 5 days have past since my 5th BCG, now it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnyone know anything of Dr. Leach?  Since he's in my area, might be a good source for a second opinion if I need one?\t\t\t", "date": "2008-06-15T03:27:48+00:00", "topic": "Bladder Cancer in the news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSuz, don't worry about the bleach/potty thing.  I live in a motorhome and at first I went to my daughter's home for this.  After a while I figured out a way to do it \"at home\", so if I can do it, so can YOU!  (And don't ask for any more operational details of my approach)    This will be a piece of cake and soon you'll be telling us how easy it was.\t\t\t", "date": "2008-06-10T23:07:58+00:00", "topic": "susant...r u ok?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSusan, I have had fatigue the second half of 2007, stretching into this year when my tumor was removed on March 31.  The fatigue continued 'till the past few days and now I feel, for the first time, quite a bit more normal.  No extreme naps necessary like before.  So trust me....you WILL get through this....just hang in there and enjoy your naps for the time being.\t\t\t", "date": "2008-05-31T14:11:27+00:00", "topic": "bcg , what is it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just got over my urinary tract infection, winding up taking Bactrim to kill it off.  So when I went in for treatment #4, there was a question on whether I could do it with the Bactrim in my system.  The Doc finally said to go ahead, but he did NOT want me taking it again...or Cipro either.  I guess the thought is it will kill off the virus they are introducing with the BCG.  Seems to make sense, but we really do need to watch those infections.  I still have some Bactrim on hand and will use it the instant I get another infection.  Don't want to go through that again.\t\t\t", "date": "2008-04-18T01:49:35+00:00", "topic": "need input!! plz.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW!     That is very positive news.  Think about how this might evolve.  When diagnosed, you may have the option of conventional cysto and BCG, etc. or to simply grow a new bladder and implant.  Isn't medical science wonderful?\t\t\t", "date": "2008-05-20T09:26:18+00:00", "topic": "Working bladders grown from progenitor cells", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't know about that, but I do find that original cysto was a killer to my plumbing.  It took a few weeks to get all the scarring healed over and only now can I urinate more normally again.  But all those trips in and out can't be good long-term for one's urethra.\n\nI'm still fighting a bladder infection likely caused by one of those catheter insertions.  It's delayed my BCG's now by 2 weeks.  This is killing me and the Wife, since we sold our home last year and now live in a motorhome, set up to travel throughout the Country.  We've already lost our trip to Alaska this summer and wonder what's next...or if we will EVER be able to travel again.\t\t\t", "date": "2008-04-22T03:59:18+00:00", "topic": "First Treatment Today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara, I had a staph infection in Mar. 2007 following back surgery.  After a 5 week stint of daily IV's I guess it was cured, but I did have instances during the summer where I'd get discomfort in my lower abdomen.  I thought it was the staph coming back and went to the ER a few times, but no one found anything. The infectious disease Doc said I was cured and this didn't make any sense.  I also had pain in the abdomen when sitting up from a lying position.  Stupid me...I thought it had to do with mechanical weakness due to the back surgery.  Then later in the summer/fall I'd get tired in late morning and in mid-afternoon.  If I was driving the motorhome, I'd have to stop and take a nap in the bed, much to the consternation of my wife.  She thought it was just a result of me staying up too late.  The fatigue has continued through my BC diagnosis and after the removal.  Sure would like to get that behind me....   ", "date": "2008-05-21T00:26:01+00:00", "topic": "Finished BCG and still have questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSara, I too, have had a LOT of fatigue dating back to last fall before I even knew that thing was growing in me!  I still have to take a nap almost daily, so I'm not sure it's just the body's fatigue with fighting this enemy and/or the BCG....likely both.  As for the frequency, I have the same, but haven't chosen to make it an issue at this time.\t\t\t", "date": "2008-05-21T00:26:01+00:00", "topic": "Finished BCG and still have questions", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat story, Craig.  I really enjoyed reading that and thanks for sharing.  I hope you'll keep us up-to-date on any further developments.\t\t\t", "date": "2008-05-16T14:46:40+00:00", "topic": "3-MONTH CYSTO: Details on the Blog", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwesome, Max.  You must be feeling like your Avitar about now.  Keep it going and let's hope all of us have the same results.  Is this the one after your first 6 treatments?\t\t\t", "date": "2008-05-03T16:19:01+00:00", "topic": "GOOD NEWS!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tToday I called M D Anderson to enquire about going down for a second opinion.  Surprisingly, I was told I should wait 'till my first round of BCG treatments was over before setting an appointment for seeing a doc down there.  While I can understand one Doc not wanting to step on another's toes, I still wish to get the wheels moving on setting up that second opinion.  Am I missing something?  Or how can I get this moving sooner rather than later?\t\t\t", "date": "2008-05-06T22:25:32+00:00", "topic": "Second Opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks, what does \"calling the continental directly\" mean?  Is that Continental Air?  Or a hotel?  \t\t\t", "date": "2008-05-01T21:31:52+00:00", "topic": "Second Opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOK, I finally got the message.   :-[  Thanks to those here who recommended a second opinion and my good friend who also has his cancer in remission, I have decided to seek another opinion from the folks at MD Anderson Hosp.  Does anyone have a name/reference for me to contact down there?\t\t\t", "date": "2008-05-01T21:31:52+00:00", "topic": "Second Opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNice to hear of your favorable results.  Here's hoping I'll have similar success when I begin my treatments.\t\t\t", "date": "2008-04-09T23:12:30+00:00", "topic": "BCG QUESTIONS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had back surgery in Dec, 2006, followed by a staph infection which required another surgery in Mar. 2007.  I had IV treatments after that for 6 weeks to cure the staph, but I felt recurrences several times more through the later part of last year.  I just thought it was more of the staph that didn't get cured.  When I'd raise up in bed, I'd feel lower abdomen discomfort, but put it down to residuals from those surgeries.  This discomfort increased near the end of 2007 and in Feb. I saw my first blood.  Then in late March this year the blood came on with a vengeance and I had the tumor removed right away. The Doc also said I had a blood ball maybe 3 in. in diameter, which he also removed.\n\nSo how long can these things grow undetected?  In MY mind I had that thing for at least a year that I can feel, but who knows how much longer?  Mine was diagnosed as being \"very aggressive\", but I still wonder how it could take that long to grow if it is indeed that aggressive.  Or maybe the rate of development accelerated as it grew? \t\t\t", "date": "2008-04-19T16:52:19+00:00", "topic": "Tumor growth rate question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs a follow-up, I have been taking some Vitamin B-12 over the past week and am pleasantly surprised at the improvement in my fatigue. Not sure if it's just the recovery period after the Cysto or how much the B-12 has contributed, but at least I can go into my first BCG treatment feeling a bit better.     ", "date": "2008-04-10T07:15:26+00:00", "topic": "Fatigue Anyone?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt's interesting to hear of a couple others who've experienced the same fatigue.  I've felt this condition worsening over the past 6 months as my tumor grew, at least in my opinion.  So now that it's been removed I guess I expect a sudden improvement, but I guess the ol' body just doesn't see it that way.  Something I need to get used to, I suppose, considering the effects BCG might have on me.  But I'll take that if the treatments work.\t\t\t", "date": "2008-04-10T07:15:26+00:00", "topic": "Fatigue Anyone?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks to all of you for your words of encouragement.  Craig, your comments were spot on and I thank you for them.  So I guess the drill is if I fast for only 2 hrs. prior to treatment I should minimize the problems insofar as my body will allow.  Afterward,  I assume I'll know when I can eat again....when my system is ready for it.  I wonder if I should eat a bit of cereal 2 hrs. prior to my 10AM treatment?  Does this make any sense?\n\nBecause I live in a motorhome with only one toilet, I gotta take special care with this stuff. See, it ends up in my holding tank and I sure don't want it infecting my wife or others downstream at a later time.  So I guess I can just bleach it like everyone else and let it sit for a while....not much else to do, I'd think.\n\nThe initial shock of all this is beginning to subside for us, so we now must look forward with confidence that all is going to be OK.  Having people on this board to talk one through this is very comforting and I thank you again.\t\t\t", "date": "2008-04-08T04:23:47+00:00", "topic": "BCG Treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, FWIW...I just had a flu shot right in the middle of my latest 3 BCG's and didn't feel any effects other than the usual more arthritic effects, stomach and lower abdominal pains and tiredness.  Other than that...nuthin!  ", "date": "2008-10-27T21:15:14+00:00", "topic": "BCG and flu shots", "subforum": "17-chit-chat"}]}