{"signature": ["TURBT", "TURBT", "TURBT", "BCG", "TURBT", "BCG", "TURBT"], "posts": [{"text": "\n\t\t\t\tIf I have learned anything with these surgeries and treatments… is go easy!\nI am on vacation now from my TURB Dec 23rd and I really thought I was ready for bike rides and golf… and I was …. my little bladder was not..\n\nGo on vacation… but just go easy on your bladder… drink lots of water too.\t\t\t", "date": "2015-01-23T01:34:12+00:00", "topic": "Newly diagnosed and confused!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tyou sound a lot like me!\nI was told of this almost 3 years ago… I just finished with my 5 turb… surgery I call them.. on Dec 23rd\nI am 56 and never even heard of bladder cancer!\nEvery 3 months I go into Boston to be checked. I have had 2 6 week treatments of BCG… last one was with the big backorder… I did finish… I am not sure if it makes it worse… Since my first round in Jan of 14 I ended up with more tumors… high grade 2 and 2 more surgeries…. Oh I could go on…. I am in Key West at the moment and ended up clotting so bad from what I though was healed enough to ride my bike and golf… I ended up in ER for 4 days\n\nBut I know of a good friend that had this once… over 5 years ago and it has never returned…\n\ndeep breaths… chin up… and write a blog… I did one and it helps for your memory as well…\nSandy Locapo\t\t\t", "date": "2015-01-23T01:34:12+00:00", "topic": "Newly diagnosed and confused!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKeep a good chin up… I was bleeding as well for a few months… thought it was menopause… tests for everything to rule things out…. Bladder Cancer! My whole world fell apart! That was May of 2012… I have had 3 surgeries since then. Going in every 3 months… I have had a surgery in May of 2012, May 2013, and Nov 2013 all low grade.. today I had my 2nd of 6 weeks chemo BCG to really try and zap it.. I so hope it works and I hope you will do well too. I have 2 grown boys 29 and 32 and I smoked for many years quit 12 years ago… I stopped dying my hair when I was told I had this...\t\t\t", "date": "2013-11-21T02:13:52+00:00", "topic": "Newly diagnosed mother of 5", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI hope next week will be better.. Thank you for your reply. I worked 12 hours today and I am ready for the pillow.\t\t\t", "date": "2014-01-08T22:14:10+00:00", "topic": "1st BCG yesterday ... 5 more to go", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you so much for your reply and information. I plan on a good nights sleep tonight. Thank you again!\t\t\t", "date": "2014-01-08T22:14:10+00:00", "topic": "1st BCG yesterday ... 5 more to go", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI have had 3 surgerys in less than a year 1/2 - feeling tired and slugish today. TB is what they put in us? Is this man made? Looking forward to spring.\t\t\t", "date": "2014-01-08T22:14:10+00:00", "topic": "1st BCG yesterday ... 5 more to go", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI have been dealing with right side severe flank pain … doctors say it has nothing to do with my cancer… anyone? oh at night it is the worst.. I have been dealing with this since Nov. off and on… is it the bed? is it a intestinal bug?\t\t\t", "date": "2015-01-27T14:43:35+00:00", "topic": "flank pain", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBelieve me I have been thinking a lot of what I need to ask… do… or don't do.\nI am getting a bit frustrated with my B&W Boston doctor… its just back and forth emails for answers… I heard he is retiring in June so I will be getting a new doctor then.\n\nThe doctor I had in Key West - very small hospital with big big hearts! Dr Fariss was wonderful very informative and stopped in all 4 days I was there as well as performed the cauterization.\n\nI am very concerned as to why they keep coming back.. and yes have wondered if I have to do a next step… what is the procedure you mentioned? my guess is a pocket cathier…of some sort.\n\nI am still in florida and quite frankly can't wait to get back to the cold north… It is home and always will be… end of the month can not come soon enough… no biking no golfing no lifting no stairs no swimming  really just sit around so I do not clot again. I would never wish a manual plunging of clots to anyone!\t\t\t", "date": "2015-01-23T15:12:58+00:00", "topic": "Clotting and how much can a bladder take…..", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my 5th… 5th TURB - surgery on Dec 23.. in Boston.. well let me back up.. my scope in Oct after my July TURB came back clear.. but middle of November my side back started to hurt a lot… ct scans.. no stones.. nope nothing… pee test.. no cancer cells present…. towards end of Nov early Dec.. I start to bleed..\nGo easy… drink drink drink water…\nhey… I am leaving on a month to Key West Dec 26th.. I need to know what is going on Boston!\nOkay in for a scope - oh a little one maybe causing the bleeding… okay come in Dec 23rd for TURB #5\nSo I do… I go…. what I thought was easy for christmas.. and dec 28th I am in the local ER with massive  clots and scared as hell!\nThey call Boston… get your fluids and rest….no Key West for about a week.\nWell I drank the whole water company till I peed clear.. and headed south…\nI played one round of golf on Jan 12th and rode my bike for a few days… 3 - to about 10 miles… a cruise bike mind you not a racing bike…\nJan 16th I wake up to peeing lots of blood and clots again..\nI email Boston …. rest... get off the advil ( for the back pain) no bike no golf ...drink more water…\nMidnight - I cannot pee and end up in ER with a flushing catheter. I cannot describe the clots! they pasted right around the catheter and were 8\" or more curled up… At one point they had to manually PLUNGED them out of me…..I have never ever in my life felt pain like I did with that!\n\nWell the 4th day they cauterized my bladder in 4 spots… and I went back to my vacation home…\nHow much can a little bladder take?? I am worn out and so afraid to even pick something up or even afraid to pee or look at it to see blood or clots….\t\t\t", "date": "2015-01-23T15:12:58+00:00", "topic": "Clotting and how much can a bladder take…..", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI went in for my 5th BCG Tuesday at Brigham and Womans in Boston. I was told of the shortage the week before and they were making sure they had enough… They really had no answers as to what was going on.\n\nThis week they had more news…. it all boils down to the dollar…. the company in France that produces it for our treatments and for other uses.. is not making a big enough profit! So they are hoping another pharm. company will buy them.  BWH does have enough to finish on going treatments but any new people coming in for it will not get it.. Miacin might be used although I was told it is not as strong…. thats my update!\t\t\t", "date": "2014-09-04T12:27:45+00:00", "topic": "BCG Shortage update", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have every night a Wheatgrass smoothie with Strawberry, mango and banana crush with ice… very good and helps kill cancer cells…\t\t\t", "date": "2014-09-05T00:17:01+00:00", "topic": "Taking this on myself!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you for reading my post and replying…\n\nI would not give up TURBs or Treatments… I just needed to do something \"outside the box\" of medicine for myself ….\n\nI think the 2 going together is a good thing and more doctors should encourage it…\n\nHave a great weekend!\t\t\t", "date": "2014-09-05T00:17:01+00:00", "topic": "Taking this on myself!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had 4 surgeries since May of 2012\nBefore this was discovered.. I worked out hard 2 -3 nights a week… I jogged and I played golf 1-2 days a week.\n\nThis past Jan/Feb I had the 6 week BCG treatments on a Tuesday… on Wednesday I was on the couch…. feeling like the flu and a mac truck sitting on me……. Every Wednesday I would expect this….\n\nThrough the winter and this 6 week treatment I was eating just normal….( comfort food ) I don't go to fast food - I love to cook and bake….. So not working out… not jogging and no golf…\n\nI figured I would get though the 6 weeks and when Spring comes I will start back running and playing Golf…. get back in shape and eat better…. Well guess what! Bladder Cancer came back and came back double the amount of tumors… and came back high grade….What the hell happened!???  6 weeks of treatment and this happens? So I have surgery in July and then 6 more weeks of BCG… the couch the truck and the flu feel….. So I decided to do something on my own as well… NO MORE SUGAR! NO MORE WHITES! NO PROCESSED AT ALL!  I have lost 15 pounds ( not from the cancer) and NOT ONCE…. NOT ONCE ON THE COUCH…. NO TRUCK…. NO FUL FEELINGS!! and I even played Golf last night WED!  I eat only - Veggies, Fruits, Meats, Nuts, Eggs, Water Water Water and a Wheatgrass Smoothie every night.  My body feels clear… Look up how Sugar loves loves loves cancer cells!  I am looking forward to my scopes… I told my doctor I have a house in Key West for the month of Jan on the Golf Course! Lets fix this!\t\t\t", "date": "2014-09-05T00:17:01+00:00", "topic": "Taking this on myself!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am going on my 4th visit this coming Tuesday. I have found that Wed is somewhat like a small pickup hit me but really nothing major.  I do take the day off so I don't wear myself out. I have no bleeding or burning. I have felt the past few days a … lets call it feels like I stretched a muscle in my groin area… I think its my bladder saying …hey.. done with this… lets get better….  Pretty much everything I read on this site is spot on and I wish you the best of health!\t\t\t", "date": "2014-01-25T03:28:28+00:00", "topic": "hope to start BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Cindy for you reply. I will have a lot of questions next week at Dana Farber. It seems like once I started with the BCG treatments I ended up with more tumors and now this… so I am very concerned about going on to IV chemo… Thank you for this site… I passed it on to a woman who's Mom is dealing with this cancer and was very thankful for our venting.\t\t\t", "date": "2015-02-27T00:06:43+00:00", "topic": "It moved to my kidney - any advice ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have had 5 TURB's last on being Dec 23rd 2014.. they went in to take 1 tumor out that they thought was causing the heavy bleeding I was having… and severe flank pain.. they said I did not have stones or blockage that they could see…. I will make this story short as I can …..\nI left for vacation in Key West to end up 4 days in the hospital with a flush cath. I flew back to Boston to be admitted to Brigham & Womans for 8 days… it had moved to my kidney and a lymph node… it had attached to my back muscle and they had to shave my muscle to remove the kidney that was completely gone.. filled with urine and blood. They opened me from top of belly to belly button… this was dam scary to say the least… I am home and will be starting chemo with Dana Farber in a few weeks. They said this was a 1 - 2 % chance it would have traveled from the bladder to the kidney…  I am afraid to do the IV chemo… but I just don't know… anyone out there dealing with this??\t\t\t", "date": "2015-02-27T00:06:43+00:00", "topic": "It moved to my kidney - any advice ?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell it is now May 28th… I had my last bladder tumor removed Dec 23rd. I then still had the pain and clots … Feb 9th I had my kidney removed along with lymph nodes. I have been doing IV chemo since March and will get my new results mid June. I did have my bladder checked and for once in 3 years… May 29th it will be… wow…  I got my 6 month check up. so its been a ride. My son gets married on Saturday and I plan to dance and enjoy! enjoy every day!\t\t\t", "date": "2014-06-27T01:20:38+00:00", "topic": "4th time for surgery", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tThis 4th of July week I am going in for my 4th time of removing these darn tumors… I go in to Boston every 3 months to be checked… I finished in mid Feb 6 weeks of BCG and hoped I could be done with it. Well its back for the 4th time. My 1st surgery was May 2012 then May 2013, Nov 2013 and now July 2014\n\nI am very baffled as to why… why do they keep \"popping\" up? I have had the chemo wash and the BCG and I will have the wash again with this surgery… how many can be in there? or how do they keep getting in there? Is it something I eat or drink that trigger them?\t\t\t", "date": "2014-06-27T01:20:38+00:00", "topic": "4th time for surgery", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tGoing to my 4th one this Tuesday.. Doing fine other than a couple tired blah days… I do have a constant stretch like feel in my lower… groin? area? a lot when I stand up. Any clue?\t\t\t", "date": "2014-01-14T00:17:02+00:00", "topic": "bcg question", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tYes I was told that as well and have read about it… Chemo has many forms ( types ) So strange that someone thought to take tb and test it for bc…\t\t\t", "date": "2014-01-14T00:17:02+00:00", "topic": "bcg question", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tFor sure after #6! I have been dealing with this since May of 2012. I have had 3 surgeries and now this 6 weeks of treatments. I was told by my surgeon that this is a treatment of chemo. Did your doctor tell you differently?\t\t\t", "date": "2014-01-14T00:17:02+00:00", "topic": "bcg question", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI quit smoking 11 years ago… my dad smoked and died of testicular cancer years ago. I stopped dying my hair when they told me people working with hair dyes ( some ) or leather hides.. I just figured it would be a good time to just go grey and love it..\n\nI have to figure smoking is my reason for bladder cancer. I am so glad I quit.\t\t\t", "date": "2013-11-14T02:11:37+00:00", "topic": "3rd time for surgery", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tThank you for the great encouragement! This is a wonderful site that has been set up for us all.. questions, answers, concerns and a new extension of a family in a way\n…\t\t\t", "date": "2013-11-14T02:11:37+00:00", "topic": "3rd time for surgery", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tIt is a small world… I was on the chat line a few Sundays ago and spoke with a person from Tenn. and at the same time Oslo Norway….  Maine which part? I have a stepmom in Wayne Maine and friends in Portland..\nMy second surgery was a year to the day of my first…. then this 3rd time was less than 6 months… I hope they stop growing in there…. but I also look at it this way… better to grow in my bladder than out of it…\nDid you smoke? Did you work with dyes?\t\t\t", "date": "2013-11-14T02:11:37+00:00", "topic": "3rd time for surgery", "subforum": "10-women-and-bladder-cancer"}]}