{"signature": ["TURBT"], "posts": [{"text": "\n\t\t\t\tDoes your mother have kidney failure? Why is she on dialysis? Removing the kidneys and bladder is a very major surgery. If both kidneys are surgically removed, the pain involved might be high. How old is your mother? I think you should discuss with the doctor about other possibilities before going for a surgery. Have you had a second opinion? If not, please do. Take care. Good luck.\n\n-Shoba.\t\t\t", "date": "2006-08-21T03:23:10+00:00", "topic": "mother having surgury in 2 weeks", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGlad to see you didn't have any issues. I was asked to hold it for 2 hours. Just make sure you don't drink any liquids 2-3 hours prior to the procedure. I am on a monthly dosage now.\t\t\t", "date": "2012-07-23T21:22:09+00:00", "topic": "mitomycin treatments  (are they worth it?)", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYes, Mike. Most probably, I will be scoping in a month. I have a surgery scheduled to remove my native left kidney with the ureter cuff, as that is at high risk now.\nTo provide some background, I originally had a kidney transplant when I was 23, in 1998 due to chronic renal failure of both my kidneys. Thanks to my sweet mother who donated her kidney, I am alive today. 7 years back, I got upper tract TCC ( muscle invasive, high grade tumor) in my right native kidney's ureter. So, had a surgery to remove the kidney and the ureter. Was a complicated one, because of my transplant kidney. Had 4 cycles of chemo as well. Have been regulary following up with cystos and MRI scans from then on.\nAfter 7 years, on finding this tumor, the doctors are advising me to remove the native left kidney as well along with the ureter as it is more of a liability. Anyway, it is not functional and not being used. I am due to have the surgery by next month and my URO would have to do a cystoscopy to make sure there is no tumor in the bladder before the surgery. Just keeping my fingers crossed.\t\t\t", "date": "2012-01-25T21:09:06+00:00", "topic": "After 7 years, papillary Ta,High grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Sara,\nThanks for the reply. I got a second opinion from an urologist at Stanford University. I was referred to him by an urology-oncologist there, who has been a big support for me as I know her personally. So, I am hoping it is reliable. When I said chemo, I was talking about mytomycin instillation. Will check out others too.\t\t\t", "date": "2012-01-25T21:09:06+00:00", "topic": "After 7 years, papillary Ta,High grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\nI had upper tract TCC 7 years back and was recently diagnosed with pTa, high grade 1cm tumor in my bladder.  My doctor did a TURB and got it out. He did a mytomycin flush as well after the TURB. Consulted another urologist for second opinion and they are advising the wait and watch mode, maybe, with a couple of mitomycin treatments.I am not eligible for BCG as I am on immunosuppressants. Any inputs please? I am planning to consult with my Uro again for further treatments. Is it OK not to do any chemo right now?\t\t\t", "date": "2012-01-25T21:09:06+00:00", "topic": "After 7 years, papillary Ta,High grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Shenor,\nI had TCC of the ureter , had kidney& ureter removal surgery in  Dec 2004.Going for regular MRI,cysto every 3 months till now . In the bladder webcafe, if you look at \"Upper tract TCC\", you will find people who have had their surgery with further recurrence in the bladder. You can send mail to them to find out about the treatments. I have had no incidence of cancer so far after my surgery and chemo (cisplatin/gemzar).\nHope this helps.\n\n-Shoba\t\t\t", "date": "2006-07-11T14:59:01+00:00", "topic": "transitional cell kidney cancer now in bladder", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHolly,\nThe good news is that it is not invasive. I had invasive TCC in my ureter and luckily, it had not spread when they found it. If the cancer is termed invasive and it occurs in the ureter or the kidney, it would mean that it can invade through your muscles surrounding that region and has more probability of spreading . Since yours is not invasive, unless it is close to a blood vessel, it should mostly be contained and not metastatised elsewhere. Usually, superficial cancers in the ureter have a very good prognosis.  You most probabily have the pain because of the growth in the ureter or the kidney. I had pain too especially after my biopsy during which my ureter got almost completely blocked.Hope this helps. Good luck..\n\n-Shoba.\t\t\t", "date": "2006-06-07T07:17:56+00:00", "topic": "Anybody experience this pain before dx?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Dan,\nI went through the same chemo regime of Cisplatin-Gemzar , which was later substituted with Carboplatin after two cycles because of rise in my creatinine. Since I was already a kidney transplant recipient, I was at major risk and was constantly monitored and the docs were very observant and I was admitted as an inpatient to make sure all the cisplatin is flushed out without fail.\nMy creatinine was at 1.5 at the end of chemo, and was in the same level for the first one year. But, slowly it started reducing and my report from last week showed it at 1.0 which is very very rare for me, with my kidney complications and the medicines that I take.Its been 2.5 yrs since my chemo. I didn't take any supplements particular for kidney function improvement. I asked my doc to reduce the dosage of my transplant medications to boost immunity and also to reduce toxicity for the kidneys. I take Vitamin C & E and that's pretty much it. I do exercise regularly and drink a lot of water.Hope this helps and I am sure yours will also reduce after sometime,since you are normal otherwise. But, it is better to check it with a nephrologist rather than just visiting your onco & urologist.\t\t\t", "date": "2007-10-01T21:57:01+00:00", "topic": "Post Chemo kidney function ", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDan,\nI had the same problem with cisplatin. My kidney function was compromised and I was already a kidney transplant patient. So, to preserve the only kidney I had, docs switched it to Carboplatin. From what I know, both are platinum drugs and are quite effective. For lung and ovarian cancers, they have already started replacing cisplatin with carboplatin , but for TCC, it is still not fully proven. I had 2 cycles of cisplatin & Gemzar, followed by 2 cycles of carboplatin & gemzar. Since you already had 3 cycles with cisplatin, I think the docs made the right decision and nothing should be compromised.Hope this helps.\n\n-Shoba\t\t\t", "date": "2007-06-03T17:25:32+00:00", "topic": "Cisplatin v. Carboplatin", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDeb,\nI am very sorry to hear about the complications that your husband is going through. I would definitely stress on getting a second opinion , for the diagnosis and especially for the chemo. If the doctors decided to go ahead with Taxol/Carbo combo because of kidney function being low, then I just dont understand how they can go ahead with Gemzar/Cisplatin . Cisplatin is toxic to the kidneys and carboplatin is not. I was switched from Cisplatin to Carboplatin since my kidney function deteriorated after 2 cycles of chemo. Please ask them these questions before proceeding with the chemo and please find another oncologist and take a second opinion.\nGood luck.\n-Shoba.\t\t\t", "date": "2006-10-04T02:37:06+00:00", "topic": "Losing control of lives", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tZachary,\nI was reading your blog regarding your first session with cisplatin. For my sessions of cisplatin, I was hospitalised since cisplatin is toxic to the kidneys and I have only one - and that too a transplanted one. The docs wanted me to be close to ER till atleast 70% of the drug comes out.And my urine output was monitored for two days!. My husband had his laptop out and was the official scorer   .The doctors gave me mannitol as the dieurtic. In your next session, check it out with your doc. From what I have heard, mannitol is the standard drug that is given for cisplatin. Isn't it strange that they ask you to hydrate a lot, forcing you to drink water when you are feeling nauseous.\nMy other side effect was losing hair. It started two weeks after the first infusion. Hair loss in not common with cisplatin though.\t\t\t", "date": "2006-10-11T23:51:24+00:00", "topic": "&amp;amp;quot;Standing On My Head&amp;amp;quot;--my chemo blog", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Zachary & Clur,\nThere is a website www.redtoenail.org . This site is for cancer patients and where they maintain blogs. I am a member and have my own blog. You will find different types of cancer patients . It would be good if you have a blog there, so that  others can support you with their experiences as well. It is a very good support group. Check it out.\n\n-Rgds,\nShoba.\t\t\t", "date": "2006-10-11T23:51:24+00:00", "topic": "&amp;amp;quot;Standing On My Head&amp;amp;quot;--my chemo blog", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSteve,\nI have had chemotherapy without cystectomy.  For transitional cell carcinoma, usually, the recommended chemo is cisplatin + gemzar, if it is intravenous. Basically, platinum salts work for killing these cells. I was also treated after surgery for flushing out any microscopic cells present. The main side effects of cisplatin is nausea and it is also toxic to kidneys. So, the docs should hydrate her before administering that drug. Hydration is very important.Gemzar is not that toxic. Some people have hair loss too with cisplatin. Since the docs are trying to treat only microscopic cells, they might recommend 3-4 cycles of chemo. In my case, since I already had a kidney transplant , I was given 2 cycles of cisplatin + gemzar and 2 cycles of carboplatin+ gemzar. Carboplatin is less toxic to kidneys than cisplatin. You will find more details about the various chemos at  blcwebcafe.org/chemosused.asp . Hope this helps.\n\nBtw, have you had a second pathology opinion.\n\n-Shoba.\t\t\t", "date": "2006-08-24T07:26:46+00:00", "topic": "Wife Had cystectomy yesterday advice please", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Sara,\nAs Wendy said, the side effects vary among different persons. I had nausea, but again the anti-nausea drugs are very helpful and prevented me from vomiting. Loss of hair 3 weeks after my first cycle started. Cisplatin affects the WBC count and brings it  low and forced me to go for neupogen shots to boost it. Gemzar affects RBC count and I had to take blood transfusion ,just once though.And it definitely varies from person to person. I am very sensitive to drugs and reacted in full swing to all of them...  My WBC used to go down real low and then neupogen will bring it up alaramingly high...but I have seen people who dont react that much and handle all the drugs very well.  And it is cumulative as Wendy pointed.Hope this helps.\nGood luck to you and your mother,\nShoba.\n", "date": "2007-01-04T06:07:37+00:00", "topic": "Platinol and Gemcitabine?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\nI had upper tract TCC and was treated with cisplatin and gemzar for the first two cycles and two more cycles of carboplatin and gemzar. My side effects were loss of WBC,RBC and nausea...and hair loss. Gemzar is a fairly less toxic drug when compared to the platinum ones. I am not sure about the new drugs that they are planning for your treatment.\n\n-Shoba.\t\t\t", "date": "2006-03-14T03:20:35+00:00", "topic": "Bladder Cancer Metastasis in Lung", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\t ;D  ;D  ;D  ;D\nLoved it....\t\t\t", "date": "2008-02-15T18:34:51+00:00", "topic": "Amazing automatic screen cleaner", "subforum": "17-chit-chat"}]}