{"signature": ["Surgery", "TURBT", "Dx", "TURBT", "Dx", "BCG"], "posts": [{"text": "\n\t\t\t\tHi Joyce,\n\nI'm thinking and praying for you as you go for your appointment tomorrow.  Keep us posted.\n\nOne thing I might mention that I always do that I have found helpful, is that I always record the appointment on my cell phone.  (Many cell phones have a \"voice record\" mode.)   My first app't I just asked the Dr. if he minded--now he waits for me to be ready!  I find it helpful in case there is something I didn't remember exactly.  My husband is always with me too, but it's interesting how we sometimes \"hear\" things differently--so I have it all recorded for further reference.\n\n(((Hugs))),\nTeresa\t\t\t", "date": "2013-07-04T22:48:58+00:00", "topic": "Waiting for consult-scared to death", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi again, Catherine,\n\nYes, I seem to be getting along just fine with one kidney as well.  It's been over a year now.  I feel great....except for this little bump in the road.  It's been quite the journey....and it's not over yet.  But see again....with Cynthia, she lost the kidney AFTER bc.  I just find it interesting that mine was in the kidney FIRST.\n\nI do have one sort of tech-y  question that you might be able to help me with.  I can't seem to find the info on the site....or I'm not looking in the right place.  I notice that most of the people who write in this forum have an automatic \"signature\" which seems to show the major milestones in their story.  How do I do that?\n\nI have begun writing my entire story on my blog, but it doesn't seem to be up yet.  I guess someone reviews them first?\n\nHave a great weekend!\t\t\t", "date": "2013-07-05T18:39:35+00:00", "topic": "Kidney Cancer THEN Bladder Cancer?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Folks,\n\nA lot of you have been here a long time.  Thanks for forging the way.  I just recently found this website/support group.  I was diagnosed with bladder cancer (CIS) in January of this year.  BUT it was last year (2012) that I had the same type of cancer (Transitional Cell Carcinoma OR Urothelial Cell Carcinoma; high grade) in my kidney.  I had a radical laproscopic nephro-ureterectomy in May 2012.\n\nI know that more commonly it will start in the bladder and sometimes it will move to the upper tract.  Has anyone else on this site had my scenario?  Just curious as I have not found anyone yet.  I know everyone's story is different.  Interesting!\n\nBy the way....I'm in the middle of BCG treatments now.  I just had my 2nd one on Wed. (July 3rd).  Two down and 4 to go for this phase.\nSo far it has been going well.  The first week the only side effect was fatigue that evening and the next day.  Second one, same fatigue, also some irritation in the urethra for a few hours in the evening.\n\nHugs to you all!\t\t\t", "date": "2013-07-05T18:39:35+00:00", "topic": "Kidney Cancer THEN Bladder Cancer?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Catherine,\nThank you for your warm welcome and encouragement.\nBlessings,\nTeresa\t\t\t", "date": "2013-05-01T10:12:11+00:00", "topic": "Mum diagnosed with TCC/UCC cancer in Kidney &amp;amp;mets", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey James,\n\nAny further word about your Mum?  I am a new member here and just read over your posts.  I was diagnosed with TCC in my right kidney last year.  CT scan showed a very small lesion in my liver also, but it is a small cyst.\n\nI had a radical laproscopic nephro-ureterectomy in May 2012.  I'm doing well, but have since been diagnosed with (TCC) urothelial carcinoma in my bladder.  I have just had my first 2 BCG treatments (4 more to go in this \"induction phase\").\n\nI also am in my 50's.  Diagnosed at age 55.  Funny thing is, I just didn't see it coming.  All my friends say I'm the most \"health conscious\" person they know.  Even the first urologist I saw scratched his head and said that I just didn't fit the profile.\n\nAnyway....interested to hear how your Mum is doing.  I am praying for her.\n\nShalom,\nTeresa\t\t\t", "date": "2013-05-01T10:12:11+00:00", "topic": "Mum diagnosed with TCC/UCC cancer in Kidney &amp;amp;mets", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey Folks,\n\nYes, I hear you all.  One of those very difficult decisions to make.  Catherine....4 in 4 years.  Not bad.  I had 3 (also double because of the contrast.....actually one was a triple!) in 1 year!  When the Dr. suggested one more that same year--I questioned whether it was really necessary.\nYes, with high grade bladder cancer, and esp. because it started in my kidney and now I only have one kidney left--I need to know what's going on in that other kidney.  But I'm still not absolutely convinced that a CT scan is the only way.  Even a urine cytology would show cancer cells IF something IS going on in the kidney.  I am sent for regular chest x-rays too!\n\nI will probably need another soon, and yes, I'll probably have it.\n\nI did find a great article (that I tried to attach but wasn't successful) with suggestions for helping to guard against the toxic effects of CT scans.  It could be found on the internet if you do a search.\n\nBlessings to you all!\nTeresa\np.s.  BCG #4 (of induction phase) tomorrow!\t\t\t", "date": "2013-07-15T23:52:34+00:00", "topic": "CT scan worth the radiation?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you, Celeste!\nBest of luck to you too!  Let us know how it goes!  The 23rd is only a little over a week away.\nSaying a little prayer for you!\t\t\t", "date": "2013-08-13T21:24:41+00:00", "topic": "Induction Phase of BCG completed!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Folks!\n\nHaven't been on this site too often.  Had my youngest daughter and her husband and new baby visiting from Saskatchewan.  I did manage to read over a lot of your posts.  ((((HUGS)))) to you all!\n\nWell....first round of BCG treatments is over!  Last one was on July 31st.  Thanking the Lord that it wasn't too, too bad.  Fatigue....yes!  Burning and urgency....only for the first hour or so after I started peeing.   I took a homeopathic remedy for the burning and it seemed to kick in within 15 to 30 minutes.\n\nNow I wait.  Why is the mental battle the most difficult?  Did anyone watch the \"Bladder Cancer Virtual Symposium\" on July 17th?  I didn't manage to tune in on the day but watched it later.  It scared me!!  One of the Dr.'s mentioned that people who have both CIS AND T1 have an 80% chance of BCG failure and he was strongly recommending bladder removal immediately.\nBad news.....I do have both.  And high-grade, invasive.  AND I had had TCC in my kidney first.  So this Dr's words didn't exactly encourage me.  There is such a fine line between obtaining information and being pushed into fear.\nSo...I'm determined to keep my thoughts positive.\n\nMike....love your quote:  \"Cancer free until proven otherwise!\"  I am going to start declaring that!\n\nI try to encourage myself by remembering that 80%   ISN'T  100% !  There is another 20% that it DOES work for!  Also, I live a healthy lifestyle.  I'm eating a very clean diet, juicing veggies, taking supplements, being sure I get my rest, trying not to stress....  Etc. Etc. Etc.\n\nHave any of you used alternative treatments to supplement your medical treatments?  I would be most interested in hearing what you're doing.\n\nMy follow-up cystoscopy is on Sept. 18th.....another whole month to wait and then another week or so before the cytology comes back.\n\nYour prayers for \"peace\" would be most appreciated!  I know you all understand fully!!\nLove, shalom and hugs to you all!\nTeresa\t\t\t", "date": "2013-08-13T21:24:41+00:00", "topic": "Induction Phase of BCG completed!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Gail,\n\nI just read your story today.  Wow!  You sure have been through a lot.....and prevailed!  You're a fighter.  How are you doing now?  I pray that you may not only be surviving but THRIVING!\n\nShalom,\nTeresa\t\t\t", "date": "2012-03-13T21:37:44+00:00", "topic": "My badder cancer story", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}]}