{"signature": ["Dx", "Dx"], "posts": [{"text": "\n\t\t\t\tMike\n\nI've read your posts with interest.  Steve had his first BCG 9 days ago and forty eight hours after developed high fever, chills, headache, pain in kidneys, stomach ache.  He looked and felt dreaful.  He couldn't even get out of bed to see gp on the Monday (he had the BCG on the Friday). I dragged him to docs on Tuesday. he had a temp of 40 deg and he was told he had a severe kidney infection, was prescribed antibiotics.  He was better by Friday. Went into hospital to see Urology nurse for second BCG who wouldn't give it because of his 'infection'. Although when she 'dipped' his pee it was clear, except for blood traces.  She said she doubted it was a BCG reaction and was far more likely to be a kidney infecton.  He is due to get his next dose this Thursday.  I am convinced he may well suffer again, so Christmas is looking bleak for him - although I may be wrong. If he does suffer again, then we will know it is a reaction to the BCG won't we?\n\nRab\t\t\t", "date": "2006-11-28T22:29:27+00:00", "topic": "BCG question", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi\n\nThanks for all your replies to date. It is sooo fantastic having this website - although it is very early days for us I feel better just knowing it is only a wobble of the mouse away!\n\nGreg - our hospital is Solihull/Heartlands. He has been seen by one consultant urologist who is the head urology/onco chap for the area.  He specialises in bladder cancers and has years of experience.  This is all happening NHS.  We do not have private health insurance but did wonder whether it would pay to see the consultant privately.  To date, the NHS have been very quick in admitting Steve - diagnosed on a Wednesday, operated on a Monday (gp wasn't so fast considering she thought it may have been an infection 10 months previously - Steve keeps telling me to stop 'harping on about the past', but I get wound up just thinking why they didn't fast track him back then...).\n\nBTW, am I replying correctly? Do I have to start a new topic every time 'to get noticed' or have you all picked up this message?\n\nRab\n\n\n", "date": "2006-11-26T14:01:08+00:00", "topic": "UK Hubby, 45, G2 with CIS - we think! Scared too!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Folks\n\nSteve completed his last lot of maintenance treatment on 21st December. He had 3 instillations at full strength which is the normal procedure here in the UK.  They do not use weaker solutions, but may cut down on instillations if side effects become worrisome.  However, first and second instillation, a breeze, third one has caused frequent urination. Every two hours, 24/7. For four weeks.  Has anyone else suffered like this?  Urine culture has been tested. 'Pustules'present but no infection.  Steve reckons his bladder is just red raw from too much bcg and he has got to live with it until it heals.  I notice some of you have been prescribed drugs for frequency, but that does not seem to be the case here.  He is finding it hard to run his business and socialise to any great extent as his life is spent in the loo! So far, he has had 6 bcg, then 3, then 2, then 3.  He blames me for having 3 bcgs this time as his last biopsy showed atypical cells (his original diagnosis was T1G3 + CIS) and I said  go for 3 just to be safe. Feedback welcomed.  Ceri\n", "date": "2008-01-19T15:24:57+00:00", "topic": "Frequent Urination post BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Folks\n\nSteve has just had his annual scope today.  He had his last one in July which was clear after 6 initial BCGs then a maintenance of 3, followed three months later by 2.  His Uro - a 'top guy' here in the Midlands, UK, said there was some 'fluffy stuff' on the dome of the bladder which he burnt off, and some velvety regions which he has biopsied.  Steve asked if he was surprised by these findings. He said no.  He then said 'we will wait for Histology results and most likely proceed with further maintenance BCG'.  This worries me slightly as I thought a recurrence of CIS post BCG would mean an RC.  Do you think they may try one more time with BCG and then make a decision? Velvety regions usually mean CIS does it not? We are disappointed as we really hoped he would be in the 80% of people for whom BCG works. Hey Ho.\t\t\t", "date": "2007-10-26T15:50:41+00:00", "topic": "Steve's annual scope - CIS Back?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh and by the way, he voided every 5 minutes for 3 hours and passed clots - if that makes you feel any better ......\t\t\t", "date": "2007-05-03T16:43:03+00:00", "topic": "PROSED - Medication for BCG burning", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Rosemary\n\nJust to say Steve has just completed his first three maintenance BCGs.  His 3rd one left him doubled up in pain. It was awful.  The pain and burning was only mildly relieved by co-proxomol.  Wonder if he can get your 'numbing' stuff here in the UK?  He has also had a urine infection, 10 days after instillation, which has been treated with antibiotics.  He doesn't want next 3 in 4 weeks time. I think this may be different to the USA.  We have 6, then 3, then another 3 five weeks later, then biopsy. He said the last of the 3 was the worse pain ever. However, knees have been ok, but eyes are quite dry. and tiredness is the same as ever.\n\nSorry to hear about your symptoms, but it seems to be the way for some sufferers.  However, no sign of CIS after first 6 so hoping it is going to stay that way.\n\nBy the way, how much water to you drink a day?\n\nCeri\nx\t\t\t", "date": "2007-05-03T16:43:03+00:00", "topic": "PROSED - Medication for BCG burning", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for your replies.  Tim, your posts are always of interest to me because you are a similar age to Steve and had a similar diagnosis and live in the UK.  As you know, Steve has only been living with this for the last 6 months so we shall go down the BCG route for now, although I must be honest, he was all for having the bladder out as he hates the stuff.  It is the constant lethargy he can't stand. We have a three year old and he feels so guilty at having to lie down on the sofa most afternoons rather than being in the park. He just hasn't been able to muster the energy. We are hoping the maintenance won't be quite as aggressive as the first 6 instillations (although I suppose that's a lot to hope for).\n\nTim - what vitamin supplement do you recommend? Oncovite isn't available here is it, and there must be an equivalent out there.  Chris - after reading your post, I take it you don't take vitamin supplements?\nI am always so interested in everyone's perspective. This website is such a learning curve.\n\nCeri\n", "date": "2007-03-20T16:43:57+00:00", "topic": "Update on Steve, BCG etc", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Folks\n\nI previously posted stating that Steve had suffered very bad side effects to the BCG, namely conjunctivitis and painful joints.  We now know after two visits to our local Eye Hospital that he has Dry Eyes and scratched corneas - and never had conjunctivitis (misdiagnosed by GP). He has had this now for four weeks and regular drops are just starting to improve his vision.  He has been unable to drive or work since this happened.  His joints still hurt first thing but NSAIDs help.  His mouth ulcers have been treated with steroids and his spots of face and chest come and go.  We went to see his Consultant last week who informed us that since 2000 he and his 'team' have put approx 2 people a month through BCG - so approx 150 in 7 years - and only two have had serious side effects, Steve being the worst he had witnessed.  The other sufferer was a 40 year old male.  It was explained that younger people do suffer more than older. He said he will not allow Steve to have any more BCG. His next Op is on 5th March and we will have to wait and see what effect the 6 doses have had on the bladder.  His diagnosis was Ta/G2 (not T1 as I was originally told) and multi-focal CIS.  He said if the CIS is still there then the bladder will come out. His words were 'I am not happy to leave in a bladder with severe dysplasia'.  Surely though, we should wait for the 6 month check as I believe BCG takes this long to work?  Also, as Steve is now starting to feel better, he said that he would reconsider a lower dose of BCG. The Consultant referred to Dr Lamm and said the US tend to follow his 'paper' but we sometimes chose to do things differently and didn't go with the 'lower dose' regimen. Hmmm. Anyway, we are off to Dubai tomorrow in the hope that the sun and sea will make him feel a lot better (although friends have said the flight and desert heat could play havoc with his eyes!).  I'll keep you posted. Ceri\t\t\t", "date": "2007-02-13T14:47:01+00:00", "topic": "Steve's BCG Nightmare", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Rosemary\n\nJust an update of Steve's symptoms.  It appears he never had conjunctivits! After 12 days of awful eye problems we ended up at the Eye Hospital on Sunday for 4 hours and he was diagnosed as having extremely DRY eyes which had caused the closing of his lids and swelling.  He has to put artificial tears in his eyes 8 times a day and we are going back to Eye doc on Friday.  Also, he has developed horrendous mouth ulcers. He has never had them before. He has been prescribed Corlan pellets - a mild steroid for those. He has a very dry mouth and nasal passages.  We are going to see Consultant Urologist on Thursday so perhaps he will be able to fill us in more.  I mean, are these symptoms just a side effect of BCG or a BCG infection or some induced chronic 'syndrome'.  He still has very sore knee joints but they are helped with NSAIDs.  The irony is, his peeing/bladder, are causing no problems at all.\n\nWe have booked to go on holiday to Dubai next week, so we are hoping we can go, he is looking forward to it and hope that a week in the sun may help. Not sure about dry eyes though - that desert heat! But, hey, we've got to live our lives haven't we?!\n\nRegards\n\nCeri\t\t\t", "date": "2007-01-26T19:39:34+00:00", "topic": "Very Sore Eyes after 6 week BCG plus aches/pains", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi\n\nTook Steve to GP yesterday as he was so poorly. Diagnosed a severe kidney infection which, in fact, produces the fever, chills, severe lower back pain. I am glad it is this (although am sorry he is so poorly) rather than it being a bad reaction to the BCG - but this infection may be masking any symptoms he may be having anyway.  Is on antibiotics and is going to hospital tomorrow for second instillation - I don't think they will give it to him but we shall go anyway and see what happens.\n\nThanks for your feedback, it certainly helps\n\nRab\n\n", "date": "2006-12-11T13:13:53+00:00", "topic": "Feeling rough 72 hours after BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Wendy. I have now phoned the Urology Nurse a the Hospital who suggested that if his symptoms persisted tomorrow then take a urine sample of gp for testing - perhaps it is a UTI? She said it is unusual to have a reaction 3 days after the instillation - most reactions occur much faster than that apparently and to drink as much as possible - but not tea or coffee. He said he no longer feels hot just extremely lethargic - no energy and a dull ache in the 'kidney' region. I'll let you know how he progresses.\n\nRab\n\n", "date": "2006-12-11T13:13:53+00:00", "topic": "Feeling rough 72 hours after BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi\n\nSteve is feeling really rough today and has left office and is in bed! Had first BCG on Friday 8th. Been fine all weekend. Today woke up with chills, achy body and no energy.  Is this normal? Bit worried as second instillation is on Thursday.  I said I would phone hospital to check out his symptoms but he wants me to wait until tomorrow.  Keep thinking if he feels like this after first BCG how is he going to feel with subsequent instillations? As he has a T1/G2 and CIS I know how important this treatment is.\n\nAny feedback would be greatly appreciated.\n\nRab\t\t\t", "date": "2006-12-11T13:13:53+00:00", "topic": "Feeling rough 72 hours after BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMe again.  Steve is going to commence BCG on 8th December which will be nearly 5 weeks after his TURB.   Is this the norm? He was supposed to start this week but he is away in Spain. Does the time delay make a big difference? Also, all our daughters little friends have gone down with chickenpox this week so I am just waiting for the spots to erupt on her.  Steve hasn't had chickenpox.  If he gets it, will they still do the BCG?   Oh, why does everything always happen at once...?\n\nRab\t\t\t", "date": "2006-11-28T18:20:55+00:00", "topic": "Time lapse between TURB and BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Folks\n\nJust wondering.  Steve has been on Anafranil now for clinical depression for 7 years. He is fine, the drugs have made sure of that - except the recent diagnosis of BC has slightly rocked his boat! Actually, his reaction when he found out was - 'well the depression was far more scarier that this'! Anyway up, I have checked out this drug and it is, in addition to being an anti-dep, is prescribed to kids with night time bedwetting problems since it causes the bladder to hold onto urine for longer - or so to speak.  So, would I be right in thinking that Steve has not been emptying his bladder as often as normal as the drug acts to prevent regular peeing!! Obviously, I need to speak to his Uro about this but it is interesting nonetheless.  I am encouraging to drink loads of water - something he finds hard to do - in order to get him to pee more and flush the bladder out. But, if the tablets are causing problems with the bladder would it better to seek a way to come off them - not easy I know?\n\nRab\t\t\t", "date": "2006-11-27T23:47:30+00:00", "topic": "Anti-depressants and the Bladder!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGuys,  has anyone suffered from 'ejaculation problems' post surgery, bcg?  Steve's semen 'output' on ejaculation has been greatly reduced.  I did read that this could be 'retrograde ejaculation' caused by 'bladder neck surgeries' (great!).  All this means is that the semen gets taken back into the bladder rather than down the urethra - you then wee it out later!  It causes no harm, so to speak, but as I was rather hankering after another baby and so this darned BC condition causes yet another problem!\n\nAny feedback would be appreciated!\n\nC.\t\t\t", "date": "2007-05-30T10:12:33+00:00", "topic": "A bit embarrassing .....", "subforum": "6-men-and-bladder-cancer"}]}