{"signature": ["Dx", "Dx", "BCG", "BCG", "Dx", "TURBT"], "posts": [{"text": "\n\t\t\t\tYour doctor would be the best one to ask how much water you should be drinking.  I found Pat's post very informative.\n\nGood Luck!\t\t\t", "date": "2009-02-14T19:04:17+00:00", "topic": "An answer to Venke\\'s blog", "subforum": "3-newly-diagnosed"}, {"text": "\n...... 2nd After the TUR she had a catheter with something going in as well and the usual urine coming out? What is that about? .....\nThey could have been running bladder irrigation (saline from a bag runs into the bladder via a catherter).  The doctor makes that decision at times if there was a lot of bleeding or a large area of resection to prevent a blood clot from forming.  I'm sure there are also other reasons but I know in my husband's case that was why.  They sent him home after his second TURBT and we ended up in the Emergency Room because he was in severe pain.  A blood clot the size of a tennis ball had formed in the bladder.  He was admitted and they ran continous bladder irrigation for two days.  It's possible your mom's doctor was being proactive--which is a good thing.\t\t\t", "date": "2007-09-22T23:26:10+00:00", "topic": "My Mother just went through her 2nd TUR and....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDavid\n\nMy husband and his bladder cancer story are quite similar.  We also live our life in three month blocks.\nHis treatments so far have included BCG 6 treatments.  At 3 months cysto there were visible tumor recurrences and once inside during TURBT there were 12 wartlike areas that could be seen.\nNext treatment Mitomycin.  He had a horrible reaction to this as you did to BCG.  At three month Cysto, once again recurrence.\nNext treatment BCG with interferon.  3 Month cysto showed two small papillary tumors so once again TURBT.\nAll pathology has come back T1G3.\nWe are at the end of the treatment rope.  Wednesday is a Cysto and if there are once again new tumors we will be talking about RC.\nI feel as if he has made a valiant attempt to avoid RC but I also think that time is working against him at this point.  He has never made even a three month Cysto clean.\n\nGood luck with the Mitomycin.  It might be the right mix for you against the big \"C\"!\t\t\t", "date": "2008-06-10T16:37:35+00:00", "topic": "What are the odds of recurring non-invasive CIS/Dysplasia Upstaging??", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Catherine.  This IS the place to be at times like this!\n\nCT scan complete so now my favorite part - sit and wait.\n\nMy husband's flank pain is not better but not worse.  It must be quite painful because he usually takes the pain medicine they prescibe post TURBT surgery for a day or so but he has had to use it regularly and asked me to call for a refill today. I am assuming under the blanket of oxycodone there is some nasty pain and discomfort.  Poor guy.  Another indication of how under the weather he feels is that he has not been to work all week and I can count on one hand the number of times he has called in to work and he is 53 years old!\n\nJust hoping for a simple fix and nothing new to be concerned about.\n\n ", "date": "2013-05-01T16:28:21+00:00", "topic": "Cancer Return and new Ureter problems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAfter finally reaching the \"one-year\" plan in between cystos, there it was - a tumor hanging from the dome of the bladder at the one year cysto this past Friday.  I guess we had a false sense of security that we had beat this cancer and I honestly did not think we would see a tumor during the cysto.  BANG!  Reality set in fast.\n\nHubby had his TURBT This past Friday April 26 and the tumor removal went smooth but our doctor noted that one of the ureter openings was very small and considered putting a stent in surgery but decided against it.  He wanted a CT first (which is scheduled for today at 3pm).  My husband also decided to tell me AFTER the surgery was over that he has been experiencing pain \"here\" (as he placed his hand directly on his right kidney area).  He didn't want to say anything because he was afraid his cancer had spread. We must have had the \"say something when someting is bothering you\" talk a million times over the past 6 years.\n\nNeedless to say I am very worried what this CT scan will reveal.\n\nMMC, I have read your story and recent happenings and you are one hell of a trooper.  You have been such a inspiration to so many and I wish you the absolute best through the next step in your journey.  I think we started posting approximately the same time and you and my husband were diagnosed very close together.\n\nThere are many posters whose stories and names are familiar to me and I have been catching up with my reading here.  It's like coming home again and being able to have others who understand the joy and the fears unlike no others.\n\nEven though I am not here often I am grateful I have a safe, comfortable and informational place to come when I need to.\n\nI need to update the below stats!\t\t\t", "date": "2013-05-01T16:28:21+00:00", "topic": "Cancer Return and new Ureter problems", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Anita and Catherine\n\nThe old waiting game.  I thought maybe someone here had a crystal ball to guide me.  Patricia is about as magical as they come but I don't think even she can see into the future.\n\nDon't get me wrong.  I am grateful for the few times he had a clear cysto and that so far he has been able to save his bladder.  I've seen many people here in much worse scenarios as we are in.  Even though I don't post often I do read the forum often and think of many of the posters here.  There are so many amazing people who inspire me to take things day by day.\n\nEric felt so confident that this was behind him that he got a new job 2 months ago and left his previous job of 10 years.  It was a huge decision for him.  I can only hope his new employer will be as understanding as his past employer.  Of course with the new job came a new truck payment.... \n\nCatherine you hit the nail on the head regarding the doc \"deviating\" from the normal routine.  Having known him for 5+ years now I can tell when he is concerned and when he is happy.  I also in the room during the procedure and saw the monitor during the cysto and there were significant changes that have not been there before.  There were bright red bloody areas that were much larger than any inflamation I have seen in the past.  Most times there would be inflamation, it would be after a series of BCG.  The areas this time looked so different than BCG inflamation ever looked.\n\nI'm also amazed at how tough the bladder is.  The inside of his bladder looks used and abused compared to the very first images we got when it was pink and smooth.\t\t\t", "date": "2011-08-22T21:04:02+00:00", "topic": "Back AGAIN!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell I am back again.  I guess we all know what that means.\n\nI don't even know where I left off with my husband's never ending Bladder Cancer situation.  The point we are at right now is he had finally made it to the 6 month Cystoscopy check up for the first time in 5 years.  I tried to count the number if BCG and BCG w/interferon treatments and I cannot come up with an exact number but I can without doubt say that the number is over 25.  I wish I had kept a better ongoing treatment journal as religiously as I did at the start of the journey.  There has also been 3 TURB's, a zillion cysto's (some with biopsies and some with biopsies with cauterization done as office procedures) and we can toss in a treatment or two of Mitomycin which he can never have again due to severe inflamatory reaction. Whew!\n\nThis past Thursday at his 6 month Cysto there were very obvious bight red inflamed areas.  Within the first 45 seconds our doctor said he needed to go to the OR for Cysto with biopsy. I am assuming he didn't like the look of the areas or it was more complicated than what we have seen in prior office cystos because usually if there is something questionable he will do the biopsy right then and there.  He also said he wanted it done ASAP so 4 days later which brought is to today he had the procedure.\n\nThe doctor spoke to me after surgery and said that because some of the areas were large and he wanted to make sure he went as deep as possible there was quite a bit of bleeding and so hubby would be coming home with a catheter.\n\nThis really hit him hard today.  He thought all of this was behind him and that he would be in and out today and back to work tomorrow.  He went from sad to mad when he woke up and realized that he feels like he is starting this whole journey from step one.  The one thing he does have on his side is he is healthy as a horse!  No daily meds and a heart rate of 48 and blood pressure of 110/70. I can only dream of having such perfect vitals.\n\nAny advice or similar stories out there?  I know we have to wait for the pathology report but does anyone have an opinion of how this will play out?\n\nThanks for listening.  I am just rambling and full of nervous energy.\t\t\t", "date": "2011-08-22T21:04:02+00:00", "topic": "Back AGAIN!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAhhhhhh okay I understand now.  I was thinking of an Infectious disease such as MRSA or osteomyeltis which I have been battling for the past year.\n\nWe do have a very good relationship with an infectious disease doctor.\n\nThank you both very very much.  I do appreciate your explanations.\n\nNix #24 for you huh?  Just when you think you know what's going on and BAM!  They toss us a curve ball.\n\nI will update and let you know what happens.  And Pat I am always sending you extra good wishes becasue you really deserve them.\t\t\t", "date": "2009-11-22T21:38:42+00:00", "topic": "Worst Pain of 30+ BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThank you Nix but I am confused as to how and or why an infectious disease doctor fits into this picture.  Can you explain more please?\t\t\t", "date": "2009-11-22T21:38:42+00:00", "topic": "Worst Pain of 30+ BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWe are home and hubby is sleeping very soundly.  As he heard the prep was worse than the test.\nThey did remove 3 polyps and found hemeorhoids.  The doctor felt the colon in general looked good.\nI am relieved that it's over.  The waiting kills me.\nThank you all again for listening.  It really means so much.  I sometimes feel a bit guilty as I know many people are dealing with much worse scenarios but take the time to ease my worrying head.  Which I have a headache from as I type!\nWe were told the biopsy can take 2 weeks. I know his primary will call a soon as the report crosses his desk.\n\nThank you Thank you,\nPamela\t\t\t", "date": "2009-01-11T22:27:51+00:00", "topic": "Colonoscopy Anyone?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAbout a month ago I posted that my husband had 2 new tumors at the 3 month Cysto check.  Very familiar territoy for him as he has never had a clean 3 month Cysto.\nHowever this was the first time they did a biopsy in the procedure room.  Reflecting on that day there are a couple of unsettling images that have not left my mind.\nWhen the doctor grabbed tumor #1 with the mini scissors and pulled not all of the tumor was removed and there was a lot of floating particles of tissue/tumor.  This scares me.  Can a small particle enter the bloodstream and make a home somewhere else in the body?\nThe pathology came back low grade for the first time ever.  Due to some staging/grading discrepancies early on they had been sending all of my husband's samples to two different labs.  This was not done this time.  So therefore I am hoping this is not an understage as it happens so often with bladder cancer.\nEven though my husband is considered a BCG failure x 2 he has currently completed two of three treatments as of Friday.  The final one will be this coming Friday and a repeat Cysto in January.\nI just feel like each and every time he does a series of treatments that he is playing with fire and that eventually he's going to get burned.  I respect his decisions but they are not what I would chose for him.  It weighs heavily on my mind that he is going to regret trying to save his bladder instead of playing it safe and saving his life.\nSorry I rambled but I feel so uneasy when I think about the situation and I respect so many of you that contribute here and I am grateful for any input.\t\t\t", "date": "2008-12-07T23:35:40+00:00", "topic": "2 BCG Treatments Down - 1 To Go", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat\nHas anyone told you how wonderful you are?\n\nThanks\nPamela\t\t\t", "date": "2008-11-03T23:26:18+00:00", "topic": "Did waiting increase the chance of mets?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHas the past year and a half or so of being treated with BCG, Mitomycin and BCG with Interferon with poor results increase the possibility that the cancer may have spread?\nThis has been a concern of mine from day one.  Aside from the intial scans for mets husband has not been rescanned.\nBeing at the end of the road as far as treatment options I am assuming they will rescan again if RC is looking like the answer to end this rollercoaster ride.\nHas anyone been this route and found mets before RC?\t\t\t", "date": "2008-11-03T23:26:18+00:00", "topic": "Did waiting increase the chance of mets?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nPatricia wrote:OUCH...a biopsy in the office?  You are so close to so many top facilities that deal in large volume with blc.  Have you been to MSK in NYC yet?  I personally can't say enough good things about them.  If i hadn't had my second opinion there and second TURB i'm positive i wouldn't be here today.  I just read a figure where most local uro's do an average of 3 cystectomies a year...at MSK...probably each one of their blc surgeons does close to 200 and they have some of the best pathologists in the country.\nI agree with Cynthia completely.  I don't know what it is about our bladders????  We'll chop off or take just about anything else out of us but we're completely obsessed when it comes to our bladders.  Truth is the diversions work...takes a bit of training...but they work.\nPat\nIt was not a very pleasant experince to say the least.  Also the delay of having to lay there while they went to get the cautery machine to stop the bleeding was torture.  I was sweating more than my husband.  He's a trooper.\nWe went to Brighams and Womens twice since diagnosis and also to a local oncologist who is directly affiliated with B&W.  That was a good move on our part becasue he called while we were in the appointment room and we had a conference call with the chief of urology.  At that point in time everyone was on the same page.\nEarly on we had a discrepancy on the tumor grade. Two pathologists were using two different systems to grade the tumors yet they worked in the same lab. Go figure.  Since then we have the biopsies sent to two different labs EVERY time for our own peice of mind.\nMoney is a huge part of why we cannot travel too far to gather 2nd and 3rd opinions.  I know money isn't everything but we do need a roof over our head and if I miss work in today's economy we would quickly drown.\nRosemary~\nI do truly appreciate your opinion.  I lurk a lot and you are always so level headed and honest.  Thank you.\nCynthia~\nDuring the Cysto Friday Dr C did point out all the scar tissue. It's everywhere.  My husband's tumors have been in all different parts of the bladder.  It's almost as if they never grow in the same place twice.\nMy line of thinking regarding the scar tissue is not that it is a contributor but maybe a tougher surface for the cancer to \"grow\" through.\nWhat made me wonder regarding the cancer growing out of the bladder as opposed to into the bladder, was earlier this spring I saw a flower grow out of the cement but there were no flowers an inch away in the dirt.  If a flower can force it's way through cement before it grows through the dirt, why can't the cancer be the same way?\nSorry if I ramble but it's been an unsettled weekend around here.\t\t\t", "date": "2008-11-01T15:54:23+00:00", "topic": "Three Month Cysto -  Never Clean", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThere is a female condom if anyone is interested in trying it \n\nMy husband is more worried about it not being \"safe\" for me no matter what the use of protection would be.\n\nI am really surprised that some docs say the day after BCG is safe.  That really worries me.\t\t\t", "date": "2008-08-05T20:55:48+00:00", "topic": "A Question on BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlso an important reminder, with some cancer policies if you are unable to obtain a policy because you have already been diagnosed, once you are cancer free for one year you can be eligible.  With the known high rate of recurrence of bladder cancer it would be a great idea.  The Aflac policy I have gives a flat $5000. at time of diagnosis plus all of the stated benefits and payments listed above. It was too late for my husband when I was offered the insurance but I am hoping someday if he is cancer free for one year I would definently invest in one for him.\t\t\t", "date": "2007-10-04T11:15:57+00:00", "topic": "Cancer Insurance Policies and BCG's", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Warren for the info\nThat is an interesting theory to pursue if there is no medical reasons found for his pain\n\nBubbles\t\t\t", "date": "2007-09-15T22:25:56+00:00", "topic": "One Year Later", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi everyone\nSince my last post it has been non stop visits back and forth to the urologist.  BCG and interferon will not be starting this Friday as planned.  Hubby has had severe burning during urination and abdominal pain and pressure and they finally booked a CT scan.\nHe has been getting up at least once an hour overnight for the last three weeks to 'go\".  During the day it is even worse.  Needless to say it has been exhausting physically and mentally.  Ditropan and pyridium didn't help at all. Nor did a miold sedative at bed time.\nThree urine tests were negative for infection.  Three bladder scans showed the bladder was not reatining urine and yet the symptoms continue.\nI am sure that he is no longer having any side effects since his last TURBT (4 weeks and 4 days ago).  Something else is wrong and going on in his abdomen.  He has a constant feeling of pressure in his pelvic area and it hurts in his lower abdomen when he sits.\nHe has never had any of these symptoms before.  Any input?\n\nI am really nervous that the CT scan may see something new......\n\nThank you\nBubbles\n\n", "date": "2007-09-15T22:25:56+00:00", "topic": "One Year Later", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAt one point during my husband's journey we switched insurance companies and the Urology office did not have our updated insurance info.  They did the Cysto and we got the bill -- $650.00 OUCH!\nWe did get reimbursed from the insurane company.\nUsually we only pay our co-pay which is $10.  With the always changing health insurance plans, types of coverages, co-pays and deductibles---nothing surprises me any more!\nAsk your health insurer to direct you where in your member \"handbook\" you can find information regarding the particular questions you may have.\nGood Luck!\t\t\t", "date": "2007-09-15T21:56:35+00:00", "topic": "Cost of cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI currently have a PICC line and it is efficient and easy to take care of.  I did have one problem when it became blocked but the nurse came and did a cath flow (all she did was but some medication in the line) and it cleared the line in 1/2 an hour.\nAs far as having the PICC line inserted I recommend requesting a sedative or relaxing pill.  It was slightly uncomfortable and I think I was tense which made the procedure a little painful.  I would ask for some type of chill pill if I had to have another one inserted.  My arm was sore and felt like I had a pulled muscle for about 5 days after insertion.  Once it's in doesn't hurt at all.\nI've had my line in for 8 weeks now and have no complications or problems.  I should mention that I do not have my line because of bladder cancer.  I come to this site becasue my husband is the bladder cancer patient.\nWhat a pair we are!\t\t\t", "date": "2009-04-30T23:57:55+00:00", "topic": "Ports", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTry taking a pillow and holding it against your abdomen when in the car.  I had to do that for a few weeks post hysterectomy and it really did help!\nTry it and let me know!\t\t\t", "date": "2008-08-14T16:53:41+00:00", "topic": "Bumps in the Road", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow Maria you sure have had a long list of things to deal with.\nNot having  your  doctor directly affiliated with the hospital you were admitted to can cause problems unfortunately.  It's just too bad you had to hear the \"not cleaning up someone elses mess\" comments.  That is so unprofessional.\nDid you get a direct answer as to what/what was the cause of the pocket of fluid was?\n\nTake care and I hope you are feeling better soon!\t\t\t", "date": "2008-08-06T00:07:55+00:00", "topic": "Update", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWOW!  13 hours.  The human body really is amazing. I hope Will has an uneventful and fast recovery and puts that BlackBerry to good use soon.\n\nI would like to add that all hospitals, big or small, have Social Services department and they will always arrange a \"discharge plan\" which will include home visits from VNA (Visiting Nurses) for wound care, stoma care--whatever the patients needs are.  Unfortunately social workers are another profession where they are over worked and have huge case loads.  It is important to ask to speak with one early on so that when it comes close to discharge time there is already a plan in place.\n\nAs far as the private room I urge everyone to ask for one.  Often we have been given one without asking.  Recovering can be so much easier without a roomate.\n\nSending my hope for a fast and speedy recovery!\t\t\t", "date": "2008-07-24T10:56:54+00:00", "topic": "12-hour Operation for Neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm glad things are going a little smoother for you.\n\nA \"care plan\" will be made by the male nurse who assessed Dick.  Sometimes they forget the small things so if there is anything missing do not be afraid to ask and see if they can \"add it onto the care plan\".  In my experience the aides have to follow the care plan to the letter.\n\nIt sounds like you are taking great care of all of him - not just his legs and feet!\t\t\t", "date": "2008-10-04T08:30:03+00:00", "topic": "Shoved out the door", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Julie\nI am so sorry for your run around with the home healh care services.  Sometimes I am embarassed to admit that I am a coordinator for home health and hospice care.  It is a very confusing world to enter and understand.  Some coordinators have unfortunately become numb to the ideal of compassion and customer service.\n\nI can applaud you for being persistant and fighting for what you want.  However I am also sad that getting what you need has been so difficult. There should be a nurse case manager that works specifically for your husband's primary care physician or at the Cancer Center.  You may find working with her/him will be easier than working with a nurse case manager that is responsible for patients being discharged.  Case managers in that position are not as familiar with the patient, the needs, the expectations and the necessities of the patient.  And, not an excuse, but they are usually overworked and given such a huge number of patients that they cannot provide quality services to everyone that they deserve.\n\nYou are doing the right thing and I'm so sorry it is so exhausting.  As if you don't have enough other things to occupy your mind and time.  Keep at it. After all the sqeaky wheel gets the grease.\n\nIf there are any home health questions that I could help you with please feel free to ask.  Policies and requirements vary from state to state but basic common sense, compassion and communication should be universal.\n\nSincerely\nPamela\t\t\t", "date": "2008-10-04T08:30:03+00:00", "topic": "Shoved out the door", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tIt never fails that when my husband is on pain meds he gets the \"full\" feeling and it makes him extremely uncomfortable.  He usually is prescribed Vicodin or Percocet and I have finally learned to give me a Colace with his pain med.  We used to wait to see if he would get the full/backed up feeling but we don't wait until it is a problem.  We nip it in the bud now and it seems to work great for him.\t\t\t", "date": "2008-08-05T01:19:13+00:00", "topic": "Monday results", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nmomof4 wrote:Rocky,\n\nThat is hysterical....Have you actually done that?  LOL....I Love it....\n\nKaren\nRight?!  That is the perfect \"comeback\" Rocky.\n\nI must say that I find it annoying when coworkers know I left early for an appointment with my husband and the next day they say \"Hey how did it go yesterday?\" in front of whoever is standing there.  I cringe every time.  I have no problem saying \"I really don't want to talk about it\" but that has been misinturpreted as \"It must be bad\".\n\nGeorge I feel for you.  I can't imagine being put under the spotlight when you need time for yourself to come to terms with whatever the next step may lead you.\n\nHowever, I like Rocky's style....\t\t\t", "date": "2008-07-27T15:14:05+00:00", "topic": "What is the right thing to say?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI work coordinating hospice care through a well known nursing association.  All of the patients I work coordinating their services remain at home and the planning of wants, needs, are all clearly discussed and decided upon before the in home care is initiated.\nMany families and patients have different expectations, understanding of and opinions of what they consider to be the best for their situation.\n\nI try to make a good match with the worker that will be going into the home.  Sometimes they go for short periods of times and other times they are in the home for 24 hour care.\n\nAll of the HHA's and nurses that work in the capacity as a hospice worker are truly very special people.\n\nAlways be sure to make your wishes and expectations heard.  We want to make the hospice experience what you expect it be.\t\t\t", "date": "2008-08-03T16:39:02+00:00", "topic": "HOSPICE,,  share your experience , to help others!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nCynthia wrote:I just found this I have been looking for this link since I saw your post. This is am organization called FOW USA Friends of Ostomates World Wide they except supplys and ship them to needy countrys. They are not only looking for Ostomy supplys but Urological ones also. I hope this works for you I think we all hate waste.\n\n\nwww.fowusa.org/newsite/page.php?page=faq#\n\nThanks so much!  It makes me much happier to see medical supplies go to someone in need rather than the trash.\nI did make some calls locally and I will be donating our surplus supplies to the local Homeless Veteran's Shelter.\t\t\t", "date": "2008-07-28T01:53:51+00:00", "topic": "Therapeutic chore tonight", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI have actual pictures of the inside of my husband's bladder taken from his last TURBT.  You can clearly see the new tumors starting to grow and the area of CIS.  They were taken by a camera on the end of the scope and they are immediately printed and ready to see by the time the doc leaves the OR. I found it very helpful to see what he was explaining to me as he pointed out different areas that he biopsied.  I saw the photos before I got to see my husband in recovery!  Unfortunately the program used by the endoscope does not produce digital images.  I am working on having a friend scan them so I can have them as an image file.  I will share them once I am able.\t\t\t", "date": "2007-09-02T21:50:46+00:00", "topic": "Bladder Picture &amp;amp;amp; Shows Stages", "subforum": "17-chit-chat"}]}