{"signature": ["TURBT", "BCG", "BCG", "TURBT", "Surgery"], "posts": [{"text": "\n\t\t\t\tHi Sara-\n\nI had my surgery for cystectomy & neo bladder 5 weeks ago & get the foley out tomorrow. May I ask...why is it harder for women? I too want to hear more stories from women living with neo bladders. It seemed that they were all men under that topic on this forum. I am mostly anxious to know how long I may be looking at being incontinent and when in the world I'll get my appetite back! I was only 105 before surgery and now 94. I cannot afford to keep losing and am drinking lots of the supplement drinks.\n\nWould love to hear from women living with neo.\t\t\t", "date": "2018-06-01T20:20:38+00:00", "topic": "Neobladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Sara-Anne-\n\nOddly enough, I just finished a round of BCG  when they found these new tumors, including the CIS ones. I am assuming that means the BGC did not work for me??? My guess is he will use the Interferon next. I'll do my best to not think much about it until my follow-up. Deep breaths.\t\t\t", "date": "2018-06-20T18:11:16+00:00", "topic": "Decided it was time to join in. Have some questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Alan.\n\nYou guys are just what I needed. I find myself exhaling a little more today. I am usually a very patient person, but after last Friday, all seems different. Yep, I'll wait for my results from Friday and discuss with my current doctor, but will also make that appointment with Duke.\t\t\t", "date": "2018-06-20T18:11:16+00:00", "topic": "Decided it was time to join in. Have some questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks Sara Anne & Anita-\n\nYes, I'm anxious and plan to call and see if I can move up my follow-up appointment, so I can get those results sooner than July 3rd. I do also know that I did not mention before that they found the CIS flat tumors in my bladder as well last Friday. I'm not liking what I am reading about those nasty boogers. Last night I decided that after I speak with my (general urologist), I owe it to myself to also seek a 2nd opinion, as I am only a couple of hours drive from Duke University Medical where they have a huge team of bladder cancer specialist. Can't hurt, right?\n\nHas anyone here had the CIS tumors? And has anyone here had Interferon treatment? He mentioned going that route to me before surgery last Friday, but that was also before discovering there were more tumors that expected and before knowing I had the CIS tumors.\n\nThanks again for weighing in. I try to keep a sunny disposition when talking to friends and family so they don't actually know how scared I really am, especially with my husband. He is there for me, but he cannot handle realistic conversations about this without getting upset. Education is everything right now, so all the shares are much appreciated.\n\ntmcbladder\t\t\t", "date": "2018-06-20T18:11:16+00:00", "topic": "Decided it was time to join in. Have some questions.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSometimes you have to be your own advocate, but it is nice when someone else is going out of their way to assist. A nurse from my other doctor's office really pulled some strings and got the scheduler to move things around and now I'm getting my cystectomy on the 15th of August. Here we go! I'm ready in every way. Thanks again guys for being here for me and answering my questions. I imagine I'll be back when I have many more questions regarding what all is going on with me and my new bladder and lifestyle changes.\t\t\t", "date": "2018-07-30T18:12:52+00:00", "topic": "How fast does HG CIS &amp;amp; HG papillary tumors spread?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI see, you are talking about Duke and UNC. I had an appointment at Duke and cancelled it because I thought I was in good hands and on my way to surgery soon. I wish I had not cancelled that appointment now. It took a month to get in to see the guy at Duke.\t\t\t", "date": "2018-07-30T18:12:52+00:00", "topic": "How fast does HG CIS &amp;amp; HG papillary tumors spread?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi cltyxx-\n\nActually these two were my 2nd and 3rd opinions. My initial urologist wanted to continue BCG with Interferon, but #2 & 3# both agreed that in my case the cystectomy is best unless I wanted to try the Gemcitabine and Doctaxel first. I may do this if they agree prior to surgery if they cannot move it up. Still waiting to hear back from the emails I sent to them both yesterday.\t\t\t", "date": "2018-07-30T18:12:52+00:00", "topic": "How fast does HG CIS &amp;amp; HG papillary tumors spread?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi All-\n\nThought I'd try this site to see if anyone can give their opinion on what medication to take for bladder spasms with an Indiana Pouch. I leak every 1.5 to 2 hours through my umbilical stoma, and because of that I have to cath every 2 hours or less and that is causing a lot of inflammation & a lot of pain in stoma & canal. Also because of this my pouch still has not stretched at all. I can only hold about 150 ccs of urine. My surgery was April 2019. I should be farther along by now! Does anyone else have these issues?\n\nAny advice?\t\t\t", "date": "2020-01-21T19:56:42+00:00", "topic": "Bladder Spasms w/Indiana Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Cynthia! Thank you so much for getting back to me! I think we all have had some set backs during our journeys with our bladder cancer. All last year being incontinent with the Neo bladder with a fistula, I would almost rather deal with the pain and difficulty of cathing than to go back to being wet & leaky. Now I have found a good way to cover it when it leaked the first few months. I use 1/3 of a light incontinence pad and breathable medical tape and it works like a charm. I have been trying to stretch my stoma using a 14 once a day and leaving it in for about 15 minutes while twirlling it around. This has made it easier for the 12 to go in the rest of the day, but there is still that painful burning sensation. I think I will continue this for just a few weeks and if there is no improvement, then I will also look into the revision.\n\nAnother question. Do you feel it when you get a UTI? I have had one but had no symptoms.\t\t\t", "date": "2019-09-19T16:10:35+00:00", "topic": "Stoma Stenosis", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tI have the indiana pouch with my stoma in the belly button. Anyone know any tips or treatment to fix stoma stenosis> It is getting almost impossible to cath. I even went down to a 12 french. I am 6 months out since surgery and it hurts extremely bad to cath. Any advice? My doctor suggested going up to a 14 to stretch it, so tried last night and it was impossible to go in. Is there a procedure for this? I have looked everywhere on line and see nothing.\t\t\t", "date": "2019-09-19T16:10:35+00:00", "topic": "Stoma Stenosis", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tHi Camille-\n\nI just ran across your post from two years ago and am very curious to know your outcome. I had my cystectomy August 2018, with neo bladder. I too have never gotten to use it properly as I never got to stretch it at all. I am totally incontinent and have proven I have a fistula that leaks into my vagina. They kept trying to find it to fix, but it is in a spot they cannot see it. I also had a failed sling surgery in the interim when they were still thinking my incontinence was due to my shortened urethra from the cystectomy.\n\nNow on April 26th 2019 I am having my Neo bladder re-routed to the Indiana Pouch. Did you have that done? I am curious to the success and if the surgery was risky/difficult for the surgeons. My surgeons are telling me it is hard to see with all the scar tissue from the first surgery. Thanks if you have anything to offer. I'm very nervous about this surgery but also anxious to be dry for the first time in a long time. My leak is not a small dribble but a constant flow, sometimes gushing. Makes it difficult to have any QOL. I go through a ton of pull ups, pads etc every day!\t\t\t", "date": "2016-06-19T11:19:47+00:00", "topic": "Neobladder-Vagina Fistula", "subforum": "10-women-and-bladder-cancer"}]}