{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tJust remember that Dads are Dads. Treat them with respect and true concern for their  welfare. My father only could hear from one ear and that one needed a hearing aid. It never once stopped him from hearing us tell him how much we loved him.\n\nHe would get a little mad at us if we started to feel sorry for our selves, instead of making the most out of every moment we had left together. He never quit fighting the cancer and trying to keep everyone up-beat and working together to cure it.\n\nWhen they diagnosed him as terminal he asked them if they had any risky or untried testing that needed to be done. He told them he had nothing to lose but cancer. They sent him to Iowa to try out some risky procedures. This made him very happy that maybe his loss would be someone else's gain.\n\nWe lost him, but I just know in my heart that what he did way back then is the very reason that I and many of the others are still here and fighting today.\n\nSo lets quit worrying about making him upset, and start making the best of every moment together. I never once pulled my hand away from one of my children when they   held it out. And even when I was in my deepest worry about my cancer, I wanted to be with my children and grand-children.\n\nI am sure that your father feels much the same way. So go hold his hand, and remember to smile. That is every grumpy old mans Kryptonite.\n\nGod Bless\n\nMark\t\t\t", "date": "2012-10-18T15:32:30+00:00", "topic": "Father has Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMike,\n\nJust thought I would let you know. I was watching the movie \"The Bucket List\" a few minuets ago, and the little guy in my head got a hold me. As usual he got the upper hand on me and I felt that fear coming back.\n\nI had a little cry and hugged my wife until it passed. Then I came on to the site to see how everyone is doing, and I came across your post. I was almost as if you knew I was getting a little shaky and needed a little reminder that I am one of the lucky ones.\n\nJust wanted to thank you for posting good news. I needed that.\n\nMark\t\t\t", "date": "2013-01-16T19:16:50+00:00", "topic": "5 years and counting...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYes. They try and get you in with in a couple of weeks if they find a tumor.\n\nThe faster the better, as we say.\n\nMark\t\t\t", "date": "2012-12-03T01:11:23+00:00", "topic": "In process...questions!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCatherine is correct once again.  \n\nThe cystoscopy is not all that bad. The only real tough spot is getting past the prostrate. That will kind of make you jump the first time. The doctor usually says something like \"And now heres where we turn the corner.\" or something like that to warn you first.\n\nIf you want kind of a humorous look at what goes on during the exam, you can read my blog called \"The Visit\" on the home page.\n\nThe waiting is the worst part. So to pass the time by reading past posts and asking questions.\n\nWe arn't experts, but we have been there, and are willing to help in any way we can.\n\nMark\t\t\t", "date": "2012-12-03T01:11:23+00:00", "topic": "In process...questions!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI have Bladder Cancer\n! There is nothing more I can do about that but fight it.  \n\nNow as for living\n with it..... Well that is an entirely differant thing!  \n\nI now look at everyday this side of the grass as a wonderful gift. I go out and do as much as I can every chance I get. I refuse to sit in a corner and wounder if, or when I might die. I try not to let the trials of everyday life bog me down on my never ending quest for FUN.  \n\nYou sound like your a lot like that also. That is a good thing because as we all know...... the one person that can bring you down lower than anyone else is ...... YOUR-SELF!\n\nYou keep fighting!!!  And we will be here to try and help as much as we can.  \n\nMark\t\t\t", "date": "2012-11-24T14:30:33+00:00", "topic": "Fighting a Rare Bladder Cancer/Seeking Community", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPlease follow this link for more info.\n\nwww.cancer.gov/cancertopics/pdq/treatment/small-cell-lung/Patient/page1\n\n\nI hope this helps.\n\nMark\t\t\t", "date": "2012-11-24T01:51:02+00:00", "topic": "Re:Small Cell Carcinoma of the Bladder", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNope. No nausea, until after the TURB was done, and that was because of a bad reaction to the antibiotic (Cypro).\n\nSometimes it takes them quite awhile to find things like cancer\n, but once they do, they can usually get it under control fairly quickly.\n\nBy the way any guy who can still do 150 push-ups a day at 83, is got to be one tough son of a gun! I haven't done a 150 push-ups in ten years. And I'm only 49. \n\nLike the others said, please keep us posted on how he (and you) are doing.\n\nMark\t\t\t", "date": "2012-10-24T00:55:10+00:00", "topic": "My dad.....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tIf you find that crystal ball to look into the future with, let me know. LOL\n\nMark\t\t\t", "date": "2012-02-01T14:16:46+00:00", "topic": "Update from Warren", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWarren,\n\nGlad to hear you found the right stuff to help you out.\n\nNow for the most important question! How was your season? Did you do well?\n\nMark\t\t\t", "date": "2012-02-01T14:16:46+00:00", "topic": "Update from Warren", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHi Ric132,\n\nI haven't had BGC yet but this sounds like it might be something like scar tissue coming loose. Hang on and one of the others will chime in shortly.\n\nMark\t\t\t", "date": "2012-08-16T22:35:40+00:00", "topic": "bcg treatment problem?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAmy,\n\nAre you on any Antibiotics? They can cause all kinds of havock with your system.\n\nMark\t\t\t", "date": "2012-10-06T18:56:35+00:00", "topic": "Things went south.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGood to hear that you are alright Amy.\n\nHopefully you will be in even better shape after some more rest.\n\nKeep up the good spirits.\n\nMark\t\t\t", "date": "2012-10-03T03:16:28+00:00", "topic": "TURBT #2 tomorrow", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tLike Cat said, if the pain gets any worse you should go to the ER just to be safe.\n\nMark\t\t\t", "date": "2012-09-14T20:02:33+00:00", "topic": "Thank you and a question", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe pain should be over by this time.\n\nPlease call you doctor and make sure you don't have something like an infection going on.\n\nMark\t\t\t", "date": "2012-09-14T20:02:33+00:00", "topic": "Thank you and a question", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's really great!\n\nCongratulations on quitting smoking. One day at a time. You can do it. \n\n\n\n\n", "date": "2012-07-24T22:39:46+00:00", "topic": "Cowardly Urologist", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHe's doing great. But had to take five different flights and spent 20 hours traveling. You know (The Army Way).\n\nI get the edgy feeling at night and my doctor told me to use one Benadryl tablet. It really works well for me. I don't understand how a antihistamine can do that, but I sleep all night most nights. You might want to ask about that.\n\nMark\t\t\t", "date": "2012-02-02T03:43:07+00:00", "topic": "9 months later", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKelly,\n\nI am so sorry that she has had such poor treatment. This is the reason we ask that someone goes with her to each appointment and ask questions. This same person (the caregiver) should also read carefully every report that she gets from her doctors.\n\nI can't say how long the tumor has been growing, but I can say that she should have been sent to a urologist when they found blood, and had problems urinating.\n\nI understand your anger and wish I could ease your frustrations. But the important  answers will come after the removal of the tumor. You can not change the past, but you can make sure that her care is watched over more closely. and that questions are answered, not left on a foot note. and not followed up on.\n\nHave you talked to your father and told him that you want to help, and want to be more involved in her care?\t\t\t", "date": "2012-08-09T02:14:57+00:00", "topic": "Mother Recently Diagnosed with Bladder Tumor", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome,\n\nI know how scary that statement is, but please remember that you will have to wait until the TURBT is done and the sample is sent to the pathologist to determine if the tumor is cancerous or not. The sooner you get that tumor out of the bladder the better.\n\nI know a week seams like a long time, but it will go by quickly for you I hope.\n\nLets hope that your doctors assumption is wrong.\n\nMark\t\t\t", "date": "2012-08-09T19:30:51+00:00", "topic": "My husband is newly diagnosed too", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWe Hate the Wait! \n\n\n\n\n", "date": "2012-08-06T20:46:51+00:00", "topic": "No definitive diagnosis yet but dr speculation", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis just shows how the Inter-Net can be as misleading, as it is helpful at times.\n\nIt is best not to blindly search for a reason of a symptom. There will always be something on the Inter-Net that can be misleading or sometimes flat out wrong.\n\nFirst seek help from your doctor.\n\nThen ask them the questions about your well-being.\n\nThen repeat back to them what you think they meant by what was said.\n\nThis way they know you understand correctly what they are trying to tell you.\n\nTHEN, you can start to Google.\n\nLook for an accredited site, or one that is well known. (Or ask your doctor.)\n\nBe careful when reading forums. Every case is slightly different. Just because it sounds like they have the same symptoms, doesn't mean that there are not other very important pieces to the puzzle that may have been left out.\n\nOnce you find a safe and reliable site, give them as accurate information as possible so that they can help you better.\n\nAnd most important. Go at it calmly and collectively. Read everything carefully, make sure you understand how this information pertains to you and your situation.\n\nBest of luck on your appointment with the Urologist. Hopefully they will get to the bottom of this for you.\n\nWe are here if you need us.\n\nMark\t\t\t", "date": "2012-08-06T20:46:51+00:00", "topic": "No definitive diagnosis yet but dr speculation", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat is just wonderful news Jim.\n\nI am doing the 3 month Poke& Peek also. Remember to keep us posted as to how the checkups go. We love to hear that you are All Clear. \n\n\n\n\n\n\nMark\t\t\t", "date": "2012-07-31T19:42:03+00:00", "topic": "path report", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am glad you are not in any pain during this. There are several ways that blood can get into the urine. I feel that you are doing the right thing by staying on top of it like you have. A CT scan usually covers more than just the kidneys. And is a very good way to see if anything bad is going on in there. Remember to take all of the antibiotic as prescribed. Don't stop taking it with out consulting your doctor. Otherwise you can make the bad bugs it's trying to kill even stronger.\n\nAlso start eating some yogurt to counter act the side effects of the antibiotic. Keep a close eye on your urine and report anything unusual to you doctor right away. (This means anything. Even if you think its nothing, it may mean something to them.)\n\nI hope the antibiotics clear it up for you. You have one thing going for you, and that is your age. Not that you can get cancer but thankfully the odds are very slight.\n\nPlease let me know how things progress from here. I hope they turn out well.\n\nMark\t\t\t", "date": "2012-07-26T21:09:48+00:00", "topic": "scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tOnly 24 hours to go Kevin.  \n\nSee things are looking up already!\n\nMark\t\t\t", "date": "2012-07-21T01:46:43+00:00", "topic": "Newly diagnosed  and happy that this site is here.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongratulations Rich,\n\nNon-Invasive is really a good thing to hear.\n\nI hope the frequency gets better with time. Mine took a while but now its only once or twice a night.\n\nMark\t\t\t", "date": "2012-06-20T13:10:06+00:00", "topic": "Question about restageing surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's a good question.\n\nSuperficial cancer is one that is highly treatable and usually can be kept in check with a TURBS (removal of the tumor with out other treatments like BCG or Chemo.\n\nHere is my information on it:\n\nCancer that is confined to the lining of the bladder is called superficial bladder cancer also known as Ta. This means that the cells have not penetrated the lining or muscle of the bladder yet. Also know as non-invasive.\n\nThe problem is that the stage and grades of cancer have changed over the years, due to the fact that the older names were not as accurate at describing what stage the cancer was at. So some people know it by the old name, and some by the new.\n\nIt can be confusing but hang in there we are here to help.\n\nMark\t\t\t", "date": "2012-07-06T16:11:07+00:00", "topic": "reoccuring tumors", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree with Mike completely on this one.\n\nP.S. Yes Mike I was a little shocked by your answer.\n\nMark\t\t\t", "date": "2012-07-06T16:11:07+00:00", "topic": "reoccuring tumors", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe cystoscopy is normally done before a TURBS (Surgery to remove a tumor).\n\nThe scoping (cystoscopy) is to show the Urologist where the tumor is located, how many there are, how big they are,and how to go about the task of removing them. You are numbed up and it only takes a few minuets in the office to do it. No big deal, I do it every three months.\n\nThe TURBS (Transurethral Resection Bladder Surgery) is where they operate on you in a hospital. They put you under and perform the surgery. Then you go to recovery. This  is a big deal, but not the worst thing to do.\n\nThe tumor is then sent to a pathologist to be tested for cancer. Not all tumors are cancerous!!! Only a pathologist can tell if its cancerous or not.\n\nThe same tool is used in both procedures, but they do not remove any thing during the cystoscopy they only look inside. It is the best way of identifying the problem in the bladder.\n\nLike Catherine has said, the sooner the better. But for now it sounds as if you are in good hands. Rest up, enjoy life as best you can, and let us know how things are going along the way.\n\nMark\t\t\t", "date": "2012-06-25T16:47:37+00:00", "topic": "still confused.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCliff,\n\nI haven't had BGC yet, but here is the oplace to go for the information you are looking for.\n\nwww.cancer.org/Treatment/TreatmentsandSideEffects/GuidetoCancerDrugs/bcg--bacillus-of-calmette-and-guerin-\n\nHope this helps.\n\nMark\t\t\t", "date": "2011-12-22T12:57:48+00:00", "topic": "Second BCG Yesterday!!", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPaula,\n\nI also had a very bad reaction to Cipro. really messed me for a while.\nI am really happy to hear your out come, that's about as good as it gets.\n\nRemember to start eating Yogurt a couple a times a day while on the antibiotics. Mix up the brands so that you get many different bacteria. That will keep your system in reasonably good shape. We want to kill the bad bacteria, but still preserve the good bacteria.\n\nKeep on schedule with your check-ups. And keep us posted as how your doing.\n\nMark\t\t\t", "date": "2012-06-18T18:09:02+00:00", "topic": "Surgery over,Good News, have one question?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWe Hate the Wait! \n\n\n\n\n\n\n\nGood luck! And we will talk to you when you are back on your feet and cancer free.\n\nMark\t\t\t", "date": "2012-06-10T11:36:04+00:00", "topic": "awaiting surgery", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPaula,\n\nWelcome to the site. I am sorry to hear that you are going to have a TURBS. Try not to worry to much about the surgery, it isn't all that bad. The worst part is the not knowing what is going to happen next. We can, and will, help you through all the way. If you have any questions, please feel free to ask.\n\nWe all know very well how you felt when you first heard that you might have bladder cancer. Its like a kick in the gut. You kind of go numb, then you only hear every sixth or so word that the doctor says from that point on.\n\nBecause of this I hope you can find a loved one, or a close friend to go on any future appointments with you. They should be there with you so that the two of you can listen to, and ask the doctor questions. Keep a note book with you and always ask the doctor, or care provider, to stop and explain, or clarify, anything you do not fully understand. This isn't being rude, this is what a good doctor wants you to do.\n\nIf you get home and don't feel right about something, or just need someone to talk to we are here for you. You are not alone. And most likely you are going to be just fine.\n\nKeep strong and have faith.\n\nMark\t\t\t", "date": "2012-06-04T21:21:36+00:00", "topic": "need some advice", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWe hate the wait!!!! \n\n\n\n\n", "date": "2012-05-30T10:54:06+00:00", "topic": "Kugel Mesh and Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tRay,\n\nGood luck with your checkup. We will all be rooting for you.\nAnd you'r right, this is one test we can't study much for.\nLet us know how it goes.\n\nMark\t\t\t", "date": "2012-05-30T10:54:06+00:00", "topic": "Kugel Mesh and Bladder Cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat feeling you get when you first hear those words, is like getting kicked in the stomach.\n\nWe all know it too well. It sounds like you have a GREAT out-look on all of this. Try and not let that little guy up in your head take control. Keep a positive attitude, and NEVER EVER GIVE UP!!!\n\nWe are here when you need us. I hope things go well for you.\n\nMark\t\t\t", "date": "2012-05-23T22:32:21+00:00", "topic": "I didnt believe it but...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDanielle,\n\nI am sorry to hear of his set back. I hope he will come to terms with this like he did with the ideal conduit. I am quite sure this is a lot for him to deal with, but he should be very grateful that he has someone like you at his side.\n\nJust keep working with him and showing him that there is life after surgery. You'r understanding and willingness to help him will show through eventually. Your doing a fine job. Hang in there. Hopefully he will come around soon and accept his new normal.\n\nGod be with you both.\n\nMark\t\t\t", "date": "2012-05-17T21:57:48+00:00", "topic": "Colostomy and Ideal Conduit", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat's Wonderful!!! \n\nAlways happy to hear good news.\n\nRemember don't waist the gift of time you have been given. Use it wisely and treasure it always. \n\nMark\t\t\t", "date": "2012-04-05T10:22:12+00:00", "topic": "Waiting for full results but wont let it beat me", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Gabby,\n\nIt's always scary when you pee blood. That we all can attest to. But you have to remember that the blood can be caused by many things. I agree with George that seeing a Great urologist (one who has a lot of experience) is mandatory at this point.\n\nHave you been seeing a Urologist through all this, or a General Practitioner?\n\nWhen you do see the Urologist make sure that he/she takes a urine sample to have it tested for microscopic blood.\n\nGeorge is also right that you should ask to have cystoscopy (a small tube camera) done, to look into the bladder. Its is the best way of knowing what is going on in side. Here is a link to The Mayo Clinic on it:\n\nwww.mayoclinic.com/health/cystoscopy/MY00140\n\nBe sure to tell the urologist of you'r families history of Bladder Cancer. Bladder Cancer is not genetic, but having a family history of it increases you odds of getting it.\n\nEven if they see a tumor it dose not mean you have cancer. They must do a biopsy of it to send to a pathologist to be checked. Most tumors are not cancerous, and can simply be remove and you are good to go.\n\nRemember we are here if you need us. Don't get to worked up over all this. That is the worst thing for you to do. Lets take this a step at a time, TOGETHER.\n\nFeel free to post if you need any help, or have any questions.\n\nMark\t\t\t", "date": "2012-04-30T20:11:37+00:00", "topic": "Scared and waiting...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCarol,\n\nWow that is quite the roller coaster ride. But it sounds like things are going in you fathers favor. It's always a good idea to get a copy of the reports. That way you can always come here, or go over to the American Cancer site to get information on how to read the reports. That can really help your mind rest, when you know what is going on first hand.\n\nNow we just have to wait for May 17th to get the rest of the story.\n\n\n\n\n\n\n", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tJust wanted to tell you how sorry I am to hear about your loss George.\n\nAs for your advise I totally agree 100%.\n\nMark\n\nP.S. I still love the way you keep minimizing cancer\n.\t\t\t", "date": "2012-04-03T15:50:19+00:00", "topic": "Waiting for results/diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMarjorie,\n\nYou have done a very good job so far with helping you'r Soul Mate, Eli. It sounds to me as if you have been there every step of the way through this journey. That is a beautiful thing to see someone care so much for another.\n\nBut please remember that you have to allow yourself to rest and stay strong. This is a battle that takes so much energy from both the patient and the care giver.\n\nI know its hard to relax and rest, but you have to for both of your sake. You are doing a great job and I salute you for that. Don't ever feel that you haven't done enough to help Eli. I know that I am so grateful for everything that my wife, family , and friends have done for me, and keep doing for me.\n\nTry and see if Roswell has a support group for you to stay in contact with. It might help you to have someone close by to help YOU along the way.\n\nRemember we are here to help you as much as we can. If you  have any questions please feel free to post them. I am sure that someone (more knowledgeable than I am) will be able to help you out.\n\nStay strong, and God Bless.\n\nMark\t\t\t", "date": "2012-03-21T19:10:56+00:00", "topic": "Soul Mate has Bladder Cancer And I\\'m scared", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCarol,\n\nWow that is quite the roller coaster ride. But it sounds like things are going in you fathers favor. It's always a good idea to get a copy of the reports. That way you can always come here, or go over to the American Cancer site to get information on how to read the reports. That can really help your mind rest, when you know what is going on first hand.\n\nNow we just have to wait for May 17th to get the rest of the story.\n\n\n\n\n\n\n", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCarol,\n\nWow that is quite the roller coaster ride. But it sounds like things are going in you fathers favor. It's always a good idea to get a copy of the reports. That way you can always come here, or go over to the American Cancer site to get information on how to read the reports. That can really help your mind rest, when you know what is going on first hand.\n\nNow we just have to wait for May 17th to get the rest of the story.\n\n\n\n\n\n\n", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCarol,\n\nWow that is quite the roller coaster ride. But it sounds like things are going in you fathers favor. It's always a good idea to get a copy of the reports. That way you can always come here, or go over to the American Cancer site to get information on how to read the reports. That can really help your mind rest, when you know what is going on first hand.\n\nNow we just have to wait for May 17th to get the rest of the story.\n\n\n\n\n\n\n", "date": "2012-03-24T02:54:23+00:00", "topic": "My Dad had just recently been diagnosed.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tStaying positive is the most important thing. If you give up on yourself others will surely follow.\n\nIt sounds as if you are in capable hands. The waiting is the worst part for all of us. As much as I wish I could I can't change that. I found that coming on the site and reading threw everyone's stories helps me out alot.\n\nFeel free to post answers, or just a kind word to others that are posting. It really helps to hear some kind of response from others. Even if it's just a little sympathy or understanding of their situation.\n\nIt sounds as if they will be using  cystoscopy to go in and remove the tumor. This is called a TURBS: transurethral resection of the bladder. It is the most common way to remove tumors.\n\nHang in there, were all in this together. \n\nMark\t\t\t", "date": "2012-03-09T18:45:48+00:00", "topic": "Welcome Mellycat", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMellycat,\n\nI lost my Father to BC when he was in his mid fifties. Then 20 years later I was diagnosed.\n\nI'm glad you caught your's early enough (way to young).\n\nAre you having a TURBS done on the 21st? And has your urologist done many of these before.\t\t\t", "date": "2012-03-09T18:45:48+00:00", "topic": "Welcome Mellycat", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBoy she's good!\n\nEven I like Catherine's better.  ", "date": "2012-03-19T00:00:44+00:00", "topic": "5 must knows about bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\t1. It is not a death certificate.\n\n2. You can fight this.\n\n3. Knowledge is power.\n\n4. Be you'r own advocate.\n\n5. Get a second opinion.\n\nP.S. Join: The American Bladder Cancer Society!\t\t\t", "date": "2012-03-19T00:00:44+00:00", "topic": "5 must knows about bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Scared,\n\nI hope for your sake it is just a UTI. But please, the next time you are asked to have a camera shoved up anywhere by a doctor, your answer should be \"YES\".\n\nThe doctors aren't doing this for the fun or the money. They are doing it because it is the best and most certain way to check the bladder and kidneys out.\n\nAs for as the pain, it hurts much less than stubbing you toe. For a little while after you will feel like you have to pee like you've never had to before. That will pass in about a day. Then you will be back to normal in about two  or three days.\n\nIf you go get the scope done and feel that something might not be right, or even if you have a dumb question. Come right back here and talk to us. We will help you through it all we can.\n\nSorry to yell, but this is not something to be taken lightly. Early detection is the key to surviving cancer.\n\nLet us know how thing work out for you.\n\nMark\t\t\t", "date": "2012-03-16T02:42:13+00:00", "topic": "Scared ... blood in urine", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHey Loubrook,\n\nGood to hear you are home and feeling better. Sounds like you have had quite the week. I hope things start getting better for you soon.\n\nThat's kind of scary, when they give you the wrong medication. I'm glad it didn't hurt you. Keep up the good spirits.\n\nMark\t\t\t", "date": "2012-03-16T22:37:21+00:00", "topic": "hernia repair", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tMonique,\n\nWow a hockey puck size tumor is huge. By the way I am from northern Minnesota so I know how big a hockey puck is. Now as for the rest of the group they may need to Google it. \n\nHang in there. Were all in this together.\n\nMark\t\t\t", "date": "2012-03-11T02:06:34+00:00", "topic": "new to this, looking for reassurance", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDoug you were to young.\nIt probably isn't cancer, just indigestion.  ", "date": "2012-03-07T00:00:23+00:00", "topic": "At What Age were you Diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI was just thinking at age 47 they told me I was to young to worry about cancer. At age 48 (and a half)   they diagnosed and removed a cancerous tumor from me.\n\nWith that being said I became curious at what age did you get diagnosed with BC?\n\nJust for fun please post your age.\n\nMark\t\t\t", "date": "2012-03-07T00:00:23+00:00", "topic": "At What Age were you Diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWarren,\n\nI only needed them for about week or so. I hope your doctor can shed some light on this for us. I would like to know why your still having spasms also.\n\nMark\t\t\t", "date": "2012-03-05T18:24:30+00:00", "topic": "bladder spasms and oxybutynin", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGroucho,\n\nYou may find some relief buy placing a warm moist wash cloth around the penis. I had to do this to soften all the blood and goo around my cath. so I could clean it.\n\nI don't know if this will cure anything, but its sure does feel good when its hurting down there.\n\nSorry for your pain.\n\nMark\t\t\t", "date": "2012-03-05T02:55:43+00:00", "topic": "My urethra is swelled and irriated", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI agree you should see a Urologist to make sure.\n\nThe aches and pains you are describing sound some what like the Sciatic Nerve. This can be caused by a pinched nerve in the lower back area. The pain is dull and starts in the lower back area and spreads down the buttocks and by the testicles, then goes down the back of the leg to the foot.\n\nBut at your age it is rare to have a problem with this. But you should ask you Doctor about it and he may want you to see a Chiropractor to help with the pain.\n\nAs for not using the medications. Please don't do that again. That's not the way intelligent people act.\n\nGo see your Doctor and ask if he feels a CT scan is necessary to be sure there is nothing going on in the bladder or kidneys.\n\nI hope this helps out, and you find the answers you need to feel better.\t\t\t", "date": "2012-03-03T19:59:16+00:00", "topic": "Need some Help. Much Appreciated", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThis is one of the most important things you will ever do. The scope will show very clearly what the mass is. I had a dark mass showing also, but when they looked at it with the scope they found out it was just blood stuck in my bladder.\n\nThe scope freed up the blood and I passed it through my urine. The good thing is that they found only a small tumor in the bladder witch they did a TURBS on a few days later.\n\nIt was cancer but we hope we caught it early enough to keep up with it. With out this scope it would have been very hard to see the tumor. And leaveing a cancerous tumor in to long is NOT a good thing.\n\nSara Anne is realy good at answering any questions that you have. But feel free to post anything (even the ones you might think are stupid). What you think of as dumb might be the most important question you could ask to us.\n\nWelcome\n\nMark\t\t\t", "date": "2012-02-09T17:48:13+00:00", "topic": "Where to get cytoscopy done?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYOU DID IT!!!  Yea  ", "date": "2011-12-29T03:15:51+00:00", "topic": "Afraid to have cystoscopy done", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks to everyone. I enjoyed the chat room, once I got the hang of it. Its really nice to talk to someone about this with out having them freak out.\n\nI have read many of the past posts, and have found a wealth of information in them.I find that when I'm feeling sorry for myself I go on the site and read for awhile. Its all most like letters from friends more that strangers.\n\nThe support I have received from everyone I have came into contact with here, has help a great deal. Not only informing me of what to expect, but also calming the FEAR of the unknown. I think that is the greatest thing about this site. It helps you calm down and work this all out in your head.\n\nI won't say I'm not still afraid. But I now can better deal with my life and treatment, thanks to all of your help.\n\nMay God touch each and everyone of you.\t\t\t", "date": "2012-01-01T04:56:30+00:00", "topic": "Hi I am new here.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI did my first TURBS on Dec 20th. The Doctor removed a tumor, and called the next day telling me it was a low grade tumor and it didnt have roots. I am still waiting for paper work telling me more about it.\n\nI am 48 and in very good health (other than a slight case of cancer). My father passed away in 1988 at age 57 from bladder cancer. I am under the same doctors care, and he told me that I am lucky we found it at an early stage, unlike Dad who waited far to long after having problems (He didnt belive in Doctoring Up). \n\nBut after watching what he went through I knew what to watch for and after the first sight of blood in my urine I went in to get a CT scan which showed the tumor. With in one week I was at the hospital having it removed. (After filling out the Will, lol). \n\nI will post agian when I get more info. I just wanted to say thanks to everyone for posting their information on this site it has been alot of help for me as I am going through this.\t\t\t", "date": "2012-01-01T04:56:30+00:00", "topic": "Hi I am new here.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGreat to hear you are doing better Mel. \n\nI am so glad you came here to tell your story so others will see that even when it looks like the worst is going to happen, you can never give up hope.\n\nPlease feel free to stop by and chat if you ever need us again.\n\nMark\t\t\t", "date": "2012-03-16T23:23:00+00:00", "topic": "Just \\&amp;quot;diagnosed\\&amp;quot; yesterday - 37 and very scared", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood to hear Doc.\n\nI too have been seeing the doctor for mental health reasons. The new medications seem to help.....Never thought I would need them, but even \"The Original Tough Guy\" needs help now and then.\t\t\t", "date": "2013-11-19T22:49:18+00:00", "topic": "3 month checkup", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoc. I am so sorry. Thats the last thing anyone wants to hear. \n\nIts time for some deep thought about going all the way. It seams to have worked well for the others.\n\nLet us know how things progress, and what your next move is.\n\nI'll be keeping you in my prayers.\n\nMark\t\t\t", "date": "2013-05-13T21:40:31+00:00", "topic": "CHECK UP", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOnce again you prove, that the odds can be beat.\n\nI am so happy to hear that you are a \"All Clear\"!\n\nMark\t\t\t", "date": "2013-04-09T19:07:01+00:00", "topic": "Happy day...MY OWN THREAD", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat makes me Happy, Happy, Happy.\nGood job Ann.\n\nMark\t\t\t", "date": "2013-04-11T22:36:32+00:00", "topic": "All Clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood to hear! Congratulations.\n\nMark\t\t\t", "date": "2013-04-25T10:05:20+00:00", "topic": "Another All Clear", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe pain should subside after a couple of hours. Then he should only feel a little bit of a twinge as he urinates.\n\nA warm wash cloth against the penis helps with the burning feeling.\n\nIf he still is feeling pain at this time you should call and check with your urologist.\n\nMark\t\t\t", "date": "2013-04-06T05:24:16+00:00", "topic": "All clear!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tProbiotics are a must have if you are on antibiotics. I found that out after the antibiotics gave me burning stools (Now thats a pain in the Butt)  \nThe nurse said to use yogurt three times a day. It took about 3 days but then it started to work.\n\nMark\t\t\t", "date": "2013-04-04T15:41:05+00:00", "topic": "Probiotics", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSorry you have to wait Sara.\n\nI agree with Mike, when I first saw your post I was scared to death to read it.\nI know its not good, but MAN am I glad to hear thats all that was wrong.\n\nMark\t\t\t", "date": "2013-03-20T22:56:42+00:00", "topic": "The best-laid plans..$@#%@#$", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear your doing well Doc.\n\nMark\t\t\t", "date": "2013-02-01T20:35:54+00:00", "topic": "Dieseldoc is sad", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am one year out from my cystoscopy with out any other treatment. I was checked every 3 months, and I am still all clear.\n\nI now only have to go in every 6 months to be checked. Unless something else shows up. (Heaven Forbid)\n\nI hope it goes as well for your husband.\n\nMark\t\t\t", "date": "2013-01-24T02:29:38+00:00", "topic": "Treatment protocol", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSeasons Greetings to you also.\n\nMark\t\t\t", "date": "2012-12-17T21:01:34+00:00", "topic": "Thank You", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am sorry if you took offense to that comment. I in no why intended to hurt you or cause any embarrassment.\n\nI will re frame from anymore humor on your posts.\n\nSorry again.\n\nMark\t\t\t", "date": "2012-12-11T18:48:38+00:00", "topic": "Plague calcification", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPlague calcification!  \n\nThat guy cracks me up.  ", "date": "2012-12-11T18:48:38+00:00", "topic": "Plague calcification", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just love to be the one who says: \"I told ya so.\"\n\nMark\t\t\t", "date": "2012-12-04T19:48:33+00:00", "topic": "Back from 5th year Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just came back from Heidi's urologist appointment. She was having a bladder test to see if she needed the meshing put in. It looks like she will need to have the procedure done. The doctor said that it should help with the Pee-A-Little when you cough or laugh problem. Thank goodness that was all she needed.\n\nAnd of course she gets a young and hansom doctor!  \n\nWhile I was in the waiting area I was listening to some of the men talking about their bladder problems. And how they didn't know if they could put up with the leaking and dripping anymore. And how they were afraid to go out, for fear they should have a problem.  \n\nNow I know that I shouldn't get angry at someone for wanting to have a problem cured by medical science...... but I just couldn't help but wounder how they would feel if they had been told that they had bladder cancer and that they would need to have a RC?  \n\nBefore I lost my composer the aid came in and asked me to follow her to Heidi's room. I sat with her doctor and listened as he explained the procedure to us, and he told us that he wanted to consult with another college before he did anything. (Point in favor of the young doctor).  \n\nHe then turned and asked me how I was doing, and asked what grade of bladder cancer I had. I asked how he knew of my cancer, and he replied that Heidi had told him and also that he worked in the same office as my Urologist.\n\nI happily told him Low Grade-Non Invasive. Doctor Hutchins just went in a took a little piece of cancer out of me and now I'm all better. He chuckled a little and said that he was glad that everything was going so well, and told me to keep up my checks just to be sure things stay that way.\n\nAs I walked back into the waiting area I once again heard the same comments from the men who were in there. When I went to sit down one of them asked what such a young man was doing here. I told him that I was only waiting for my wife. Then turned back to my magazine and read quietly until it was time to go. All the time thinking to my-self how quickly I would have my bladder ripped-the-heck out of me if I thought for one minuet that the cancer might spread. And how if my only problem was that I wet my self a little now and then, I would surely count my-self as one of the lucky ones.\n\nI know it sounds petty of me, but I wanted so bad to tell them about what my friends here, and maybe someday my-self, have had to go through. And how they should count them-selves as one of the lucky ones too.\n\nI'm kind of made at my-self for even writing this rant down, but I just felt I needed to vent. Sorry I took so much of your time.......I feel much better now.  \n\nMark\t\t\t", "date": "2012-12-12T23:47:57+00:00", "topic": "One of the Lucky Ones", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is very good news indeed!  \n\nIf you have to have bladder cancer that is the one to have. It is very treatable and hopefully it will not raise its ugly head again.\n\nJust keep up on the check ups and keep us posted as to how things are going.\n\nMark\t\t\t", "date": "2012-12-11T03:44:55+00:00", "topic": "turb", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOHHH Man! How well I remeber how it felt to hear that first \"All Clear\".  \n\nCongradulations by the way. And...Yes... The three month scoping is a very big deal.\nIf the cancer is real agressive. It usually shows its ugly head right away.\n\nThe cystoscope checks seem to get easier the more you do them. {Or we just learn how to deal with them better} I always ask my doctor to turn on the BCTV (Bladder Cancer T.V.)so I can see that it is clear for my-self. It just gives me more peace of mind.\n\nKeep up the good work!\n\nMark\t\t\t", "date": "2012-12-04T23:51:19+00:00", "topic": "passed my first 3 month cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongradulations!!  \n\nI am glad to hear that you could hold it for the full two hours.\nKeep up the good work. Your on your way to being free of the beast.\n\nMark\t\t\t", "date": "2012-11-30T17:35:40+00:00", "topic": "1/2 way", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow that's what you want to hear just before a weekend! \n\n\n\n\n", "date": "2012-09-29T00:07:49+00:00", "topic": "Good check up for Doug", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so pleased to hear that you are trying out another doctor.\n\nYou are far to kind of a person to have to go through all this.\t\t\t", "date": "2012-07-06T16:02:08+00:00", "topic": "Two TURBTS since Jan and still no BCG treatment..", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for the wonderful replies everyone.\n\nHeidi and I just spent a couple of days out in the woods looking at the leaves. \n\nIs it just me or do they seem far prettier this time. Maybe BC\n is Gods way of getting me to appreciate what is really important.  \n\nMark\t\t\t", "date": "2012-10-05T16:01:17+00:00", "topic": "Another \\&amp;quot;All Clear\\&amp;quot; Upnorth", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe! I knew it all along!  \n\nBut it is nice to know the doctors agree with me.  ", "date": "2012-09-25T20:20:11+00:00", "topic": "Checkup OK....probably", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI just loved your post.\n\nCongratulations on your good report.\n\nAnd thank you for keeping us posted on how you are doing. Its truly inspiring to hear.\n\nMark\t\t\t", "date": "2012-09-23T16:12:29+00:00", "topic": "Another round of good news!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBeen There - Done That!\n\nThe heart thing is from freaking out about cancer usually. Like George said don't over think, or diagnosis the situation. Base all assumptions on prove-able facts. Talk to your doctor about your fears.\n\nMine has been with me for many years, and he told me straight up that he will not allow me to get depressed and feel sorry for my-self.\n\nHey, You and I are a couple of the lucky ones. Lets hope it stays that way for a long time.\n\nWe will get through this together. You don't have to do it alone.\n\nJust keep us posted on how things are going with you. Even the little things that you think might be too stupid to ask. Are okay. That's what we do here.\n\nSorry you had to come aboard. But glad you are here with us.\n\nMark\t\t\t", "date": "2012-09-13T16:24:20+00:00", "topic": "From shingles to BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t<strong>Alan wrote:</strong>I found that putting release tablets in the water basin (tank) were an easy solution. That way with each flush there was an active cleanser and didn't have to pour after every trip!. As the other ladies have indicated, it is good to be safe but, as my URO answered my concerns several years ago \"If it were extremely dangerous he wouldn't let his staff handle it\". Be careful and cautious but, you'll be fine!\nThanks for the good idea, and advise.\n\nPlease consider getting the BCG, it can, and has been handled by many others with no problems. You can't run from this disease, you have to fight it or it will surely win.\n\nYou have to show your children, and grand-children how even cancer can be controlled, if you keep fighting.\n\nMark\t\t\t", "date": "2012-08-24T01:27:05+00:00", "topic": "denial..BCG therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlways good to hear an \"All Clear\"!\t\t\t", "date": "2012-08-19T22:02:09+00:00", "topic": "First check up since diagnosis in in April", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI found sleeping in my recliner worked out a lot better than in a bed.\n\nAlso use a good quality lube like KY. The cheap ones tend to dry out and leave scaling behind that hurt. Like little daggers of death is how someone described them.\n\nUse a warm moist wash cloth around the cath and penis to clean it and soften the lube  that is left before you reapply.\n\nHang in there, it only feel like for-ever!\n\nMark\t\t\t", "date": "2012-07-27T01:47:20+00:00", "topic": "Question about Turbt procedures", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI glad the BCG went well. The beach sure sounds fun.\n\nI can't resist it:....... Don't sweat the small stuff.   \n\nMark\t\t\t", "date": "2012-07-19T11:13:31+00:00", "topic": "Maintenance Update and Question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks Mike.   You're right about keeping an eye on it for sure.\t\t\t", "date": "2012-07-06T17:20:58+00:00", "topic": "All Clear Upnorth!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoey,\nI know! My son is in Georgia with the same problem. I hope this cool air reaches all of you soon.\t\t\t", "date": "2012-07-06T17:20:58+00:00", "topic": "All Clear Upnorth!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSeeing blood after a TURBS isn't unusual. Even a small amount of blood will turn a large amount of urine red. Kind of like food coloring in water. If you exert yourself or strain a little you can get a scarred area to seep small amounts of blood. Witch cause large amounts of panic. Trust me I know of what you speak.\n\nBut keep an eye on it, and keep your Urologist posted as to any more occurrences.\n\nJust a note: You should always be checking your urine and stools for blood.      Sounds over the top but that is the easiest way to tell if something is up.\n\nP.S. Don't hold a pee!  Carry a Thunder Mug (Urine Collector)on the water.\t\t\t", "date": "2012-06-07T16:28:08+00:00", "topic": "Wish Me Luck", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow that's good news!   ", "date": "2012-06-28T22:51:48+00:00", "topic": "First BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSteve,\n\nThe septic system will be okay with the small amounts of bleach that will be needed to clean the potty. I grew up with a septic system and had a mother that must have invested in bleach stocks, she used it on everything. We never had a problem. You can and should use RID-X septic treatment to keep the little bugs working well in the system.\n\nLet us know how the BCG treatments go. I know you will be fine.\n\nMark\t\t\t", "date": "2012-06-28T22:51:48+00:00", "topic": "First BCG treatment", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDonn,\n\nIf they can do nerve sparing surgery it will take some time to get back in the saddle. But you should be okay.\n\nI am sure the others will be answering you'r question soon. Some have gone through this surgery, and can help you out a lot.\n\nSorry you have to be here. But we will try and help anyway we can.\n\nMark\t\t\t", "date": "2012-05-24T13:57:23+00:00", "topic": "Surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBoy is that the truth.....The more you learn .....The more questions you have.  \n\nThat is good. It shows that your paying attention!  \n\nMark\t\t\t", "date": "2012-05-18T21:40:15+00:00", "topic": "bladder, prostrate cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRocky, Good luck! Lets keep up the good work.\t\t\t", "date": "2012-04-06T11:37:51+00:00", "topic": "All clear (still)!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike,  How do you keep out doing yourself like that? The family and I got a kick out the Happy Feet. Good job.\n\nGeorge, You are going to come back with a clear report. We all know it, now you just have to prove us right.\n\nMark\t\t\t", "date": "2012-04-06T11:37:51+00:00", "topic": "All clear (still)!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHuumm! Indeed.  ", "date": "2012-04-21T13:55:23+00:00", "topic": "TheraCys Shortage?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWarren,\n\nJust a prayer going out to you during your treatments.\nI sure hope everything goes well from this point. No more scary blood stuff please.\n\nHang in there pal!\n\nMark\t\t\t", "date": "2012-04-10T01:19:07+00:00", "topic": "BCG Just finished !!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike don't scare us like that. I live to have you send the Happy Dance to us.\n\nNow put it in a safe place, quite a few of us go in to get checked this month. If I'm clear, I reeeaallyy want to see the Happy Dance.\n\nMark\t\t\t", "date": "2012-03-28T20:19:17+00:00", "topic": "It\\'s all good!!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear it! There are many more on this site that are far more educated than I am on this subject.\n\nSara Anne is one of our best. \n\nJust keep reviewing some of the older posts. You will see how much help these people can be.\n\nMark\t\t\t", "date": "2012-03-31T18:36:32+00:00", "topic": "Newly Diagnosed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHere is some information from the American Cancer Society on the subject.\n\nPersonal history of bladder cancer\n\nUrothelial carcinomas can form in many areas in the bladder as well as in the lining of the kidney, the ureters, and urethra.\n\nHaving a cancer in any part of the urinary tract lining puts you at higher risk of having another tumor. The tumor can form in the same area as before, or in another part of the urothelium (lining).\n\nThis is true even when the first tumor is completely removed. For this reason, people who have had bladder cancer need close,routine medical follow-up.\t\t\t", "date": "2012-03-31T18:36:32+00:00", "topic": "Newly Diagnosed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlbyone,\n\nSara Anne did a real good job with explaining things for you so I don't have much to add. The week feeling after the surgery is normal for a few days. It will get better. For me it seemed that after the third or fourth day, things started to get better much faster.\n\nAs for the question of weather or not you still have Bladder Cancer (BC) after having a cancerous tumor removed, my answer is yes. According to Dr. David B. Agus, \"cancer is not something that you get or have, it is something that the body dose\".\n\nOnce the body starts to get cancerous cells it will continue to produce them from that point on. How quickly they will produce is the real question. In order to stay ahead of the cell production the doctors have to keep checking you. If they see that the cells are producing rapidly they will step up your treatment. Such as,  bacillus Calmette-Guerin (BCG) treatments, radical cystectomy (RC), or Chemotherapy.\n\nThe first step in this process is to get the pathology report back to see if the tumor is invading the muscle, and to see if it really is a cancerous cell or not.\n\nLets all hope that the report comes back that it is not cancerous. And you will be in the clear. That is truly what we want for you.\n\nWelcome and keep us posted on how things are going. We are always here, so just ask if you have any questions, and someone will help you out.\n\nGod Bless.\n\nMark\t\t\t", "date": "2012-03-31T18:36:32+00:00", "topic": "Newly Diagnosed", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow that's the kind of news I like to hear!!  ", "date": "2012-03-06T21:16:59+00:00", "topic": "Another Gary\\'s Story", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGlad to hear its going well Ray. I really like how understanding and appreciative you are about things. I hope others (like myself) learn from your example.\n\nNow get out there, and have some fun!  ", "date": "2012-02-20T21:11:27+00:00", "topic": "BCG Treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust got back from the doctor today. He found microscopic blood in my urine. He is sending the results of the ultrasound and lab work over to my uro, for him to have a look at.\n\nI am scheduled for my next Poke& Peek on April 4th so I am waiting until then to see him.\n\nCould have been worse  \n\nMark\t\t\t", "date": "2012-03-05T02:59:51+00:00", "topic": "Slight pain after shoveling.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood news and Bad news,\n\nThe ultrasound showed nothing wrong. Thats good news.\n\nBut the source of the pain wasn't found either. So I'm off to see the doctor again on friday.\n\nI have been reading about people who quit smoking, and start to get bloating and pains due to the nicotine not being in thier system.\n\nThe nicotine helped move along the digestive system, and now that it's gone the system has to find a new balance.\n\nThat, and the fact, that at the same time I had a allergic reaction to Cipro, witch wiped out my intire digestive system.(Lots of water and yogert helps)\nMight be the cause.\n\nSolution: Start smoking agian! \n\nHeidi just said maybe not. Oh well it was worth a shot. \n\nI'll run these ideas by the doctor on friday and hopefully he will come up with a game plan. I will post the results then.\n\nThanks for listening.  Mark\t\t\t", "date": "2012-03-05T02:59:51+00:00", "topic": "Slight pain after shoveling.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThanks for asking Catherine;\n\nThis morning the pain had gotten much worse, so I called the doctors office and they got me in right away. Their sending me in for an ultrasound Friday morning.\n\nThe funny part was I was just telling the student assisting the doctor that I wasn't your normal patient, because I am the \"Original Tough Guy\". Just then the doctor poked my stomach and I winced pretty hard.\n\nThe doctor just calmly looked over to him and said \"Tough Guy\".\n\nI will let you know how thing go as soon as I find out more. For know I'm still biting the bullet.\n\nMark\t\t\t", "date": "2012-03-05T02:59:51+00:00", "topic": "Slight pain after shoveling.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt seems to high up for that? And I don't notice any bulges.\n\nI go in for my scope on April 4th. But if it starts to hurt more I will call my GP.\t\t\t", "date": "2012-03-05T02:59:51+00:00", "topic": "Slight pain after shoveling.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoc.\n\nSo Good to hear from you my friend. I'm glad you checked in to let us know how you are doing. Its okay to be down once in awhile, but its NOT okay to scare the heck out of us.\n\nPlease next time just post something like: I'm OK. I will talk later.\n\nMan its good to hear your alright.  \n\nHey! While you guys were hiding from the tornado's, we were digging out from a blizzard last Wednesday only to get hit again on Saturday. About 18 inches all total so far, but its still snowing. The winds were at 65MPH off of Lake Superior but have slowed way down now thank God. Mike Sidell of The Weather Channel was here during the worst of it.\n\nTalk to you later Pal.\n\nMark\t\t\t", "date": "2011-08-15T02:36:53+00:00", "topic": "gary\\'s story", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAwe the memories. \n\nHere's to the best medicine of all SLEEP.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou may find it easier to sleep in a recliner, rather than a bed. I couldn't sleep in bed at all with that darn thing on.\t\t\t", "date": "2012-02-22T23:36:31+00:00", "topic": "65 yr old male - T1 High-grade", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tALL CLEAR is GOOD to HEAR!  ", "date": "2012-02-16T02:17:44+00:00", "topic": "cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHow about a little janitor sweeping up the broken word cancer? I like this idea!\t\t\t", "date": "2012-01-16T19:24:42+00:00", "topic": "checkup", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLOL  ", "date": "2012-01-07T12:40:36+00:00", "topic": "Almost Cysto Time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Luck. Just remember to breath slowly out as the scope passes the prostate. After that relax and enjoy BC TV.  ", "date": "2012-01-07T12:40:36+00:00", "topic": "Almost Cysto Time", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGail,\n\nYou have done a wonderful job of telling your story. It almost reads like a TV movie, but the scariest parts is that it is true, and you are living it.\n\nI salute you for your abilities, and the courage you have displayed through out this whole ordeal. I hope others read this and see that YOU, and YOU ALONE, are ultimately responsible for your medical decisions.\n\nI hope and pray that you can continue to be so strong and keep taking care of yourself, and your daughter.\n\nI will pray for you, and with you.\n\nMark\t\t\t", "date": "2012-03-13T21:37:44+00:00", "topic": "My badder cancer story", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHappy to hear everything is okay. \n\n\n\n\n", "date": "2012-09-13T06:14:02+00:00", "topic": "Urine cytology after neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news! \n\n\n\n\n", "date": "2012-08-14T21:36:54+00:00", "topic": "3 year mark!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBen,\n\nI love your positive attitude. I pray that it has all been removed and that you will not have to go any further with your treatment.\n\nPlease do keep us posted, so if others have to face this situation they will have your story to help them.\n\nHang in there. Your going to do okay.\n\nMark\t\t\t", "date": "2012-03-04T02:15:22+00:00", "topic": "Ben\\'s Chapter One - Partial Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t<strong>\"she encourages her children (four of us) to \"be cheerful,\" and I'll dig deep inside myself to ensure she always sees that cheerfulness when she is around me.\"</strong>\n\nMary, That is just beautiful.\n\nMark\t\t\t", "date": "2012-08-06T02:20:53+00:00", "topic": "Questions Regarding Chemo &amp;amp; Surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMary, Welcome.\n\nI am so sorry to hear about your mothers condition. But I am glad you found the site. I feel your mothers approach of lets face it one day at a time is a good one. The ultimate decision is her's. I am very happy to hear she has chosen to fight this.\n\nI don't know how well she will handle the Chemo. It's different for everyone. But keep working with her doctors and keep them informed as to how well she is handling it so they know how to proceed. Keep a note book handy and take notes on everything involved in her treatment. If you don't understand something stop them and they will explain it more clearly. Make sure one of you always go to her appointments with her to listen to the doctors and ask questions.\n\nPlease read up on the treatments on our forum, and feel free to ask us anything you need to know. Someone will always try to answer your questions.\n\nWe are not doctors but these people are very, very good at helping with bladder cancer.\n\nYou should be very proud of your-self for taking the lead on trying to help your mother. I hope we can help you out along the way.\n\nMark\t\t\t", "date": "2012-08-01T00:46:28+00:00", "topic": "My Mom\\'s Story and Mine", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi,\n\nI am sorry to hear about your father. I know what its like when you feel helpless after hearing this. But have the doctors talked to him or you about what the drugs are going to, or not, to do for him?\n\nI realize it is Chemo. and they don't feel he is strong enough to do an RC. But what have they said as far as what there treatment plan is. Talk to the doctor yourself if you can, and explain to him/her that you don't understand what is going to happen next. I'm sure they will help you out.\n\nI wish I had more information for you. But before you say it can't be cured lets get a doctor to help you understand why. If you have any doubt at all get a second opinion.\n\nI know too well the path you are walking.\n\nPlease keep us posted on how things progress.\n\nMark\t\t\t", "date": "2012-06-05T02:49:18+00:00", "topic": "Dad can\\'t have RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKeep us posted. We are here if you need us.\n\nMark\t\t\t", "date": "2012-05-14T12:51:09+00:00", "topic": "Dad had Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTUMMY TUCK!!...I love it.  ", "date": "2012-05-10T02:11:25+00:00", "topic": "Radical Cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome,\n\nThat is one of the rarest cancers out there. I can't answer why they would wait so long to start treatment. If it were me, I would be asking why no one has suggested a radical cystectomy (RC). This is a very aggressive and dangerous cancer.\n\nHere is a quote from a study done in Mexico on 2007.\n\nThe management of such tumors has not been standardized, due to their low incidence.\n\nIn any case, most published studies point to radical cystectomy as the treatment of choice, generally followed by chemotherapy or radiotherapy. However, the benefit of complementary therapy with respect to surgery alone, in terms of the reduction in relapse risk and improved global patient survival, is not clear.\n\nHere is another link stating the same:\n\nwww.ncbi.nlm.nih.gov/pmc/articles/PMC2695712/\n\nI think she should find a qualified cancer treatment facility, to get another opinion.\n\nWhat clinic is she at now? If we know where you are, we can try and make a referral to a know good clinic near you.\n\nMark\t\t\t", "date": "2012-05-04T21:43:48+00:00", "topic": "sarcomatoid bladder cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJohn,\n\nI don't know what to say. I really admire you for allowing them to do the testing on you. My Dad did that 25 years ago also.\n\nNo he didn't make it but I know in my heart, that the information found from those test results are the reason I and many others on this site are still alive to day.\n\nMay God be with you, and guide your treatments. I will pray for you also.\n\nThank you for your commitment to helping find better treatments for this diseases.\n\nMark\t\t\t", "date": "2012-05-01T18:04:10+00:00", "topic": "Just got bad news.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJack,\n\nGeorge is right! I AM the \"ORIGINAL TOUGH GUY\"!!!\n\nAnd even I have that little guy in my head at times. Just don't tell anyone else. They will think I'm not so tough as I know I am. \n\nMark\t\t\t", "date": "2012-04-10T00:48:06+00:00", "topic": "Today was decision day!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJohn,\n\nI think Mike wears a Condom Catheter at night. I not sure but he should be on soon to help out.\n\nI am glad to hear things are progressing well for you, and hope they continue to go well. Good luck with the exercises, and keep us posted as how things are going.\n\nMark\t\t\t", "date": "2012-03-31T21:14:40+00:00", "topic": "Training my new bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood to hear from you John.\n\nIt sounds as though you are in good spirits, even with the not so good news. Keep up the good attitude. That in its self goes along way in the healing process.\n\nMark\t\t\t", "date": "2012-03-07T12:16:14+00:00", "topic": "Neo is now complete", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGood Job! Pam and Ben.\t\t\t", "date": "2012-03-02T00:26:41+00:00", "topic": "What can the kids expect?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBen,  You are going to teach your children how to handle situations like this. Show them to not fear cancer but to try and understand its processes.\n\nLet them help you along the way so that they feel apart of your recovery. This can be any small act you feel they can handle well. This may seem small and not very important to you, but to them they will always remember how they helped Dad get through recovery.\n\nAs a father we have to teach our children many things. Cancer is a nasty lesson to learn, but just think of this, what you teach them now may someday save thier lives.\n\nI know this well. I lost my father to BC 20 years ago. But what he taught me was to pay attention to my body and get help while there is still a chance.\n\nHe may have died, but last Christmas he gave me the greatest gift of all. LIFE.\n\nI had my first TURB done then, and things look real good for me now.\n\nI hope this helps. Mark\t\t\t", "date": "2012-03-02T00:26:41+00:00", "topic": "What can the kids expect?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWay to go Herb. Its always nice to hear good news. May God grant you many more years.\t\t\t", "date": "2012-01-20T00:41:58+00:00", "topic": "16 Months Cancer Free", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon, Welcome. That's the worst part about BC. Sometimes it has no sign or symptoms, then all of a sudden you go in to have something checked and BAM, its going every where.\n\nIts sounds like you've been through hell the last 6 months. I'm glad your feeling okay now. But that's another thing about BC, no one can see cancer. And as for yourself you feel pretty good also. Don't let this fool you. Keep on it. Don't let any work, or check ups slip by. That just what this sickness waits for.\n\nI hope that the treatments start to take hold of the tumor, and bring its sizes down soon. We will be praying for you.\n\nHang in there, and never quit fighting.\n\nMark\t\t\t", "date": "2012-03-09T20:11:39+00:00", "topic": "Bladder cancer Plus", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThat's really good to hear.   I hope this is the beginning of you and your mom working together to help your father. It sounds like the lines of communication are open and all is going well for you and your family.\n\nThings should be a little more bearable now, I hope.\n\nTell your father I wish him the best, and don't ever quit fighting.\n\nMark\t\t\t", "date": "2012-01-25T14:59:58+00:00", "topic": "New here", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tOkie, You should go see him as soon as you can. Try to feel out what shape your mother is in also. Remember she is tired and scared so be watchful of your words and actions. We come to help support are families and do so as gently as possible.\n\nSome times just your smile, or getting them coffee without being asked to can go along ways. My mother tells me now 20 years later she remembers me bringing her some coffee and then quietly sitting in the corner reading the paper. She said I would look over the paper and give her a quick smile. It made her feel stronger and more relaxed knowing someone she loved was there and at the ready if she needed them.\n\nI felt as if I was a child who was told to stay out of the way, and keep my mouth shut unless asked. So I just read the paper and waited to be able to do something to help no matter how small.\n\nYou see how different my mother and I saw the same situation.\n\nAs for your father speak to him as if he was healthy. No man wants to feel weak or unable to help his daughter. Maybe ask his opinion on something in you life. Something to make him feel like a DAD again.\n\nYou hang in there. And keep us posted as to how you are doing. You could use a little comfort to, so here's a hug from all of us.\nMark\t\t\t", "date": "2012-01-25T14:59:58+00:00", "topic": "New here", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tLindy, I sorry your father (and you) had to join the club. Remember you are not alone in this if you ever need to talk, or ask questions, please do so. I agree that you should be mad at the cancer, not the doc. This is a very sneaky, underhanded, dirty rotten, disease. My prayers go with you and your family.\t\t\t", "date": "2011-11-20T02:35:08+00:00", "topic": "New to forum", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThat's what we are here for. Most people are afraid to talk to friends and relatives until they know for sure. Then they have to sit and worry with out any support. That is not only sad, but a very unhealthy way to deal with the stress.\n\nHang in there we are routing for you.\n\nMark\t\t\t", "date": "2012-07-17T10:57:32+00:00", "topic": "Waiting for a diagnosis....", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tPassing blood or blood clots is always scary. I had passed blood twice before I took a sample into the Ready Care. They sent me to a urologist to have a cystoscope done, that is where the tumor was first spotted. After I got home I started to pee out the clots, lots of them. This scared the living day-lights out of me.\n\nI made a panicky call to my Urologist, who calmed me down and explained that when the scope went in it broke up the blood that was stuck in my bladder and allowed it to be voided during urination. Even though it was a small amount it caused BIG concern for me. He apologized for not for warning me ahead of time. (He really felt bad about this)\n\nBut you must keep in mind that there are many things that can cause blood in the urine. You have been sent on the right path, cystoscopy is the best way to see whats going on. I only wish they would make it sooner so that you didn't have to wait so long to get the results.\n\nIf they do find a tumor don't panic yet, most are not cancerous. It has to be sent to a pathologist to be looked at and diagnosed as cancerous or not. So until then you are supposed to remain calm, cool, and collected. (Good luck with that one)\n\nWe are here to help with the waiting process too, so feel free to ask any questions, or if you just need a friend.\n\nWe Hate the Wait! \n\n\n\n\n", "date": "2012-07-17T10:57:32+00:00", "topic": "Waiting for a diagnosis....", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tKaren,\n\nMy Uro calls me at home with the results. Usually only takes a day or so to hear back from him.\n\nThey did a lot of testing on you. That shows your doctor is taking no chances. I for one like that kind of aggressive approach.\n\nMark\t\t\t", "date": "2012-07-20T02:53:16+00:00", "topic": "Please some advice", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tAnnie,\n\nIt is always hard to lose a brother or sister. I lost my sister three years ago from a hart attack. I'm so glad you could be with your family, they always seem to help in times like this. But sometimes we need to talk to someone who is from the outside looking in. Someone who is trained to watch for signs of danger that even we ourselves are not aware of.\n\nI hope after the grieving you are able to find a peaceful acceptance of the loss of your brother. They are gone but live in our thoughts daily.\n\nMark\t\t\t", "date": "2012-01-30T20:04:45+00:00", "topic": "Physiology of Grief", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tYea Annie! I like good news like this.\t\t\t", "date": "2012-01-06T19:05:15+00:00", "topic": "How lucky can a gal with BC be?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tAndy is going home to be with family, mainly due to an infection from a stent. He has been fighting bladder cancer for several months. Are prays are with him.\n\nHere's a memory for you.\n\n ", "date": "2012-07-17T17:20:56+00:00", "topic": "Andy Williams Worsens", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tYou'r welcome Rebel.\n\nRemember we are here if you need us.\n\nMark\t\t\t", "date": "2012-06-25T15:22:39+00:00", "topic": "gross hematuria", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI get a scoping done every 3 months, The urge to urinate is kind of strong for about the first 2-3 hours. Then it gets better as the day goes on. The next day you are fine.\n\nAs far as the first time you try to release urine after a cysto, there should be no real bad pain. Just a very small amount of tingling at best. If you have anything more than that get a hold of your Uro and find out what is wrong.\n\nIt's really no big deal, and only takes a few minuets.\n\nFirst off they usually do a CT scan, then a cysto. I even had an Ultra-sound once before the scoping.\n\nTalk to your doctor and your Urologist about any questions or fears you may have . They should be able to answer all your questions and calm your fears.\n\nRemember if you don't fully understand something, ask them to clarify again. They are depending on you to ask questions. They can't read your mind, or tell what you are feeling. Write down a list of concerns before you go in.\n\nMost people only listen to their doctors. That's so wrong. Doctors hate that. Be honest and open with them so they can make a good diagnosis with the info you give them.\n\nHope that helps.\n\nMark\t\t\t", "date": "2012-06-25T15:22:39+00:00", "topic": "gross hematuria", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tCongratulations!!  \n\nIts always good to hear an \"All Clear\".\n\nMark\t\t\t", "date": "2010-10-27T22:25:18+00:00", "topic": "New here, looking for support for husband with BC", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tElle,\n\nYou just keep on doing the mustard seeds, and following your doctors plan. It seems to be working for him, so keep up the good work, and we will be looking forward to hearing another \"All Clear\" from you in 4 months.\n\nMark\t\t\t", "date": "2010-10-27T22:25:18+00:00", "topic": "New here, looking for support for husband with BC", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome Cheryl. I am sorry you have to be here.\n\nI have not gone through BCG yet. But it is always nice to have someone with you no matter what kind of treatment you have. It doesn't have to be you it could be a family member or friend. It should be someone who can help him write down and understand what the doctor is saying.\n\nI always have my wife with me, but if she can't go I have four children that are far smarter than I am to go with me.\n\nOne of the others will be on shortly to help you out further soon.\n\nMark\t\t\t", "date": "2012-11-14T23:28:20+00:00", "topic": "BCG Questions", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tWelcome, and sorry you have to be here.\n\nI am not real good with Chemo. questions, but one of the others should be on soon to help you out.\n\nI commend you for trying to educate your-self on your fathers condition. You will find lots of help on this site, and our members will do their best to help you out as much as possible.\n\nHang in there, someone will be with you soon.\n\nMark\t\t\t", "date": "2012-08-16T02:27:39+00:00", "topic": "BC recurrence in my dad - what questions to ask?", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tWow that's great news for sure.\nSometimes the miraculs are hard to see if your not looking hard enough. Her vision must be 20-20. Because that's what I call miraculous.  ", "date": "2012-02-17T22:19:57+00:00", "topic": "Another Life impacted by cancer", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tHear, Hear!\t\t\t", "date": "2012-02-28T01:47:46+00:00", "topic": "Anita\\'s Story", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tThe note book idea is very good.\n\nDon't depend on the doctors to keep your records. You have to do this yourself. Remember to include any unusual\nthings that happen along the way. They may not seem important now, but could be very important later on.\n\nP.S. Good thing Doug is screening your posts, it gained him a whole year of freedom you tried to cheat him out of. \n\nMark\t\t\t", "date": "2012-02-28T01:47:46+00:00", "topic": "Anita\\'s Story", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tGood luck with the site.  \n\nLet us know how things are going over there once in awhile.\n\nMark\t\t\t", "date": "2012-12-18T21:29:35+00:00", "topic": "First time - From Australia", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tGood work eh! \n\nWe need more things done like this every where.\n\nMark\t\t\t", "date": "2012-11-21T22:28:52+00:00", "topic": "Canada Public Awareness Program Now Launched", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tIts so nice to see, and hear you at the same time.\n\nI think the rewards went to the right people. And you all did a great job!\n\nMark\t\t\t", "date": "2012-09-14T00:09:49+00:00", "topic": "Thanks for the You-Tube Site!!!", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHere is a link about the most recent Chemo findings. It starts out as bad news but ends up helping them use it better.\n\narticles.nydailynews.com/2012-08-06/news/33069701_1_healthy-cells-tumor-cells-chemotherapy ", "date": "2012-08-12T22:19:48+00:00", "topic": "Chemo Problem Maybe a Good Thing", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tWe will take any publicity we can get.\n\nThanks for the post Mike.\n\nMark\t\t\t", "date": "2012-07-14T21:25:45+00:00", "topic": "News Segment on Bladder Cancer.", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tRay;\n\nGreat artical.\n\nI really like the fact that they will be able to tell if a person will benefit from Chemo instead of just putting them in the microwave to see what happens.\n\nThanks for the heads up. Let us know if there are anymore stories like that.\n\nMark\t\t\t", "date": "2012-03-18T12:25:08+00:00", "topic": "Cure Magazine Article", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThis is one of the foremost experts in the field of cancer medicine. The video is him talking about a new direction in diagnosing cancer and many other illnesses.\n\nHere is a link to the video;\n\n\n\nwww.google.com/url?sa=t&rct=j&q=dr%20david%20agus&source=video&cd=15&ved=0CFQQtwIwBDgK&url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DIRxgDMSp9Gs&ei=zhM3T9HJAdDTgAeu5pnoBQ&usg=AFQjCNHdRMRcotjaMahetarbn6F8RY5ZHw ", "date": "2012-02-12T01:30:24+00:00", "topic": "Dr. David Agus Video", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHi everyone. I just started reading a new book called \"The End of Illness\" by Dr. David B. Agus. It has to do with the intire health system, but there is a lot of information on cancer and how it all works.\n\nDr. Agus is a oncologist and has done a vast amount of reserch in the feild. He has a interesting way of looking at how we veiw cancer and its treatment. Theres also advice on how to talk to and work with your doctor.\n\nI am about a quarter way through it now, and realy like what I am reading. But I will reserve my final judgement for when I am finished.\n\nIf nothing else the book gives good basic patient/doctor outline that I truly belive in. If you can't ask your doctor questions, and he is making all of your decisions with out informing you of your options,  GET A DIFFERENT DOCTOR!\n\nJust thought you might be intrested in reading it.\n\nEspecially the Newly Diagnoised members.\n\nMark.  ", "date": "2012-02-09T01:56:03+00:00", "topic": "New Book - The End of Illness", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks for the post Mike.\n\nI have stuck my foot in my mouth so many times, I have to use Dr. Scholls as a  lozenge.  \n\nSometimes I think I shouldn't say anything, for fear that I might say the wrong thing.\n\nSo I ask you not to listen to \"what\" I am saying, as much as what I meant by it.\n\nMark\t\t\t", "date": "2013-04-09T17:05:03+00:00", "topic": "How not to say the wrong thing...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tCall it crazy but I am restoring an old boat to pass the time and to give my mind a rest from BC for awhile.\n\n\n\n\n\n", "date": "2012-03-27T01:42:34+00:00", "topic": "Tell us what you do while waiting.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHere I go again. But so many people keep saying that the waiting for test results, the next appointment, and so on, is the worst part.\n\nSo I would like to know some of the things you do to  beat the stress of waiting. I know some are serious and some are silly. That's fine but I think any idea could help.\n\nSo let's hear them!\n\nMark\t\t\t", "date": "2012-03-27T01:42:34+00:00", "topic": "Tell us what you do while waiting.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThe man has a flow chart for everything!  \n\nMark\t\t\t", "date": "2012-11-28T15:38:58+00:00", "topic": "Don\\'t Worry!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGood to hear from you doc.\n\nJust remember to post us now and then so we know your okay.\n\nMark\t\t\t", "date": "2012-11-04T01:40:32+00:00", "topic": "Guess who", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJust wanted to say \"Hi\" Babs!\n\nGlad to hear your doing better. Talk to you soon.\n\nMark\t\t\t", "date": "2012-10-23T12:10:12+00:00", "topic": "Miss you", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tYou see I told you that you would be just fine. It's the power of positive thinking.\n\nNow if I could only get that to work all the time, I'd cure cancer\n.\n\nMark\t\t\t", "date": "2012-10-08T18:25:15+00:00", "topic": "Life After cancer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNow that's the way to get things done!!!\n\nI am happy that you finally got a date. Way to stand up for yourself.\n\nMark\t\t\t", "date": "2012-10-07T15:15:03+00:00", "topic": "waiting for new legs", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHere's hoping for good news on the test!  \n\nAnd that the legs are as nice as Ginger Rogers.\n\nYour going to need them for all the happy dances.  \n\nMark\t\t\t", "date": "2012-10-07T15:15:03+00:00", "topic": "waiting for new legs", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRocky,\n\nJust checking to see how your sister is doing?\n\nMark\t\t\t", "date": "2012-09-03T02:52:12+00:00", "topic": "sister hurt", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHope things get better soon Rocky.\nWe all have your back side.\n\nMark\t\t\t", "date": "2012-09-03T02:52:12+00:00", "topic": "sister hurt", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Birthday!!! \n\n\n\n\n", "date": "2012-09-04T14:01:05+00:00", "topic": "Happy Birthday!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI think you missed your calling!   ", "date": "2012-08-14T20:30:11+00:00", "topic": "Technology!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJust seeing 27 makes me feel sad.  ", "date": "2012-03-07T00:00:23+00:00", "topic": "At What Age were you Diagnosed", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSeriously Funny!!!!! \n\n\n\n\n", "date": "2012-08-07T22:53:10+00:00", "topic": "No bladder cancer found on Mars so far..", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe plan on it. But that's along ways from Northern Minnesota.\t\t\t", "date": "2012-03-10T21:58:17+00:00", "topic": "Good News! My son passed Basic Training.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tRich,\n\nThanks. He was at Fort Gordan GA. 551 battalion Signal Corp. Now he came home for a few days before shipping out for permanent duty at Schofield Barracks in Honolulu Hawaii.\n\nTough tour but someones gotta do it.   ", "date": "2012-03-10T21:58:17+00:00", "topic": "Good News! My son passed Basic Training.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat's what he is doing also. Signal Corp. 25 Quebec.\n\nHe says he likes it alot better than Basic.\t\t\t", "date": "2012-03-10T21:58:17+00:00", "topic": "Good News! My son passed Basic Training.", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tA flying dog?  \n\nThanks for the post mike.\t\t\t", "date": "2012-07-16T03:05:12+00:00", "topic": "Live like someone left the gate open!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI see it. Thanks Cat.\t\t\t", "date": "2012-07-11T02:43:28+00:00", "topic": "New Blog", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks Cat,\n\nI understand. I wish I could be at the conference, but it's to far, and of course would cost to much. I hope everything goes well for them. And I am looking forward to hearing all that went on there.\n\nMark\t\t\t", "date": "2012-07-11T02:43:28+00:00", "topic": "New Blog", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI have a new blog that needs reviewing so it can be posted.\n\nI know you have plenty to do for the meeting so no hurry.\n\nMark\t\t\t", "date": "2012-07-11T02:43:28+00:00", "topic": "New Blog", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHave Fun! & Be Safe! \n\n\n\n\n", "date": "2012-07-05T00:13:39+00:00", "topic": "Happy Fourth Everyone!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMike,\n\nYou forgot to warn them not to use this medicine if they are, or plan to be drinking any milk or other liquids directly after receiving a dosage. Doing so while may cause oral and nasal discharge of the fluids with out warning.\n\nOnce again: Mike is not a doctor!  \n\nMark  (also not a doctor)\t\t\t", "date": "2012-06-26T23:38:59+00:00", "topic": "Medical Advice: Best Medicine", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWelcome back among-st the living Doc.\n\nGlad to hear all went well. By the way are they giving you frequent surgical miles at the hospital ? \n\nMark\t\t\t", "date": "2012-06-13T02:35:46+00:00", "topic": "Surgery", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGeorge.\n\nLOL. \n\nI am 49 years old, but I have always been a fast learner. \n\nSadly enough, that picture was taken last November just before I was diagnosed.\nMan, its seems so much longer than that now. \n\nBut because of you, and all my other friends on this site, I feel far richer now, than I ever did back then.  ", "date": "2012-06-05T02:42:04+00:00", "topic": "Pictures that make you feel better!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThat is three out of four total.\n\nThe youngest one is graduating tomorrow. The other girl has been married for a couple of years, my son is now stationed in Hawaii. The oldest (not pictured) is the caretaker of our three grandson's    (with one on the way PRAY FOR A GIRL).  ", "date": "2012-06-05T02:42:04+00:00", "topic": "Pictures that make you feel better!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe need some feel good pictures. Anything that you look at, and say aawhh.\n\nSomething like this:\n\n\n\n\n\n\n", "date": "2012-06-05T02:42:04+00:00", "topic": "Pictures that make you feel better!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Birthday Kiddo!!!!\n\nMark\t\t\t", "date": "2012-05-30T21:19:22+00:00", "topic": "Birthday alert!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJust thought you deserved this Mike. \n\n\n\n\n", "date": "2012-05-26T13:09:24+00:00", "topic": "Nine months since I quit smoking!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThank's again Mike.\n\nYou always seem to help out and I appreciate it.\n\nMark\t\t\t", "date": "2012-05-25T02:15:05+00:00", "topic": "Breast lump again", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWell that is some-what good news then.\t\t\t", "date": "2012-05-25T02:15:05+00:00", "topic": "Breast lump again", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDoc,\n\nI'm sorry to hear about you'r loss. You have had a tough time of it lately. I hope you find some comfort in knowing that you are proof that you can fight this disease.\n\nI hope you are doing okay. Hang in there pal.\n\nMark\t\t\t", "date": "2012-05-25T02:06:17+00:00", "topic": "My step daughter in law", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGo to Community tab, then My Profile Page, then Edit my Profile.\n\nThe Change Password is in the tool bar  in the middle of the page.\t\t\t", "date": "2012-05-21T00:46:42+00:00", "topic": "Changing Password", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSometimes I have issues too.  ", "date": "2012-04-30T22:41:47+00:00", "topic": "Who shut the lights out?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWas it just me, or was the site down on Sunday?  \n\nMark\t\t\t", "date": "2012-04-30T22:41:47+00:00", "topic": "Who shut the lights out?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tInteresting read from University of Southern California, It's a little old (1997) but has a lot of good information in it.\n\nHere's a link:\n\nscienceblog.com/community/older/1997/B/199701831.html\n\nMark\t\t\t", "date": "2012-04-12T13:48:48+00:00", "topic": "Question for the guys", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAnita,\n\nI told Heidi that I don't want to know, and I would rather go home now, just before we entered the doctors office. \n\nShe was about as understanding as you are. Why is it we love you guys so much again? \n\nMark\t\t\t", "date": "2012-03-31T23:51:38+00:00", "topic": "Good Luck and be Safe Catherine!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGeorge,\n\nGood luck on your checkup. I know you'r going to do just fine.\n\nMark\t\t\t", "date": "2012-03-31T23:51:38+00:00", "topic": "Good Luck and be Safe Catherine!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThank you Catherine. Yes Heidi is VERY happy too.\n\nMike. You know how much I love you for sending the Happy Dance file? Thiiiiissss Muccchhh!  ", "date": "2012-03-31T23:51:38+00:00", "topic": "Good Luck and be Safe Catherine!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWell its good to hear from you anyway. I hope the pain eases up a little for you.\n\nLike Catherine said, post when you feel up to it. We are always here for you my friend.  ", "date": "2012-03-27T02:02:53+00:00", "topic": "It\\'s me", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGood to hear Doc.\n\nHave they been able to relive some of the pain?\n\nMark\t\t\t", "date": "2012-03-27T02:02:53+00:00", "topic": "It\\'s me", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIf I remember right, I read something about that in Dr. Agus book \"The End Of Illness\". I will go back and look.\t\t\t", "date": "2012-03-18T15:53:45+00:00", "topic": "Growing your own bladder...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThank you Cynthia.\t\t\t", "date": "2012-02-15T02:07:55+00:00", "topic": "Blog not showing?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI posted a blog last week, but it only shows in review. I think I have done everything correctly. Let me know if there are more steps that I have to do.\n\nThanks Mark\t\t\t", "date": "2012-02-15T02:07:55+00:00", "topic": "Blog not showing?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI new you liked them short, dark, and adorable.  ", "date": "2012-02-09T21:45:28+00:00", "topic": "ABLCS Hires New Staff Member", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI'm so sorry to hear that. Thanks for the update. She, and you will be in our prayers.  ", "date": "2012-01-10T03:42:19+00:00", "topic": "Update on friend with cancer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI'm so sorry to hear that. Thanks for the update. She, and you will be in our prayers.  ", "date": "2012-01-10T03:42:19+00:00", "topic": "Update on friend with cancer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDoc, Don't ever feel that you have failed when dealing with other peoples problems. You reached out to help, and they choose not to accept it. That is far more than most people will do in this type of situation.\n\nRemember you reached out to help someone not to long ago and they did take you up on your offer. For that I and my family thank you very much.\n\nAll you can do is keep trying. The big guy only see's what you have tried to do. He doesn't judge you on what others think.\t\t\t", "date": "2011-12-19T00:30:50+00:00", "topic": "A friend with cancer", "subforum": "17-chit-chat"}]}