{"signature": ["Dx"], "posts": [{"text": "\n\t\t\t\tI'm sure everyone remembers the day they learned about BC and I was lucky because I found this site early on and had so much support and read all that I could from old posts.\n\nOne of my early posts here was about how you tell people and how or if they treat you differently.  That was one of my biggest concerns.  I think I had a different perspective because I was at the very end of my time with my mother who died a couple of months later from cancer.  My worry about people treating me like an invalid kept me from sharing with people for a while.\n\nI have shared this in stages.  My immediate family was all very different and I have followed their lead about how much we talk about this.\n\nWork has been more difficult.  Teaching 7th graders, I know I don't want them to know so I slowly shared this one on one with people at work.\n\nI have been amazed at the support I have and know that it is the ability to share things with others that are dealing with the same that has given me the knowledge needed to have the strength to deal.\n\nAgain, I was lucky to find this site and it is good to know that I have people to ask when I am dealing with anything.\t\t\t", "date": "2010-09-02T13:50:52+00:00", "topic": "How to tell others....one person\\'s method.", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTime magazine had a great article in the January 2010 issue that talked about our \"Epigenetics\"\n\nIt talked about the fact that we may not do anything to develop a cancer, but our parents may have and therefore passed that down to us in our genes.\n\nWhen I read the post from Pemquid and her father, it made me think of the article and I will need to pull that back out again.\n\nTitle is:  Why genes aren't destiny.  Summary says that the new field of epigenetics is showing how your environment and your choices can influence your genetic code--and then that of your kids.\t\t\t", "date": "2010-05-24T21:00:13+00:00", "topic": "family members with bc", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou hear about people that make a difference and are amazed.\n\nAt this site, you are for sure someone that amazes everyone, but also someone that makes a difference.\n\nThe research that you do for everyone, the advice that you give, and the information you share is something that just can't be re-paid.\n\nThanks for who you are and know that someone who was so important to you is probably looking down and saying, Yup, that's my gal.\n\nVi\t\t\t", "date": "2010-05-06T19:36:51+00:00", "topic": "WHO WOULD YOU SEND YOUR MOTHER OR FATHER TO?.......", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWhere is the twilight series music?\n\nI just saw your post yesterday morning, responded, and then the post was gone in the afternoon.\n\nThis is all strange.\t\t\t", "date": "2010-05-15T10:50:58+00:00", "topic": "Just starting the journey", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks for your help.\nIt was really weird because yesterday Pat sent a message asking why I brought an old post up since it was talked out.  I replied that it wasn't me and then it was gone again.\n\nOh well,\nVi\t\t\t", "date": "2010-05-15T10:50:58+00:00", "topic": "Just starting the journey", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCongratulations on your completion.  I'm sure you are glad to have that behind you and I hope your recovery goes fast.\nMy mother in law always said, If your house is picked up no one notices that it is not \"clean\".\n\nYet another time you are an inspiration,\nVi\t\t\t", "date": "2010-04-15T23:14:16+00:00", "topic": "DONE...UNTIL THE NEXT BATTLE", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tGeorge,\nLoved your idea and it is great to have someone like you that reminds us to laugh.\nThanks,\nVi\t\t\t", "date": "2010-02-18T19:42:02+00:00", "topic": "Mike\\'s crazy theory on BPH and Bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tReading all these posts that talk about the support you've given and especially your strength there is really little to add.  However, I too must say that I have appreciated in such a short period of time all your thoughts and advice and would be willing to help in any way if I only could.\nVi\t\t\t", "date": "2010-01-10T03:47:07+00:00", "topic": "Pat - Any new info. on test results?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThanks for the advice.  I was talking to my husband about this thread as I was trying to analyze what was said.  He laughed and said \"They don't know you very well.\"\n\nI was/am not sure what exactly was being suggested.\n\nFirst, I think I have a pretty good handle on what is happening with me and understand how good my status actually is.  However, I want to understand about all aspects so I have the knowledge if things ever change.  I also have not given up the fight for a second opinion.\n\nI guess I need some clarification on the idea of replies.  Do people tend to stick with their area (Newly diagnosed, etc.) or is it ok to get involved with other postings.  I know I don't have the experience or knowledge of some, but I do have compassion and get excited when I hear good news.\n\nThis is getting too long, but I am one who gets 100% involved in things, but can curb myself if needed.\t\t\t", "date": "2009-12-21T00:24:58+00:00", "topic": "Diagnosis for spreading?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPerhaps I need to take your advise that I should not seek or give advise here and take a break from the forum.  Not sure that will help, but I trust the people here.\t\t\t", "date": "2009-12-21T00:24:58+00:00", "topic": "Diagnosis for spreading?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe biggest concern is not having support as you go through this.  Sounded like you had someone with you that kept the humor going in the hospital. Those are not the ones doing all the research or living it though.\n\nAlthough there are so many people here that are \"here for you\" it is a shame and frustration to me that we can't do more.  Especially since you are one of the most prominent role models on this site.\n\nYou don't know me from Adam and I have not been here for long, but if you ever need someone to vent with let me know and I'm sure there are others as well.  While that doesn't help with all you are concerned about right now, I hope it helps.\n\nVi\t\t\t", "date": "2009-12-29T02:13:37+00:00", "topic": "SURGERY TOMORROW", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDid he complete his treatment in 2005 and been cancer free since then?\t\t\t", "date": "2009-12-04T02:00:14+00:00", "topic": "Bladder Cancer History", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI can't say that I have no anger, but I do think that just being able to voice that has helped.  Does that even make sense?\n\nThanks!!!\t\t\t", "date": "2009-11-07T17:06:08+00:00", "topic": "Containing your anger", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI think that if you don't feel confident in your team then it is smart to find someone else.  I'm sorry that you have to do so much of the work.\nWishing you the best,\nVi\t\t\t", "date": "2009-10-26T19:49:57+00:00", "topic": "What i\\'ve learned so far......???", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI did not list everything on my list, but this site was at the top of mine as well.  I am even some what concerned about how much time I am spending on this site\t\t\t", "date": "2009-11-14T16:13:17+00:00", "topic": "Thankful for list idea", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAs a newly diagnosed patient I have been going through all kinds of emotions over this.  My latest was my very own pity party.  I ended (maybe just put on hold) my pity party as I thought about the holidays coming up and that I should be thankful to be able to enjoy these.  Therefore, I started my own list of things to be thankful for in my life right now even though I have one and may find I have 2 kinds of cancer.\n\nThought it would be good for the soul if we made a list and just kept adding to this since many will think of things that others didn't.\n\nMine started with:\nI'm thankful for:\nFamily that loves and supports me\nFriends that I can count on whenever I need them\n\nMay seem corny to some of you??? but it sure helped me\nVi\t\t\t", "date": "2009-11-14T16:13:17+00:00", "topic": "Thankful for list idea", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHow lucky you were to have such support and BRAVO to you for recognizing her importance.\t\t\t", "date": "2009-11-09T19:12:07+00:00", "topic": "How do we care for our Caregiver?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSomewhere I guess you sent me a private message.  Don't know how to find that.  However, I never took offense to this message or thought it was meant for me alone... actually thought it was good.  I was frustrated with myself because I do think I am somewhat intelligent and your post went over my head for a while.\t\t\t", "date": "2009-11-01T18:21:13+00:00", "topic": "Reasons NOT to get 2nd opinion from BLC ctr", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPat,\nAnytime we learn about problems like this it feel worse than being hit by lightning.  However, I anticipate you staying with this group forever and only needing the other for a while.\n\nI say this because my sister in law had breast cancer.  She did go through treatments....  But.... she is now and has been for 13 years, cancer free.\n\nThat is something I hope you can use to help you through this.  Once you take care of things, you can be cancer free without the concern I'm thinking you have with bladder cancer.\n\nI hope this helps,\nVi\t\t\t", "date": "2009-10-20T03:44:20+00:00", "topic": "I guess i\\'ll have to find a new forum", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAll of this is so new to me and the wait and watch seems wrong when the word cancer is involved.  I never realized how many different things have to be considered.\n\nWhile no, I am not in denial, I also hate how much this is on my mind and don't want it to control my life.  I wake up in the night and say \"Man, Vi, You have cancer\" which is something no one wants to think about.\n\nRight now, I plan to continue with my research, and pay close attention to making sure I am doing all I can.\n\nI've read so much about diet.  Has anyone heard of these and do they make a difference?\n\nCottage cheese and flaxseed oil?\nBroccoli daily\nOncovite (mega-dose vitamin)\n\nThanks,\nVi\t\t\t", "date": "2009-10-31T03:00:42+00:00", "topic": "Just starting the journey", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHere's to good reports and an even better hike.\n\nVi\t\t\t", "date": "2011-02-25T03:42:54+00:00", "topic": "cysto  today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations and yes that is an inspiration for others.\n\nI'm thinking you should celebrate for at least 3 days....one for each year.\n\nVi\t\t\t", "date": "2011-01-11T20:17:36+00:00", "topic": "3yr cysto..no tumors", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations on your all clear.\n\nI hope you enjoy every minute of those 6months with not worries.\n\nVi\t\t\t", "date": "2010-10-25T19:25:47+00:00", "topic": "All clear, 2 years 4 months", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations on the good news and it is always great to hear about someone that has success.\n\nBe sure to celebrate,\nVi\t\t\t", "date": "2010-09-16T17:57:24+00:00", "topic": "And again?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThere are times when you feel that you must put on a good face for others so they don't worry so much.  Even with those that are your best support.\n\nThat is one of the greatest parts of this site.  It is a place where you can be honest, vent, and then know you will be supported so you can go on.\n\nI'm sorry you are having a bad time with your treatments and sending good thoughts that lowering the dose will make it easier.\n\nVi\t\t\t", "date": "2010-08-12T18:32:12+00:00", "topic": "Just plain sick of it", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\nThanks for the site and I will think about that.  I was told that I should have fought before the appt. rather than trying after the fact since they know I already paid.\n\nAs for my lung, the nodule is in the lower left lobe.  Was 5mm and has grown to 8mm.  Right now they don't think it is mets, but because of where it is located he wants one more CT scan and perhaps a PET scan before doing surgery.  It is a strange shape so he is not eliminating mets but does not think the two are related.\n\nPlaying the waiting game is hard on the mind. At least he said he probably won't just do a biopsy, but cut it out and then see what needs to be done after the pathology report.\n\nTrying to do research now on this and it is so very different with each stage.\n\nThanks for your support,\nVi\t\t\t", "date": "2010-07-26T16:50:06+00:00", "topic": "Cysto news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI went through 2 levels of fighting the insurance and lost both so I just chalked it up to experience.\n\nThing is, now I have a nodule on my lung that they think might be cancer since it is growing and I know I can't go to the cancer university for a 2nd on that.\n\n\nI'm just thankful that my insurance does pay so well for my urologist and pulmonologist.\t\t\t", "date": "2010-07-26T16:50:06+00:00", "topic": "Cysto news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tPat,\nYou are correct.  My insurance did not cover my appointment with Dr. Wilson at the Cancer University.  I had to write a personal check for $1,000.00 to see the Doctor and now $400.00 for the pathologist that reviewed my slides.  As Mike (MMC) said, it was money spent to give me piece of mind that my doctor is doing what he should.\t\t\t", "date": "2010-07-26T16:50:06+00:00", "topic": "Cysto news", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nwww.surgeryencyclopedia.com/A-Ce/Bladder-Augmentation.html\n\nJack,\nDon't know if this will help, but there seems to be a few articles on bladder augmentation.  Maybe that is the same or at least a term that may help.\t\t\t", "date": "2010-06-26T00:23:57+00:00", "topic": "Original Bladder Has Shrunk", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was doing the flaxseed oil and cottage cheese until I read the new articles coming out that say flaxseed oil causes free radicals.  I asked about this at the University when I went in for my second opinion and she said it was new information just coming out.  I'm not sure about using the seed, but the oil version is what they are saying is bad.  Could just the oil version do this?\n\nVi\t\t\t", "date": "2010-06-10T19:16:35+00:00", "topic": "Biopsy results", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFree....what a great way to describe your good news.  Thanks for sharing and giving others hope.  In addition, make sure you take the time to celebrate and doing something wonderful for yourself.\nVi\t\t\t", "date": "2010-05-19T10:30:52+00:00", "topic": "Free", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI keep reading different procedures done and it seems to vary by doctor.  That is another thing I will ask on Friday when I talk to the doctor at the university.\nI can sure understand waiting if possible, since your body sometimes changes in its reaction to chemo or other treatments.\t\t\t", "date": "2010-04-22T11:13:46+00:00", "topic": "Turbt and not doing BCG or Mytomycin??", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell, I finally got that 2nd opinion.  $1,000.00 later after review of my slides and all other information, I was told that my URO was correct in my diagnosis, is doing what he should and keep doing what I have been doing for diet and vitamins.\n\nUnless I need an RC, she did not think she need see me again.\n\nQuite the place and really made me wonder how many people in this region must have cancer and how sad that is.\n\nVi\n\nMy insurances final word (I got the call as I was waiting for the doctor) was that they were processing the request for this 2nd opinion and needed at least 14 days to make a decision.\t\t\t", "date": "2010-04-30T22:28:44+00:00", "topic": "Finally have appt for 2nd opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe slides are in Nashville TN and she is the one that suggested I request overnight.  I checked and my URO does not have a copy of the slides so it isn't something I can just pick up.\nI just got off the phone with the insurance and she is checking to see if I can get a reference authorization number since we established that my region does not include Denver and that is the only place there is a University Hospital.  I asked about going to Houston and NO again on that. She suggested Rocky Mountain Cancer Center (here in the Springs), but I called them earlier and they don't have a bladder cancer specialist.\n\nI'm going ahead with Friday...come what may...pay don't pay... and then move on from there.\n\nThank you Pat for all your help and I will let you know what this brings.\nVi\t\t\t", "date": "2010-04-30T22:28:44+00:00", "topic": "Finally have appt for 2nd opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLove hearing good news and there are many wonderful days this summer for you to enjoy.\nCongratulations\nVi\t\t\t", "date": "2010-05-06T15:31:23+00:00", "topic": "YIPPEE!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFirst, I am sorry about your loss.  This is, I'm sure, a tough time and am glad you are able to get away and enjoy a vacation.\nSecond, I am wishing and praying for a positive check for you.\n\nVi\t\t\t", "date": "2010-04-08T02:16:15+00:00", "topic": "check up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI still get confused sometimes as well with stage/grade etc.\n\nI am hoping he will do Mytomycin when he removes this tumor.\n\nThanks Mike for the clarification and all the words of encouragement in our emails.  Still working on that and hope to get an answer this Thursday.\n\nVi\t\t\t", "date": "2010-03-12T00:33:40+00:00", "topic": "New growth found", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou guys are great at offering the advice that is most needed.\n\nI think for the most part, I am really doing OK.  It's only been 6 months since my diagnosis and I am still what I consider a baby at this.  However, I do think that all I've read and heard from all of you has made me a \"smart\" baby.  I'm counting on time and experience of cystos and whatever is needed to help me get used to what this cancer means and am trying to be ready for that.\t\t\t", "date": "2010-03-12T00:33:40+00:00", "topic": "New growth found", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMake sure you celebrate since this is a fantastic milestone for you.\nCongratulations,\nVi\t\t\t", "date": "2010-02-19T12:44:52+00:00", "topic": "All clear at 6 months", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have just purchased two American Cancer Society books on Alternative cancer treatments.  They go through all kinds of food, minerals, and vitamins and discusses what they can help.  Just started looking at them, but would be willing to look up anything for anyone if you have questions.\n\nSince it is from the cancer society, I have more faith in what it says.\n\nWhat surprised me so far, was that cranberries were not in the index at all.\n\nVi\t\t\t", "date": "2010-01-24T12:32:15+00:00", "topic": "Health and Diet Changes My Experience", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news indeed for all.  New year and good things happening for several people.\nYea!\t\t\t", "date": "2010-01-22T14:38:24+00:00", "topic": "All Clear Cysto", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat great news that is for you Ann.  This deserves all of Mikes happy dancers going at the same time.\n\nCongratulations,\nVi\t\t\t", "date": "2010-01-20T22:48:44+00:00", "topic": "And more good news/happy dancing", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tKnew we could count on Mike!  He is the official Snoopy man.\t\t\t", "date": "2010-01-19T21:39:53+00:00", "topic": "GOOD NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations and if I knew how it was done, I would post the happy dancer Snoopy.\t\t\t", "date": "2010-01-19T21:39:53+00:00", "topic": "GOOD NEWS!!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMade my last post based on what my aunt told me...what was told to her.\n\nThank you Pat for the excellent research and I am sending this to her because you are right and it could very well just be another scam.\n\nI was hoping this was something that would be good after the discussion about the dangers of CT scans.\t\t\t", "date": "2010-01-19T19:51:37+00:00", "topic": "CT vs ViaScan", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't think it is a scam.  The reason she heard about it is her son in law is with the fire department and they went through some training and saw it.  One of them did this and they found a tumor she did not know about.\nShe lives in Texas.\t\t\t", "date": "2010-01-19T19:51:37+00:00", "topic": "CT vs ViaScan", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHave any of you heard of this?  My aunt called me yesterday and told me about this.   Here is what I found on a web site.\n\nViaScan is the only scanner in North Texas with ultra low radiation.  Comparable scanners, like the 64 slice or 128 slice CT scanners widely used by imaging facilities, subject you to 90% more radiation ...\t\t\t", "date": "2010-01-19T19:51:37+00:00", "topic": "CT vs ViaScan", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow, thank you all for the fast response to this.\n\nUCCC is where I called to get the second opinion.  The scheduler I talked to is the one that explained that my insurance would not cover a second opinion with them on the plan that I have.  She learned this when another person had problems with the insurance.\nChecked the fine print (it specifically lists them) and called... They will only cover the university if my doctor does not have equipment/technology needed for my situation and that is not the case.\n\nOpen enrollment I can change to the more expensive plan that she thought might let me go there, but thought I could do something here in town now.  Our hospital has a cancer center and when I called them, they just have oncologists...thus my question.\t\t\t", "date": "2010-01-15T21:56:51+00:00", "topic": "Urologist vs oncologist for 2nd opinion", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI am so happy for you.  You are a role model and source of hope for all.  Celebrate big!\nVi\t\t\t", "date": "2009-11-04T03:03:18+00:00", "topic": "Time for the Happy November Club", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat an inspiration for all of us.  Congratulations!\n\nI agree that this seems to be the best site for support.\nVi\t\t\t", "date": "2009-11-10T12:02:13+00:00", "topic": "Special Day", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou guys are lifesavers!  Now I have a better idea on what to expect and have already changed what I had planned to pack.  Gonna stick to sweat pants and tee's for him.  I will make a complete list of final questions before we leave.  Thank you again so much.  Really appreciate you taking the time to help.\nJeannette\t\t\t", "date": "2009-06-08T20:37:49+00:00", "topic": "date set for RC surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHope someone can give me some advice.  My husband has T1G3+ CIS.  We live in northern California.  He has accepted the fact that he needs to have a neo-bladder performed.  He did have a consult with Dr. Konety at UCSF who has great experience with the robotic approach.  We live 2 hours away from UCSF and would need to establish with a PCP ect. to get this done there.  We are very close to UCDMC and have a very good surgeon Dr. Chris Evans there who is able to perform the surgery but not robotically.  This is very close to our home and follow up care would be a breeze.  Is the advantage that great having this surgery via DaVinci? I want the very best for him and will overcome the odds to get it done outside our community but I have several advantages having it done at UCDMC.  One of the greatest is I am an employee and they do care for their own.  Opinions or thoughts?  We need to make a decision by Friday so I can change our medical group.  Thank you\t\t\t", "date": "2009-05-13T21:23:28+00:00", "topic": "What to do?  Paralyzed with indecision", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI followed up on Pats suggestion regarding how many neo-bladder reconstructions are done at our local facility and am now almost decided on  going in the direction of changing our medical group to a San Francisco one and starting the whole referral process  with a new PCP all over again.  This will lose some time but might be better in the end.  So - for those who did travel for their surgery - can you share with me what to expect?  If I allow 12 days for the surgery and hospitalization - is it best to get a apartment or hotel for 3-4 weeks?  Is the patient usually discharged with a catheter?  Is the first follow up appointment within days of hospital discharge and therefore better to stay in the city of surgery facility?  If his PET scan was clear last month do I have a month to get this all arranged or am I in danger of jeopardizing his health?  If I change his care today to a San Francisco medical group the soonest we can be seen would be early June and then back to Konety and then....  what is the average time  before surgery takes place?  As you can tell I am about as frazzled as I get and need to make a decision that is well informed and doesn't create more stress.  Thank you all for helping me.  I will return the good thoughts and favor when I have this experience behind me.\nJeannette\t\t\t", "date": "2009-05-14T20:11:21+00:00", "topic": "OK - ready to travel for surgery", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhat a great picture you paint and I'm so glad you are back to share your story.  Once again you also provide good information that many of us would have never thought about.  I will be checking on the vitamin K I'm putting in my body.\n\nTake care of yourself,\nVi\t\t\t", "date": "2011-01-25T05:01:38+00:00", "topic": "I\\'m home..they tried to make me 93,000 and 1", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHoping that this is resolved quickly and she can get back online.  She is a driving force on this site and needed.\n\nPrayers from Colorado,\nVi\t\t\t", "date": "2011-01-14T15:40:33+00:00", "topic": "Patrica is in the Hospital", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm sure you are really excited and can actually believe the news now that everything confirms each other.\nI hope you have lots of celebrating planned and months with no worries.\n\nSo happy for you,\n\nVi\t\t\t", "date": "2010-11-12T20:01:42+00:00", "topic": "More good news!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI always enjoy reading your blogs.  You are indeed so honest about your feelings and that in itself is an inspiration.  Forget everyone else because they really don't have a clue of what is happening with you and that I know includes myself.\n\nMaybe you are at that new normal, but just don't know it because it is new??\n\nWish I had great insight to help, but know that you are in my thoughts and prayers,\nVi\t\t\t", "date": "2010-08-14T16:30:49+00:00", "topic": "Webs Normal??????????", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSounds like you survived the operation very well and are enjoying watching those kids.\n\nI hope you have a great celebration for your birthday and many more to come.\nVi\t\t\t", "date": "2010-07-30T00:59:36+00:00", "topic": "Counting my blessings", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs I read many of these posts, I am always wondering how to get the knowledge many of you have from experiences into a format that others could use.  Pat's list of expert doctors, other peoples tips on recovery or choices in RC.  Your expertise really should be documented somewhere since it goes beyond the normal books.  Perhaps an FYI that includes things like Mikes flow chart.\n\nYou all truly are so valuable to those just learning and needing some positive support, expert advice, or even humor when needed.... so thanks,\nVi\t\t\t", "date": "2010-06-28T19:53:47+00:00", "topic": "Indiana Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNot surprised that things went well.  Congratulations and enjoy being home for the rest of your recovery.\n\nVi\t\t\t", "date": "2010-06-09T22:30:07+00:00", "topic": "Heading back for another hernia repair.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSounds like you've weathered the storm and ready to move on.  Sorry it was so rough, but glad you were tough.\nVi\t\t\t", "date": "2010-04-24T23:19:08+00:00", "topic": "4 1/2 weeks in Hell", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMany times they are caused by the diaphragm and breathing in and out getting out of alignment.  Lots of swallowing and deep breathing has been known to help some, but waiting it out is ultimately what has to be done.\t\t\t", "date": "2010-04-02T15:35:30+00:00", "topic": "Question Regarding RC and Hiccups", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is always great to read your posts and even though they put you through the ringer.... you are cancer free and have a great summer to look forward to.\nCongratulations and hope your feeling good enough to celebrate.\nVi\t\t\t", "date": "2010-03-19T20:39:03+00:00", "topic": "JOINING THE 6 MONTH CLUB", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWow, you must be walking on air.  What an inspiration as well.\n\nHope you celebrated,\nVi\n ", "date": "2010-02-05T20:25:56+00:00", "topic": "Check up.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was reading blogs in non invasive and found this.  It was only after I started to reply that I realized it was older.  You are right though, what ever works.\t\t\t", "date": "2010-01-14T22:39:08+00:00", "topic": "To OWN (or NOT to own) my cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust thinking out loud with you even though this is an older blog.   Do you think it is like when we are kids and the word mine means I get to keep this?  If it isn't mine....my body does not need to keep it.  It can stay gone...\t\t\t", "date": "2010-01-14T22:39:08+00:00", "topic": "To OWN (or NOT to own) my cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tShelby,\nIt is great to hear those 2 words:  cancer free\n\nDouble yay!!! coming to you.\nVi\t\t\t", "date": "2010-01-14T22:33:36+00:00", "topic": "The results are in", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is always to hard to hear about someone like this.  Please let her husband know the many lives she touched and that she is in my prayers.\nVi\t\t\t", "date": "2010-10-09T00:35:10+00:00", "topic": "Anne", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSo great to see that little critters picture in a new post.\n\nI'm thankful that your treatment is working and praying for miracles.  Wish there was more we could do for you.\n\nTake care and thanks for the good news,\nVi\t\t\t", "date": "2010-07-07T10:35:22+00:00", "topic": "Home at last!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSince you have been so supportive and sharing important messages for each of us it is hard when there is no way to repay that during this time for you.  I am so sorry.\n\nI will continue to send up prayers for you,\nVi\t\t\t", "date": "2010-06-24T21:39:52+00:00", "topic": "Update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI will be adding extra requests in my prayers for you and wish there was more that I could do.\n\nKeep the faith,\nVi\t\t\t", "date": "2010-05-06T21:29:23+00:00", "topic": "Is this the end of the road?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI hope you have little or no side effects and make sure you just enjoy some free time from all of this.\nVi\t\t\t", "date": "2009-12-02T21:01:06+00:00", "topic": "More on Betsy Mae", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tWhile I am new to all this, I still feel for you and wish you the best.\n\nThough I have no words of wisdom, I am finding new people to add to my thought and prayers and you are added as well.\n\nVi\t\t\t", "date": "2009-11-04T18:07:05+00:00", "topic": "Is there room in here for one more?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tIf anyone gets to be the fat donor, I would love it to be me.  The crazy thing is since starting to eat healthy and quitting smoking, I gained a lot of weight.  It is slowly coming off, but I'm there for the lypo if you need me.\t\t\t", "date": "2010-09-21T21:14:20+00:00", "topic": "Cancer Diet", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tI am so sorry you must even deal with another cancer.  I agree that the new treatments for things are amazing.  I hope they caught this early and good for you that you are getting another opinion right off the bat.\nVi\t\t\t", "date": "2010-09-24T03:34:34+00:00", "topic": "husband has melanoma", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\n\t\t\t\tI say go for it.  I just bought my sister in law a t-shirt that said:  \"At my age, I need glasses.\"  Under that was 3 wine glasses.  You could always use that for an excuse.\nVi\t\t\t", "date": "2009-12-19T18:56:24+00:00", "topic": "GO AHEAD..DRINK THAT WINE", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tHave any of you had an MRI or other type of scan instead?  If CT scans can lead to other cancers it seems we should insist on other methods.\t\t\t", "date": "2009-12-15T18:36:00+00:00", "topic": "CT scan variables??", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tWhen I went to see the pulmonary specialist about the nodule in my lungs he mentioned this same concern.  We talked about coordinating my scans if we could, but he wants to check me every 4 months at first and my uro every 3 months.\t\t\t", "date": "2009-12-15T18:36:00+00:00", "topic": "CT scan variables??", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI will have to go back and find the article, but this talked about ways to prevent cancer and also ways to keep it from coming back.  There were testimonials, etc.  That is where I read about the cottage cheese and flaxseed oil.  I did so much research in the beginning that I'm not sure I will find the article.  I just cut and pasted like crazy from several things I read.\t\t\t", "date": "2009-11-16T00:46:09+00:00", "topic": "Medicines to Deter Some Cancers are not Taken", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI was able to read the entire article without any problems.\n\nThis was one of the first things I researched and may have even asked about when I joined.  I am currently eating 1/2 c. cottage cheese with 1-2 tsp. Flaxseed oil daily.  Now I am concerned and will probably try to do some more research on this.\n\nWhen I asked my doctor about diet, his answer was that there just was not any medical proof about anything in particular to help.\n\nVi\t\t\t", "date": "2009-11-16T00:46:09+00:00", "topic": "Medicines to Deter Some Cancers are not Taken", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tPoint taken on the second opinion/specialist,\n\nRight now I am waiting until next Wednesday to see what the lung specialist says.  Not sure what to do about doctors if I'm going to double dip (end up with 2 cancers).  Really just trying to cope with the stress right now while waiting for my appointment.\t\t\t", "date": "2009-11-11T05:23:42+00:00", "topic": "The Rules of Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tI really liked #8:  Spend energy living forward, not backward.\n\nAt this point I can't live wondering why or trying to find a blame for this.  I need to #3 Enhance my self-awareness by doing my job researching, and the most important that did not even have a #:  Reach out which is where all of you/us come into play.\n\nVi\t\t\t", "date": "2009-11-11T05:23:42+00:00", "topic": "The Rules of Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tGeorge:\nCelebrations can never be too late so we will consider you early.  This is especially true since every year becomes more special when you have had cancer.\n\nThanks,\nVi\t\t\t", "date": "2011-01-09T13:48:07+00:00", "topic": "Happy Birthday Vi (Vgau)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for the birthday wishes.  This seems to be a birthday year that just keeps getting celebrated.\n\nAbout the age deal, I'll be sure to let you know if I ever get to that point.\n\nHope all is well with you,\nVi\t\t\t", "date": "2011-01-09T13:48:07+00:00", "topic": "Happy Birthday Vi (Vgau)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHumpy:  I've always thought you guys were the life of the party on this site so it does not surprise me at all.\nVi\t\t\t", "date": "2011-01-09T13:48:07+00:00", "topic": "Happy Birthday Vi (Vgau)", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMerry Christmas to all and I hope 2011 brings good health to you.\nVi\t\t\t", "date": "2010-12-24T23:27:33+00:00", "topic": "Merry Christmas to All!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSaw this on facebook and what a wonderful idea of how to share the event.\nCongratulations on renewing your vows,\nVi\t\t\t", "date": "2010-10-05T15:43:50+00:00", "topic": "An invitation to our ABLCS family", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat news and I hope he is having fun right now on his honeymoon.\n\nCongratulations Sailorman,\nVi\t\t\t", "date": "2010-09-02T00:54:57+00:00", "topic": "Sailorman gets married", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHappy Birthday Pat and I hope you did something wonderful for yourself since you spend so much time helping everyone here.\n\nVi\t\t\t", "date": "2010-07-12T00:00:28+00:00", "topic": "Patricia\\'s Birthday is today!!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAs a new person to this site I must say that this group really is like a small family.  Each person has a specific part and personality that makes up this family.\n\nTherefore, yes, you are missed and people start to worry so it's great that you checked in and glad that you are just really busy.\n\nGood luck with all,\nVi\t\t\t", "date": "2010-05-10T18:52:36+00:00", "topic": "The mysterious disapearance and reaperence of Webs", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI want to find someone really rich that will fly us all somewhere so we could all meet.  Wouldn't that be great.\nVi\t\t\t", "date": "2010-05-13T19:26:31+00:00", "topic": "I met Julie!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWow!  Here I am at school reading this and crying like crazy(Good thing I don't have kids in my class right now).\n\nWhat I really heard as I read this was how much you are loved by your daughter and what a shining example you are to be strong and brave.\n\nVi\t\t\t", "date": "2010-05-11T17:37:14+00:00", "topic": "Lauren\\'s Poem", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSounds like a wonderful time and I'm sure you will see many great things with someone in the know showing you around.\n\nWhat fun also to meet someone from this forum.\n\nEnjoy,\nVi\t\t\t", "date": "2010-04-26T00:40:39+00:00", "topic": "Vacation", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGood for you.  Forget about everything here and have a wonderful time.  I am soooo jealous and will love hearing about your adventure when you get back.\nVi\t\t\t", "date": "2010-02-18T16:46:34+00:00", "topic": "Going away", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\t** This thread discusses the content article: \n\tPay it Backwards\n **\n\nThanks, Thanks, Thanks, to everyone here,  I don't think you all know what a difference you make and it never hurts to hear it again if you do.\n\nWhen Cynthia said I was now moved in status, that opened up the thought of how do we thank the people who help our progression? I don't want to loose sight of my support and would love to hear some unique ways you have shown your thanks.  Kind of a pay it backwards idea.\n\nThere are many people that have made such a difference for me from those pushing me to get a second opinion, helping me keep my humor, and especially to look at myself and how I am dealing with this.  I am in a good place and recent discussions have caused reflection that really makes me feel good here.\n\n\n\n", "date": "2010-02-04T14:32:05+00:00", "topic": "Pay it Backwards", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMike shared some great song lyrics and I thought it might be interesting to hear about inspirations.\nThis is one that was shared before and my favorite. The Climb by Millie Ray Cyrus  youtube.com/watch?v=NG2zyeVRcbs\n\nI can almost see it\nThat dream I’m dreaming but\nThere’s a voice inside my head sayin,\nYou’ll never reach it,\nEvery step I’m taking,\nEvery move I make feels\nLost with no direction\nMy faith is shaking but I\nGot to keep trying\nGot to keep my head held high\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSometimes I'm going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nThe struggles I’m facing,\nThe chances I’m taking\nSometimes might knock me down but\nNo I’m not breaking\nI may not know it\nBut these are the moments that\nI’m going to remember most yeah\nJust got to keep going\nAnd I,\nI got to be strong\nJust keep pushing on,\ncause\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSometimes I'm going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nThere’s always going to be another mountain\nI’m always going to want to make it move\nAlways going to be an uphill battle,\nSomebody's going to have to lose,\nAin’t about how fast I get there,\nAin’t about what’s waiting on the other side\nIt’s the climb\n\nKeep on moving\nKeep climbing\nKeep the faith baby\nIt’s all about\nIt’s all about\nThe climb\nKeep the faith\nKeep your faith\nWhoaaa Ohwaoooh\t\t\t", "date": "2010-02-18T14:06:21+00:00", "topic": "Lyrics/Inspirations", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tBeing a science teacher, this title made me open this one first.\n\nScary stuff...messing with a mom and her cubs.  Did you know that how many cubs they have depends on how much food they were able to get before hibernation?  I am jealous that you got to see that.\nVi\t\t\t", "date": "2010-01-26T04:15:04+00:00", "topic": "bears", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI do have fun and as long as that is happening, I plan to continue.  Love middle school kids and especially with my curriculum.  On the other hand, I can't imagine working with the younger ones like you.\t\t\t", "date": "2010-02-03T00:07:35+00:00", "topic": "Remembering a great icon .........", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI need to tell you that I am doing a nutrition/digestion unit right now and it was perfect timing to get this.\nI read this to all my 7th graders and Oh my!\nSome asked if this was someone related to me or someone in the class (over their head).  Others asked if he really died because they love those commercials...(Hard to keep a straight face.)  Others asked for a copy since it was so funny.\n\nThanks for sharing,\nVi\t\t\t", "date": "2010-02-03T00:07:35+00:00", "topic": "Remembering a great icon .........", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGreat one.  As I am getting older (what is considered over the hill) and starting to experience some of the fun of old age... I wonder why they call them the golden years?\t\t\t", "date": "2010-01-27T20:23:46+00:00", "topic": "The Reunion", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\t** This thread discusses the content article: \n\tSigns of hope in 2010\n **\n\nAn amazing Fireworks show right outside my bedroom window woke me up to say Happy New Year.  Seemed like it was my own private show to give hope for a healthy year in 2010.\n\nHope you all have signs this year to share,\n\nVi\n\n\n\n\n\n\n\n\n\n", "date": "2010-01-01T07:38:16+00:00", "topic": "Signs of hope in 2010", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tChristmas has always been my favorite time of the year (all the needless spending and cooking can't bust my bubble).  This year it is even more special to me for all the reasons you have mentioned such as family, friends, the support group here, and more.  My new grandson will be so much fun this year as he loves the lights and is cheap to buy for since he just likes the sound of paper being crushed in his hands (I can just wrap empty boxes although I have bought him several fun things).\n\nI guess while I am scared, mad, sad, and glad....I am also now more aware of just how wonderful my life has been and can continue to be even with cancer.\n\nI'm ready for the new year and hope to have a year of lots of positives from everyone.  My new slogan is \"Look out...I'm cancer free for at least 3 months.\"  I plan to say that all year and hope all of you can too.\n\nMerry Christmas,\nVi\t\t\t", "date": "2009-12-24T15:04:14+00:00", "topic": "MERRY CHRISTMAS or HAPPY HOLIDAYS or JUST HAPPY", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThought it might be good to start this thread.  Seems like the holidays are a time when we need some cheer in our thoughts.\n\nI'll start with how thankful I am for all of you.  It is like a new group of friends even though I will probably never meet any of you face to face.\nI will also thank Mike for his great job at predictions.  Watched my scope and there were no new tumors to be seen.\n\nHope everyone has a little good news today (Isn't that a song?)\t\t\t", "date": "2009-12-10T19:46:13+00:00", "topic": "December good news", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI am going to see how things go on Tuesday.  I have already talked to my husband about doing a second opinion.  The problem is finding someone in Colorado Springs rather than Denver.  Have you any knowledge about people in this area of the country?  Mike suggested someone, but that was in Denver.\t\t\t", "date": "2009-12-03T01:17:03+00:00", "topic": "A little good news today", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tToo perfect and no dry eyes.\n\nHow do you download this?  I would love to keep a copy of this for myself.\nVi\t\t\t", "date": "2009-11-28T22:29:25+00:00", "topic": "My Bladder Cancer Theme Song", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tYou make sure you take care of your self. Get lots of rest and liquids. My boss had this and ended up in the hospital only because he would not take it easy and take care of himself.\n\nWill be thinking of you and wishing you a fast recovery.\nVi\t\t\t", "date": "2009-11-27T22:50:40+00:00", "topic": "Cynthia and the flu", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tA day to share with family, eat...and then get to eat left overs.  Priceless!\nHappy Thanksgiving to all my new friends here at this site!\nVi\t\t\t", "date": "2009-11-25T19:42:28+00:00", "topic": "Happy Thanksgiving!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAnything that OK's chocolate is great in my book.\n\nMy homework on Halloween was to be safe while trick or treating and save me their Nestle Crunch.  Maybe I should have said dark chocolate since I have had so much stress lately.\nVi\t\t\t", "date": "2009-11-13T20:40:16+00:00", "topic": "Another Case for Chocolate!!!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI'm not sure I understand the difference between the forum or blogging.  Seems there are all types of things on both.   How do you decide where to put a posting?\t\t\t", "date": "2009-11-09T22:46:34+00:00", "topic": "To blog or not to blog that is the question!", "subforum": "17-chit-chat"}]}