{"signature": ["Dx", "TURBT", "TURBT", "BCG", "BCG"], "posts": [{"text": "\n\t\t\t\tI have the same pain I did a sonogram cat scan and nothing founded. I asked my doctor and he said it is nothing. I know that we must be suggested about cancer. Good luck with you results. Let us know them.\t\t\t", "date": "2016-08-13T01:17:39+00:00", "topic": "Confused about flank pain", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tExperience taught me that we have to prepare for the worst. If you have fatigue with no explanation , if you are loosing weight you have to be very carefully. Other way you are passing some hormonal changes that may cause this symptoms. So go to your doctor maybe gynecologist first . Keep posting\t\t\t", "date": "2016-06-11T16:28:59+00:00", "topic": "New here, waiting for urine results", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\thello charliem, do you have your biopsy results? I really hope that everything is good. Although life will never be the same i am fighting  everyday, and it is not too bad, my priorities have been changed but i\nam ok. this fórum helps me a lot, please continue posting. hoping good news\t\t\t", "date": "2015-11-25T15:28:52+00:00", "topic": "Low grade non invasive bladder cancer", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI am sure that everything is going to be excelent! Your husband is very lucky to have you as a partner in this journey  . Please let us know his evolution. Next tuesday i will have a citoscophy . I am a Little afraid, but i cant do anything, just wait and wish that everything will be ok.\t\t\t", "date": "2015-12-08T21:37:51+00:00", "topic": "My husband had his RC/IC Surgery yesterday", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello  hope you don't have too much uncomfortable symptoms and enjoying your chicken soup.why do you have to wait 5 weeks, I think the next check will be each 4 months. Please let me know.\t\t\t", "date": "2015-06-20T17:58:10+00:00", "topic": "BCG Treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello katjabber your story looks like mine ,most of the time there are not infection, although that this is possible, I had bladder inflammation with all of the uncomfortable symptoms, urgency burning, some pain etc. I had to go to the bathroom each  hour with emergency. My doctors gave me some pills named vesicare and I take them for a week and I am better. I asked the other day if my life will be \"normal\" and I think ours concepts will change I fell good, happy, thankful , yes our priorities change, but life goes on and we must enjoy it. I will have my cithoscopy next Thursday I am a little worried and concerned my sonogram x Ray and lab tests are ok.  My life would have change, I think you are in the right way, for me sharing my doubts help a lot. Greetings\t\t\t", "date": "2015-12-05T16:02:48+00:00", "topic": "Bladder infections with BCG treatment", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou don't have choice you must go to an urologist. Your case looks like mines. I had cat scan ultrasonography, etc the second cat scan showed the tumor, so I had a cithoscopy and there were found thre tumors. I had won weight . It is probably a bladder cancer but the unique way to know is with a cithoscopy . The good new is that 75 percent of bc are superficial  with excellents treatments . Good luck this forum is awesome !\t\t\t", "date": "2015-11-05T03:17:25+00:00", "topic": "Necessary scope?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello everybody here is afraid of cancer. It seems like we are living a nightmare, but the unique way to do something is doing the test. Cat scan and cithoscopy. I believed for two years that I had stones in my kidneys, when finally after two cat scans I saw an image compatible with cancer, the next day I had a turb with three tumors very big, fortunately superficial. What I am trying to tell you is if you have cancer your opportunities to get a better treatment is knowing what you have. Don't waste time please. I am 50 years old two kids 15 and 8 years old. I was diagnosed in January . My best wishes for you and your husband.\t\t\t", "date": "2015-11-09T05:25:12+00:00", "topic": "waiting...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI understand what are you living. The urine incontinence and the urgency is probably because your bladder irritation, the presence of blood must be investigated. I had these symptoms before I was diagnosed with cancer. Then after the surgery turb they disappeared. When I finished my 9th BCG my symptoms began again, my doctor says that it is normal after the BCG, but I am no bleeding anymore. You must check your symptoms. My thoughts are with you\t\t\t", "date": "2015-11-02T19:13:32+00:00", "topic": "So many questions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThank you . I am a doctor and it is a advantage and disadvantage at the same time. Well I will be on touch thank you again\t\t\t", "date": "2015-10-25T11:27:29+00:00", "topic": "Post BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello I am 50 years old, in January I was diagnosed with bladder cancer . I was bleeding for almost 2 years. I went to  a doctor an urologist   I did all tests except  cithoscopy , finally in January  I had an tur . I had 3 tumors, one  6 cmt , the other 4 cmt and the other 3 cmt. They were G 3 tumors. I changed the doctor an cancer urologist and he repeated the TUR. One week later, there were no tumors and apparently the muscle was free. So I began with 6 dosis of BCG   In March . I finished the induction in April. I felt very good. I had a cithoscopy in August and the doctor didn't find anything, so I started BCG again for three weeks. The last  dosis was the last week of August . I am very worry because I still have urine disorders, like urine urgency , I go to the bathroom frecuently each hour and a half. I feel tired with some muscles pains. I went to the doctor and he told me that it is normal cause the chronic inflammation of the bladder. My next control will be the first week of December , so please give me your opinion. I am planning to do a pet scan or something, thank you.\t\t\t", "date": "2015-10-25T11:27:29+00:00", "topic": "Post BCG", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello my journey partners . Today y had my three months cithoscopy , and fortunately everything is good. I will start BCG on Monday , for three weeks. thank you people. Just I want to share you. I was diagnosed January 2015.\t\t\t", "date": "2015-10-30T23:10:33+00:00", "topic": "Need advice", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI usually received BCG at 7 pm so I wait until 9 pm  I have bladder irritation for  a week approx. I need a bathroom very close to me. I don t work the next day. Since my diagnosis  I had to hire an assistant , cause I an surgeon. I had to addapte my life as everybody here.\t\t\t", "date": "2015-10-30T23:10:33+00:00", "topic": "Need advice", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tcongratulations my journey partner. right now i am waiting for my 3 month citoscophy. little nervius . whatever  hope everything is gonna be ok.\t\t\t", "date": "2016-02-10T02:17:07+00:00", "topic": "No sign of Cancer today at Urologist!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello i had  my  turb in january 21 2015  I had pain until march with some blood, so i  started  the BCG in april . I told my urologyst  and he said it was normal . You  have to ask your doctor, continue posting\t\t\t", "date": "2016-01-20T17:21:34+00:00", "topic": "turbt 5 weeks ago... painful urination now", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello would you please tell me wich is you cancer stage ,?\t\t\t", "date": "2015-11-03T07:43:39+00:00", "topic": "Starting BCG this week", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI think you have really good probabilities to cure cancer. Be alert! And enjoy each day of your life.\t\t\t", "date": "2015-09-03T22:20:40+00:00", "topic": "a year after surgery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTo everybody here i Wish a happy holydays. We are in this path . Hope we have a real good 2016.greetings from Perú.\t\t\t", "date": "2015-12-24T10:12:36+00:00", "topic": "Happy Holidays!", "subforum": "17-chit-chat"}]}