{"signature": ["TURBT", "BCG", "BCG", "BCG", "Surgery"], "posts": [{"text": "\n\t\t\t\tAbout a week or more after a TURB the clots that form at the site of the biopsies start to be shed. I always had a little bleeding, internal itching, and burning. A few years ago my cardiologist put me on aspirin 81 mg. I stopped for the biopsies but was told I could restart afterwards. Aspirin interferes with platelet function thus preventing clots which is why it is used to help prevent heart attacks. The FDA recently concluded that there wasn't sufficient evidence to recommend aspirin as a preventive. I'll have to talk to my cardiologist about that. In any event, while on the aspirin I developed severe post biopsy bleeding and clots which obstructed my bladder. I catheterized myself a few times until I could no longer get the catheter to pass and then took myself to the hospital where I was admitted for continuous bladder irrigation. I couldn't call bleeding \"normal\" but it does happen and until it is fully resolved your husband needs to discontinue the aspirin.\t\t\t", "date": "2014-04-24T18:00:57+00:00", "topic": "Newly with bladder cis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWas the second tumor already there at the time of the first biopsy? It is not unusual to have multiple rumors at presentation, and if it was small, it could have been missed. If this new high grade tumor arose in such a short time reaching the T1 stage, the concern is how quickly invasive disease can develop. Having a cystectomy once muscle invasion occurs is absolutely necessary, but getting rid of the bladder before nvasive disease develops has the best prognosis.\nRepeat BCG with interferon may be more effective than BCG alone. That's what they tried with me, but I kept having high grade recurrences and so opted for the cystectomy even though I had not had invasive disease. This was after 10 years cancer-free from the initial diagnosis.\nAnother option which nobody ever tried with me is BCG maintenance. I had such an awful reaction to my second course of BCG I'm glad I had the cystectomy instead.\t\t\t", "date": "2014-05-26T03:31:07+00:00", "topic": "T1G3 Bladder Cancer Diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou'll certainly want a second opinion and treatment at a major cancer center. Your second opinion should include a review of the slides by their pathologist; however, if the biopsy shows muscle invasion, cystectomy is the treatment of choice and an additional biopsy wouldn't change that.\t\t\t", "date": "2010-05-11T14:32:42+00:00", "topic": "SC new Dx needs advice", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tYou can't make any treatment decisions until you know your pathology. Stage (how far it has invaded into the bladder and surrounding layers) is more important than grade. I had high grade tumors but my cancer was superficial (non-invasive) not having even gone through the lamina propria. I was treated with intravesical chemo (mitomycin C) although most in that situation are treated with BCG. That was 9 years ago.\nInvasive cancer requires more aggressive therapy including removal of the bladder. Radiation is not used to treat bladder cancer and might do more harm than good. I don't know if radiation is used on lymph nodes for invasive cancer, but irradiating the bladder is a bad idea.\nGetting a second opinion is always a good idea, but unless you have invasive cancer you probably don't need to consult an oncologist. You should make sure you're seeing a urologist who has lots of experience treating bladder cancer, preferably at a university hospital.\nTo the best of my knowledge there is no relationship between cervical cancer and bladder cancer, even though they're in the same general area. Most cervical cancer is caused by human papilloma virus (HPV).\nI always had major bladder spasms when things were done to my bladder. Ask your doctor about medication to relieve the spasms. There are many such as Detrol, Vesicare, Urelle.\nMore than 2 weeks sounds like a long time to wait for a report unless the lab is extraordinarily busy. I knew my results in less than a week. Can you speak directly to the pathologist?\t\t\t", "date": "2010-01-08T22:11:10+00:00", "topic": "Too many Questions - Too few answers", "subforum": "3-newly-diagnosed"}, {"text": "\nmmc wrote:I'm 50 so does that make me TOP OF THE HILL?\n\nI guess that's kind of like King of the Hill!  I've seen your many helpful posts. I'd say you're top of the hill, or at least tops.\t\t\t", "date": "2009-11-05T00:34:28+00:00", "topic": "Talking about your cancer and how you are treated", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThe bladder expands as it fills and contracts as it empties, so there should be no nooks or crannies. The appearance of nooks or crannies, or a collapsed (rather than empty) appearance on an image suggests something is there creating that appearance. It does not tell you what, so the cystoscopy is the next step, and if there are possible tumors, a TURB after that.\t\t\t", "date": "2009-12-06T02:43:45+00:00", "topic": "Deciphering doctor\\'s descriptions", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tKidney stones and I supposes stents (if they cause irriation) in the distal ureter (the far end where it attaches to the bladder) can cause intestinal symptoms as well as urinary symptoms. When I've had stones I've found that more annoying than the flank pain.\t\t\t", "date": "2009-07-29T06:24:57+00:00", "topic": "husband diagnosed june 26 2009", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tBecause the interpretation says, \"Muscularis Propria is identified, Definitive involvement cannot be determined,\" you should have the slides reviewed by an independent pathologist who has experience with bladder cancer. Unless they can state that the muscularis has not been invaded, your doctor cannot call your cancer superficial, and that makes all the difference in terms of treatment. If review of the biopsies is not definitive, get a reTURB from another urologist who is epxerienced with bladder cancer for a second opinion.\nNy urologist also acted like my cancer was no big deal. A more educated, detailed discussion would have been more reassuring; however, 8 years later, even though it was high grade, I guess he was right since I'm fine, but... mine was unquestionably non-invasive, and I still had the slides reviewed elsewhere. The issue of msucularis invasion must be clearly determined.\t\t\t", "date": "2009-02-03T03:49:08+00:00", "topic": "new dx", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAlthough I have no research to back me up, I remember the day I heard I had cancer, and I'd venture to say that we don't even hear half of what the doctors tell us after we hear the word \"CANCER.\"\nIt's been my experience as a pediatrician that whenever I tell a parent something upsetting, they will often ask me something I just finished explaining to them. Not only do they need reinforcement of the information, but even as they ask and I answer, I can tell that their minds are spinning with the next question and they're only half concentrating on my answer.\nThat's one of the reasons we need caring and supportive specialists who take the time to talk with us, not at us. The prima donnas who breeze in and out of the room before you can even think won't do.\t\t\t", "date": "2008-10-24T16:49:40+00:00", "topic": "New Cancer Patients Retain Little Information", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tSensitivity and specificity:\nIf a test is sensitive It will find most of the positives. Using bladder cancer as an example, a sensitive test will not miss many bladder cancers - but if the test is not specific (low specificity) it will have a lot of false positives, meaning a lot of patients will require further evaluation because the screening test suggsted they might have bladder cancer even though it turns out they don't.\nTesting for blood in the urine is a fairly sensitive test since the vast majority of patients with bladder cancer have blood in the urine, however the specificity is very low since there are many other reasons a person could test positve for blood in the urine. The standard cytology has shown a low sensitivity for low grade cancers, but doesn't have many false positives so it has high specificity.\nUnfortunately the most senstive test usually have the lowest specificity, while the most accurate tests (regarding spcificity) might miss too many patients. The goal is to find a screening test that will not miss many bladder cancers, but which will not have a high number a false positives.\nDid I make it clear? If I try to say any more I'll trip over my tongue:P\t\t\t", "date": "2008-08-20T01:29:04+00:00", "topic": "Finding a test that works 100%..from Urotoday", "subforum": "3-newly-diagnosed"}, {"text": "\nI was advised to go to the emergency room if I wanted immediate treatment rather than waiting for an appointment that was 2 months off.  The nurse told me \"they have to take you mmediately in the emergency room.\"They do have to take you in an ER, but they only do emergency treatment. That would not inlcude a cystoscopy unless there was an obstruction to urine flow which couldn't be resolved by catheterization, or if catheterzation could not be accomplished. ER docs are not urologists, and a urologist would not be called except for a urological emergency. While anybody waiting for a TURB for bladder cancer may consider it emergent, it wouldn't qualify for ER treatment\t\t\t", "date": "2008-04-10T15:50:53+00:00", "topic": "Dad has growth but no info!?!?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear Doug,\nYour path report clearly states T1, so your analysis that it is T1G3 is correct. The fact that muscularis propria was present is crucial. If there wasn't any muscle in the specimen, the pathologist could not conclude that it did NOT invade the muscle. That means the specimen was adequate and your stage is correct.\t\t\t", "date": "2008-02-27T21:32:51+00:00", "topic": "Pathology Questions", "subforum": "3-newly-diagnosed"}, {"text": "\nThe \"focally high-grade\" throws meDear Debbie,\nFocally high grade means that when they did the slides of the tumor (1 tumor can yield multiple slides, and multiple areas must be examined) they found some areas of tumor which were high grade and some which were not (presumably low grade then). Since there was no invasion, your husband is being treated for a high grade non-invasive bladder cancer.\nIf this doesn't clarify things for you, please write again or PM me. We physicians sometimes have a great deal of difficulty figuring out which of the words we say patients don't understand.\t\t\t", "date": "2008-02-12T20:50:59+00:00", "topic": "Husband's Pathology Report Came In....", "subforum": "3-newly-diagnosed"}, {"text": "\nI had the urogram in around 1/12 and about a week later the urologist called and said they want to do a cysto.  This immediately freaked me out becuase I thought that they must have found something and they wanted to investigate further, the Urologists office had no idea and said that it was routine and I shouldn't worry about it.The CT Urogram is a good test, but it can't see everything that a cystoscopy sees. It cant' show flat tumors like CIS, and small tumors may not be visible. The cystoscopy is just as important to definitively rule out cancer as it is to find it early and treat it before ti becomes a problem. Even though tests make patients nervous, one must always rule out the worst case scenario - in this case bladder cancer. You could never be truly at peace without knowing for sure that you don't have cancer, and if you do, it's best to find it now rather than later.\nAll of us have been scared before our diagnosis, and we have the pleasure of being scared again at follow ups because we worry about recurrences - but there is life after cancer. I'm 7 years out with a high grade cancer and have never had a recurrence.\nYou may have nothing, so try to stay clam. If you have something, you'll be treated, and we'll all be here to help you deal with it.\t\t\t", "date": "2008-02-14T20:13:49+00:00", "topic": "Not Diagnosed yet but............", "subforum": "3-newly-diagnosed"}, {"text": "\nwe returned to the doctor's office at 10:30 this morning to get the catheter removed. By 3:00pm, he could not urinated and bladder was in pain so we went back to get the catheter put back in... Is it possible to not urinate properly even with a catheter?Dear Debbie,\nI took out my catheter the morning after my TURB as instructed. Felt reasonably OK all day, although I'm sure the Detrol helped with the bladder spasms. By evening my stream was becoming weak. By the middle of the night I couldn't urinate, so I drove to the ER and was sent home catheterized. Once again, as instructed, I removed my catheter the next morning, and by the next night was again obstructed, so back to the ER. This time the catheter stayed a few days until I saw my urologist (and found out my diagnosis).\nHe gave me a few catheters and instructed me in self catheterization. The following week, a large clot came partially off the bladder wall and obstructed my flow. I tried the catheter, but the clot obstructed the catheter. Fortunately, on removal of the catheter I experienced a gush of urine that provided much relief, although I was up all night until the clot finally broke free and passed. So yes, even catheters don't guarantee free flow of urine.\t\t\t", "date": "2008-02-09T03:37:31+00:00", "topic": "Husband had TURB yesterday...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had microscopic blood in my urine for 8 years before the cancer, but no visible blood. I even had a cystoscopy the first time around, but since it was negative, we just let it go. I actually must have had increasaed bladder twinges for about ? months and asked my urologist how we would know if there was anything to worry about. He had me do a cytoloogy which showed \"sheets of atypical cells\" which he thought was okay, so we did nothing. A month later I passed a clot. The rest is history - TaG3 - 4 tumors plus CIS. It's 7 years later and I'm fine except for a urethral stricture as a complication of treatment.\t\t\t", "date": "2008-01-31T03:56:32+00:00", "topic": "Warm hello to all....", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAmen!\t\t\t", "date": "2007-12-04T17:52:20+00:00", "topic": "Taking Vitamin Supplements and websites you can check from The Cleveland Clinic", "subforum": "3-newly-diagnosed"}, {"text": "\nI seriously dont know...ive lost all will to live...the only option left is a cystoscopy..\nim 19...do i have a tumor in my bladder?Dear John,\nFirst, a cystoscopy can rule out a tumor and help you move on, but it is not the only thing that a cystocopy can check for. The doctor can see if there's any inflammation in your bladder causing your symptoms. So go ahead with it and be done with it. The information we have is too limited for any of us to know if every test has been done. We don't know if the urologist has evaluated your stream, checked your bladder capacity, checked for post void residual.\nWhat we do know, is that those of us here on the forum were ready to fight for our lives when we found out we had cancer, and yet you, at 19, are talking about giving up without even having such a diagnosis. I can't help wondering, whom do you turn to for support? I know you're not a kid, but are you talking to your parents, other family members, friends? It's great to turn to us for what support we can give, but it sounds to me like you need some more hands on support. Your stress, anxiety, and depression could be contributing big time to your symptoms.\nHave you considered getting couseling? No matter what your final diagnosis is, it sounds like you could use some help in coping... with the future, and with the here and now.\t\t\t", "date": "2007-11-27T05:53:48+00:00", "topic": "what is wrong with me?", "subforum": "3-newly-diagnosed"}, {"text": "\nI can't imagine anyone not getting a second opinion. I would think the first urologist would also suggest that.Now that I'm a member of this forum and have learned so much here, I can't imagine not getting a second opinion. And perhaps I did in a way since I had the slides reviewed at Harvard, and I reviewed the recommended treatment (Mitomycin C instead of BCG for TaG3 + CIS) with a urological oncologist from Harvard, but in the end, I asked very few questions, and what I read on the internet scared me more than it helped me. My urolologist was a friend and colleague and I followed his advice blindly. I think our personal relationship (even though it was professional and not social) made it more difficult for me to question him. I still don't know if my recurrence-free 6¾ years was a result of his surgical skill or luck because there were so many aspects of his dealings with me that I began to find disturbing. Then, when he basically dismissed the problem with my urethral stricture, I changed urologists and now I'm first having an evaluation of the upper tracts (kidneys & ureters) which I never had. I hope everything turns out OK, but now I really have misgivings about never having had a second opinion.\t\t\t", "date": "2007-11-12T21:46:28+00:00", "topic": "The 2nd opinion suggestion", "subforum": "3-newly-diagnosed"}, {"text": "\ni havent really not told the truth, ....so at the moment i cant put my son through the whole truth , as i said before my son is a bright boy , and he doesnt realise anything other than the blood clot is a problem , had he have done so then i wouldnt have been able to not tell him , as we are open with each other and he would realise that i was keeping something fron him , the hospital appointments are checking his leg , which isnt a whole lie as the kidney is causing the leg problems .I think you'll know when the time is right to tell your son the facts. As long as you continue honestly sharing your feelings, he may even know when it's time to ask.\t\t\t", "date": "2006-11-06T21:06:34+00:00", "topic": "helping", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tAn addendum to my reply; Another Reason to Keep the Conversation Real. It's hard for parents to see their kids in pain, but just because we don't see it doesn't mean it's not there. You'd be amazed at  what great lengths kids will go to to protect their parents from things they think their parents don't want to hear. And you'd be equally amazed at how false reassurances and reassurances given too quickly end a conversation when it would have been better for the child to put all his feelings out there for open discussion. A child doesn't need to hear that everything will be okay when it's not. He needs to know that you'll be there for him even when it's rough for you, and that you'll get through it together.\t\t\t", "date": "2006-11-06T21:06:34+00:00", "topic": "helping", "subforum": "3-newly-diagnosed"}, {"text": "\ni really dont know how or if to tell my son about his grandad just yet , he has been affected badly by my partners passing and was aware of the illness , to turn around at the moment and tell him about his grandad , i dont think is a good idea , yet i dont want to lie either , i have tried never to lie to him , and in return i dont get any back so far anyway  ;D my son is a very bright child for his age (10 ) , and at the moment thinks grandads just got a bad leg , he was aware how the blood clot could have taken his grandad straight away , i just think at the moment if i tell him the whole truth it would devistate him ,and maybe he would assume the out come to be the same as my partners , any one have an opinion on this ?I always advise telling children the truth. When you don't tell the truth and they sense that something is wrong (which they usually do) what they imagine is often worse than the reality. But telling the truth doesn't mean giving every detail. You have to give it in terms they can understand, and maybe not all at once, leaving time to absorb some information and come back to ask questions. If you're worried you can say you're worried without putting it in the bleakest terms. If you're reluctant to talk about how you feel, your kid will be reluctant to intrude with his own feelings. You can share the scary stuff without taking away hope. You can't promise everything will be fine, but you can tell him about all the people who are fighting this battle well.\n-Warren\nTaG3 CIS cancer-free 6½ years, Pediatrician\t\t\t", "date": "2006-11-06T21:06:34+00:00", "topic": "helping", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDear David,\nOf course I don't have the answer, but I certainly favor the idea of trying Mitomycin C before throwing in the towel. I had great results so far wtih Mitomycin C.\t\t\t", "date": "2008-06-10T16:37:35+00:00", "topic": "What are the odds of recurring non-invasive CIS/Dysplasia Upstaging??", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's a really tough question David, but aside from considering the risk of progression and therefore the risk of a bad outcome, another factor in your case would be quality of life with your bladder. If the required treatment for keeping it will have you spending most of your time miserable dealing with prolonged treatment side effects, you have to weigh that into your decision. Note that I said, \"If,\" so you'll have to know what your urologists wants to do to spare your bladder.\t\t\t", "date": "2008-09-21T00:16:57+00:00", "topic": "Bad Reaction to Mitomycin C", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMost of my problems have been complications of treatment. I do have a neobladder, and did well with the surgery, but was completely incontinent afterwards. After a year without improvement, I finally had an artificial sphincter installed. 6 weeks after it was activated, it eroded into the urethra resulting in swelling and severe pain, so I had to have surgery to remove it. I've learned to roll with the punches. I haven't missed a day of work except for the surgery.\t\t\t", "date": "2012-09-17T17:02:30+00:00", "topic": "BCG Reaction", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t14 years ago I had mitomycin C instead of BCG. I remained cancer free for 10 years after that. I had BCG for my recurrences after that. The second time was hell... and it didn't work.\t\t\t", "date": "2012-09-17T17:02:30+00:00", "topic": "BCG Reaction", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI was generally miserable the day after BCG. I used pyridium & urelle to get through the burning and frequency.\t\t\t", "date": "2014-04-21T01:08:32+00:00", "topic": "Stage 1 non invasive or invasive? I'm confused.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThere are 2 non-invasive stages. Stage Ta has not invaded the lamina propria. Stage T1 has invaded the lamina propria, but not the muscularis. Both can be treated without cystectomy. However, for the best long-term outcome, it's desirable to get the bladder out before the cancer becomes invasive, so if you have multiple recurrences of high grade cancer in spite of treatment, even without invasion, it's best to get the sucker out. That's what I did, and I have no regrets.\t\t\t", "date": "2014-04-21T01:08:32+00:00", "topic": "Stage 1 non invasive or invasive? I'm confused.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI don't say any of this to scare you, but just to emphasize the need for follow up. Never become complacent. As others have alluded to, grade (how cancerous) and stage (how invasive) is very important. Many people have recurrences of low grade tumors. They are a nuisance and just have to be removed to be treated... But they must be taken seriously, because low grade cancers can recur as higher grade cancers, and low grade cancers can invade. The key to long survival is to try to treat before the disease becomes invasive.\nI had high grade, noninvasive cancer, but after my first treatment remained cancer free for 10 years. Then I had 2 recurrences of CIS in 2 years and just a few months after my last treatment a recurrence of high grade tumors with invasion of the lamina propria but not the muscularis. I knew it was time to get my bladder out. It's been 13 years, and they haven't been easy for a variety of reasons, but I'm here, working full time and enjoying my family.\t\t\t", "date": "2014-05-15T16:17:37+00:00", "topic": "2 new tumours found", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHaving been through years of pain due to a urethral stricture caused by the initial treatment of my bladder cancer, and having been through cystitis caused by BCG treatments and all kinds of other grief caused by my bladder cancer, my stricture, and the treatments, I have to say, that I don't think one can easily tell urethral pain from bladder pain. And now that I've ended up having a radical cystectomy, all that pain is one of the things I do not miss.\t\t\t", "date": "2014-03-16T16:34:27+00:00", "topic": "Urethral Pain w / Bladder cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThere are no guarantees, but BCG has an excellent track record. Since the only real alternative when it fails is radical cystectomy, it makes sense to give it a try. That being said, after my second recurrence of CIS, we tried BCG + Interferon which was immediately followed by recurrence of high grade tumors. I opted for the radical cystectomy and I don't miss my bladder 1 bit.\t\t\t", "date": "2014-04-21T01:11:01+00:00", "topic": "I hate to always be a negative nancy...BUT...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust a quick follow up! I think I'm doing great. Can't wait to get my suprapubic tube and drain out so I can shower, but I have found a way to wash my hair over the tub with a handheld shower and the rest of me by wash cloth. Gotten the morning routine of bathing, changing to leg bags, changing dressings, emptying the drain, and flushing the catheters down to 1.5 hours and it no longer exhausts me. Believe it or not, the Foley in the neobladder as compared to the native bladder is barely noticible.\nWarren\t\t\t", "date": "2013-01-27T19:00:24+00:00", "topic": "I'm back", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had Mitomycin C for high grade tumors and CIS 11½ years ago and remained cancer-free for 10 years. My urologist did injure my urethra during one instillation resulting in urethritis with each treatment and ultimately a nasty stricture, but if that hadn't happened, I would have considered my Mitomycin C treatment uneventful. I had a recurrence of CIS 1 year ago and was treated with BCG. I did well for 5 treatments and then had a reaction to the 6th... and now, a year later, I have another recurrence of CIS and have to figure out what's next.\nWe each respond differently to treatment.\nBTW, nobody ever told me to do anything with baking soda or to not drink after the mitomycin C.\n-Warren\t\t\t", "date": "2012-04-20T01:24:40+00:00", "topic": "Mitomyicin Question.   Having a problem", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t<strong>Lessie1953 wrote:</strong>I work full time and have basically used up my sick time with the Turbt and other issues not related to BC. I will need to schedule a biopsy Cystoscopy in the hospital after BCG is done as well. What do others do about work?I only missed work the day after my 6th (last) BCG, and that was only because I didn't feel I could handle the train trip in. My first 5 BCG's didn't cause much reaction, especially considering how many years I've been going to work with bladder symptoms anyway.\nAs far as the TURBT or biopsies, there's no avoiding missing work. You gotta do what you gotta do. Follow up is very important. I enjoyed 10 years cancer-free and then had a recurrence of CIS, and a year later a second recurrence. As I plan my next step, figuring out how to deal with being out of work for a long time if I'm advised to have a radical cystectomy will certainly be a major headache, but I'll still do whatever I have to do.\t\t\t", "date": "2012-05-02T01:40:19+00:00", "topic": "Changed urologists and changed my experience of BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had a standard 6 week course of BCG. No maintenance. It was never suggested. But based on my reaction to the last BCG, I'm not sure I could have tolerated it. Treatment can sometimes be such torture cystectomy begins to seem a pleasant option.\t\t\t", "date": "2012-05-01T04:05:29+00:00", "topic": "Recurrence of CIS. Treatment options", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJust to clarify: the follow up biopsies after BCG were negative. To the best of my knowledge I have not had CIS for a year. Erythema in my bladder has been an ongoing issue for 11+ years, so while I didn't think biopsy every quarter was necessary, I requested that we do biopsies if the erythema persisted 1 year.\t\t\t", "date": "2012-05-01T04:05:29+00:00", "topic": "Recurrence of CIS. Treatment options", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt's been said many times on this forum, once you have BLC you need to commit to a lifetime of surveillance. I hope your husband does well. The mitomycin c gave me 10 years.\t\t\t", "date": "2011-01-10T22:51:47+00:00", "topic": "After 10 years it\\'s CIS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\npemquid wrote:Warren--\nYou're such a \"veteran\" to me on the board, that it seems strange to be \"ahead\" of you on this!I guess it does seem strange, but my original treatment was with Mitomycin C, not BCG, and this is my only recurrence in 10 years, so I never had BCG.\t\t\t", "date": "2011-01-10T22:51:47+00:00", "topic": "After 10 years it\\'s CIS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs usual, Pat is right on. A positive PPD without signs of active tuberculosis (no symptoms [night seats, weight loss, cough] and negative chest x-ray) is latent TB. The treatment with isoniazid (INH) for 6-9 months is aimed at preventing reactivation TB later in life.\nTo the best of my knowledge BCG does not increase the risk of developing reactivation TB. In fact, BCG is used as an immunzation against TB in areas outside the US where TB is more prevalent.\nIn addition, I don't think the PPD would be a reliable way to decide if the BCG is causing a problem, since the decision must be made on the basis of symptoms. A negative PPD would not be adequate to decide that the BCG wasn't causing a problem if one was suspected.\nEven though you need your urologist for his expertise treating the cancer, you need him to consult with an infectious disease specialist, who you should consult with as well. Then your concerns will be accurately addressed and an appropriate TEAM will be making the decisions. Don't forget, you're a member of that TEAM, so you need accurate information to make your decisions\t\t\t", "date": "2010-02-11T18:57:40+00:00", "topic": "BCG - Been exposed to Tuberculosis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYou're working too hard, Pat. Thanks for the info.\t\t\t", "date": "2010-01-24T15:10:17+00:00", "topic": "Stricture Redux", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nPatricia wrote:Warren..check out Allegro's price of $2.58 for Mentor Coude..they'll also send you free samples.\nPatThanks Pat. Unfortunately for me, most people who self cath aren't trying to keep strictures open. They don't appear to have 18 fr. Looking on the web is a great idea. Since I'll have time before I need to reorder I'll check it out.\t\t\t", "date": "2010-01-24T15:10:17+00:00", "topic": "Stricture Redux", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\npemquid wrote:Since my husband is on coumadin, and had been doing some fairly vigorous activity a day or so before (dragging and burning brush, inclding some fairly large trees)we're hoping his bleeding is related to that.Coumadin can certainly contribute to bleeding from benign causes.\t\t\t", "date": "2009-12-30T13:23:58+00:00", "topic": "bladder polyps?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm on my way to feeling better, but it's been a long haul. I've been back to work. Actually I had gone back one week after the surgery with the catheter still in, but the infection knocked me on my ass, and I was out for the full 9 days of fever. I'm still fatigued. And I still have scrotal swelling and pain.\nI can't say they tested anything. I sent the culture myself. I'm sure my surgeon would have done it but that would have meant the inevitabe delay of first getting an appointment with him. And then it took 6 days to find out the correct antibiotic to use. I do have to wonder how this scenario would have played out for most of you guys who don't have the ability to send your own urine culture to your lab and follow up on the results yourself.\t\t\t", "date": "2009-10-16T22:31:54+00:00", "topic": "Urethral Stricture", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Pat,\nApparently every manipulation of the urinary tract carries some risk of infection which is why I wasn't on antibiotics for the whole time I was catheterized, but I was told to restart the Cipro before the catheter removal and VCUG. As to the source of the super Klebsiella, I don't know. I've been on Levaquin a few times in the past year, which could explain the resistance to Levaquin and Cipro, but otherwise I never take antibiotics so the resistance to penicillins, cephalosporins, and sulfonamides is a mystery to me.\t\t\t", "date": "2009-10-16T22:31:54+00:00", "topic": "Urethral Stricture", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDon't know many details David, but apparently Zack had a recurrence in the form of metastases and didn't respond to treatment.\t\t\t", "date": "2009-10-23T21:19:44+00:00", "topic": "had my ureterscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI haven't heard anything about Rosemary... and you know we lost Zack.\t\t\t", "date": "2009-10-23T21:19:44+00:00", "topic": "had my ureterscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI took the word \"discharge\" to imply that it was coming out of your penis when you weren't urinating. The implication is that the reaction is in your urethra, not your bladder. I have no experience with BCG sinc I was treated with mitomycin C. I did have a discharge with that, but it resulted from a reaction of the mitomycin C passing through a traumatized urethra due to a traumatic catheterization. I definitiely had pain with the discharge and I felt it when the catheter poked me on the way in, so I'm not saying your sitiuation is the same. Just be sure to keep your urologist posted regarding any progression of symptoms.\t\t\t", "date": "2009-08-13T18:32:19+00:00", "topic": "Re-occurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nbritt wrote:I had read about something called staticus asmaticus that really hit home and woriies me.  The Pulmanry Dr attending me this wekend hadnt heard of it.  Its scary the things we find on the internet while lookning for something else!\nbrittI don't know why the pulmonologist told you he hadn't heard of \"status asthmaticus.\" Anyone who has ever done a medical or pediatric residency has heard of it and treated it. I suspect your pulmonologist was trying to avoid a discussion or make light of it to get your mind off it.\nDon't make it more than it is. Status Asthmaticus is an asthma attack that doesn't break with the bronchodilator medicines used at home requiring emergency treatment and additional medications. As you already know from your own experience difficulty breathing can be serious, but even status asthmaticus is treatable. Don't look at the worst outcomes and think they must apply to you.\t\t\t", "date": "2009-07-13T23:53:17+00:00", "topic": "Sorry to be off topic again.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nMoonerj wrote:T1 =  Tumor invades subepithelial connective tissue\nHigh Grade =   Aggressive cancer\n\nJackTrue, but I had a high grade tumor (grade 3) and did quite well. I had no invasion of the lamina propria (Ta). There is a concern with T1 high grade that without removal of the bladder there will be progression and with progression a risk of late metastatic disease; however many are treated with BCG and if there are no recurrences, that might be sufficient.\t\t\t", "date": "2009-06-03T23:33:52+00:00", "topic": "Best Hospital", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Britt:\nIV sedation carries some risk of respiratory depression which might be an issue with COPD. What you really need is a consult with an anesthesiologist to discuss your anesthesia options. In addition, anyone doing a procedure on you needs to be prepared to treat any acute respiratory symptoms you have during the procedure regardless of the type of anesthesia you have. That is not an impossible taks, but takes some advanced planning. Your surgeon and anesthesiologist need to talk to your pulmonologist. This is one of those situations where the physicians involved need to remember they're treating patients, not isolated diseases or organs.\t\t\t", "date": "2009-03-15T05:08:30+00:00", "topic": "Urethral stricture decsion Part 2", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOne more thing Britt. I'm not sure what 22 mil is. 22 mm would be 2.2 cm which is almost an inch, which would be enormous for a urethra. Catheter sizes are measured in a different unit such as 22F. F stands for French. I don't know what the actual mm. size is. In any event, the flexible cystoscope is about 16F and would easily fit through a 22F opening.\t\t\t", "date": "2009-03-15T05:08:30+00:00", "topic": "Urethral stricture decsion Part 2", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBritt: Even for men who don't have prostate enlargement the most unpleasant part of the cystoscopy is when the scope goes through the prostate. With prostate enlargement, that part can be even more difficult. That does not mean you have a stricture Britt. A stricture is narrowing with scar tissue.\nIf you find the procedure too painful to be done with a flexible scope and adequate time for the numbing gel to work, then you need some kind of anesthesia. A TURB cannot be done through a flexible scope and definitely requires anesthesia. If you are too ill for general anesthesia perhaps you can  have it done with spinal anesthesia or an epidural. You would have to discuss that with an anesthesiologist.\nPat: I'm not sure if the technique used for dealing with a ureteral stricture can be applied to a urethral stricture. In any event, my urethral stricture has been dilated multiple times and opened 4 times by urethrotomy. After the last urethrotomy, examination showed it to be scarred back down within a month. Any further dilations or urethrotomies are not advisable. It is entirely possible that the increasing difficulty I'm havng wtih the stricture is due to the multiple dilations I've had to accomplish cystoscopies. The next step is a urethral reconstruction. The urologist believes the stricture is short enough to remove the scar tissue and do an end to end anastamosis. This will be done through a perineal incision. If the stricture is longer than it appears on the retrograde urethrogram, then it will require a graft using buccal mucosa.\t\t\t", "date": "2009-03-15T05:08:30+00:00", "topic": "Urethral stricture decsion Part 2", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI never had BCG. My uro preferred an 8 week course of Mitomycin C. I was TaG3 plus CIS. I have never had a recurrence in 8¾ years. I wish the same for everyone else. Perhaps you will have such a response.\t\t\t", "date": "2009-04-26T21:03:44+00:00", "topic": "mytomycin c for 6 weeks", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tEvery cancer begins as a single cell that grows and propagates. Therefore it is posible to have early metastases that are not detected on initial studies. Any person who has ever had successfully treated for any kind of cancer always carries a risk of recurrence and metastases, but if you have superficial (noninvasive) bladder cancer removed and are monitored for recurrence your chances of long term cancer free survival are very good. Without the surgery, things will definitely get worse.\nThe man who had surgery and then died from metastatic disease most likely had early microscopic metastases at the time of his original surgery. It is unlikely that the surgery contributed to his demise. In addition he would have likely reached the point of invasive and metastatic disease without the surgery if his cancer was not already that advanced.\n-Warren\t\t\t", "date": "2009-03-18T07:52:15+00:00", "topic": "Possibibility of spreading.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOther than local reaction (urinary symptoms) to Mitomycin C, which could have been just irritation from weekly catheterization, the only side effect I had was a rash on my hands, which my urologist told me to expect. And the late side effect of a urethral stricture, but that was due to a careless, traumatic catheterization during the Mitomycin C treatment.\nBTW, I had 8 weeks, not 6.\t\t\t", "date": "2009-02-20T19:12:11+00:00", "topic": "mytimycin c", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Jack & Melanie,\nOne person's experience does not constitute a scientific study, but I had a course of Mitomycin C for treatment instead of BCG. My urologist at the time said he had better results with Mitomycin C. Before agreeing to this course of action I discussed it with a urological oncologist I knew at Harvard, and he agreed that treatment with Mitomycin C was comparable to BCG. Now I know that BCG is the standard, and 8 years ago when I was diagnosed with TaG3 plus CIS things might have been different than they are today. I had 8 weekly instillations of Mitomycin C and 8 years later I've never had a recurrence. My only caution: beg your urologist to pass the catheter carefully. After one rough catheterization with Mitomycin C I developed urethritis, and thereafter had urethritis with each treatment resulting in a urethral stricture which continues to plague me even though I remain cancer free.\t\t\t", "date": "2009-01-16T02:50:40+00:00", "topic": "BCG- Complication", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nLeigh wrote:Wishing you many decent pee's with no pain and a wonderful wedding for your daughter.Thanks Leigh,\nI'll be trying to focus more on the wedding and less on the pee... if I can  .\t\t\t", "date": "2008-12-22T18:30:41+00:00", "topic": "Self Catheterization", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nPatricia wrote:I'm trying!!\nPatYes you are trying, and I appreciate it. I know others have had to deal with constant burning from BCG and the like. Don't know how they do it. I do go about my business - work, baking cookies for my daughter's wedding - but I'm getting a headache from always having my teeth clenched. It's been going on since right after Thanksgiving, and the attempted self catheterization probably set me back another two weeks. Like I say, it isn't the pain of catheterization I have a problem with. It's the stricture symptoms that just won't go away and seem to have been perpetuated by trying self catheterization.\nSomehow I missed your last answer even though it posted before my most recent update. You really try to help everyone, me included, so you deserve to feel appreciated. I'll try to stop being so cranky. I'm impatient, but the symptoms are finally starting to improve... and I have a plan of action. See my last post.\t\t\t", "date": "2008-12-22T18:30:41+00:00", "topic": "Self Catheterization", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nHappy New Year everyone!\n\nToday I visited my urologist for a cystoscopy to look at the stricture. We agreed in advance that he would not try to pass the stricture or dilate it. Urinalysis still shows 4+ blood which is consistent with the fact that I am still inflamed (= in pain). He said the stricture was back but not bad, although he said that it didn't look bad in March and when he tried to dilate it found that things were worse higher up since he couldn't even pass the smallest follower (dilator). In any event, my uroflow wasn't bad and I had no residual, which doesn't surprise me since I never have obstructive symptoms, just pain and bladder irritability.\nHe said he didn't see any inflammation (but I feel it, and if it's not inflamed, what's bleeding?!?) He offered to just pass the scope through the stricture but I suggested we not do anything at this time since\n\nI just had surgery 3 weeks ago, so why would opening things up traumatically last any longer or be any better\nI just self-catheterized 1½ weeks ago and the end result was enough swelling that I couldn't pass the catheter 2 days later\nI need a break from these symptoms. I've been hurting since just after Thanksgiving. Another procedure will mean at least 2 more weeks of healing. Even just looking up to the stricture has irritated me.\nMy daughter is getting married in 5½ weeks . I need to be feeling better then, and I need to work on baking cookies now!\n\nWe agreed that he would take another look after the wedding and if the stricture was not too tight for me to pass a 14 French catheter, I would try it in his office then, and see if self catheterization is still a viable option. If not, he will refer me to Dr. Noel Armenakas in Manhattan for urethral reconstruction surgery. Thankfully, Dr. Armenakas participates in my insurance since I have no out of network benefits.\t\t\t", "date": "2008-12-22T18:30:41+00:00", "topic": "Self Catheterization", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNow how did I miss that? ", "date": "2008-12-02T17:39:26+00:00", "topic": "Here we go again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAnd yet I feel like a whiner because nobody seems to have the degree of pain I have with the stricture or the persistence of pain and urinary symptoms after procedures. My urologist says I have a sensitive urinary tract. Lucky me. I would be OK with the discomfort of dilations and self catheterization if only I would have no symptoms afterwards (i.e., between procedures or after).\t\t\t", "date": "2008-12-02T17:39:26+00:00", "topic": "Here we go again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOh, BTW David, I got so caught up in my stricture response I forgot your question regarding Peyronie's. Thankfully I have been spared. The stricture has turned out to be more than enough to bear.... and yet I have to consider myself lucky since I remain cancer-free.\t\t\t", "date": "2008-12-02T17:39:26+00:00", "topic": "Here we go again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNo question that the stricture is a result of treatment. A traumatic catheterization during the mitomycin C treatment resulted in urethritis  with each subsequent treatment. The stricture became eveident 4 years later, and had to be dilated for each subsequent cystoscopy in order for the scope to pass. Since dilations tear (damage) tissue, with each procedure the stricture just got worse and worse.\nThe catheter's out now. I was supposed to remove it Monday morning, but by Sunday night had had all I could tolerate.  I didn't even sleep well with it since I was constantly waking feeling like I had to pee anyway. And I couldn't move without feeling it.\nToday I had to travel 2 hours to my wife's uncle's funeral. Another sad story. I really didn't know if I could handle the trip, but somehow made it. Perhaps the healing has begun.\nI hope self catheterization works as a method to keep the stricture open without resulting in my having constant urinary irritation.\t\t\t", "date": "2008-12-02T17:39:26+00:00", "topic": "Here we go again!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI often had red spots which turned out to be nothing, so if you must take a break, take it with a modicum of peace of mind, but for your own sake, don't choose to ignore them. If the red areas persist at some point you need to get them biopsied.\t\t\t", "date": "2008-12-11T16:03:14+00:00", "topic": "Just Venting", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI believe up to 64 means anything under 65. I haven't researched since I don't treat any 65 year olds, but, I know the DTaP for kids is approved up to 6 years and that means anyone under 7.\t\t\t", "date": "2008-11-22T18:15:49+00:00", "topic": "Does DPT vaccine hurt the immune system?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Rosemary,\nThere's no interaction listed with Celebrex, but that's a moot point since you're hoping to get rid of the Celebrex. As far as the side effects, neither the Celebrex nor any other treatment you can get is side effect free, so armed with the knowledge of the side effects, you can try the Cat's Claw and if you think you're having a problem with it, discontinue it. While your results wouldn't constitute a scientific study, I'm sure we'd all like to hear how you do, and wish you good luck with it.\t\t\t", "date": "2008-11-21T05:43:11+00:00", "topic": "Arthritic Effects?...You won\\'t Believe This", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Ro,\nPlease make sure there are no interactions with the Cat's Claw and any other medication you're taking. It may not be a \"drug\" but it does have potent effects and has side effects as well. If you need me to run a multicheck for you, you can send me a private message with other meds you're taking to check for interactions. According to my reference Cat's Claw should be avoided by anyone with autoimmune disorders, multiple sclerosis, pregnancy, rheumatoid arthritis, and systemic lupus. Note that it didn't say psoriatic arthritis or BCG induced arthritis, but you might want to discuss it with the doc treating your arthritis.\nSide effects include bleeding, diarrhea, dizziness, headache, low blood pressure, nausea, stomach discomfort, and vomiting. My reference does not provide any details about the frequency or severity of these reactions.\nI don't have anything against these types of non-pharmacological treatments. I just worry that folks might presume greater safety than they deserve just because they are not regulated medications. You may have done your due diligence of research before considering Cat's Claw, so I'm not implying otherwise. I'm just writing because I care, and because others will read your post and may conclude they should try it too.\t\t\t", "date": "2008-11-21T05:43:11+00:00", "topic": "Arthritic Effects?...You won\\'t Believe This", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDoctors sometimes use vague medically inaccurate descriptions to reassure patients, but in the end it leads to more confusion, so it drives me nuts. The bottom line is that if something was removed the biopsy result will tell you what it is. Make sure he discusses the biopsy results with your or your dad.\t\t\t", "date": "2008-11-09T18:02:30+00:00", "topic": "question about my dad\\'s  followup visit", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tInteresting research... but it didn't help me. As a guy who's been waking at least once a night for as long as I can remember and can never walk past a rest room without going in, just add it to the list of risk factors I didn't have.\t\t\t", "date": "2008-10-05T23:32:19+00:00", "topic": "Latest  Bladder Cancer News", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThere's no avoiding the fact that cancer is a life changing event. The only time I cried about it was when my daughter cried. But after 7¾ years without a recurrence, it remains a significant part of my life. Every bladder twinge is potentially a recurrence. And then there's the cystoscopies, which for me have just been moved to once a year - but since I have a urethral stricture from the treatment, I have to be dilated for cystoscopies, so that's always a grueling experience. And I had so much trouble with the stricture in the past 2 years that I'm not sure I'll make it another 6 months without needing a procedure.\nBut then, there's so much of life that isn't about my bladder, like my daughter getting married in February and my son getting married the following fall. And work, which I go to even if I have to go catheterized after a procedure. And cookies to bake for all the special occasions.\nAnd since I can't afford to retire for another 10 years, and I expect to have grandchildren to enjoy, I intend to keep chugging along for a lot more than those 10 years no matter what my bladder thinks.\t\t\t", "date": "2008-09-20T16:17:05+00:00", "topic": "I need input from you all", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYour faith in your doctor is a paramount part of your treatment. You will never feel like you've made the right decisions if you base them on advice from a physician you don't have faith in. I left the urologist  who \"cured\" my cancer (he was also a colleague and a friend), after being with him for 6 years post cancer and 8 years pre cancer because once he and I were no longer on the same wavelength about my management I began to look critically at other problems in my care and I realized that even though he did a great surgery he was not the doctor for me.\t\t\t", "date": "2008-08-20T21:08:27+00:00", "topic": "cannot go on right now", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFor many years the doctor-patient relationship was paternalistic. Doctors gave instructions and patients followed the treatment advice. The current generation of patient doesn't want to be told what to do so much as to make informed decisions. The older generation of doctors has to get used to laying all their cards out on the table.\nLow success rates make it difficult to endorse a treatment, but when it's the best treatment out there and the alternative is risking recurrence and progression... so the doctors have to get used to explaining all the risks, benefits, alternatives, and statistics, and some don't do a great job of full disclosure unless you ask questions.\nBut hiding something? What would be a physician's motivation to hide something? The medical profession's ultimate goal is to successfully treat patients. I can't see how hiding the truth from patients would accomplish that. And the suggestion that the medical community as a whole is hiding something smacks of some sinister conspiracy with an ulterior motive. I'm sure that's not really what you were thinking.\nAs for myself, I'm TaG3 plus CIS, 7¾ years cancer free without a recurrence. Was it my surgeon's skill, the Mitomycin C treatments, or just good luck? I don't know. And although I've had complications of the Mitomycin C (a urethral stricture) I would still opt for treatment if I had to make the choice over again.\t\t\t", "date": "2008-08-02T06:34:12+00:00", "topic": "Update on white patches", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhen I was first diagnosed TaG3 + CIS 7¾ years ago, I didn't know about this site, and I found all kinds of information on the net that frightened me - reliable information too, because as a physician I have access to medical web sites, but the information was dry and lacked perspective. I couldn't tell what applied to me. I decided I was better off not reading it.\nNow 7¾ years out with no recurrences after treatment of a high grade tumor, I am no longer frightened by reading stories from the invasive boards and metastatic boards, but take comfort in the knowledge that there is life and hope after recurrence and progression.\nMeanwhile, I hope that my good fortune gives others the hope that things can turn out reasonably well. Yes, I have some complications that will never let me forget that I had bladder cancer, but had is the operative word.\t\t\t", "date": "2008-07-28T16:47:50+00:00", "topic": "Posting concerns", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Rosemary,\nWell, pediatrics is very different. We see most illnesses the day they call... but then, I don't have a surgery schedule to deal with. I think it's true, as Zach said, that the doctor can't tell you much over the phone, but the truth is a lot of things that make patients anxious aren't emergent, and a call from the doctor could calm you enough to wait for an appointment if he says it's OK. I would ask your urologist how he wants it to be handled when you feel you need to talk to him.\t\t\t", "date": "2008-04-19T18:32:17+00:00", "topic": "What to do when you can't get through to the Doctor... ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nYou raised an issue with which I can identify, sara.anne. When I was in the hospital with very heavy hematuria just before being diagnosed, a physician \"doing\nrounds\" for my doctor saw that I'd said \"yes\" to a nurse who asked if I had\nanxiety. (I think I said that anxiety seemed reasonable in my situation.)\nHe asked \"Would you say, then, that anxiety is your major complaint?\" I was\nfurious and said something like \"No, doctor, it is the hemmorhaging that brought me here.\"We all have anxiety. It's not a female thing, and I think for all of us it played a role in the decision to seek medical help as such a decision is never purely intellectual.\nThis somehow reminds me of the high-school gym teacher who chided me that I was afraid to be on the high bar. I answered, \"No! I'm afraid of falling off.\"\nAfter 7 years I haven't failed to be anxious about every encounter with my urologist.\t\t\t", "date": "2008-04-02T20:46:24+00:00", "topic": "BCG Treatment Aborted", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHmmm... well you might read things on some fairly authoratative web sites that quote misinformation or even misunderstand the correct information, but any physician ought to know that BCG is a bacterium - in fact the B stands for Bacille which is French for Bacillus which is a specific form of bacterium. The mycobacteria of which tuberculosis is a family member is a fairly advanced bacterium, even demonstrating some branching growth structures similar to the fungi which are multicellular - very far from a virus which is an incomplete cell and can only grow inside another cell.\t\t\t", "date": "2008-03-29T23:03:23+00:00", "topic": "BCG follow-up", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWell, my \"clean\" cysto didn't quite work out...  the possibility of the \"scope\" not being as clean as it should have been...Dear Bill,\nAny instrumentation of the urinary tract carries with it the risk of a UTI. Not only must the scope be clean, but most urologists clean the head of the penis with betadine to be sure no germs will be introduced with the scope. Still, it happens... often enough that even though every precaution of cleanliness should be taken, a UTI doesn't imply improper cleanliness. ", "date": "2008-03-13T13:03:52+00:00", "topic": "SOME GOOD NEWS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWell, my \"clean\" cysto didn't quite work out...  the possibility of the \"scope\" not being as clean as it should have been...Dear Bill,\nAny instrumentation of the urinary tract carries with it the risk of a UTI. Not only must the scope be clean, but most urologists clean the head of the penis with betadine to be sure no germs will be introduced with the scope. Still, it happens... often enough that even though every precaution of cleanliness should be taken, a UTI doesn't imply proper cleanliness.\t\t\t", "date": "2008-03-13T13:03:52+00:00", "topic": "SOME GOOD NEWS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nDid you get an idea of what they did with the stricture and how long are they keeping the catheter in this time?\n\nKnowing you a little from your posts...you are probably back to work today  please just take it easy and have a lovely weekend...Yep, Back to work and walking very slowly.\nThe procedure involves making little cuts all the way around the stricture to open it up. The catheter stays in until Monday morning. The long-term plan is yet to be discussed. I don't think this procedure differs from previous procedures in terms of recurrence risk for the stricture, which is high  --- but it's not cancer.  ", "date": "2008-02-19T00:47:19+00:00", "topic": "Back on the Merry-Go-Round", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI have been trying to get my pathology report, first was told it had been send to my GP, he said my consultant had it as there was no connection between the proctice and the consultant.  My consultant has not contacted me since my several requests....\nso I am still waiting!!There isn't just the one copy of the report that you have to track down by figuring out who has it. Contact the pathology department of the hospital where the procedure was done and ask for a copy.\t\t\t", "date": "2008-02-19T15:58:59+00:00", "topic": "Really scared", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWarren,... do you think cystectomy is warranted in my situation (recurrences of TA papillar and CIS, failed BCG, but all non-invasive so far)?Dear David,\nI don't feel qualified to give you that opinion. I think your doctor is concerned that if you have many recurrences, you may become one of those who has a worse outcome by delaying cystectomy. But that's why you need a qualified second opinion - so that you're not pushed into something, and yet do what's best to keep you among us for a long time.\nBTW, how about an 8 week course of Mitomycin C if the BCG hasn't worked? I's not better than BCG, but it's different, and it appears to have worked for me.\t\t\t", "date": "2008-02-12T16:42:55+00:00", "topic": "FISH Test on urine specimen?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nThe other thing that confuses me a little (and forgive my ignorance, I had Mitomycin treatments but only in the hospital under anesthesia)is why the rotisserie????  Is that standard procedure with Mitomycin...?I had the 8 Mitiomycin C treatments instead of BCG. I was not told to play rotisserie... But then, who says that there was anything standard about my experience  .\t\t\t", "date": "2008-02-26T19:49:38+00:00", "topic": "My Eight Weeks of Mitomycin Therapy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI wonder if they are prescribing this treatment by rote alone.Well, we know it works, but I don't know if there are any conlusive studies comparing doses. An article in European Urology Volume 52, Issue 5, Pages 1300-1302 (November 2007) \"What is the Optimal BCG Dose in Non–Muscle-Invasive Bladder Cancer?\" at \nwww.europeanurology.com/article/PIIS0302283807007117/fulltext\n concludes \"apparently full-dose BCG is not necessary in all patients. Lower doses, usually one-third or one-half dose, is effective, although data in high-risk patients are not conclusive. For that, the results of EORTC study 30962 will hopefully give an answer. However, in all reports toxicity with lower doses is significantly decreased. So far the lower limit of low was not well defined, but this new CUETO study indicates that, although not statistically significant, one sixth of the full dose is less effective than one third of the full dose, and a further reduction in toxicity is not observed.\"\nI hope the link works as I got to it through several links. If not, Google \"BCG dose\"\n", "date": "2008-03-01T14:13:01+00:00", "topic": "BCG Dosage Question", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nIf it were you, and you had a second recurrence, and your doctor was a urologist, a board-certified surgeon, but not an oncologist, would you rather have your BCG/chemo treatments from an oncologist, or would you stay with the urologist?If you wanted another opinion, especially if there was an issue of other treatments such as oral or intravenous chemo, or radiation, you would consult an oncologist. Intravessicle treatment with either Mitomycin C or BCG is routinely done by urologists. There'd be no reason to go an oncologist just for these intravessicle treatments.\t\t\t", "date": "2008-02-15T21:49:14+00:00", "topic": "It's back....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had 8 weeks of Mitomycin C, and other than a rash on my hands did well, except one complication. My urologist poked too vigorously with the catheter one time. The catheterization was painful. Urinating the Mitiomycin out through the injured urethra resulted in urethritis, which recurred with every subsequent treatment. Since the urethritis developed only after the traumatic catheterization (the 4th or 5th one) I'm certain it was the cause. I've paid the price with a urethral stricutre which now continues to give me trouble. So urge your urologist to proceed gently.\n", "date": "2008-02-21T16:19:37+00:00", "topic": "Mitomycin-C Revisited", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI wonder if one year past BCG treatments would qualify as one year past \"chemo\".  I've heard tell that once you have BCG treatments, then you may possibly test positive for the TB virus for the rest of your life.Dear Rosemary,\nThe test (PPD) is an immunologic test. A positive PPD caused by tuberculosis does imply that the organism remains dormant and walled off in your body (usually the lungs, the site of entry). A positive PPD from BCG, however, shows an immune response to BCG and does not imply the presence of BCG remaining anywhere within the body. The stimulation of an immune response in the bladder is the intended response to BCG treatment. Infection is not the intended, expected, or desired result.\t\t\t", "date": "2008-02-12T00:03:38+00:00", "topic": "Can I still donate bone marrow?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nThe doctor found calculi in the prostate during the ultra sound and the histology demonstrated a condition known as granulomas prostatitis. The initial symptoms, increased urinary frequency, interrupted and weak stream were all present.Dear Jack and Melanie,\nCongratulations on passing yet another hurdle. Unfortunately, with any cancer there are always more hurdles, even if it's just the anxiety of the follow up. So onward Jack and Melanie and fellow travellers. It's always part of our lives, but it isn't our life, so time to celebrate the good news.\t\t\t", "date": "2008-02-09T18:38:54+00:00", "topic": "BCG And Granulomas Prostatitis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nMy imagination has me thinking about everything like Bladder removal & death.\nPlease help me copeWe've all been there. No matter how many peeks & pokes you have, there's always the worry they'll find something. But, we're all here because we've survived. The folks who've had their bladders removed can tell you how life goes on. But there's also a large contingent of us who share your anxiety because we haven't had to give up our bladders.\nYou're right. Follow ups are anxiety provoking and they're no fun at all  But the odds are in your favor. You had a low grade non-invasive tumor. There's no reason to think the worst. You can manage with whatever they find, but it'll probably be nothing or no worse than what you had.\nI haven't had a recurrence in 7 years and mine was high grade plus CIS. I'm rooting for you  8)\t\t\t", "date": "2008-01-07T21:22:14+00:00", "topic": "Nervous", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nno the second turb found no cancer in the muscle. The first lab that saw muscle invasive tumor was done with the specimen from the tumor of,my first turb. the conflicting report was done from a slide, could this fact effect the pathologists findings slide versis specimen? thank you sodacatPlain & Simple: We're all glad you got good results from your second TURB BUT you MUST have the slides of your first TURB reviewed by a competent, indpendent pathologist. There's too much confusion surrounding TWO TURBs. Untill you can be told unequivocally that the first TURB did not show muscle invasive disease the good results of the second TURB are irrelevant, even though it is good news. If the first TURB indeed shows muscle invasive disease, the current recommendation is to have your bladder out regardless of the results of the second TURB. Do not be distracted by the results of the second TURB. Pursue a review of the slides from the first TURB until you are 100% clear and confident regardng those findings. A first biopsy that shows muscle invasive disease (if it truly shows that by the interpretation of a competent pathologist) cannot be dismissed because of good results on a follow up TURB.\t\t\t", "date": "2008-01-31T18:45:39+00:00", "topic": " My Doctor gave us good news after a second Tur                 ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nOh, I took the PSA 1-1/2 hours after the cysto.Dear Jack,\nMy urologist always said not to do the PSA after the cystocopy as that would affect the results. The cystoscope has to pass through the prostate through the prostatic urethra to get into the bladder. That is, no doubt, the most difficult and uncomfortable part of the cystoscopy so it shouldn't come as a surprise that the PSA would be affected.\t\t\t", "date": "2008-02-02T18:59:13+00:00", "topic": "High PSA/Prostate Biopsy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nCan anyone shed some light on the \"folate intake\" mentioned- it seems from what has been quoted that if it is familial in your family, than an increased folate intake would be a good idea. Is this the same as folic acid? and what can it be found in naturally? Green leafy veg?Dear Anne,\nFolate and folic acid are the same thing. Check the information at\n\nohioline.osu.edu/hyg-fact/5000/5553.html\n and\n\ngrove.ufl.edu/~folic/info/folatesources.html\n\nfor more information.\t\t\t", "date": "2008-01-19T02:54:13+00:00", "topic": "Familial Bladder Cancer?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n'fluffy stuff' was ostreaginsaion of somethingDear Sally,\nSorry, I haven't a clue ???, but keep me posted.\t\t\t", "date": "2008-01-16T16:13:00+00:00", "topic": "Am I thick or just confused.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t    Well, there-in lies the problem. I have no idea what fluffy stuff is. That's why I hate it when my colleagues treat patients like idiots and give them simplified explanations that provide no real medical information. No other physician can possibly interpret that nonsense. You need to know exactly what the doctor found, what procedures he did to diagnose and treat, and what additional procedures need to be done to clarify the situation. Insist that your doctor use real medical terms, and have him write them down so you can look them up later, but have him explain them and their significance as well.\nAlso, I wasn't at all clear where the lump was - inside the bladder or out. If inside, was it biopsied? And was the fluffy stuff biopsied. If it wasn't because it's normal, it must still have an anatomical name. \"Fluffy stuff of child bearing women\" is not in my medical dictionary.\t\t\t", "date": "2008-01-16T16:13:00+00:00", "topic": "Am I thick or just confused.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDid they do biopsies? That's where you answer lies.\t\t\t", "date": "2008-01-16T16:13:00+00:00", "topic": "Am I thick or just confused.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI'm really afraid to take the Vesicare (though I am seriously considering at least giving it a try) because of the side effect of constipation.  I almost think that constipation would be a worse problem, (though I'm not really sure about that.)\n\nI'm with the rest of you.  I'm hypersensitive about going as soon as I feel the urge because of the worry that holding it may have been what caused the Bladder Cancer to begin with (?)Dear Rose,\nVoiding infrequently increases the risk of UTI because it allows bacteria that have entered the bladder to take a foothold rather than be washed out, but I have never heard that there is any reason ignoring an urge could cause bladder cancer, and it doesn't make sense to me as an hypothesis. Ignoring an urge doesn't make a great deal of sense either since there's no reason to be uncomfortable, but the point at which an urge becomes urgent does vary. Case example: when my urethral stricture was inflamed, it made my bladder irritable, but urinating caused so much pain and aggravated the situation so that I did learn to ignore the urge to a point.\nIt is possible that anxiety about the urge has you going the minute you have a bladder sensation. You might make an effort to retrain yourself, but focusing on it might make you have to go more. And frankly, unless the urge is there, it can't wake you from your sleep. On the other hand, if your sleep is disturbed for another reason, you might then find it hard to get back to sleep without going. The answer there is to deal with what's disturbing your sleep.\nThirst is another matter which is individual. Good bladder health demands adequate fluid intake, but you might be drinking more than you need by habit. If you drink more slowly, and your drink is good and cold, it may quench your thirst with less. It might also help to swish the first few sips around your mouth to wet the entire membrane.\nRegarding Vesicare: I've never taken it, but I've taken Detrol, and it definitiely constipates me. When I have to take it, I take Senokot prophylactically. That's probably not desirable for long-term management, but if you have to be on Vesicare long-term you might do well with a fiber supplement and a stool softener or Miralax and an occasional Senokot to move things along. The thing is that Vesicare is for overactive bladder - bladder spasms. If you gotta go because your bladder is full, an antispamotic is not the answer and won't eliminate the urge. Unless you are really not able to hold as much as you used to, the answer seems to be with producing less urine.\t\t\t", "date": "2008-01-08T11:59:29+00:00", "topic": "Quality of Life - Frequent Urination", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear LindaOz,\nI've had redness on cystoscopy many times. There is always a concern that redness could be CIS, so I have had several follow-up TURBs with biopsies which were, fortunately, negative. I have not been on BCG and my original treatment with Mitomycin C was almost 7 years ago, so it would not account for redness seen most recently. I have had only one UTI (urine infection) and that was shortly after removal of the cancer.\t\t\t", "date": "2008-01-05T14:02:43+00:00", "topic": "Redness on Cystoscopy?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Linda,\nSince it's a simple enough test, you should have a urine culture done to check for infection - and I mean CULTURE, not urinalysis. If you have an infection it would be best to start treatment for the infection before the cystoscopy. Regardless of the outcome of the culture, and even if your symptoms resolve, you must proceed with the cystocopy since you are overdue for it.\t\t\t", "date": "2008-01-05T05:14:20+00:00", "topic": "Newbie w/pain at END of urination.", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWarren,\n\nAll my doctors/medical personnel have told me that BCG is live attenuated tuberculosis cells. Have they given me a bum rap and am I telling people wrong???\n\nBuds and in appreciation,\nRosemaryDear Rosemary,\n&#160; &#160;&#160; How about, we're both right&#160; \n&#160; &#160;&#160; I never trust my own recollection of information when intelligent people question me, so I looked it up. Here's what it says in Wikipedia at \nen.wikipedia.org/wiki/Bacillus_Calmette-Gu%C3%A9rin\n.Bacille Calmette-Gu&#233;rin (BCG) is a vaccine against tuberculosis that is prepared from a strain of the attenuated (weakened) live bovine tuberculosis bacillus, Mycobacterium bovis, that has lost its virulence in humans by being specially cultured in an artificial medium for years.Human tuberculosis is caused by Mycobacterium tuberculosis which is a related but different organism than BCG's original organism.\t\t\t", "date": "2008-01-03T20:30:54+00:00", "topic": "BCG &amp;amp;amp; Tuberculosis", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\ni will also be haveing a course of mitomycine c\nthey have asked me to consider whether i would prefer myto first and then blue light or vice-versa\ni have untill tuesday to decide\nnot sure of the ramifications of this and would appreciate any helpBeing given the choice kind of implies that it doesn't make any difference, but the urologist should explain the significance of the choice if there is one, otherwise how can you make an informed decision?\nMitiomycin C might cause inflammation. Does the blue light distinguish easily between CIS and inflammation? Might too much inflammation make the exam harder to interpret?\nDoes the Mitomycin treatment eradicate CIS so effectively that doing the exam first would establish the diagnosis (which might be important prognostically), but doing it later would establish the absence of CIS but you wouldn't know if it was never there or cured?\nIf it really doesn't matter, your urologist should tell you and you can flip a coin or decide what would make you happier. If the choice makes a difference, you need to know what you're choosing - and if anybody here can tell you, that's great, but Hey! Doesn't your doctor have any responsibility to provide the info!?!\t\t\t", "date": "2007-10-24T22:03:58+00:00", "topic": false, "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nBladder wall thickning (I forget the exact location).  So he stated that he wants me on \"short cycle\", which means I have a cysto every 6 to 8 weeks - 12/17 is the now the next one.  ... Why the \"short cycle\" for Cystos, I am not sure I understood or was actually given a reasonI had thickeing of the bladder wall on my last CT urogram (current one pending). My understanding is that it could be seen with CIS, but my urologist didn't see anything on the cysto. Still, he ordered the CT urogram I just had and I'm scheduled for full cysto, retrograde urogram, and, I suppose biopsies on 12/6. Gotta try not to freak. I've been almost 7 years cancer-free with never a recurrence.\t\t\t", "date": "2007-11-01T19:42:08+00:00", "topic": "Cause to celebrate, I think.....", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear David,\nWishing you good results. And, as a hopeful word of encouragement, I had the Mitomycin treatment instead of BCG and did quite well with it.\t\t\t", "date": "2007-11-22T00:52:33+00:00", "topic": "Confused--Cysto found Papillary Tumors but Cyto Negative...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nInitial clinical and pathologic factors can be identified that predict a high risk of progression and are reasonable indicators for initial cystectomy.\n\nThey conclude that radical cystectomy can provide a very high cure rate for these patients and should be considered early in the treatment plan.Dan,\nIf these initial clinical and pathologic factors can aid in the decision, wouldn't it be great if we all knew what they were. 7 years ago when I was diagnosed with high grade papillary carcinoma + CIS, the matter of cystectomy was not even discussed. Of course, I was Ta and not T1, and maybe that makes a difference, but after 7 years without a recurrence, I'm not sorry the issue of cystectomy was never broached. Of course I still have the requisite follow up cystoscopies and the ansiety that one day something will be found, but it's not like everyone who has a cystectomy never has progression to ureteral involvement, kidney involvement, or metastasis. In the end, cancer never lets you forget.\t\t\t", "date": "2007-12-01T22:53:58+00:00", "topic": "Evaluate the role of initial cystectomy re:high-grade T1 blc", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWill be interested to know what the dr. thinks - and what he intends to do about it.\t\t\t", "date": "2007-12-01T22:46:25+00:00", "topic": "Frequent Urination", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nIn May 2006, I had my prostate ablated with laser surgery. Since that proceedure I have not had a moments peace. continual, and incessant urination. Sometimes 10-15 times a day. I seem to retain urine as the amounts expressed are between 4 and 8 ounces several times a day.Dear Jack,\nI'm not a big believer in coincidences. If your symptoms began after the ablation of your prostate, doesn't that suggest that a reaction to the treatment is the cause of your symptoms? What does your urologist say? and what has he offered as diagnostic evaluation and/or treatment?\n8 oz. That's 240 cc. I wish I could hold that much before I had to pee. If you're retaining urine, which would mean the ablation didn't have its desired effect, your baldder would fill up more quickly because it's never empty. Of course that would make you have to urinate more frequently. Has your urologist done a uroflow to check for obstruction or an ultrasound to check for residual urine in the bladder after urination? Has he addressed the issue of urinary retention?\t\t\t", "date": "2007-12-01T22:46:25+00:00", "topic": "Frequent Urination", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWell Jack,\nI don't know about upgrading from TaG3 which is what I had with CIS because I've never had a recurrence. It's almost 7 years. So how about that as a possibility?!? Upgrading isn't inevitable, especially if recurrence isn't inevitable.\t\t\t", "date": "2007-11-20T21:43:42+00:00", "topic": "Up Grading", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nHe also plans to use Mytomycin-C instead of BCG this time because of the very severe reaction last time around.Wish I could promise you something good David, but for what it's worth, I never had BCG. My urologist liked Mitomycin C better, and I haven't had a recurrence. Hope you get the same result.\t\t\t", "date": "2007-11-17T14:16:41+00:00", "topic": "A &amp;amp;quot;bump in the road&amp;amp;quot; -- problems near left Ureter, some papillary tumors...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nThe only interepretation that I can glean from this, is that IF your cancer progresses to the point of RC and you've had IVT (Intravesical Therapy) then the rate of survivorship goes down....\n\nAny discussion on this?\nRosemary\n\n\"BJU Int. 2007 Jul;100(1):33-6.\nThe increasing use of intravesical therapies for stage T1 bladder cancer coincides with decreasing survival after cystectomy.A relationship may not imply cause and effect. One possible explanation is that IVT decreases the rate of early RC so that some patients who would have done better with RC delay RC until after their disease has spread. This may relate to understaging since IVT is intended for superficial disease and understaged patients won't find out they've been understaged initially until a recurrence shows invasion, a node or metastasis shows up, or the staging is changed at RC.\nIf this is the explanation, it isn't the IVT which decreases survival, but rather the delay in RC which treatment with IVT makes possible.\t\t\t", "date": "2007-11-15T02:40:04+00:00", "topic": "IVT Therapy &amp;amp;amp; Decreasing Survival after RC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDear Fluke Lady,\nAs far back as I can remember I've always had to know where the restroom was wherever we went. It's a family joke. For just about every place we went on vacation my photo album has a picture of me and my twin standing in front of the men's room. Sleeping through the night? ... I can't remember the last time. And all this began long before I ever had a TURB or bladder CA.\t\t\t", "date": "2007-10-16T20:43:34+00:00", "topic": "Frequent urination after G1 PTA removal", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nMy wife of 13 years divorced me and left me alone with my 5 year old son and 7 year old daughter within 6 months of my T1G3 diagnosis.She not only left you. She left the kids. That has to tell you something about where her head was at with regard to putting any effort into life. You were probably the caretaker in the relationship.\t\t\t", "date": "2007-10-17T10:12:56+00:00", "topic": "Lost Relationship due to Cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nThe delayed images show that the bladder is decompressed.  It would be difficult to exclude any mucosal neoplasm in an undistended bladder.  The remainder of the study is otherwise unremarkable.\nImpression:  Nondistended Bladder throughout the study.  Otherwise unremarkable study.Dear Rosemary,\nWhat they're saying is that even after the IV contrast your bladder did not fill, so they could not fully assess whether or not there were any growths in the bladder. When the bladder is distended and filled with contrast, a tumor shows up as a filling defect in the dye. Since your bladder hadn't filled, they couldn't make a judgment, but that doesn't mean they didn't look, and it doesn't mean they found anything wrong. Fortunately, what they couldn't see on the CT is what your urologist CAN see when he does a cystocopy.\t\t\t", "date": "2007-10-26T01:36:10+00:00", "topic": "CT Scan Results - Decompressed Bladder?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI know that there are people on this board who do not like me to talk about my ongoing problems stemming from my conventional cancer treatments (BCG's), but, sometimes, I just need my turn....pleaseWe don't want you to have problems to talk about... but when you do, you have as much right to qvetch as anyone else, and a right to a sympathetic ear. So don't go keeping your troubles to yourself to protect anyone else here because the answers you get when you complain can help someone else just like you help everyone.\t\t\t", "date": "2007-10-18T17:24:53+00:00", "topic": "Thoughts on natural remedies", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTim's story is good because it shows you that even if things go from bad to worse, there is life and good health after bladder cancer. But some of us are even luckier than Tim. I've had my complications, but I was TaG3 at initial presentation and I've never had a recurrence in almost 7 years. There's room for hope, but it can't be head in the sand, make it go away hope. The possibility of a recurrence is still part of my life, and I go for regular follow ups.\nBTW, I also never smoked and was fairly young (52) at diagnosis.\t\t\t", "date": "2007-10-18T18:28:04+00:00", "topic": "Wanted - Mentor for newbie to BC!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nBut, as my very kind Dr. told me, \"Be prepared\"  because he was sure it would come back.And that's being realistic... but it's OK to hope. I've never had a recurrence in 6¾ years.\t\t\t", "date": "2007-10-02T19:02:08+00:00", "topic": "BCG maintenance treatments", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\nI am sure that he is no longer having any side effects since his last TURBT (4 weeks and 4 days ago).  Something else is wrong and going on in his abdomen.  He has a constant feeling of pressure in his pelvic area and it hurts in his lower abdomen when he sits.\nHe has never had any of these symptoms before.  Any input?Dear Bubbles,\nI'm not sure if this is the answer, but check out the information on pelvic pain at \nwww.pelvicpainhelp.com/\n. My urologist suggested it to me as the cause of my pain with my urethral stricture. While he was wrong (my opinion since the pain went away when the blood in the urine went away), I could see how my response to the pain I was having aggravated the pain further. It's hard not to tighten pelvic muscles in response to pelvic pain... but if you do, it makes the symptoms worse.\t\t\t", "date": "2007-09-15T22:25:56+00:00", "topic": "One Year Later", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI'm wondering how cystos are billed by different urologists in the U.S.  When I go for my annual check up -- a five minute look inside my bladder -- I get a bill for a \"surgery.\"  I end up paying about $350.  I have Blue Cross/Blue Shield insurance. I recall back when I had another insurance co., I only paid the office co-payment. Is it just me, or does this sound like I'm being gouged by somebody?  I called to complain to my doctor's billing dept., and they told me to talk to my insurance company.  I called my insurance company, and they told me to call the provider.\n\nHas anyone else disputed a bill that they thought was exorbitant, or not coded correctly.  Has anyone been successful?\n\nGod help you in the good old US of A if you're not rich and have a serious illness.Dear Connie,\nYou need more than a bill. You need the EOB (explanation of benefits) that your provider received from your insurance company. It shows what they charged, what the allowable charges are, what they were paid, and the disposition of any unpaid charges. The EOB might even show that according to the doctors' contract, they are not allowed to balance bill you, in which case you are entitiled to a full refund. If you were charged a deductible, or a service was rejected, there will be an explanation. All of this will help you figure out if there was a correctable error which can eliminate the charge to you. The doctor's office should be able to provide you with a copy of the EOB, but so should your insurance company. Many insurance companies send statements as a matter of course, but since they are not bills, many patients just dispose of them rather than trying to figure them out.\t\t\t", "date": "2007-09-15T21:56:35+00:00", "topic": "Cost of cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nBasically for the past 3 months my urine patters have changed. I've been having these strange symptoms which are driving me nuts. It all started off with frequence urination. My GP sent me to a nephrologist who did blood work and an ultrasound. The blood work showed I had a UTI and the scan was negative. He gave me medication and sent me off. My symptoms never stopped and I tested positive again for a UTI.\nNow I've been sent to a urologist who has me scheduled for another ultrasound and my tests were negative.\nBasically I have severe pain and difficulty urinating in the morning. I have lower abdominal bloating and pain. It seems like my bladder is never empty. The strangest symptom of all is that I DO NOT HAVE URINARY URGENCY. I can go HOURS without feeling the need to pee and when I do every little comes out.\nCould I have bladder cancer eventhough the ultrasound and urine\\blood tests were negative? I am 19.Hey John,\n&#160; &#160; &#160;  There are so many things that can cause urinary symptoms, and at 19, bladder cancer is a highly unlikley possibility. But I do find some things confusing in your story.\n\nFirst, a UTI cannot be diagnosed or ruled out by a blood test or dipstick urinalysis. The only reliable test to diagnose or rule out UTI is a urine culture. A culture is especially important with persistent symptoms because the organism and its sensitivity to antibiotics can be determined to help determine the best choice of antibiotics. If symptoms persist on antibiotics a culture tells you if there's a need to change. If symtpoms recur, a culture tells you if it's the same organism. A negative culture tells the doctor if the treatment worked. A blood test would be the least reliable way to diagnose UTI because bladder infections rarely affect the blood work, and abnormal blood work doesn't tell you where an infection is. Kidney infections are more likely to affect the blood work, but generally cause fever and flank pain.\nSecond, healthy 19 year old men don't get UTIs. Well, I'll never say never - but if any young male patient of mine truly had a UTI, I would feel it absolutely essential to do a thorough evaluation of his urinary tract to find out why. An ultrasound is a fine start. In fact, an ultrasound is an excellent way to find out if you do fully empty your bladder. Was that checked? If these symptoms don't clear up, and if you really are having recurrent infection you probably should have a voiding cystourethrogram (VCUG) to make sure you don't have bladder reflux into your kidneys (although such problems usually show up as UTIs in infancy) and maybe even a cystoscopy to look at the bladder.\nIf this is not really infection related, there are lots of other tests a urologist can do to evaluate voiding problems to see if they can find a cause... and I'm not talking about serious things for you to worry about. I'm talking about finding answers to help you.\nThird, I have to ask (and you need not feel obligated to answer except to yourself), Any possibility you could have an STD? Have you been checked?\nFourth, I have to ask about your bowel habits (and again, I'm asking for you benefit. You don't have to answer). The bladder sits against the rectum. Since you mention lower abdominal pain and bloating, maybe there's a connection. I've had a few little boys evaluated by the pediatric urologist for things like penile pain and voiding problems who turned out to have constipation as the cause for their symptoms.\n\nLet me just say that cancer is the most frightening possibility, so I understand why you're concerned about it, and you're wise not to ignore the possibility even though it is most unlikley. But UTI is also an unlikley possibility unless it is proven to be the diagnosis by culture - and it really drive me nuts when my colleagues jump on the easy diagnosis when it doesn't make sense. Forgive my rant if you were correctly diagnosed with UTI and I somehow missed it. The bottom line is that you need your doctor or urologist to be willing to spend the time with you and sort this out rather than doing a quick test and sending you on your way with a prescription. You deserve an answer and hopefully a solution even if the problem isn't something serious like cancer.\t\t\t", "date": "2007-09-20T08:28:55+00:00", "topic": "Really scared...Need advice badly...please help", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nall one needs to do is check out the metastatic area to find dilligent patients and not so dilligent uro's who felt the naked eye was all they needed to access the grade of tumor/tumors.I can't help but be amused. I well remember my uro finding the origianl cancer at the in office cystoscopy and muttering \"It's not more than a grade 1 or 2.\" I had no idea he was talking about cancer. Fortunately, he was diligent, even though we've had a parting of the ways over his management (or the lack thereof) of my stricture. Although, when I had the slides reviewed at Harvard, even though they concurred about the grade 3, they had concerns that there was too much fulguration to reliably say the lamina propria was not invaded. If I knew then what I've learned from this forum 6½ years later, I would have insisted on more thorough evaluation. Well any way, I got lucky I guess.\t\t\t", "date": "2007-09-11T12:14:47+00:00", "topic": "Let's talk turkey", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI have had burning symptoms upon urination for about 2 weeks.  It burns way down at the bottom and tingles as urine fills up and it is an uncomfortable feeling.  It feels like cystitis.\n\nI have an idea that it is related to a recurring yeast infection that seems to be thriving in every warm place inside and outside of my body.\n\nThere are so many things that these problems COULD BE.  And I am so very tired of doctors (and dentists, too) that I almost just want to say, \"Let it Be.\"  Because I have been checked and rechecked and then checked again, and no one can tell me what is really wrong.\n\nSo, after about the 3rd opinion, I've decided to just live with my symptoms and just hope that it isn't metastatic cancer.\n\nSorry, Ya'll, I guess I've had a rough dayDear Rosemary,\nAfter all the help you've given folks on this forum, you're entitled to complain a little and get at least a sympathetic ear, if not a little help.\nYou didn't say what diagnostic evaluations you had, and I know you know your stuff, but... have you seen your gynecologist? Vaginitis can mimic cystitis as you probably know since you've been treated for yeast infections. I know of a situation where a patient was treated frequently with metrogel for bacterial vaginosis and various yeast treatments with no relief. She went to a new Gyno who treated her with ¿boric acid? (not sure if that was what she was treated with) to change the pH, and she had a miraculous cure. Antibiotics had really messed things up.\nNow we all have bad days. I know that I've had more than a few during the two times my stricture acted up giving me pain and urinary symptoms for a month each time, but why think of METASTATIC cancer. If anything it should be local, and you have had the appropriate urological follow up for that. And frankly, I've had more painful and annoying symptoms from my treatment and it's complications than I ever did from the cancer.\nKeep the faith, and don't give up on your doctors even when they're not coming up with answers. Unfortunately you still need to be vigilant about follow up on the original cancer.\t\t\t", "date": "2007-08-20T08:44:41+00:00", "topic": "Any ideas what to do next", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nsometimes realizing that I must follow up on every detail regarding both my Mom's and my Dad's healthcare becomes overwhelming.Dear Nean,\n&#160; &#160;  Even when the doctor is conscientious, we have to remember that he/she has many patients to be concerned about, and we have just our loved ones about whom we remember the smallest details. I always appreciate it when patients remind me to take care of things because sometimes something gets moved to the back burner for more pressing problems, and then I might forget. And then, in some offices it's up to staff who may be overwhelmed and not appreciate the significance of some delays. And unfortunately, some physicians simply aren't conscientious.\n&#160; &#160;  When my mother had leukemia, I had to keep after the doctor's office constantly for every detail. My mother loved her oncologist, but my sister was ready to string the doctor up from the nearest tree. I tried to mediate and keep things moving smoothly because as a physician I could understand how things sometimes go awry, but after that experience I wondered how any patients manage without somebody advocating for them.\t\t\t", "date": "2007-08-01T15:04:59+00:00", "topic": "New to forum: Urologist wants to start Maintenance BCG with my Dad ...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nNot only that, but the doctor STILL did not have the pathology report from my Dad's TURB in July.How could he not have the patholgy report from July?  :o  That means his office has to call the pathologist to get the results because he should have it, and perhaps it got lost in the mail or misplaced. Insist that the urologist's office call for the results NOW, or give you the name and phone for the lab it went to so that you can get the results yourself.\nWe occasionally don't get lab reports on some of our patients. If we don't follow up on missing reports, they would remain missing forever.\t\t\t", "date": "2007-08-01T15:04:59+00:00", "topic": "New to forum: Urologist wants to start Maintenance BCG with my Dad ...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWhat I didn't expect was to be made fun of.   I'm not looking for causes of BC, those are pretty clear to me.Whoa! You made me look back at my response and some of the others. You can't tell, when looking at the written word, the expression on the writer's face. I'm not sure why you would have felt made fun of, so if my response contributed to that feeling, I sincerely apologize. I haven't been a member of this forum that long, but from what I've seen you are free to speak your mind, and all the responses are intended to give support. So, I'm very sorry if we didn't come across that way.\t\t\t", "date": "2007-08-14T21:34:55+00:00", "topic": "Swimming Pools and BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nA cysto with an inflamed bladder is definitely an experienceDavid,\nI feel for you, and with you... literally. I just had my cysto and urethral stricture dilation with an inflamed urethral stricture. And he sent me home catheterized for 3 days. I couldn't get in and out of chairs without yanking my chain (if you know what I mean  ) So I spent the next 3 days standing all day seeing patients and walking slowly between patients. Thank God no little kid kicked me or anything. I couldn't wait to get the catheter out. It felt so good for almost ½ hour until the dysuria, frequency, and continuous burning pain returned. No real help from Urised or Pyridium, since he said my bladder's not inflamed. I guess I shouldn't complain since I'm still cancer free. But it hurts  :'(\t\t\t", "date": "2007-08-09T20:55:51+00:00", "topic": "Inflamation of bladder following BCG", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWarren...where does your identical twin brother live?  This is interesting and should probably be studied.....you might be right about Long Island!..PatWe grew up in the Bronx until we were 11 when the Cross Bronx Expressway came through 1 block from our house. Then we moved upstate to Rockland County. After college our lives shifted around a bit, but my twin ended up back in Rockland and I ended up in Long Island. Just in case you're seriously considering the oncologic potential of living in Long Island and haven't read my story on the story board, 10 months before my bladder cancer, I had a Leydig cell tumor of the testis -very rare. They sent it to the army pathologists for a second opinion and the conclusion was that it probably wasn't malignant.\t\t\t", "date": "2006-08-13T22:20:35+00:00", "topic": "Best Water?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOops. Looks like I've replied to this one before. Oh well, at least I'm consistent in what I said.\t\t\t", "date": "2006-08-13T22:20:35+00:00", "topic": "Best Water?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWinndixie you said: ...I'm told smoking is a cause for all cancers. I think it's just mix of genes & fate!\nI agree but want to add the word stress.  Mix of genes, fate and stress.  RosieWell, I hope it's not genes, because in the 6¾ years since my big C event my identical twin has been spared. And in my life I've had ½ cigarette, 2 puffs of a cigar, and pot twice 37 years ago. Now stress, I've had plenty, but if that was the cause of cancer, every organ in my body would be taken over by now. I suspect living in Long Island, NY is what did it for me.\t\t\t", "date": "2006-08-13T22:20:35+00:00", "topic": "Best Water?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nWhat's the difference between a TUR and a cysto with fulguration?If I remember correctly, TURB stands for TransUrethral Resection & Biopsy... which is, of course, done through a cystoscope. If the tumor is fulgurated (burned) to remove it, there is nothing left to biopsy; however, if the electrocautery is used to remove the tumor and at the same time fulgurate the tissue underneath to stop bleeding, than a cysto with fulguration would be one method to do a TURB.\t\t\t", "date": "2007-07-25T23:06:18+00:00", "topic": "Nervous Dad!", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nthere seems a high-ish incidence of people on the site who have had cystectomies only to discover that their post-cystectomy prostate pathology reveals a malignancy in the prostate. see the thread in the mens section on post-cystectomy prostate pathology...I once had a urologic oncologist tell me that the vast majority of older men will have some low-grade prostate malignancy found if they have biopsies. The older you get , the more likely it is to happen, so it isn't a big surpirse if prostates removed at cystectomy show unexpected prostate cancer, especially if the men are older as the incidence increases with advancing age.\nThat's a different issue than the question of whether or not the treatment for prostate cancer increases the incidence of bladder cancer.\t\t\t", "date": "2007-07-16T19:36:33+00:00", "topic": "Bladder Cancer and Prostate Cancer - Any correlation?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI know there is some disagreement about Mytomicin, and I read that Rosemary's uro said someone died from it (which I am guessing is very rare).  Are there other side effects that my mom should know about?  According to my mom, the uro made it sound as if it was no big deal, but I am wondering why some docs don't use it.Dear Kim,\nI'm no expert on mitomycin, but I did have 8 treatments with it. 6½ years ago it was not standard practice to instill anything after the TURB, so my treatments started a month later. I did develop a rash on my hands, which I was told to expect. I also, unfortunately, developed urethritis and ended up with a urethral stricture, but I think trauma from a careless catheterization along with the mitomycin caused that. It certainly didn't kill me  ", "date": "2007-07-13T02:11:58+00:00", "topic": "1st follow up scope", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nIf he has been free of cancer for >5 years and this is the only enduring problem and he is not seeing progress these conservative measures then it would make sense to go with the surgeryDear Wendy:\nThanks so much for your input, and your effort to get information. I could tolerate the dilations for every cystoscopy and can't say I ever had major symptoms from the stricture until the episode in December when everything got so inflamed I was in pain for a month. It's not that I'm anxious to have a procedure done. I'm willing to wait and see if the stricture can still be managed conservatively. But I can't have a urologist who thinks what I went through was not related to the stricture and treats the whole incident as if it was inconsequential as long as I'm cancer-free. When you consider the role inflammation plays in cancer development and the inflamed hemorrhagic appearance of my bladder when the covering urologist opened the stricture at an operative cystoscopy, I hope I'm lucky enough to remain cancer-free. Anyway, we'll see what the new urologist says. I have an appointment on July 11. He's young, but was recommended by a urological oncologist I've been in touch with from Harvard. I figure 20 years from now, when I'm old (I'll be 59 tomorrow, July 1)and need a really good urologist, he'll be experienced and still active in practice  ;D\n-Warren\t\t\t", "date": "2007-06-14T04:11:22+00:00", "topic": "Urethral Stricture", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi Wendy,\nThere are treatment options, each with it's own morbidity and complications. Periodic dilation remains an option since my stricture is short. Opening surgically is an option which I've had twice at operative cystoscopy. Laser is another option which has also failed me. A stent can be placed... migration of the stent is a possible complication. An open repair can be done (Ouch! with prolonged catheterization and all). I will explore my options with my new urologist. But I sure would love to hear from anyone who has a stricture about what symtoms they've had, especially since my urologist basically shrugged off the stricture as being a significant concern. And I can't believe him, which is why I have to go to a new urologist.\t\t\t", "date": "2007-06-14T04:11:22+00:00", "topic": "Urethral Stricture", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBoy, I've learned a lot reading the posts in this section! Checked out the article you've mentioned. I was never told my staging, but based on the lack of invasion of the lamina propria, conclude it was Ta. Maybe grading has changed since I had my cancer, but my biopsy reads Grade 3 out of 4, high grade. There was only 1 focus of CIS, and review of the slides at Harvard didn't find any CIS, but that could be sampling error. I never knew the size of the tumors, but I had 4 of them. According to what I've read, it sounds like I was at serious risk, but here I am 6½ years later dealing with the complications of treatment and never having had a recurrence. Guess I should be happy to have a urethral stricture. could have been a lot worse.\t\t\t", "date": "2007-04-02T22:39:37+00:00", "topic": "Superficial BC vs. Metastatic BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIf you had a clinical response to Cipro, that almost proves that you had an infection. A urine culture to determine the organism with a plan for treatment seems like a good idea to me.\nAs far as constant urination, I had that reaction to just about every procedure. Detrol did a great job of controllng the bladder spasms. You'd need to talk to your doctor since it's a prescription medicine.\n-Warren\t\t\t", "date": "2007-06-09T14:44:00+00:00", "topic": "Bladder cancer in situ,hemmoragic cystitis, pain, frequency", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI never had BCG, but I do remember the postoperative tissue slough because I had clots that wouldn't pass. That started about a week after my TURB. The last time I had biopsies I had the same experience.\n-Warren\t\t\t", "date": "2007-06-11T16:28:48+00:00", "topic": "BCG /SCAB/ DEBRIS", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHe should discuss this with his urologist when he is adequately recovered. If his erections don't return, he can have a device implanted to give him erections. He can also give himself injections to create an erection. Both methods require his doctor's input. Don't waste any time or money on other devices or methods you may find on the Internet.\t\t\t", "date": "2014-03-15T15:59:59+00:00", "topic": "Bladder removal and sex", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAs far as flushing, I've never had to flush since the catheter was removed. I used saline for irrigation which is much easier to get than water. Maybe it's less expensive. Mine was covered by insurance. My incontinence supplies; however are not covered and are running about $150 a month.\nAs far as potency, I haven't had an erection since 10/09 after the urethroplasty, so I told my urologist no need to worry about nerve sparing for the neobladder since nothing works anyway.\nAs regards incontinence devices, I think I've tried every variety known to man. I'm not sure how the Cunningham clamp differs from the j-clamp. I use the j-clamp when I get out of the shower and when I transition between devices. After 1.5 hours I start to have intense penile pain, and I leak even with the clamp set on the highest setting after I've been wearing it for a while. I had to use it for my last CT scan so that I would retain dye in the bladder.\nDuring the day I use the AFEX system which is essentially a semi rigid funnel in the underpants that attaches to a bag. As with all the devices, I have to change positions slowly to avoid yanking my penis out of the device.\nDuring the night I use the GeeWhiz, a condom catheter that attaches to the penis with a silicon strip and tape over the condom. Although I think I've mastered applying it so that it's unlikely to detach,  reapplying it is not so easy that I would chance using it at work. I have an overnight bag and long tubing. The AFEX wouldn't be  good for night sine it doesn't seal with the body, although I find mine does form a suction. In any event, I find all the devices become irritating after a while, so that switching from one to another gives the sore spots a break, since each device irritates in a different manner.\nI've also switched off to the McGuire type device, but it holds too little to be practical and the outlet is a screw cap which guarantees it will get lost and you'll get pee on your hands. It comes with a leg bag, but the tubing is too short to put it down on the calf. I'm working on getting different tubing  to which I'll try to attach the connector.\n-Warren\t\t\t", "date": "2013-03-28T21:01:21+00:00", "topic": "New Neobladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI have posted this on the non-invasive board but am posting this here as well in case you guys have a different perspective based on your personal experiences.\n\nFor those of you who don't know me a brief summary. I'm a pediatrician, diagnosed with TCC TaG3 + CIS 12 years ago. I was treated by TURB & intravesical mitomycin C. I developed a major problem with a urethral stricture which is when I learned about this support group and became a member. In 10/2009 I finally had a urethroplasty to repair the stricture just in time to deal with a recurrence of CIS after 10 years cancer-free. I was treated with BCG, and 1 year later had a recurrence of CIS treated with BCG/interferon. I had consulted specialists at Weill-Cornell and NYU, who agreed that this was a reasonable approach and that a recurrence after that would require a cystectomy. 6-7 months after my last set of biopsies and 3 months after BCG/interferon my biopsy shows high grade TCC with invasion of the lamina propria making it T1G3. My opinion is that this is a rapid enough progression to make it wise to get this bladder out before it becomes muscle invasive, even though it is not a recurrence of CIS (which I'm betting would happen within the year anyway). I have forwarded the biopsy reports to the specialist at NYU. I welcome your opinions.\n-Warren\t\t\t", "date": "2013-01-27T19:02:46+00:00", "topic": "I'm back", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIf indeed a radical cystectomy is what my consultants recommend, it's highly unlikely that there would be time to search for a suitable new associate and, unfortunately... I wouldn't be able to afford to pay a new physician. Being a pediatrician isn't all that lucrative... but that really plays no role in the final decision. It just adds to the stress.\t\t\t", "date": "2012-05-06T15:46:30+00:00", "topic": "Radical Cystectomy or More Intravesical Chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi everybody. I'm back. It's been about a year. For those of you who don't know me, I had high grade noninvasive cancer (TaG3) plus CIS in 12/2000. My urologist treated with mitomycin C instead of BCG and I remained cancer-free for 10 years. Unfortunately I had complications of treatment - a urethral stricture that caused me no end of grief and finally required a urethral reconstruction in 2009. I've had many follow up cystoscopies and often had areas of redness. Last year when I had an ill defined epididymal mass for which I needed surgery I asked my urologist to biopsy my bladder and I had CIS. Fortunately with my urethra repaired I was able to be treated with BCG, after which my biopsy was negative for cancer. Subsequent to that my urologist continued to see a red area in my bladder, and he agreed with my request that if it persisted for a year we would biopsy it. The results - a recurrence of CIS.\n\nI've already posted this on the non-invasive board but decided to repost on the invasive board because I want to hear from people who've had radical cystectomies.\n\nI have read that delaying cystectomy to preserve the bladder can end up shortening one's life. I have no great love for my bladder as it has caused me a great deal of pain, and since I haven't had an erection since the urethral surgery 2 years ago, I'm certainly not concerned about the sexual side effects of a radical cystectomy.\n\nMy urologist does not think a radical cystectomy is called for and would like to treat me with intravesical valrubicin. I'm tempted, not because I want to keep my bladder, but my partner (I'm a pediatrician) is retiring due to a recurrence of pancreatic cancer leaving me alone to run our practice. I don't see how I can manage being out for 6+ weeks. But then I could have a reaction to the valrubicin... Probably not an issue as far as work since I've gone to work many days in pain over the years.\n\nI told my urologist I need a second opinion and he recommended William Huang at NYU. I also got a referral from the uro who did my urethral reconstruction to Douglas Scherr at Presbyterian/Weill Cornell. Seeing both of them this month.\n\nSo, now I'd like you all to cast your votes and voice your opinions as to my next step.\n\nI'd also like to know what to expect if I have the radical cystectomy - length of hospitalization, recovery period before returning to work, dealing with continence issues, complications any of you may have had.\n\n-Warren\t\t\t", "date": "2012-05-06T15:46:30+00:00", "topic": "Radical Cystectomy or More Intravesical Chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCynthia. Best of luck.\nCancer - the gift that keeps on giving. You hope your troubles are over if you're cancer-free, but our bodies don't always react that way to our treatments.\t\t\t", "date": "2010-01-30T18:26:12+00:00", "topic": "Once again it is always something", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t4 weeks is a long time to have pain without even talking to the doctor about it. I'd give a call.\t\t\t", "date": "2009-04-13T00:31:48+00:00", "topic": "Wine and bladder pain", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tInteresting, because when I've ha my worst symptoms, the only thing that really hleps is a glass of wine.\t\t\t", "date": "2009-04-13T00:31:48+00:00", "topic": "Wine and bladder pain", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHi All,\nPat sent me a PM asking for my comments. Glad she did. My life is hectic, but good, and I always have time for you folks so please feel free to contact me if you think I can help.\nAnyway, my first comment is more of a question. What really was going on with your father's right kidney? Nephrosis has so many possible meanings all I really know is that there was something wrong with his kidney. In kids, nephrosis generally refers to the results of inflammation of the kidney, and neither nephrostomies nor stents get involved with the treatment. Perhaps a clearer understanding of what's going on with your father's right kidney might lead to an explanation about the bigger picture and help to understand what's happening to his left kidney.\nSecond, is the left kidney obstructed, or not producing urine? That's a crucial question, and not one that has weeks to figure out. There are nuclear scans, ultrasounds, and CT scans which should clarify that answer. If the kidney has somehow become obstructed due to what they've done, they need to fix that ASAP. If the left kidney isn't producing urine they need to know if the blood supply to his kidney was affected or if the kidney is failing.\nMaybe it's something as simple as the right kidney, once opened up, has not recovered enough to concentrate the urine properly and is overproducing urine so that the left kidney is doing what a well behaving kidney should do and compensating by producing less. But it's still important to know that the left is functioning and not miss an opporunity to fix something that can't wait.\nI can't promise to monitor this thread, so please PM me if I should follow this discussion further.\t\t\t", "date": "2008-06-06T04:13:16+00:00", "topic": "Kidney Not Producing Urine", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\t     I wasn't quite sure if I should respond to this because I do sympathize with your plight, but then I thought, perhaps the group should hear a response from a physician. True, I never got $172 for a visit unless it included immunizations and procedures, but I'm curious just how much everyone thinks a doctor's time is worth. You did say he spent almost 30 minutes. Don't forget, the $172 doesn't all go into his pocket since he has to pay for office staff, supplies and equipment.\nMany of my patients who complain about a $25 copay think nothing about spending $300 at the veterinarian for their pet, big bucks for home and auto repair.\nYou're absolutely right that we need universal health care insurance. I felt that way when Bill Clinton ran for president. I can certainly say that we're not better off with the HMOs that came in instead. In 1993 my practice lost 1/3 of it's patients because we weren't participating in any HMOs. We had no choice. Their contracts require that we take a reduced fee. Of course I sympathize with those who don't have insurance and have given many a break to those in need, but does that mean that I should give everyone a break just because I have been forced by the HMOs to accept less from them. You would be amazed by what the HMOs get away with. If a claim isn't filed within 90 days, they don't have to pay it, but if they determine that a patient wasn't insured when they paid a bill, they can take the money back from me 2 years later when I have no recourse. If I see a patient and provide a legitimate & necessary service, and it turns out that they had been assigned to another doctor, the insurance company doesn't have to pay me and I can't bill the patient. Can you imagine the amount of time and expense I have just to provide the care to insured patients!?!\nI haven't raised my rates since 1993 because I won't get paid more no matter what I charge. I'm lucky if I get $40-50 for a visit plus cost for vaccines. My personal expenses have gone up. The cost of running my practice has gone up. And now NYS wants to increase my malpractice insurance by 33% plus a $100,000 annual surcharge for the next 5 years even though I've never been sued.\nThere are lots of poor people who would love to earn what I earn, but I still earn less than I did in 1993. I'm not getting rich. I have to pay for my own retirement and health insurance. I sympathize with the poor and would love for everyone to have a great life, but tell me, after I spent all those years in school and, took out loans, delayed earning a regular income until my education was complete, now that I work holidays and weekends and get calls all hours of the night from sick or frightened patients, even though I recognize that everyone needs affordable health care - do you really want me to earn less for what I provide than your auto mechanic and plumber?\t\t\t", "date": "2008-01-16T04:41:48+00:00", "topic": "Insurance vs. no Insurance", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nYou may want to find out if the Staph is the MRSA variety (methacillin resistant Staphlococcus Aureus) that is being discussed in the news lately.  This means it is difficult to get rid of but I think they can test the staph to see what antibiotics it will respond to.  I think it is important to ask what to expect with that kind of infection.Well fortunately, if it is MRSA, he's on vancomycin, which is the drug of choice for treating hospital acquired MRSA\t\t\t", "date": "2007-11-17T01:01:04+00:00", "topic": "help, help, new surgery needed!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFor many men prostate cancer is a low grade chronic cancer rather than an explosive, invasive, or metastatic cancer. Just like with bladder cancer, it all depends on what the biopsy shows.  I suppose if the cells are highly anaplastic (poorly differntiated as in high grade) it might be hard to tell what the primary cancer is, but the cells of bladder cancer invading the prostate should look different to the pathologist than primary prostate cancer.\nI once had a urological oncologist tell me that most men in their 60s or older would have some prostate cancer if they had biopsies. It is found at autopsy of many men who die from other causes.\nThe association between bladder cancer in many of these cases may simply be that the prostate cancer is discovered in treating the bladder cancer.\t\t\t", "date": "2007-10-07T14:12:03+00:00", "topic": "Bladder Cancer &amp;amp;amp; Prostrate Cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFind out the laws in your area. In NY State a patient has a right to a full copy of his medical record from any doctor or hospital. The law limits charges to reasonable copying and handling fees (I think 75¢/page). Ask for what you want a copy of by contacting the lab or medical records. If you don't get immediate satisfaction ask to speak to a supervisor. If that doesn't work, speak to the hospital administrator. If all else fails, threaten legal action.\n", "date": "2007-09-22T23:27:13+00:00", "topic": "Frustrated With Doctors!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\ndon't feel bad even the doctors only have to take a 6 week course in drugs!Hmmm. I took a full semester of pharmacology. But hey, that was more than 30 years ago. It's mostly out of date anyway. I've learned about more drugs since medical school than I did in medical school.\nForgive me for jumping in off topic - and my best to Gene.\t\t\t", "date": "2007-09-20T19:01:10+00:00", "topic": "day 6, Gene Beane, going home", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAlways tell children the truth, but tell it in a way they can understand and that answers their concerns.\nTell them grandpa is sick and he's going to have an operation to help him be OK. Give only as much medical detail as the boys ask for. Prepare them for anything they will see. They only need to  know about bags, bladders, and tubes if they will be exposed to it. Too much information is confusing.\nTell them they can't get sick from Grandpa.\nTell them what they need to know about grandpa's recovery and how it will affect them - visiting, playing with him, doing things together, realistic answers about what he will be able to do and when.\nReassure them that you're not sick. You can't promise that you'll never be sick or even have the same thing that grandpa has, but as much as possible, the kids need to know what will be ok (for most kids that means what won't change) in their world.\n", "date": "2007-08-29T03:19:57+00:00", "topic": "explaining things to children.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nHe says \"the prostate is intimately attached to the bladder and can serve as a reservoir for cancer cells if it is not removed.\"  If it's so \"intimately attached\" why is it that so many men with prostate cancer can have their prostate removed without also removing the bladder?  What does \"can serve as a reservoir\" mean?  That there might be cancer cells in the prostate...or that cancer could develop sometime down the line?  Why is cancer from the bladder any more likely to move downstream to the prostate than upstream to the kidneys? Are they saying gravity is involved here?Prostate cancer is a different beast than bladder cancer. It doesn't have the high recurrence rate that bladder cancer has, tends not to be as aggressive if caught early enough, and is affected by male hormones. Prostate cancer can metastasize, but it doesn't go to the bladder. On the other hand, the prostate is connected to the urethra, so while I don't think bladder cancer cells metastasize to the prostate, I suppose they could hide there. The kidneys and ureters are unfortunately at risk as well, but removing the kidneys to decrease one's risk is not an option since the kidneys are vital organs. You may disagree, but when it comes to preserving life and limb, the prostate is not a vital organ. That is more a quality of life issue, and should you face the problem, you're entitled to ask the risks of leaving the prostate intact and make an informed decision.\t\t\t", "date": "2007-08-23T19:38:41+00:00", "topic": "Basic Questions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nIts interesting to note that with women who have this done the stoma nurses gear all instructions to the patient not the husband....when a man has this done they gear it to the wives.  hmmmmmm..........PatInteresting indeed. When I woke up from my initial surgery for the bladder CA they tried to tell my wife how to remove my catheter. She didn't even want to look at it. And give me a break! In medical school and residency I catheterized more than a few patients. Why would I need my wife to remove my catheter!?!\t\t\t", "date": "2007-08-08T23:19:19+00:00", "topic": "caregiver needs info for after RC on Monday", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can see from the MRI that you're a real handsome fella \nI wish you no more tsuris (Yiddish for trouble, but more colorful sounding).\t\t\t", "date": "2010-02-04T01:30:19+00:00", "topic": "MRI scan of brain... CLEAN!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tSorry to read this. Best of luck.\t\t\t", "date": "2009-12-05T20:14:12+00:00", "topic": "Back from UK", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tNothing to add, my friend, except my good wishes.\t\t\t", "date": "2009-11-26T12:56:15+00:00", "topic": "2 cm Mass in Cerebellum", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tAlthough people talk about life expectancy, hospice will not hold you to any rule on that matter. Hospice is appropriate when treatment switches from efforts at cure or remission to palliative care. Pain management is a large part of palliative care. Hospice care can be done at home, in a hospital, in a rehab/nursing facility, or an inpatient hospice. Hospice should be able to help you plan the appropriate level of care for your Mom, and will help you transition to higher levels of care as needed. If you need a full time caregiver, at least in NY, while hospice will help, it is not part of hospice service and is not covered by insurance.\nNarcotics like morphine are severely constipating. Although it might be reasonable to consider a blockage given the size of your mother's lymph nodes, a blockage would generally cause severe pain (which could be masked by pain meds) and vomiting. Obviously, Mom needs her doctors to be on top of things and carefully evaluate her status.\t\t\t", "date": "2008-10-26T22:04:53+00:00", "topic": "Please read...the good days are gone", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tWishing you the best from Long Island, New York.\t\t\t", "date": "2008-07-15T14:57:40+00:00", "topic": "Zachary,   prayers for you, from the US and ABROAD", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI am saddened to learn, after my long break from the forum, that Susan has left us. And to think, I just learned that we are both RPI alums - me undergraduate, her doctoral. She was so strong and inspirational.\n-Warren\t\t\t", "date": "2008-07-18T00:30:15+00:00", "topic": "Susan has passed", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tOnce you have a neo-bladder, pouch, or ileal conduit any of those becomes part of the urinary tract. An untreated infection in any part of the urinary tract can become a kidney infection.\t\t\t", "date": "2008-07-08T23:26:48+00:00", "topic": "can you get a UTI with no bladder?", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Susan,\nI'm just back for a brief visit between events in my life (nostly good). I was sorry to hear your news, but given how you've waged your battle, I hope you enjoy good health to the end, and that you have plenty more time for joy. You amaze me.\t\t\t", "date": "2008-06-20T18:03:18+00:00", "topic": "Very bad news from Susan; consider deferring reading if you are vulnerable", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nA week ago, I\nwent to see my local oncologist and described my symptoms. He listened and felt and said I should come back in a month (just before I'm scheduled to return to Houston).\nHe didn't even prescribe cough medicine.Did he advance an opinion on what was going on? If it's just a cold, It'll make you feel crappy, but it will go away. Cough medicine doesn't cure anything and some of the latest research suggests that dark honey works as well or better than any OTC cough medicine. Narcotic cough medicines will get you a night's sleep, but they don't cure anything either and can be constipating.\nDid he think a chest x-ray was warranted?\nSorry, I'm not trying to drive you more nuts. Just want to be sure you're taken care of even when cancer isn't causing your symptoms.\t\t\t", "date": "2008-04-14T15:59:21+00:00", "topic": "I'm not feeling quite as well", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI don't know about metastatic disease of the liver, but I do know that vomiting is a symptom of hepatitis, so apparently inflammation of the liver can lead to vomiting.\t\t\t", "date": "2008-03-01T17:48:37+00:00", "topic": "Dr. Chang &amp;amp;amp; Meridian Medical", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nhow does this happen to such a great person who put everyone in front of her own needs....Dear Sam,\nThe question to which nobody has an answer. When my mother, who was a vigorous, independent, 83 year old developed leukemia, she never complained. She became so weak she had to move into assisted living. Just before that I found her sitting on her bed crying and she asked, \"How could such a terrible thing happen to such as nice person as me?\" Remembering that moment still brings tears to my eyes. 3 years later I still miss her terribly. The pain of our loss never completely goes away. While we find joy in our lives, there is always someone important missing. But for them, with their bodies so ravaged by their illness and no way back, death was a blessed release.\nIt seems that it takes the first year to deal with our own grief, and the second to deal with the fact that they're never coming back, and then finally we come to terms with the emptiness by celebrating the joy we had together.\nI've gone over my mother's final days in my head so often and asked myself so many \"what ifs?\" and I have to remind myself that she was better to leave us as she did since the alternatives were not pretty.\t\t\t", "date": "2008-02-09T23:52:54+00:00", "topic": "Trying to remain strong", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nthe doctors in the Oncology office will not treat her because they are not comfortable with her choice of treatment for her cancer\".  If she would get sick again like she did last weekend, she was not guaranteed any contact with any doctor in the Oncology office.\n\nCan doctors do this?!!Forgive my late entry to this discussion. I haven't really been following the metastatic discussions lately. First, let me say that I agree that your mother's treatment by the local docs is unconscionable.... but, as a physician (pediatrician), I may have some clue what's going on here. Your local doc may be concerned about being sucked into liability for a treatment he doesn't know about.\nI think her doctor at the Cancer Center needs to contact the locals and work out an arrangement for her care. If a local doc, not necessarily an oncologist, knows he has a readily available consultant to be responsible for her care, he may be willing to do the local leg work in providing the care.\t\t\t", "date": "2007-12-11T20:37:32+00:00", "topic": "Local Oncologists Won't Treat My Mom!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDear Karen,He was given Hydroclorothiazide, for blood pressure, I found this strange because it is a dieretic.  He is constipated and hardly drinking enough water as it is, he has no swelling what-so-ever.  I questioned them on this so they put him on lopresser.Diuretics are the first line of treatment for hypertension, even for patients who have no visible edema. They're generally safe, effective, well tolerated, and inexpensive. Lopressor is a beta blocker. Beta blockers decrease vascular tone (they prevent constriction of peripheral blood vessels). Beta blockers and diuretics are often used together for effective blood pressure control. If your husband needs additional medication for his blood pressure there are plenty of other categories of medication to try, and it would still be safe and reasonable to use a diuretic (should the need arise).\nAt least your doctor didn't ignore or dismiss your concerns about the diuretic. (I beleive they missed this cancer last year Aug).  He was scheduled to have elective surgery for a cyst, and during pre-op, they notified him that he couldn't have the surgery because there was microscopic blood in his urine.  He went to the Uro, and they of course sent him home on antibiotics, and called it a day.Like I said in another message on this forum to a 19 year old fella who was worried he had cancer because he was treated for a UTI and didn't get better, \"it really drive me nuts when my colleagues jump on the easy diagnosis.\" The only reliable way to diagnose a UTI is by doing a urine culture. I can't understand why any physician would want to diagnose and treat a UTI without a culture. It's not like it's a really expensive or complicated test - and in the absence of urinary symptoms and white cells in the urine why would UTI even be the most reasonable diagnosis!?! I have this argument with ERs all the time, but I'm a bit surprised that a urologist would take that approach.\nHey, but then my urologist followed me for 8 years for microscopic blood in my urine without repeating the cystoscopy after the initial one. When I started having increased twinges and asked him how we'd know if everything was okay since I always had the hematuria he said do a cytology, and when that showed sheets of atypical cells he said it was okay. If I hadn't urinated a clot a month later, I'd either be dead or among the members on this board who had an RC and maybe even chemo. He told me that he learned from my case that he'd have to be more aggressive in evaluating perisitent hematuria - Thank you very much!\t\t\t", "date": "2007-09-11T01:31:49+00:00", "topic": "Chemo Update", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nMy gynocologist does not know why I'm having pelvic pain, constipation and urine blockage.Dear Rosemary,\nI must have missed this when you originaly posted. I can't promise that this is your answer, but check out \nwww.pelvicpainhelp.com/\n", "date": "2006-09-28T02:28:31+00:00", "topic": "Hysterectomy and Bladder Cancer issues", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tSorry I didn't answer sooner, but I haven't been here recently.\nIn the 13 years I have been doing battle with high grade bladder cancer including CIS, I have never had a positive cytology. It's a good test, but one can't be lulled into complacency with a negative test.\nWith regard to how quickly bladder cancer can develop, my follow up biopsies just a few months after BCG for CIS were positive for high grade papillary carcinoma with invasion of the lamina propria. I wasted no time getting my bladder out before I developed invasive disease.\nThat being said, there's no indication that you have bladder cancer, but I had problems with kidney stones during all my treatments, so the best thing to do is follow up appropriately with the cystoscopy.\nI hope by now you've had it done and it was negative for cancer.\t\t\t", "date": "2014-01-31T01:36:49+00:00", "topic": "Would Like Some Suggestions Please", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Ian,\nWhile i can assure you from my personal experience that a urethral stricture is no fun, we can manage with it - you and me. You're in so much pain and sore now, but it may very well be that once this heals there will not be a stricture. Right now you most likely have swelling at the urethral opening from their mangling it with whatever they did, but if the injury is primarily at the tip, hopefuly they can make sure it heals without a stricture, or monitor it easily enough and open it.\t\t\t", "date": "2008-03-27T21:24:41+00:00", "topic": false, "subforum": "6-men-and-bladder-cancer"}, {"text": "\nFor five cancers -- thyroid, prostate, kidney and breast cancer, and melanoma -- data from the past 30 years show an increasing number of new cases but not an increase in deaths. In each of these cancers, an increase in screening or imaging tests has been associated with an increasing rate of new diagnoses.Perhaps the lack of increased death rate represents the patients saved by earlier diagnosis. And most urologists aqnd oncologists already know that some prostate cancers should just be observed, but observed is not the same thing as ignored.\t\t\t", "date": "2010-04-27T18:27:13+00:00", "topic": "Overdiagnosis?  HUH?", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tWhat I really \"Love\" about this kind of news is that in spite of being on so many e-mail lists for physicians, my patients always hear about this stuff on the news before I get notified.\t\t\t", "date": "2010-01-15T23:42:12+00:00", "topic": "Huge recall..Tylenol, Motrin, St. Jos. Aspirin,", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tYes, there are two of us. Check it out on my brother's web site - \n\tthe Twin Page\n", "date": "2010-01-05T19:59:02+00:00", "topic": "Study of Risk for BLC", "subforum": "31-articles-of-interest"}, {"text": "\nPatricia wrote:I know of 3 cases of identical twins where one has it and one does not.Since I don't know any statistics I take heart in your experience. Who wants my twinnie getting this beast. One of us is enough.\t\t\t", "date": "2010-01-05T19:59:02+00:00", "topic": "Study of Risk for BLC", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tWhile of note that bladder cancer was mentioned in the article, so little was said about his treament and course, leaving it a total mystery to any curious readers of the article.\t\t\t", "date": "2009-11-24T18:55:23+00:00", "topic": "Celebrity Bladder Cancer", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tThanks.\nI'll keep it in mind for the next time that I hope never comes.\t\t\t", "date": "2008-12-31T19:37:30+00:00", "topic": "new article on T1G3 blc", "subforum": "31-articles-of-interest"}, {"text": "\n\t\t\t\tNew guidelines of this sort aim at cutting down on false positives and unnecessary procedures. Unfortunately, the insurance industry jumps on anything that cuts down on paid procedures as a standard of care.\t\t\t", "date": "2009-11-07T01:38:23+00:00", "topic": "How did a popularity contest become a part of cancer survivorship?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDo keep in mind that not all swine flu is the same, just as each seasonal flu varies, so, while previous exposure or immunization against swine flu may afford you some protection, if you're in a high risk group or a healthcare worker like me, you still should get the vaccine.\t\t\t", "date": "2009-10-07T17:49:58+00:00", "topic": "Pro’s, Con’s H1N1 your thoughts?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI was able to read it with your link in this message thread, but it did not show up at all when I logged onto Facebook, which I do regularly since my whole family is on. I did get a notice about the first interview, but the link on Facebook didn't work. I hope other BLC supporters are seeing these on Facebook.\t\t\t", "date": "2009-09-28T17:21:55+00:00", "topic": "Second Facebook Interview", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tChocolate buttercream icing for the feathers applied with a #67 leaf tube.\t\t\t", "date": "2008-11-23T22:56:45+00:00", "topic": "Christmas Cookies", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Rosemary,\nYes I have started baking for Christmas, but Thanksgiving is first.\n\n\n\n\n\n", "date": "2008-11-23T22:56:45+00:00", "topic": "Christmas Cookies", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Pat,\nNot sure what a Gene Meyer tie is. It's Dr. Seuss. Got it at \nwww.wildties.com\n. You can't even tell that I was catheterized at the time after my last urethral stricture dilation  ", "date": "2008-07-20T03:18:29+00:00", "topic": "I\\'m back", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDear Gene,\nThanks for thinking I don't look 60. Here's me and my twin not looking 60.\n\n\n\n\n\n\nI'm on the right. I'm 7 minutes older. Isn't it obvious  ", "date": "2008-07-20T03:18:29+00:00", "topic": "I\\'m back", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi All,\nI think it's time for me to take a little break from the forum.\nLife is complicated - sometimes sweet, sometimes awful - and either way can take an enormous amout of your energy. My baby daughter is engaged to be married next February - there's lots to be done. My twin and I are celebrating our 60th birthday in July and combining that into a big bash including my other daughter's 30th birthday, and his grand daughter's first birthday. I have lots of cookies to bake. And then back to the engagement - there's a party for that this summer.\nMeanwhile, my wife's mother died after a long battle with metastatic breast cancer on my son's 34th birthday while he was visiting us to celebrate. At least we all got to say good-bye. I wish I could say that my wife enjoyed a close loving relationship with her mother and a friendship as adults like I had with my mother, but it wasn't so - and that makes the healing so much more difficult. Meanwhile, I have been left dealing with my step-father-in-law's affairs because he is old, disabled, and has early dementia, and because my mother-in-law successfully alientated his own family from him.\nI look at the messages on the board to see if anyone would benefit from my input, and while I see lots of people providing the wonderful support you all provide for each other, I find my mind is elsewhere and I have little to offer.\nShould anyone want to talk to me or think someone needs my input, you can PM me and I will get the e-mail calling me to action. After all - I'm not going anywhere. I'm doing OK, but I need a little break.\t\t\t", "date": "2008-05-14T04:04:36+00:00", "topic": "Taking a Break", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tFinally finished making the cookies and the trays. Here's the process:\n\n\n\n\n\n\n\nHere's a finished tray before it's wrapped.\n\n\n\n\n\n\n\nAnd here's the final Christmas gift. Wish I could send one to each of you!\n\n\n\n\n\n\nBut I can still post more recipes if you see something you like   ", "date": "2007-12-01T04:05:55+00:00", "topic": "My Christmas Present to You", "subforum": "17-chit-chat"}, {"text": "\nYour right Zach I could not see the pics either with IE and I think this is the reason Rosemary can not view them either she is using IE.I hate to complicate things for you guys, but I use IE7 and I've seen all the pictures and the discussion. It's got to be a setting, or something. Call IT.\t\t\t", "date": "2007-10-28T18:28:00+00:00", "topic": "Rosemary, a couple of my photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI got this referral  for my brother in-law from a Urolgogical oncologist I know at Harvard. The urologist is at UCSD. Her name is Carol Salem: (619) 543-6966. My brother in-law was very happy with her. Just googled her. She has a website at drsalem.ucsd.edu\n-Warren\t\t\t", "date": "2007-05-14T02:12:14+00:00", "topic": "Need a new uro!", "subforum": "17-chit-chat"}]}