{"signature": ["Chemotherapy", "Surgery"], "posts": [{"text": "\n\t\t\t\tThe Canadian Competition Bureau has launched Project False Hope to warn consumers against online cancer scams. Its first offering is an analysis of claims made for a fictitious \"Natural Herbal Formula.\" Scrolling over the text of a page designed to look an advertisement produces pop-up bubbles that comment on the tactics that scammers use to hook people.\n\n\nwww.competitionbureau.gc.ca/epic/site/cb-bc.nsf/en/02586e.html\n\n\nInteresting stuff.\t\t\t", "date": "2008-06-14T20:10:18+00:00", "topic": "Anatomy of of an Online Cancer Scam", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tA little background would be helpful since there isn't a \"one size fits all\" answer--are you a man? woman? age? lifestyle? is your surgeon experienced in both procedures? your expectations? there more info you can provide the better, since there are many people here who have had one or the other procedures.\t\t\t", "date": "2008-05-07T20:12:15+00:00", "topic": "Need Feedback", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThere may be no blood visible to the naked eye, but under the microscope the doctor may see plenty. When I first went to the urologist thinking I had a kidney stone brewing, I actually apologized to him for what I thought was a waste-of-time visit--my urine sample looked clear as a fine chardonnay. He told me that he saw quite a bit of blood under the microscope, so I wasn't being a hypochondriac after all.\t\t\t", "date": "2008-04-26T13:36:52+00:00", "topic": "No symptoms at all", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHow can you not love the sincerity of a face like this?\n\n\n\n\n\n\n\n\n\n\tJohn Stein's Obituary in the LA Times.\n\n\n", "date": "2008-04-12T01:54:38+00:00", "topic": "Dr Stein passed away?", "subforum": "3-newly-diagnosed"}, {"text": "\nI really don't know what this all means other than the Doc's are saying it is outside the bladder.\nGet a notepad and bring it to your next appointment and ask your doctor exactly what he means. Don't leave until you're satisfied that you understand. Believe me, I've been there. Things are happening so fast and so many unfamiliar terms are being tossed around that it's easy to lose focus and lose track of exactly what is going on. When I was first diagnosed I honestly didn't hear a word the urologist said--the room was spinning and I had to lie down I was so close to passing out.\n\nAs an aside, as my wife and I were driving home from the clinic in a state of silent shock, a car ran a stop sign and nearly t-boned us. It's not always the things you think are going to kill you that actually do. At any moment, at any intersection, life may throw you a curveball you'll never see coming. This one--bladder cancer--is at least a curveball you can take a swing at.\nIn my mind I realize bladder removal is probably the best thing to do at this time  to have the best chances of getting it all and hopefully not re-occuring. I am having a hard time accepting that. As I said before, I really don't want to go thru the surgury and recovery period and lifes changes afterwards. I read articles of people with other types of cancer being cured with chemo. Why can't this happen with bladder cancer?\nChemo isn't a magic bullet that kills cancer. It is a systemic solution that kills *all* fast-growing cells, including the lining of your stomach and your mouth. If you had enough chemo to kill all your invasive bladder cancer it would do an incredible amount of damage to your body. And it probably wouldn't kill all the cancer anyway. Again, ask your doctor if this is an option.\n\nNone of us wanted to have our bladders removed, but compared to the alternative it's a walk in the park. Karen's (momof4) husband is, sadly, an example of someone with bladder cancer that has spread to other organs and his bones. If he could talk with you, I'm sure he'd advise you to have the surgery (if that's what your doctors are recommending) while you still can.\n\nSince we're the same age, you might remember the film they showed in Driver's Ed called \n\tSignal 30\n. Signal 30 is the radio call-code police use to designate a traffic accident with fatalities, an accident there is no need to call the ambulance for. Please don't be a Signal 30 out of fear or confusion. If your bladder can be spared, terrific. But if not, there are people here who can help you through this with knowledge and support.\n\nBut please ask your doctors for options and opinions. If you aren't clear on something, don't walk out the door until you understand it.\n\nBest wishes to you.\n\nZach\t\t\t", "date": "2008-04-15T01:21:58+00:00", "topic": "Confused, scared, to many decisions to make", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tNo matter what anyone here tells you, you're going to be very anxious until you get a definitive diagnosis.\n\nThat being said, I think--and hope--that it's an infection or you've been working out too hard or a kidney stone.\n\nPlease do report back. We were all in a state of shock like you are now.. some of us not too very long ago.\n\nZach\t\t\t", "date": "2008-02-14T20:13:49+00:00", "topic": "Not Diagnosed yet but............", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI had my turb eighteen months ago. I was a healthy guy of 49.\n\nAnd I stayed in bed almost three days afterwards.\n\nPlus, because of some extraneous tissue floating around my bladder from removing some tumors, my catheter was blocked several times and I thought I'd have to go to the emergency room.\n\nFortunately the dam burst and there was sweet relief. By day four or five I felt almost normal. I still don't know if 1) I was a big baby 2) I responded poorly to all the work the urologist did, or 3) the anesthesia knocked me for an extended loop.\n\nI think it was a combination of all three. After my last surgery at USC/Norris in March of 2007, it took a long time for me to come out of the anesthesia, and there was much wailing and gnashing of teeth in the recovery room.\n\nBut this I know--the pain and inconvenience will soon pass; in fact, I'll bet it's much better even now.\n\nAt least I hope so.\n\nZach\t\t\t", "date": "2008-02-09T03:37:31+00:00", "topic": "Husband had TURB yesterday...", "subforum": "3-newly-diagnosed"}, {"text": "\nRosemary...link wouldn't let me open the page?....\nI fixed the link--try again ", "date": "2008-01-21T07:28:10+00:00", "topic": "34 year old newby in Seattle", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHere's an interesting article regarding the actual science of how exercising can help with depression.\n\n\n\tClick here for the article.\n", "date": "2007-12-03T22:14:21+00:00", "topic": "How exercise fights depression", "subforum": "3-newly-diagnosed"}, {"text": "\nim 19...do i have a tumor in my bladder?\nMaybe. Maybe not. Probably not.\n\nI'm more concerned with the fact that you sound so seriously depressed about the unknown. Get a cystoscopy. Soon. They only take a few minutes, and then either you'll be massively relieved or ready to make plans for your treatment.\n\nYou've certainly read the importance of getting checked by a doctor with experience, so I'm assuming you've been to good doctors. What are they telling you about your diagnosis?\n\nAside from the frequent urination and your concern about a tumor--and I know that's a big aside--what is the rest of your life like right now? I know that fear and apprehension are probably dominating your thoughts right now, but I really worry when someone says they've lost their will to live, especially since you haven't even been diagnosed yet. What Pat said is very important; you might be having a reaction to medications you're taking for something else. Please, please let us know the results of your cystoscopy--I'm keeping my fingers crossed for you.\n\nZach\t\t\t", "date": "2007-11-27T05:53:48+00:00", "topic": "what is wrong with me?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tDo you have stock in this company? You've pretty much posted the same message in many many threads.\n\nAnd *nothing* has no side effects. Even drinking too much water can kill.\t\t\t", "date": "2007-08-06T22:40:38+00:00", "topic": "First Biopsy Results", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tRosie, that sounds like a tremendous resource.\t\t\t", "date": "2007-07-19T18:01:26+00:00", "topic": "Financial Aid", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPlease do!\t\t\t", "date": "2007-07-19T18:01:26+00:00", "topic": "Financial Aid", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI got this from Cure magazine. I hope it helps those of you who could use a hand financially:\n\n\n\nHelp for Patients\n\nThe costs of cancer treatment can quickly become overwhelming, even if you have medical insurance. Patient assistance programs are offered by various companies, nonprofits and government agencies to help patients with little or no insurance get access to drugs and money for other expenses.\n\nIf you’re interested in enrolling in a patient assistance program, you must first gather information, usually from your doctor or the maker of the specific drug you’re taking for which you need assistance. A doctor must be involved in the process because the physician writes the prescription for the medication.\n\nMany patient assistance applications will require proof of income, including tax returns, social security income, interest and retirement to prove financial burden and to meet income requirements. Faxing the information often speeds up the process. In addition to many state governments, numerous organizations provide information on patient assistance programs, including the ones listed below.\n\nAmgen Reimbursement Connection\n800-272-9376\nwww.amgen.com/patients/assistance.html\nFor patients who are uninsured or underinsured and who have limited financial resources; based on insured status and income level. Drugs in this program include Aranesp® (darbepoetin alfa) and Neulasta® (pegfilgrastim).\n\nBristol-Myers Squibb Patient Assistance Foundation\n800-736-0003\nwww.bmspaf.org\nEstablished to provide temporary assistance to patients with financial hardship who generally have no private prescription drug insurance and are not enrolled in a prescription drug coverage plan through Medicaid or any other federal, state or local health program.\n\nCancerCare\n800-813-4673\nwww.cancercare.org/get_help/assistance\nCancerCare’s financial assistance program provides limited grants for certain expenses related to treatment.\n\nGenentech’s Single Point of Contact\n888-249-4918\nwww.spoconline.com\n[Avastin Expenditure Cap: 800-232-2717]\nA reimbursement resource for Genentech products that provides information to patients and their health care providers.\n\nGlaxoSmithKline’s Commitment to Access\n866-265-6491\nwww.commitmenttoaccess.gsk.com\nProvides outpatient medications to eligible low-income patients who do not have prescription drug benefits.\n\nLilly Cares\n800-545-6962\nwww.lillycares.com\nProvides temporary assistance to patients obtaining Lilly or Dista medication.\n\nMerck's ACT Program\n\n866-363-6379\n\nwww.emend.com/aprepitant/emend/consumer/reimbursement/what_is_act.jsp\n\nACT is a two-part program specifically designed to assist insured patients with insurance reimbursement issues, and to provide product support for those qualified individuals lacking coverage for Emend® (aprepitant).\n\nPartnership for Prescription Assistance\n888-477-2669\nwww.pparx.org\nOffers a single point of access to more than 275 public and private patient assistance programs.\n\nPatient Advocate Foundation's Co-Pay Relief\n866-512-3861\nwww.copays.org\nProvides direct financial assistance to qualified patients to enable them to afford co-payments required by their insurance. Offers personal service to all patients through call counselors.\n\nPfizer’s FirstRESOURCE\n877-744-5675\nwww.pfizerhelpfulanswers.com\nFirstRESOURCE provides products to eligible, low-income, uninsured and underinsured patients.\n\nRxAssist and Rx Outreach Patient Assistance Programs\nwww.rxassist.org\nOffers assistance to patients without prescription drug coverage who meet income requirements.\n\nRx Hope\n877-979-4673\nwww.rxhope.com\nOffers information on assistance programs from various pharmaceutical companies; offers an Assistance Finder, which matches patient information against available federal, state and charitable prescription drug programs.\n\nSanofi-Aventis’s PACT Plus\n800-996-6626\noncology.sanofi-aventis.us/reimbursement.do\nOffers reimbursement services and patient assistance programs for most products including Taxotere® (doxetaxel) and Eloxatin® (oxaliplatin injection).\n\nSchering-Plough’s Commitment to Care Program\n800-521-7157\nwww.schering-plough.com/schering_plough/corp/commitment_care.jsp\nProvides free cancer medications through patient assistance programs to people with low incomes who do not have prescription drug coverage.\n\nTogether Rx Access\n800-444-4106\nwww.togetherrxaccess.com\nAssistance for patients who are ineligible for Medicare, have no prescription drug coverage and meet household income and age requirements.\n\n\n", "date": "2007-07-19T18:01:26+00:00", "topic": "Financial Aid", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tFrom reading his CV, I would say you are a family in extremely good hands.\n\nI know this is a very stressful time for you, but you aren't in the care of some local-yokel public-health physician. This is a guy who sounds absolutely top-flight in his abilities and his connections.\n\nI think you have enough stress without worrying about someone who is so obviously very qualified.\t\t\t", "date": "2007-07-05T13:06:32+00:00", "topic": "Time frame between Diagnosis and First Oncologist Visit?", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tCarole, Dan's story is both powerful and enlightening. It didn't exactly help me make the decision to have a radical cystectomy because in my personal situation I couldn't avoid one, but it made me feel a lot better about my decision and my future.\n\nDan is a guy who really did his homework in a systematic and thoughtful way. I always appreciate people like that--people who do so much groundwork that it helps make our choices easier.\n\nSomeone here.... Rosemary?... coined the term \"bladder-optional living\". It's not so bad and it's not so hard. None of us have a time machine or magic potion to take away our bladder cancer. What to do about it is sometimes a difficult and personal decision. But, in my heart of hearts, I would probably do what Dan did even if my cancer was superficial.\n\nZach\n\nOh, and the Dr. Stein alumnus Dan mentioned that he just missed meeting was, of course, me...\t\t\t", "date": "2007-02-13T15:30:18+00:00", "topic": "Missed BCG treatments", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tWelcome, Danny.\n\nEveryone here has had that same spinning-room sensation. My legs got so weak I had to lie down in the doctor's office. So you definitely are not alone in that.\n\nI'm really glad to hear that you're doing better now. No matter what, no matter how bleak things seem, they do get better.\n\nMost of the time I never get it a second thought. It's just something you get used to.\n\nYou have my best wishes,\n\nZach\n\n", "date": "2007-06-08T20:20:34+00:00", "topic": "Another new guy......", "subforum": "3-newly-diagnosed"}, {"text": "\n...my prostrate must go along with my appendix\nThey're removing your appendix?\n\nThat's the first I've heard of removing a perfectly good (at whatever the heck it does) appendix. I wonder why mine was left in? It was never even mentioned.\n\nZach\t\t\t", "date": "2007-06-05T22:21:42+00:00", "topic": "New guy, new story, new questions...", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tI just sent an email to Robert, but I don't think he'd mind if I posted it here:\n\nThirty-three? You definitely don't fit the profile for bladder cancer. Neither did I--sometimes it's just, as my doctor said, \"bad luck\".\n\nWhen I was undergoing the cytoscopy, my urologist said, \"young man, you have a very angry tumor. Get your wife in here right away.\" I was so shocked and stunned (I thought I had a kidney stone) I couldn't even stand. I had to lie down on his couch the room was spinning so much. I almost fainted.\n\nThat was about a year ago. Shortly after that I had my bladder, prostate, and 85 lymph nodes removed at USC/Norris cancer hospital. And then I got the news that it had spread to my lymph nodes. Lovely.\n\nBut like I said, it's a year later and I'm doing fine. It's difficult not to dwell on your diagnosis and prognosis and staging at first, but it's important to remember not to define yourself by those words and numbers. I liken it to being in a car accident--you wouldn't necessarily refer to yourself as a \"car accident victim\" or stew about car accident statistics. You get better to the best of your ability and move forward.\n\nDr. Edward Banfield of Harvard University, after more than 50 years of research, concluded that \"long-time perspective\" is the most accurate single predictor of success in business. I think this applies to cancer as well. I try to keep my \"time horizon\" in perspective; what we have is devastating in the here and now, but we have to focus on the long-term.\n\nI'm not being Pollyanna here either. It's not lollipops and puppies; it's a real detour to your life and your plans. My wife and I have been in the process of adopting a little girl from China for several years, and just this week we were let off (actually kicked out of) the program because China doesn't allow adoptive parents with cancer. We has spent years and over ten-thousand dollars up until last week, so I'm not minimizing this at all. It crushed both of us, but now we're looking into fostering children instead of adopting. It's not a perfect solution, and it's not what we wanted, but it's something we can do, and it's moving forward.\n\nOne thing I'm in the process of doing is writing a book on coping with cancer with positiveness and realistic optimism. I'll post the fist chapter--\"Diagnosis\"--here in a few weeks.\n\nBest,\n\nZach ", "date": "2007-06-02T00:37:56+00:00", "topic": "Re: New to Website New Diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\nI don't quite understand how they are going to fit all that equipment up my urinary track. That's got to hurt, what have i got to look forward to?\nI was like you--incredibly anxious about the cytoscopy. And I won't kid you, it did hurt a bit, but it's over with fairly quickly. The anxiety is far worse than the procedure--\"you're going to do what with that thing??\". (I had another one last month, and it was a piece of cake.)\n\nYou'll be sleeping like a baby for the Turbt, so you won't feel a thing. There will be some manageable pain afterwards, though. I stayed in bed for a couple of days following the procedure. You'll also come home with a catheter installed, and if you're like me you'll have your first night's sleep in ages that you didn't have to interrupt by getting up to pee. So it's not all bad.\n\nMine was a year-ago last week, and I can hardly remember it. It's just something to get past.\n\nYou'll do fine.\t\t\t", "date": "2007-06-02T00:37:56+00:00", "topic": "Re: New to Website New Diagnosis", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tPatti,\nI had my bladder removed almost a year ago, and although I'm younger than your dad (50), I'm sure he'll do fine. It takes a bit of getting used to, but humans are remarkably adaptable.\n\nHe may have one round of chemo afterwards if it hasn't spread, or if it has--in my case it had--he may have several rounds.\n\nIs he having the surgery at a hospital where they do this often?\n\nZach\t\t\t", "date": "2007-05-08T20:23:32+00:00", "topic": "father in-law recently diagnosed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tThat is absolutely fantastic news!\t\t\t", "date": "2007-04-05T18:15:18+00:00", "topic": "Newbie and stressed", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tHello bje,\n\nChemo is a teeter-totter, with an uneasy balance between constipation and diarrhea.\n\nBe patient--if you're anything like me, you'll tip from one extreme to the other. It's not fun, but at least it has an end. Imagine those poor dialysis patients who go in three times a week for three hours every week of their lives.\n\nAlyssa's advice--lots of water and fiber--is great.\n\nSorry you have to go through this.\n\nZach\t\t\t", "date": "2006-11-02T23:54:49+00:00", "topic": "New to web site - advice on chemo", "subforum": "3-newly-diagnosed"}, {"text": "\n\t\t\t\tTate, I'd suggest *not* reading everything about the side effects. I anticipated many horrors before my chemo, and it was not nearly as bad as I'd imagined and read about. I shared a room with was a very strong-looking guy for one of my sessions... he looked like an former sailor or marine. By the time the nurse explained all the possible side effects he might have from the chemo, he was pale and almost physically ill before the treatment even started!\n\nFor most of my chemo, I got to watch television and my portable dvd player, listen to my ipod, and my wife brought me lunch from California Pizza Kitchen. Nowhere on the internet, my oncologist's printed information, or on people's posts here about chemo did I see television, movies, and pizza mentioned.\t\t\t", "date": "2008-05-15T00:15:57+00:00", "topic": "1st BCG tomorrow and stressed to the gills", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tWhen I've had a couple of concerns (one of which put me back into the hospital for five days), I never tried to get to my doctor personally, since I knew how difficult that was. Instead we called the cancer hospital where I had my surgery (USC/Norris) and asked to speak to the urologist on duty. We always got a callback very shortly.\n\nAfterthought--of course since the doctor can't really diagnose anything over the phone with 100 percent accuracy (and they're two hours away), they'll more than likely tell you to go to the emergency room. I--in fact--did end up in the emergency room. By ambulance. In Rosemary's case, there is no way they could have told her over the phone exactly what was causing her bleeding. In my case, there was also no way they could have told what was causing my bleeding (an upper GI bleed; an ulcer perforated an artery and I was bleeding like crazy). A tough position to be in for all involved.\t\t\t", "date": "2008-04-19T18:32:17+00:00", "topic": "What to do when you can't get through to the Doctor... ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThis topic has been moved to \n\tInvasive bladder cancer  \n.\n\n[iurl]bladdercancersupport.org/smf/index.php?topic=2003.0[/iurl]\t\t\t", "date": "2008-04-01T21:20:03+00:00", "topic": "MOVED: Bummer...", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRosemary--I made an appointment to talk with a nurse there who was familiar with the ins-and-outs of after-cancer donations. You might want to get one of the higher-ups email address and send her your exact BCG concerns so she can investigate it if she isn't already aware of this type of treatment.\n\nJulie--because bladder cancer isn't considered to be a blood cancer, as long as you're cancer-free and a year out of treatment, you should be able to. At least that's how it was explained to me. Your mileage, of course, may vary.\n\nImage removed\t\t\t", "date": "2008-02-12T00:03:38+00:00", "topic": "Can I still donate bone marrow?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\non one hand I would like to go with good report and just be happy, but Id like to be more sure\nPlease, please don't just go with the good report. What Warren says is great advice--have your first turb results looked at by a bladder cancer specialist at a major cancer center.\n\nThere is no way to put a good spin on muscle-invasive bladder cancer, but believe me, you'll be happier *knowing* your situation and all the ramifications and treatments options than you will be *hoping* your \"good news\" turb was the correct one. I--and everyone here--hope that the \"good news\" version is the right diagnosis, but make sure one way or the other.\t\t\t", "date": "2008-01-31T18:45:39+00:00", "topic": " My Doctor gave us good news after a second Tur                 ", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations, Jack. That is absolutely terrific.\n\nZach\t\t\t", "date": "2008-01-28T03:31:37+00:00", "topic": "Cysto Clean-Two Years Without Recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI would be interested to know what my \"calculated\" risk would be.  I'm guessing it to be about 50/50.\nFifty/fifty? Then you might want to check \n\tthis alternate prediction computing device.\n  ;D I rely on it for many of life's important decisions.\n\nSeriously, if you can't get it the original calculator to work, please let me know and I'll download it and run it for you from my own computer (provided it works for me, which it should).\t\t\t", "date": "2007-11-27T18:49:30+00:00", "topic": "Cystos as predictors of recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI could not get this calculator to download, so good luck with it....\nThe link format was incorrect--this link should download the calculator:\n\nwww.eortc.be/tools/bladdercalculator/files/EORTC_Bladder_XP.zip\n\n\nThe site itself (\nwww.eortc.be/tools/bladdercalculator/default.htm\n) says the calculator is used to \"estimate the probability of recurrence and progression in patients with stage Ta T1 bladder cancer based on six different factors:\n\n* Number of tumors\n* Tumor size\n* Prior recurrence rate\n* T category\n* Concomitant carcinoma in situ\n* Grade\"\n\nWithout actually downloading and trying it (it doesn't work with my T3a) the calculator seems quite specific about being for Ta T1 bladder cancer.\n", "date": "2007-11-27T18:49:30+00:00", "topic": "Cystos as predictors of recurrence", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoe, I honestly don't know what the norm is. And I'm not sure if I responded to the anesthesia like other patients do.\n\nFortunately I had my turb on a Thursday so I had time to recover and get back to work on Monday. Maybe that schedule will work for you, too.\n\nHow am I doing today? I'm doing fantastic. My RC was June 23, 2006 and I honestly feel better now than I did before the surgery. I had a couple of glitches along the way, but on the whole I'm happy and healthy and have no complaints.\t\t\t", "date": "2007-11-28T20:14:13+00:00", "topic": "Seek advices", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDitto to what Ross just said. I don't doubt your original doctor, but please get a second opinion at a major cancer center (if you told us where you lived I'm sure someone here could give you advice on facility near you) just because a very experienced bladder cancer specialist can give you some options that your personal urologist might not be able to provide.\n\nYou can read people's experiences with various pouches and diversions all over this forum, and no matter what they had, most seem to be happy with their decision. Like most, I wanted to keep my bladder as well, but now that's I'm a year out from my RC, to tell you the truth I don't miss it a bit. I don't miss it because my neobladder is so trouble-free that I never think about it. It just works.\n\nPlease let us know what you and your doctors decide.\n\nZach\t\t\t", "date": "2007-11-26T19:07:38+00:00", "topic": "Found cancer at ureter opening", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nIt's funny, there are so many things in life that I'd like a 'do over', a chance to do something again.\nDan, the next time you're feeling nostalgic about the good old days, you might enjoy \n\tseeing the fashions from this 1977 JCPenny catalog.\n\n\nI don't regret my RC either. Not for a second. I feel better and healthier now than I did a year ago, and my lack of my original bladder is so inconsequential in the big scheme of things.\t\t\t", "date": "2007-11-16T21:40:33+00:00", "topic": "What exactly does this mean?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe American Urological Association has prepared a new Guideline on the Management of Nonmuscle Invasive Bladder Cancer for professionals.\n\n\nwww.sciencedaily.com/releases/2007/11/071109104726.htm\n\n\nA quick summary:\n\nThe Guideline comes to the following conclusions based on current literature:\n\n* Accurate clinical staging upon which to base treatment decisions is critically important. The panel recommends performing a repeat TURBT prior to intravesical therapy in situations where there is high grade T1 disease without muscularis propria in the specimen and in select cases even when there is muscle present.\n* A single, post-operative instillation of a chemotherapeutic agent may decrease recurrence risk in patients with superficial disease who have undergone uncomplicated resection of the tumor(s).\n* There is no clear superiority of immunotherapy over chemotherapy for low risk disease. Induction courses of either intravesical chemotherapy or immunotherapy (BCG) should be administered in patients with an increased risk of tumor recurrence but low risk of progression.\n* An induction course of mitomycin C in conjunction with maintenance therapy enhances the effectiveness of the drug in preventing recurrence, however, no determinations have been made in regard to optimal maintenance dose, schedule or duration.\n* An induction course of BCG in conjunction with maintenance BCG therapy decreases recurrence and possibly progression in patients with higher risk tumors. Though no determinations on optimal schedule and duration have been made, data is available that supports the SWOG regimen.\n", "date": "2007-11-09T23:33:49+00:00", "topic": "New Guidelines On Non-muscle Invasive Bladder Cancer", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nDan,\n\nWhile I do agree that the decision is ultimately the patients, I also think that by being in a relationship, You often have to put the other person BEFORE yourself.\nI'm not going to speak for Dan, but what I got from his post was that her husband is *not* going to put her desires ahead of his. He's going to do what he wants to do.\n\nAnd no one can change that. No amount of pleading or logic can make an obstinate person change their mind. All she can do is what she has done--present the options in a clear and meaningful way. If he is going to ignore that, well, she either has to 1) back him up, 2) keep on him to change his mind (which doesn't sound like it's working), or 3) accept that he's choosing to go against her wishes for his own, perhaps illogical, reasons--and by accept I don't mean be happy about it, but resign herself and go with whatever the future holds.\n\nNone of those choices are pleasant, but he has his choice of treatments and she has her choice of how to respond. That's it. Unless she can get a court order, she can't make the decision for him.\n\nI wish them both the best, and I hope that he eventually makes the choice that gives him the best chances for a good life. In that light, I don't miss my own bladder a bit.\n\nZach\n\nAfterthought:I do not envy your position right now,  it is a desperate, helpless, and frustrating feeling being the spouse of a Cancer Patient.\nThat's why I felt a lot sorrier for my wife than I ever did for myself. I couldn't imagine dealing with the helpless and powerlessness she must have felt.\t\t\t", "date": "2007-09-15T22:25:56+00:00", "topic": "One Year Later", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI can't complain a bit about the cost of my surgery, because Blue Cross has been tremendous so far.\n\nBut I do have a little story about my TURB, which I had in May of last year. The surgical center, which is fairly new, never got their act together about billing Blue Cross for the procedure, and didn't submit a bill until after the one-year billing-limit had passed.\n\nBecause of the late billing, Blue Cross won't pay them the almost $15K they wanted.\n\nI know billing is complicated and a nuisance, but if a company can't get an invoice out within a year, someone in that department should go back to working for the DMV or wherever they came from... ;D\n\nAnd no, they can't come after us for the loss.\t\t\t", "date": "2007-09-15T21:56:35+00:00", "topic": "Cost of cystoscopy", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat seems to be a problem with this new incarnation of the forum.\n\nWhat you can do is manually insert [qquote] and [/qquote] around what you want to quote.\nI purposely misspelled \"quote\" because they wouldn't show up if I didn't.\n\nSo to quote something:\n\n[qquote] just fix the spelling of the word \"quote\" between the parenthesis and \"cut and paste\" what you want right here[/qqote]\n\n", "date": "2007-07-24T10:38:39+00:00", "topic": "Associations between Exercise and Quality of Life in BC Survivors", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nIF I MAY ASK, WERE THE BCG'S BAD FOR YOU??\nLinda, you may be filling your body with \"FRESH FRUITS AND VEGGIES + 9 VITAMINS\", but you're filling your mind with the worst anti-vitamin of all--worry.\n\nI've read (and believe) that as much as 94 percent of our inner dialogue tends to be about the things we fear, our worries, the people we're angry at, our problems, our concerns and so on.\n\nWe don't have control over the fact that we have cancer, but we can focus on those things over which we have the most control: our thoughts. If we guide our thoughts and actions in accordance with what we see and hear around us - particularly in the media - we're likely to spend your life in a state of anxiety. That's not good or healthy.\n\nInstead we should really concentrate being positive and optimistic even in the face of difficulties. And the bottom line is that our thoughts are all we really have total control over. Instead of asking and wondering in advance how bad our treatment is going to be, be grateful that there is a treatment, and have an attitude of positive expectancy that it's going to be successful. By asking \"WERE THE BCG'S BAD FOR YOU??\" you are adding a layer of negativity that doesn't have to be there. Why not ask \"what were the BCGs like?\" That is the same question without the assumption of it being \"bad\".\n\nIt can't hurt.\n\n", "date": "2007-03-15T21:49:38+00:00", "topic": "Good report today", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nRosie,\n\nYOU WOULD NOT RECOMMEND BCG TREATMENTS IF MY RE-OCCURANCE RETURNS??????\nLinda, that is definitely a question you should discuss with your doctor, who knows the specifics of your unique situation. Would you honestly let the opinion of a layman stranger--however knowledgeable--override the professionals who know your situation and history and prognosis better than anyone here possible could?\n\nEdit--you should definitely talk with your doctor about what Rosie suggests. That makes perfect sense, and I don't mean to imply that your doctor can't learn new tricks or techniques. Folks here have done a lot of research that perhaps your own doctor hasn't read yet, and Rosie may well have knowledge and facts that will be of interest to your physician.\t\t\t", "date": "2007-06-19T22:37:22+00:00", "topic": "why treatment doesn't work?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tTim, that video was absolutely astonishing. I can hardly wait for my wife to get home so I can show her.\n\nAnd that, my friend, was another two minutes and fifty-four seconds I was cancer-free.\n\nThank you. I am, as you Brits say, gobsmacked.\t\t\t", "date": "2007-06-29T16:36:39+00:00", "topic": "Thoughts on European versus U.S. protocols", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nOn a more positive note, my sis lives in calif and when I visit her, as a brit, Im always impressed by the crispy freshness of a lot of the food.\nIf your sister lives anywhere near \n\tour little town of Los Olivos\n I hope you'll let us know in advance.\t\t\t", "date": "2007-06-29T16:36:39+00:00", "topic": "Thoughts on European versus U.S. protocols", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nTim, I understand about the hardware, but was just concerned about your health.  Sounded like you were going to have to go in and have surgery again in which I hope this is not the case.\nTim was referring to the voluntary surgery that I had a few months ago.\n\nA hardware upgrade, so to speak.\n\nHe's a bit jealous....    ", "date": "2007-06-24T17:23:32+00:00", "topic": "How Long?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Linda,\n\nI do have a thought, and please don't take it the wrong way.\n\nWhen you type in ALL CAPS LIKE THIS it is not only difficult to read, but looks like shouting on the screen. Studies have shown that readability is optimized when words are printed in upper and lower case. That's why you'll never see a book or magazine THAT LOOKS LIKE THIS.\n\nThere is an article about readability here:\nplanetoftheweb.com/components/promos.php?id=182&channel=Graphics\n\nTwo of the points it makes are:\n\nDisplay lines set in all capital letters are difficult to read. Body copy set in all caps is totally illegible.\n\nWords set in all caps are read letter by letter. Reading is approximately 15% slower in words set in all caps.\n\nI'm telling you this because now that I'm 50, my eyes aren't as good as they used to be, and I want to be able to read every one of your posts.\n\nAnd I, of course, wish you nothing but excellent results between now and September.\n\nBest,\n\nZach\t\t\t", "date": "2007-06-13T17:45:01+00:00", "topic": "Re-Occuring BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tFunny you guys should bring this up, as this was a *huge* concern of mine.\n\nAs you may know, I spent years in South America, diving in some very nasty river and ocean water. I got quite a few cases of intestinal parasites.\n\nSo I was positive that was what caused my bladder cancer.\n\nWhen I asked Dr. Stein about parasites, he immediately asked me if I'd been to the Middle East, which is the only place these parasites are. Of course the answer was no, and we were back to square one.\t\t\t", "date": "2007-06-27T15:05:29+00:00", "topic": "Egypt parasite responsible for BC", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nZachary why the upper GI bleed?  Have never heard of that one with cysectomy...oral drugs???...Just curious their explanation.\nI developed an ulcer--probably from worry--that perforated an artery in my GI tract. Because I was on blood thinners and baby aspirin, the arterial blood just merrily pumped and pumped and pumped through the little ulcer pinhole all night long.\n\nSo it was *related* to the RC, but not caused by it. The combination of all the circumstances was what ganged up on me. Plus, I had transfusion-free surgery. No blood. So I was already a bit low, and was weaker than usual because of that. USC knew I was low, but the plan was that my blood would restore itself naturally over time. It would have, but the ulcer put a wrench in things.\t\t\t", "date": "2007-06-26T15:44:12+00:00", "topic": "Voiding BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nI would never have to make that fiscal decision re calling an ambulance. not quite yet anyway.\nThe ambulance ride ended up costing over four thousand dollars.\n\nIt was actually two rides; one to our little local hospital, where I was stabilized, and another to a larger hospital where I was actually treated. The second ride had to be in a special ambulance with a nurse and transfusion equipment.\n\nOur insurance coverage pays up to $750 per ambulance trip. That's $1500 out of a $4000 bill. We had to pay the rest.\nYour story also made me think how lucky we are to have the NHS here.\nOh, I wouldn't be too sure of that, my over-taxed friend....\nnews.scotsman.com/index.cfm?id=995812007 ", "date": "2007-06-26T15:44:12+00:00", "topic": "Voiding BCG?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI agree--that's an excellent suggestion, as the main site is an incredible resource.\n\nBut one thing I've noticed is that from the forum, there doesn't seem to be any clear link to the main site.\n\nSo if a new visitor is sent here from a google search, they really wouldn't even know that there was another site affiliated with this forum.\n\nPerhaps Wendy can remedy that.\t\t\t", "date": "2007-06-25T23:22:35+00:00", "topic": "Suggest to ALL", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tD,\nYou're asking a question that you really should be asking your doctor. Everyone here can guess and take stabs in the dark, but when it comes down to it no one can really answer your questions about your specific condition except the professionals that are treating you.\n\nAnd don't be afraid to ask. I write down all my questions in advance so I don't get distracted or forgetful when I'm in his office.\n\nBest wishes,\n\nZach\t\t\t", "date": "2007-06-13T03:35:50+00:00", "topic": "Re: BCG Symptoms", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCheri,\n\nThe \n\tHealth Physics Society\n has a page about the relative safety of CT scans.\n\nOne fact I found interesting was their observation that \"there are places around the world where the natural background radiation dose is as high as 150 mSv per year and the populations living in such areas show no increased incidence of cancer.\"\n\nWe can all choose what we worry about, but this seems to fairly low on the true danger list.\n\nAs always, I wish you, and everyone here, the very best in treatment, outcome, and general happiness.\n\nZach\t\t\t", "date": "2007-06-11T14:08:29+00:00", "topic": "Are CT Scans good or bad for yearly maintenance test of kidneys?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nTell me how?\nYes, I'd love to hear that answer as well. When I was in Dr. Stein's waiting room I seem to recall several well-to-do Europeans who had come to Norris specifically for bladder cancer treatment. You'd think they could have saved lots of time and trouble by just having a more advanced and superior treatment done in Europe. \t\t\t", "date": "2007-06-11T14:08:29+00:00", "topic": "Are CT Scans good or bad for yearly maintenance test of kidneys?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI had my first follow-up from my surgery with Dr. Stein at USC/Norris last week, and I asked him point-black what chance my cancer had of popping up again in the next five years. The American Cancer Society has pretty grim numbers for my situation--T3aN1M0.\n\nDr. Stein said 50%, which are much better odds than the ACS.\n\nWhen I asked him why there was such a difference, he said that, quite frankly, they get better results at Norris.\n\nWhich is a pretty good reason to choose the best hospital and surgeon you can find.\n\nPlus, and this is no small plus, Dr. Stein is a great person as well as an amazing surgeon. I couldn't be more fortunate that my urologist here in Santa Barbara recommended him.\t\t\t", "date": "2007-02-26T17:28:36+00:00", "topic": "Confusing statistics?", "subforum": "8-non-invasive-superficial-bladder-cancer-questions-and-comments"}, {"text": "\nthose \"jelly bean\" looking things..are the lemop nodes ??\nThe yellow ones are the fatty layer surrounding the bladder. The purple ones? I'm not positive. I asked my surgeon about lymph nodes, and if I remember correctly, he told me that they weren't necessarily where you'd look for them, and sometimes there are many bunched together. They don't have quite the symmetry or organization that you'd expect.\t\t\t", "date": "2008-05-17T16:52:30+00:00", "topic": "Stages-What they look like ", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tRight before I left the hospital after my RC, the hospital's dietitian came in to discuss this very topic with us. It might be wise to ask to speak with her before your father is sent home, just to be on the safe side.\t\t\t", "date": "2008-05-07T22:53:24+00:00", "topic": "my dads rc", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\nbladdercancersupport.org/smf/index.php?topic=1450.0\n\n\nbladdercancersupport.org/smf/index.php?topic=213.0\n\n\nbladdercancersupport.org/smf/index.php?topic=1154.0\n\n\nbladdercancersupport.org/smf/index.php?topic=499.0\n", "date": "2008-04-24T19:08:12+00:00", "topic": "Benefits of Neoadjuvant Chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat was an interesting article--I remember well, and just looked it up to remind myself what exactly it said.\n\nOne huge difference between the children and us is that the children received bladders grown from their own bladder cells. Our own bladders are not, of course, good candidates for cell-harvesting since we have already been diagnosed with bladder cancer.\n\n\nwww.childrenshospital.org/newsroom/Site1339/mainpageS1339P1sublevel198.html\n", "date": "2008-05-01T16:19:21+00:00", "topic": "growing new bladder", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\"GO TO USC\"\nI'm going to second that.\n\"GO TO USC\"\n\nThey are such pros at USC/Norris, and bladder cancer is something they deal with day-in and day-out. I couldn't be happier with my decision to go there.\n\nZach\t\t\t", "date": "2008-04-29T14:52:43+00:00", "topic": "Need help in Las Vegas", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm only going to give my one experience having a turb.1-are you always \"knocked-out\" ?I was--and don't remember a thing after the anesthesia.2-how long is \"normal\" turb?I think we were there half a day. You probably shouldn't make plans to go dancing that evening.3-do most people go home same day \"I did.4-how long before path report comes backA couple of days. (again, this is in my case)5-does doc give any info when your in recovery roomBelieve me, you're going to be in no mental shape to ask, answer, or receive any important information. He may talk with whoever brings you, but not you.6-what are reaction to turbIt's funny--I'm a pretty healthy guy in good shape, and the turb really knocked me for a loop for a couple of days. I had the turb on Friday and stayed in bed the entire weekend. On the plus side, I actually didn't mind having the catheter in--those nights following the turb were the first nights in ages that I didn't have to get up during the night.7- how long before back to \"normal\"Remember you're going to be coming home with a catheter, so you won't be back to normal until it is removed. But I felt fine on the fourth day.i understand everyone is different..just looking for some sort of avg\nwhen i had \"scope\" job , ended up with bad infection and had a 2 day in hospital to clear it up..adding to my nervousiveness (sp?)thanking everyone in advance\nSometimes the cup is half empty as well as half full. Let's be realistic. I know you're nervous about this procedure--you have every right to be apprehensive. It's certainly not what you had chosen to do that week. But in a few days it will be over and done with and you'll have the knowledge and information to start an action plan to reclaim your life again.\nNot a bad trade-off.\n\nAnd, quite honestly, I can hardly remember mine, even though it was less than two years ago. In the big scheme of things, it's just a bump in the road.\n\nOne last thought to put this in perspective; right now I have a torn rotator cuff in my right shoulder. It is absolutely excruciating. The cortisone shots helped some, but I'll be having surgery soon. The pain from the rotator cuff is far worse than anything I've every experienced, including the several surgeries I've had for my bladder cancer. So if you've had an injury like that, you're going to be pretty well prepared for anything cancer throws at you.\t\t\t", "date": "2008-04-27T18:37:49+00:00", "topic": "1 st turb", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n...I was scared shitless at the time and getting a hard on was the least of my worries....\nBelieve me, friend, I know exactly how you felt...\n\nBy the way, that ankle-nerve transplant was totally new information to me. Thanks.\t\t\t", "date": "2008-03-27T00:20:30+00:00", "topic": "Nerve Sparing RC Surgery??   Peter K.?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHello Jeff,\n\nAs you've doubtless read here more than once, having your RC (and yes, I'm echoing Dale's sentiments) at a major cancer center by an experienced surgeon is your most important card in the hand you've been recently dealt.\n\nWhere do you live? Perhaps some of the members can give you a recommendation.\n\nBest,\n\nZach\n\nAfterthought--I saw in another post you asked about wearing a bag. Have you or your urologist ruled out a neobladder?\nIf you have any questions I can help with, I'd be happy to give you my experience with this stuff. I'm going to PM you my cell number.\t\t\t", "date": "2008-03-26T19:44:22+00:00", "topic": "When to RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSounds terrific, Joe--sometimes \"out of the ordinary\" can be very good, indeed.\t\t\t", "date": "2008-03-07T19:30:14+00:00", "topic": "Bladder Sparing", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nI'm having my RC/neobladder on March 13.  I was reading the brochure they gave me, and it says that in a normal bladder there is a sphincter below the bladder which helps stop the flow of urine.\n\nIs this sphincter left in place when the neobladder is attached?\nHello Dan,\n\nYou're--in all likelyhood--going to get to keep the external sphincter. Right now it's weaker than your internal sphincter, since you don't use it as much. After your surgery you'll be instructed in exercises (kegels) that will strengthen your sphincter and pelvic muscles so you can be as continent as possible.\n\nZach\t\t\t", "date": "2008-03-03T02:08:13+00:00", "topic": "Neobladder construction ??", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat is fantastic news, but a little scary that it could have turned into an unnecessary procedure--I'm glad you took your own advice.\n\nZach\t\t\t", "date": "2008-02-19T04:39:43+00:00", "topic": "Even at 5 yrs out you can hit a snag!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThat's a pretty good explanation of the various options, Joe--thanks for posting that.\t\t\t", "date": "2008-02-13T19:28:45+00:00", "topic": "Pictures of the 3 Diversions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLisa, don't feel stupid about not knowing everything about this. I feel the same way when I read about some of the superficial treatments--I just don't know anything about them, and, just between you and me, I don't want to. I want to be knowledgeable, but only knowledgeable enough in some things to know that there are others more expert who can answer questions and concerns that I can't.\n\nWhile I'm on the subject, I wish that there was a better term than \"superficial.\" It sounds like it's synonymous with \"minimal,\" when of course it's not.\t\t\t", "date": "2008-01-03T15:31:12+00:00", "topic": "What now...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tLisa, this is a tough one, because it's difficult to write something encouraging without it sounding Pollyanna-ish.\n\nBut I'll tell you what I tried to do during chemo. I tried to remember that I was being helped instead of being hurt. I tried to think of chemo as an investment in my future, and like a lot of investments, they're painful now but pay dividends down the road.\n\nAnd I thought about how my chemo was kicking cancer's ass much more than it was kicking mine. In that way, I was grateful for being sick and nauseous. Because the cancer was feeling even worse.\t\t\t", "date": "2008-01-31T12:46:56+00:00", "topic": "Chemo gets worse how do you cope", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nI am now holding 400 CC and get up 2 times at night.\nFor all of us who live in ounce-land, that comes out to about 13.5 ounces.\n\nPretty impressive!\t\t\t", "date": "2008-01-24T02:29:09+00:00", "topic": "Not Sure Which Type of Pouch to Get ??", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHere's an article on that very subject:\n\ntinyurl.com/35aqjk\n\n\nThis is a TSA page on flying with medications,\n\n\ntinyurl.com/kv3uv\n\n\nThe bottom line, according to the TSA is \"if the liquid medications are in volumes larger than 3 ozs each, they may not be placed in the quart-size bag and must be declared to the Transportation Security Officer. A declaration can be made verbally, in writing, or by a person's companion, caregiver, interpreter, or family member. Declared liquid medications and other liquids for disabilities and medical conditions must be kept separate from all other property submitted for x-ray screening.\"\n\nAnd:\nDisability-related items permitted through the security checkpoint include:\n# Augmentation devices (A catheter is an augmentation device)\n# Ostomy supplies\n\nSo just keep it separate and declare it when going through security. Believe me, these security people deal with many, many people in the same situation you're in. It shouldn't be a problem at all.\t\t\t", "date": "2008-01-20T16:24:05+00:00", "topic": "Self catheterisation and flying (regulations)", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOn the main WebCafe page, if you enter \"Florida\" into the search field, it provides this:\n\nblcwebcafe.org/floridapouch.asp\n\n\n(Just a reminder that there is an absolute wealth of information on the main site in addition to this forum.)\t\t\t", "date": "2008-01-17T18:33:51+00:00", "topic": "Florida Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tBy the way, if you want to see what I was up to in Ecuador, here's an article about it: \ntinyurl.com/3yhg5j\n.\n\nI come into the story in the \"CLAY, SLIME, AND SILT\" part. In the picture of five people standing on the deck, I'm the one on the far right.\n\n\nOne last article:\n\ntinyurl.com/2kbox4\n", "date": "2007-12-22T23:01:43+00:00", "topic": "Decision on type of diversion for RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOne of the qualities we have as humans is that we can get used to just about anything. And I mean that in a good way. I used to live near train tracks, and at first the trains would shock me out of a sound sleep. Soon, I couldn't hear them at all.\n\nThere is certainly no \"best\" diversion in every situation. I'm perfectly happy with my neobladder and Joe (fearandfight) seems fine with his Indiana pouch. But if our situations were reversed, I have no doubt that we'd both be equally happy.\n\nIt's funny how that works. I was once \"boatsitting\" all by myself in Ecuador. The boat was tied to a couple of pilings in the middle of a river, with a long cord strung to shore for power. Right after I got arrived, there was a typical third-world electrical problem and for the rest of my stay--an entire month--I had no electricity for lights or power. For the first couple of days it was a tremendous pain-in-the-neck, but after a bit, I hardly noticed. I read more, listened to music by battery, and rowed ashore for meals. I went to bed early and got up early. What started as a disaster (my thinking at the time) became just part of my routine.\n\nIn the interest of full disclosure, I was awfully glad to get out of there when my month was up.\t\t\t", "date": "2007-12-22T23:01:43+00:00", "topic": "Decision on type of diversion for RC", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCarolyn, it *is* a rotten choice to have to make. There is definitely no getting around that fact. Right now, though, it's the hand you've been dealt, and it's time to get clarity about your situation.\n\nIf it's important to you, ask your doctor about the possibility of bladder-sparing procedures. Ask to talk with other women who have gone through something similar. Not just by email or a forum, but voice-to-voice over the phone. Maybe even in person. I can't imagine anything more comforting then meeting someone who has not only gone through what you're going through, but has come out on the other side. I've been fortunate enough to talk with a couple of men here over the phone, and I could literally--and I do mean literally--hear the tension and fear in their voices almost vanish by the end of the call. Sometimes just talking with someone is all it takes.\n\nWrite down every one of your questions and concerns for your next doctor visit. If you think you might be too upset to ask them, bring along a friend or family member. That way you'll know exactly what to expect and what's expected of you.\n\nYou wrote that nothing can be worse than this waiting. Actually, I think there is something worse, and that's waiting with the fearful uncertainty that comes from unasked and unanswered questions. I think you'll find that when you get your questions answered and a plan for your treatment and progress, the fear moves into the background like a shadow moves away from light.\n\nMark Twain said that when he got up, the first thing he did was read the obituaries, and if he didn't find himself there, he got dressed and went to work. It's up to you, now, to get dressed and go to work. Your job is to get knowledgeable, to get treated, and to get better.\t\t\t", "date": "2007-12-17T00:27:37+00:00", "topic": "Scared", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI'm in the middle of writing something about kegels--I'll post it as soon as I'm finished.\t\t\t", "date": "2007-12-01T03:46:08+00:00", "topic": "Neo-bladder - now an infection", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tCongratulations, Joe. Keep fighting the good fight.\n\nAnother thing to celebrate--on this day, in 1933, Prohibition ended. And it's Walt Disney's birthday.\t\t\t", "date": "2007-12-05T12:58:52+00:00", "topic": "3 Month Follow Up Over", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nHe is gaining weight, he's walking, today when I went over he was doing laundry, dishes and taking out garbage.\nAndrea, please don't post information like this.\n\nMy wife might see it... ;D\t\t\t", "date": "2007-11-17T09:51:14+00:00", "topic": "Pelvic Floor Exercise Reminders", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nBob has started doing the exercises but is experiencing quite a lot of pain. Is he doing too many? We have his reminder watch set for every hour. Could someone possibly describe the technique?\nHere is a post I wrote a while back about kegels--I hope it clarifies things a bit:\n\ntinyurl.com/2yflxu\n", "date": "2007-11-17T09:51:14+00:00", "topic": "Pelvic Floor Exercise Reminders", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n...it's a relief to stop worrying about most of this stuff. I do know it never goes away entirely.\nActually it does. Or rather it can. I think you'll find that when you're doing something you love, thoughts of cancer are pushed so far into the background that they can stay away for quite a while. I just spent a week in Santa Fe and I can honestly say that, except for a couple of times, I didn't think about cancer at all.\n\nThat's saying a lot. A year ago it was all I was thinking about.\n\nYou're right, though. It will never go away entirely, but with luck and a bit of focus, it can stay away for long periods at a time.\t\t\t", "date": "2007-11-15T21:31:04+00:00", "topic": "On to the next stage of recovery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMike, that's a fantastic report. Congratulations, both to you and your wife.\n\nZach\t\t\t", "date": "2007-11-15T21:31:04+00:00", "topic": "On to the next stage of recovery", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nI say to myself just a few more minutes...just a few more minutes..\nI think we've all chanted that particular mantra.\n\nIf there's one thing I've learned in the last year it's that we have to strike \"just a few more minutes\" from our vocabulary. When you have a neobladder and you have to go, the clock is already ticking. That's one of the problems with getting almost back to normal--we start to feel like our formerly invincible (and totally continent) selves. We are--almost. But that \"almost\" can get us into trouble.\n\nI'm still trying to put into practice that when I feel the urge to go, I should go right now. You can procrastinate on a lot of things--haircuts, trips to the dentist, mowing the lawn--but telling your bladder \"just a few more minutes\", especially in public, is a lesson you really don't want to learn the hard way.\t\t\t", "date": "2007-11-14T07:16:57+00:00", "topic": "Neo bladder question", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tJoe, I was gone for a week (to Santa Fe for Thanksgiving) and didn't get to say goodbye to you.\n\nI'm glad I didn't have to.\n\nPlease stay.\n\nZach\t\t\t", "date": "2007-11-27T00:19:14+00:00", "topic": "Friendship", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tHere's a site by an herbalist that claims zeolite *causes* cancer!\n\n\nwww.herbological.com/herblog/?p=20\n\n\nWatchout for “zeolite”. Zeolite is being touted as the latest MLM snake oil… at least down here in Southern Oregon where due to high unemployment and a high proportion of gullible wealthy folk there are lot of people involved in pushing MLM health products from Rain Forest Herbs to “glyconutrients” and stem cell supplements.\n\nI was asked by a patient whether they should take zeolite ( a “volcanic” mineral complex) for their malignancy. A quick down dirty MEDLINE search revealed that zeolite, unlike most MLM scams has hundreds of studies relating to cancer. OOops! I thought for a split second as the downloads started coming that I had been mistaken. Until I started reading them - they are all about how zeolite CAUSES cancer!!\n\nNot only does zeolite cause cancer, it causes pleural mesothelioma. Mesothelioma is the most deadly and almost untreatable form of lung cancer known, and is associated with exposure to asbestos and silicon fiber. The form of zeolite that causes meothelioma is fibrous, and is not the powdered crystal form pushed by the MLMers. But they have been told by their “UPLINE” marketors that zeolite cures cancer (among other things). Like babes in arms the new recruits sally forth promoting a “cancer cure” that causes mesothelioma. Well, ok the “fibrous” form causes mesothelioma not the powdered product. So would you eat ground up asbestos rather than inhale the fiber form? At least have a sales-chat line ready to explain away the embarrassing facts of the carcinogenic properties of the material to people who are not complete morons.\n\nNow, I believe in the inalienable constitutional right of the American citizenry to inflict self abuse by any means, whether high velocity automatic weapons or MLM products. At least as consenting adults in private. What is objectionable is touting them as snake oil cure-alls to people with a cancer diagnosis. And especially my patients.\n\nA single Croatian lab has recently put out TWO lame studies claiming limited antioxidant and anticancer effects for this material. The studies are so underwhelming that one wonders how they were even financed. Half a clove of garlic probably has more anticancer effects than a volcano full of zeolite, and is a lot better for your lungs too. Hmmm. What else is zeolite used for? Well as a silicate based mineral complex (= mud) it has physical adsorbent properties - a little like charcoal or bentonite clay. It can therefore complex certain metal ions, and has been used in industrial animal husbandry (=factory farming) for these purposes. Needless to say, that makes it a miracle “detox”agent - and detox = “cancer cure”.\nCaveat emptor!\n\n\nI think a good rule of thumb is to avoid any cancer cure sold by multi-level-marketers.\t\t\t", "date": "2007-10-29T18:54:56+00:00", "topic": "liquid Cellular Zeolite", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tDid you notice this at the bottom of the page?\n\n*DISCLAIMER: Liquid Zeolite HAS NOT been approved by the FDA as a treatment for cancer or any specific disease. In addition, none of the statements above have been evaluated by the FDA. All content presented on www.zeolite.com has been compiled to provide information about Liquid Cellular Zeolite. Always consult a physician or board certified health practitioner before taking this product. Use at your own risk.\n\nDoes this \"new breakthrough product that works at the cellular level by trapping heavy metals and toxins and safely removing them from the body through the digestive tract\" pass the smell test for you? It doesn't for me. And the fact that one of the ordering options is for the customer to become a distributer doesn't add much credibility.\n\nIf you do try it, they helpfully provide this warning: \"When looking for zeolite it's very important to buy high quality zeolite crystals to ensure that it's pure during the liquidation process. There are lots of low grade imitation zeolite products available, especially on the internet, so make sure you purchase zeolite from a trusted source. Order Cellular Zeolite Here! - We carry The Original Zeolite in it's pure liquid form at discounted prices.\"\n\nSo if you do order it, they certainly sound like the best place! After all, there are some places on the internet that sell \"low grade imitation zeolite products\". You certainly wouldn't want that!   ;D\t\t\t", "date": "2007-10-29T18:54:56+00:00", "topic": "liquid Cellular Zeolite", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMc,\n\nI have to plead ignorance about the Florida pouch. Long ago I decided that I was never going to be, and could never be, an expert on bladder cancer. When I read about different diversions or chemo protocols, my eyes glaze over and I often skip them. I'm officially out of the market for procedures. Once you've had yours, there's no since looking for a better one. I have a friend who has never bought a computer printer because he keeps waiting hoping something better and cheaper and faster comes along. This has been going on for ten years! I think we should decide, do it, and not look backwards.\n\nWhat I am an expert on, though, is my particular situation. I have a neobladder (I'm 51, by the way) and have no difficulties with it. In the beginning there was a learning curve, but with a few months I was fine in the day-time. Nights were another matter; I had an additional surgery to install an artificial sphincter and now I'm fine all the time. In time--that's the operative statement--everything new becomes a normal part of your life. My neobladder is a little different than my old bladder, but I'm so used to it now (after a year) that it's second-nature. It requires absolutely no thought. It... just..... works.\n\nIf you do go the neobladder route I think you'll be pleased. If you go the Indiana route I think you'll be pleased. Likewise with the Florida pouch. The Rhode Island pouch I'm not so sure of.\n\nThis is my short-winded way of telling you that I think you'll do well with whatever you and your surgeon decide on. Of course you've read many posts here on the importance of finding a surgeon who has done many of these procedures.\n\nBest of luck to you.\n\nZach\t\t\t", "date": "2007-10-28T12:50:35+00:00", "topic": "Neobladder v. Florida Pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOne thing I should mention is that I was extremely apprehensive about having my catheter taken out. My mucus volume seemed so high that I couldn't imagine how--without the big tube of a catheter to help--all that mucus could pass through unaided.\n\nMy fear, as usual, was for naught.\n\nAs I've said before, I've never had to self-catheterize and have never had any \"back pressure.\" In fact, the only time I had a panic situation was shortly after my turb when I still had a catheter installed (the \"dam\" was passed after a few minutes of pain).\n\nI'm sure they wanted to keep your dad's catheter in just to be on the safe side, but since it came out prematurely, the advantages of installing it were outweighed by the disadvantages. I'm very glad he's doing well with it out.\n\nZach\t\t\t", "date": "2007-10-24T15:02:07+00:00", "topic": "3 weeks post op, doing pretty well...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nSo, now, he will see him again next Tuesday.  My question I guess is will dad be able to empty himself efficiently? For others that have learned, were you more closely monitored during that time period than weekly? I just think that if he is not able to empty well enough, he can do a lot of damage to the neobladder in a week!! He is not to try working on continence yet, just emptying.  Any thoughts? andrea\nI can only tell you my experience. Two or three weeks after my surgery I went back to USC to have my catheter removed, and that was that. The nurse explained kegels, and I didn't go back to see them for six months.\n\nIf you have concerns, please discuss them with your doctor. One thing to consider, though, is that your dad's bladder needs to expand from lots of liquids, so for a while he's going to be drinking more than he is comfortable with.\t\t\t", "date": "2007-10-24T15:02:07+00:00", "topic": "3 weeks post op, doing pretty well...", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nhi stephany - i'm replying to your question about the stomach pain.  first of all, my husband had cisplatin and gemcitabine (gemzar).  yours is having carboplatin and gemzar.  i don't know what carboplatin is.  are you sure it's not cisplatin?\nCarboplatin is similar to cisplatin but has that has fewer side effects; it is notably less toxic to the kidneys.\t\t\t", "date": "2007-10-16T19:57:46+00:00", "topic": "Finally starting chemo, after yet another screw-up!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\nmy husband's problem with the neobladder was not with the concept of it, but with the fact that there is a possibility that you may have to catheterize yourself through the penis.  he is totally phobic about catheters in the penis. also, you come home from the hospital with a catheter for 3 weeks or more.  but he finally decided to take the long-term view of it and is going to get the neobladder.  let's just hope that when they get in there they're able to do it!\nIf it relieves Mike, please tell him that I've never had to cath at all, or even come close to it. Tim, except for a bit of morbid curiosity, hasn't had to either.\n\nBelieve me, I worried about this plenty. It turned out to be just another thing that I worried about for nothing.\n\nZach\t\t\t", "date": "2007-09-20T23:28:53+00:00", "topic": "Continent Diversion - Indiana pouch - questions and concerns", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n....I barely got out of the bathroom to make it to the surgery!!\nThat's what I was thinking about. Poor Wayne had a long drive.\t\t\t", "date": "2007-10-20T13:35:17+00:00", "topic": "Wayne's World Wife Questions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nWayne is sleeping, it's 7:56am, I have to wake him to get ready to go to the hospital.  We have to be there at 10:00am and surgery is at noon...........\nI had to check-in the afternoon before my 7am surgery for paperwork and nasty drinks--have things changed that much in just a year??\t\t\t", "date": "2007-10-20T13:35:17+00:00", "topic": "Wayne's World Wife Questions", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nOk i'm making up converstations with Zachary...didn't you tell me that you were readmitted to a local hopital with a obstruction and that John was out of the country at the time and his message to the surgeons on the floor was emphatically \"Don't Cut\".......maybe i made up the NG tube...but i did read where that is what they do in some cases.  I'm now searching my archives!!   Pat\nWell, part of that actually happened.\n\nThe whole fascinating story is here:\n\nblcforum.com/smf/index.php/topic,1001.msg6167.html#msg6167\n\n\nBut you might be mixing me up with another somebody or other. It happens.  ;D\t\t\t", "date": "2007-10-16T18:28:32+00:00", "topic": "Bladder/Prostate Removed 9/24/07", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tExcellent, excellent questions, and thanks for sharing the answers.\n\nI've been urging people to make sure they write their questions in advance so that when they're in the doctor's office they don't get so rattled or distracted that they forget what they wanted to know. You obviously put some thought into your questions.\n\nZach\t\t\t", "date": "2007-10-15T23:05:52+00:00", "topic": "one month,post-op appt. here's the poop", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThey gave me simethicone as well, and it eased things but didn't eliminate them.\n\nI hope Harry is letting the nurses and doctors know how much pain he is in. Being the typical guy, I suffered through it until it got so bad I was pushing the the morphine button every chance I got. It didn't help a bit. The simethicone, on the other hand, did help.\t\t\t", "date": "2007-10-02T22:38:19+00:00", "topic": "Harry's surgery was successful", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tNorth Carolina seems to be getting a lot of pixels on this site lately. Now, researchers at Duke University have (perhaps) figured out why we have an appendix.\n\n\n\tThe article is here.\n", "date": "2007-09-13T19:44:45+00:00", "topic": "It's 12:44pm--do you know where your appendix is?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nAs far I read they said it might be used in bladder reconstruction so we already got that part covered with other intestines.\nWhat they use it for is if there is a problem down the line, not for the reconstruction that we've already had. I'd rather have them use my appendix, if necessary, than having them remove more intestine. For those of us over fifty, appendicitis is not common.\n\n\n\n\n\n\n", "date": "2007-09-13T19:44:45+00:00", "topic": "It's 12:44pm--do you know where your appendix is?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOne last piece of advice.\n\nHave an \n\tAdvance Directive\n ready by the time you get to the hospital. By the time you get there you'll be so distracted that it will end up being a mad scramble trying to find one. By the time we were asked about it before my surgery, it was 11pm and no one could find the administrative person who had the right forms.\n\nThe link will take you to a sample, which you can customize.\n\nZach\n\nP.S.--\n\tDo Not Let This Happen To You\n", "date": "2007-09-27T01:48:53+00:00", "topic": "Going into the hospital? I have a suggestion", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSince you're pressed for time you can go to an electronics store (like CompUSA) and get something that looks like this \ntinyurl.com/2z8le2\n. They don't cost much.\n\nIf you don't know how to make an mp3 cd, please let me know and I'll make one and send it up to you (it's not hard, but if you don't know how, and don't have a friend or child who can do it for you, it can be frustrating).\n\nThe reason you want an mp3 cd player is that each cd can hold umpteen hours of audio, as opposed to the one hour max of a regular cd.\n\nZach\t\t\t", "date": "2007-09-27T01:48:53+00:00", "topic": "Going into the hospital? I have a suggestion", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nWith my husband Harry going in for surgery at Stanford on 10/1, this was a great post.  I will definitely let him know your suggestion.  If you have any more, they would be appreciated!!  Thanks.\n\nMargot S.\nOne last thing--you might want to bring some of Harry's personal items (toothbrush, toothpaste, razor, shaving creme, shampoo, that sort of thing) with you to the hospital. I didn't bring any of that; we just expected that it would be kind of like a hotel.\n\nWrong. They didn't provide anything, and much of it wasn't even for sale at the gift shop. And this was USC/Norris, not Hooterville General!\n\nAnother nice thing about bringing an iPod or another player with earphones--when they took out my staples it was a bit painful. When I played some music--LOUD--it distracted me from what was going on. It was a godsend.\t\t\t", "date": "2007-09-27T01:48:53+00:00", "topic": "Going into the hospital? I have a suggestion", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGinger, progress is almost aways two steps forward and one step back.\n\nGene is doing remarkably well, and these little course corrections, to quote from Casablanca, won't amount to a hill of beans in a week.\n\nBest wishes,\n\nZach\t\t\t", "date": "2007-09-17T20:11:52+00:00", "topic": "day 3 after surgey,gene beane, oops!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tIt is quite possible that it is isn't three cancers at all, but is bladder cancer that has (potentially) spread to two other places.\n\nMost likely your doctor will explain to you that what your husband has isn't prostate cancer or (potentially) kidney cancer, but is bladder cancer that has metastasized. It is still technically bladder cancer.\n\nOf course it is possible that he has three distinct types of cancer, but the likelihood is that the bladder cancer has spread.\n\nIn any case, I wish you the best.\n\nZach\t\t\t", "date": "2007-08-16T01:05:51+00:00", "topic": "three kinds of cancer", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nI don't have much faith in PSA tests or maybe even biopsies anymore.\nI do remember during an early consultation, while I was trying to wrap my head around all the doctor was telling me and the room seemed like it was spinning and I was growing lightheaded, thinking that, at the very least, no more prostate exams was definitely a plus.\t\t\t", "date": "2007-08-07T22:51:55+00:00", "topic": "surgery over", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nGotta go carry some more water.\nI think you've earned a break. Turn on a faucet instead.\n\nI'm extremely happy that it went so smoothly.\n\nZach\t\t\t", "date": "2007-08-02T22:06:00+00:00", "topic": "path report is back, and how to tell husband?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nPepa...i think you mean ureters (the tubes that connect each kidney to the bladder)...not uterus\nI kinda wondered the same thing. Scrotal pain and an enlarged uterus seem unlikely in the same person.\t\t\t", "date": "2007-08-14T02:28:21+00:00", "topic": "Surgery OVER!!  So far so good...I think", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tMy initial diagnosis before surgery? Just an invasive tumor.\n\nThe lymph node involvement came with the pathology report after the surgery was over. Of course the lymph node by that time was removed, as was your husband's. I had three rounds of chemo and as far as I can tell I'm perfectly fine.\n\nI'm actually in better shape now than I was before the surgery.\t\t\t", "date": "2007-08-13T01:23:03+00:00", "topic": "one more question about surgery tomorrow", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nDo you know if there are doing a clinical trial on the extensive nodal removal they're doing at USC and is it panning out? I ask because their approach is not yet accepted world wide because of lack of data and I sure hope they put it out there soon; I think they might be on to something.\nWhen I last talked with Dr. Stein on February 21st (six-month checkup), he told me that USC/Norris was statistically getting better results because of the thoroughness and completeness of their procedures.\n\nI didn't specifically ask him about clinical trials. But he was *very* adamant about how important it is to remove and test many lymph nodes. And he doesn't fool around when it does it.\t\t\t", "date": "2007-08-13T01:23:03+00:00", "topic": "one more question about surgery tomorrow", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nKY will plug up the catheters...\nEspecially--especially!--do not be seduced by the commercials with the very happy couple using the \"sensual warming\" version. You definitely do not want to cath with the sensual warming version.\t\t\t", "date": "2007-08-08T18:06:29+00:00", "topic": "Self catheter lubricant jelly", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tStephany, when is your husband going to be discharged?\t\t\t", "date": "2007-08-01T00:11:33+00:00", "topic": "husband just finished surgery....Indiana pouch", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nI'm worried about reoccuring infections once the treatment starts and my immune system goes haywire.\n\nAny experience out there that will help me make the decision to start now or wait until I'm more sure about the infections?\nAre you having infections right now? If not, I'm not sure how waiting will make you more sure about them. Believe me, they will be monitoring you very closely. In my case, I missed a couple of treatments because my blood numbers weren't good enough, even though I felt okay and wanted to go through with them.\n\nAfterthought--this thread should be moved somewhere more appropriate than \"chit chat.\"\n\nAfter-afterthought--I was also very worried about infections. This was mostly from my reading about all the bad things that could happen. I actually bought a new electric razor so I could avoid having to use blades. My oncologist set me straight, and told me just to live as normally as possible, and that my fears were exaggerated. They were. I had no problems with infections, and the chemo went by pretty quickly. You can read about it by clicking the link in my signature.\nI sat next to a guy who was having his first session. He was a strong ex-marine. By the time the oncology nurse got through telling him all the side effects--nausea, fatigue, hair loss--that he *might* experience, this strong, powerful guy was ashen and pessimistic. He was crumbling right before my eyes. And he hadn't even had so much as a band-aid put on him yet. Focus on the good chemo will do, and how short a time you'll have to go through it.\n\nIt won't be nearly as bad as you're thinking it will be.\n\nFinal afterthought, I promise. Get an ipod and get some audio books from audible.com. You'll have several hours of peace and quiet--well, relatively--to listen to them. There are worse ways to spend an afternoon.\n\nZach\t\t\t", "date": "2007-08-08T19:17:39+00:00", "topic": "Timing for chemo", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nJust be straight with me....your guess.....will it be in the lymph nodes?\nYou want me to guess? No, it's not in her lymph nodes.\n\nBut, even if it is, like Patricia said, bladder cancer that has spread isn't necessarily a death sentence.\n\nFor some of us, it's just a semi-colon.\t\t\t", "date": "2007-08-03T02:03:06+00:00", "topic": "Just be straight with me please", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nDo you know if there are any websites evaluating doctors and/or their experience?\nPerhaps one of the MDs who frequent this site can best answer that. There are sites that list the \"Best Doctors in America\" and \"America's Top Doctors,\" and I know they're legit because my own doctor is on them....   I can't vouch for sites where patients vote for doctors because I just don't think that is a very good way of evaluating a physician. Our local paper recently had a \"Best of Santa Barbara\" contest and the winner of the best burrito didn't even serve burritos.\n\nJust for fun, here is a thread about that mysterious burrito:\nnippers.sbwh.com/topic.asp?TOPIC_ID=1336\n\nAll that being said, here is a site that does claim to rate doctors:\nratemds.com/ ", "date": "2007-08-02T18:20:35+00:00", "topic": "How long is normal wait for surgery?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nBut she doesn't want to travel or inconvenience anyone and she's very stubborn.\nPat is so correct on this. And everyone here will tell you that her advice is not only right, it's important that you get your grandmother to do as she suggests. Whether she feels like it or not.\n\nI know that she's an adult and can make her own decisions, but she's making the wrong one here. Perhaps you can talk with the urologist and have him suggest going to a larger facility with a higher volume of BC surgeries. My own urologist was gracious enough to suggest to us that we go to USC/Norris, and that while he could do the surgery, he did only one or two a year.\n\nDo whatever it takes. If you're successful, terrific. If not, well, you tried.\n\n(In the interest of full disclosure, my own grandmother was from Scotland, and pretty stubborn, too. I don't know if I could have convinced her to do something if she'd made up her mind no to.)\n\nGood luck,\n\nZach\t\t\t", "date": "2007-08-02T18:20:35+00:00", "topic": "How long is normal wait for surgery?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nZachary,\nI will have four round of chemo (Gemzar and cisplatin on day one, gemzar on day eight, and then an off week). The one side affect that I haven't read about for this type of chemo is the postential hearing loss.\nNot that my experience will correlate to yours, but I didn't experience any difference in my hearing at all.\n\nBut look on the bright side. This is something you can take advantage of.\n\n\"Dad, can I borrow $20?\" \"Daddy, will you take us to the new Barney movie?\"\n\n\"Sorry kids, I can't hear you!\"\t\t\t", "date": "2007-07-30T14:33:30+00:00", "topic": "They didn't get all the cancer after surgery!", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tI do have some advice on staging that comes from personal experience.\n\nDo NOT become preoccupied with staging or Relative 5-year Survival Rates. It is so easy to forget that your husband is not a statistic or a point of a graph. Your husband is a young man who has had a bad hand dealt to him, but is also fortunate enough to be living close to top-notch treatment and care. We also live in the greatest time in history as far as cancer treatment is concerned. There is a lot to be hopeful and optimistic about.\n\nFind out his staging and treatment options and look forward. Right now you're filled with fear, panic and confusion. As we all were. But after you and your husband and your doctor talk and develop and an action plan for your husband's treatment, you'll feel better. It takes a lot of courage to move forward in the face of uncertainty, but you'll not only feel better, it's your only option.\n\nA question--the N1 means it has spread to a lymph node, and the M1 means it has spread to another organ. In a man, this is usually the prostate. Have they done a biopsy to confirm this, or is this information from CT scans?\n\nI'll post more later after I've given this some more thought.\n\nZach\t\t\t", "date": "2007-07-10T03:59:56+00:00", "topic": "Can someone answer a few questions about staging?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nAs Pat mentioned, an experienced surgeon is of paramount importance for this type of operation.\nAnd \n\there is an article detailing exactly why you want an experienced surgeon\n.\n\nMemorial Sloan-Kettering Cancer Center tracked the outcomes of more than 7,700 men who had their cancerous prostates removed between 1987 and 2003.\n\nThe bottom line?Within five years of their prostate removal, 17.9 percent of men treated by inexperienced surgeons — those who had done just 10 prior operations — had evidence that their cancer was back.\n\nAmong men treated by experienced surgeons — 250 prior operations — 10.7 percent relapsed. ", "date": "2007-07-30T03:03:11+00:00", "topic": "please read this and help me understand", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nEarly May diagnosis, TURB early April, all gone with ilium neo April 25.\nJust a wirlwind memory now....\nDid you mean diagnosis in March? May diagnosis to April TURB seems awfully long.\t\t\t", "date": "2006-07-12T00:39:58+00:00", "topic": "Time from diagnosis to urinary diversion surgury?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tThe problem seems to be with the new software running the forum.\n\nThe poll was created on the old forum software, and the legacy polls and some other details are not 100% compatible with the new software.\n\nAn example is the pictures under names being distorted. The old software allowed vertical photos, while the new software seems to compress every vertical photo into a square. Hence the distortion. And hence my new photo. The solution is to crop your photo into a square.\t\t\t", "date": "2006-07-12T00:39:58+00:00", "topic": "Time from diagnosis to urinary diversion surgury?", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nI go under the knife Wednesday. After all the searching and studying,\nI have chosen the internal neo, if, they can go with it once he's inside.\nJerry, I'll be thinking of you the next few weeks.\n\nBelay that.\n\nWe'll all be thinking of you. You'll be up and around in no time. Better than ever.\n\nBest wishes,\n\nZach\t\t\t", "date": "2007-07-06T22:57:50+00:00", "topic": "Two weeks since my Radical cystectomy", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nAfter my chemo I got a CT Scan of abdomen, pelvis, and chest and that is pretty much standard to see if the chemo has done it's job.\nSame here; except my chemo was after surgery.\n\nI was tempted to bail on the follow-up CT and exams after chemo, though.\n\nWhy?\n\nBecause there's nothing for them to see! It's all gone!  ;D\t\t\t", "date": "2007-06-03T17:30:36+00:00", "topic": "How do we know if chemo has worked", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tAm I the only one who is confused by which one is Ann and which one is Sam?    \n\n\n\nOne thing I'm sure of is that Norris is top-flight. That was a good decision on your part.\t\t\t", "date": "2007-05-30T00:15:24+00:00", "topic": " Need help with a RC recovery wrinkle.", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tYour husband definitely should have had instructions when they removed the catheter.\n\nYes, urinating for him will be a very different experience. The muscles used are like having a bowel movement--he'll soon get the hang of it, though.\n\nHe's still pretty new to this, and it takes time. I wasn't continent in the daytime for three months after my surgery, and nights are still not dry.\n\nWrite down any questions in advance for your doctor.\n\nBest of luck to you both; I'm sure things will be back to semi-normal in due time.\t\t\t", "date": "2007-04-02T16:36:47+00:00", "topic": "Having trouble making neobladder work??", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tGreat news, Joe!\n\nI think having a great attitude like you obviously had played a large part in getting through it.\t\t\t", "date": "2007-05-02T16:33:40+00:00", "topic": "Chemo All Over 5/2", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tSpeaking of attitudes, the other day I was trying to think of at least one thing about cancer that wasn't entirely awful--and I realized that when the bar is set so low that part of having a good day is not wetting your pants in public, it makes having a good day not that difficult a task.\n\nPlus, we've gotten out of some engagements that I really didn't want to go to in the first place--\"sorry, my cancer is acting up....\"\n\nThere's a great quote from the Dalai Lama: \"The enemy is a very good teacher.\" I'm trying to learn to keep my humanity--and my humor--in what is, as we both know, not the best of all possible worlds.\t\t\t", "date": "2007-03-10T04:30:50+00:00", "topic": "NO intestinal segments", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nMy husband finished his cisplatin/ gemzar week before last and is slowly becoming more like himself.\nIf your husband's experience is like mine, you'll be pretty pleased at how fast he perks up.\n\nAnd he's lucky to have someone else do the worrying.   ", "date": "2007-02-14T13:38:56+00:00", "topic": "Treatment Plan Setup-Invassive Tumor", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n\t\t\t\tOne of the things I was *most* concerned about was the mucus from my neobladder blocking my urine flow and having to catheterize myself.\n\nAnd of course I went though the same flushing fears you two had before the catheter was removed.\n\nYou know what? The mucus is the biggest non-event so far. It passes easily, and hasn't caused one second of trouble or concern.\t\t\t", "date": "2006-10-29T11:47:01+00:00", "topic": "Bag Watching", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nHi Zachary\nWhat a great idea I hope all goes well for you.\nLove Clur\nBelieve me, Clur--I have been thinking about you, and your experience is one of the reasons I started writing the blog in the first place.\n\nPlease get better. Actually, don't get better, get well. An important, if subtle, difference.\n\nZach\t\t\t", "date": "2006-10-11T23:51:24+00:00", "topic": "&amp;amp;quot;Standing On My Head&amp;amp;quot;--my chemo blog", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\n...just promise you won't make it too scary for me.\nI can't promise that, but I just updated the blog with the results of my first session with Cisplatin and Gemzar.\n\nSo far, there's nothing that should scare you. It may make my wife mad about her measuring cups, but it should relive some of your fears.\t\t\t", "date": "2006-10-11T23:51:24+00:00", "topic": "&amp;amp;quot;Standing On My Head&amp;amp;quot;--my chemo blog", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nFor example, I like the fact that USC Norris in Los Angeles is doing extensive lymph node removal when they do radical cystectomies(60+ compared with 14-20 at most cancer centers) because I think it correlates with USC's higher long-term survival rates.\nI couldn't agree more. I checked into USC Norris three months ago today for my RC (I'm 49, T3a, N+, M-) by Dr. John Stein, and he removed *85* lymph nodes. That's above and beyond the call of duty. I now have a T-pouch neobladder, but I can't say for certain that the T-pouch procedure is performed elsewhere.\n\nHere is a little more info on the T-pouch:\nwww.tinyurl.com/nj472\n\nAs far as the \"local experts,\" my personal urologist was kind enough to say, \"I do two or three of these a year--at USC they do three or four a week. If I were you, that's where I'd go.\" At first I wasn't happy with this recommendation, since I had already mentally prepared for two weeks in our local hospital, close to home and family and friends. How do I feel now? After I get off the computer, I'm going to write my urologist a thank-you note for his honesty and for his referral to Dr. Stein.\n\nAs far as satisfaction with the neobladder, like many have related here, I was absolutely and totally incontinent for a time. Two-and-a-half months, to be precise. I despaired of ever becoming one of the vast majority of patients that regain continence. Then, about two weeks ago, things began to get much better. Within the last three days I'm almost back to normal--in fact, I hereby resolve to stop answering \"Depends\" when someone asks me how I'm doing.\n\nYou've got a tough row to hoe coming up, but having the right surgeon and hospital will make your life much easier.\n\nBest of luck, pal.\t\t\t", "date": "2006-09-20T11:34:55+00:00", "topic": "Advice on Pouch/Reservoir systems", "subforum": "5-muscle-invasive-bladder-cancer-questions-and-comments"}, {"text": "\nPatricia wrote:Let me know when the Ice Cream runs low!!.......You know i wish nothing but good things for you.    Pat\nHere's a pretty funny story. Patricia was kind enough to Fedex us a case of absolutely delicious ice cream that arrived packed in dry ice.\n\nThe next day a friend came over for a visit and Heidi slipped a piece of the dry ice into the toilet--if you've never seen dry ice interact with water, it bubbles and makes waves of \"smoke\" like in scary movies.\n\nHeidi told him I was too weak to do any work, and there seemed to be a problem with the toilet...could he please look at it?\n\nAfter about thirty seconds in the bathroom, he came out and asked, \"Did Elvira use this last?\"  ", "date": "2008-07-07T19:13:02+00:00", "topic": "Update on...well... me", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tDang, everyone.\n\nI'm humbled and grateful. More than you'll ever know.\n\nZach\t\t\t", "date": "2008-07-15T14:57:40+00:00", "topic": "Zachary,   prayers for you, from the US and ABROAD", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nRobin wrote:Although he could no longer speak, he lifted his chin and puckered up his lips to kiss my mother twice in the hour before he died.\nYou folks will have to excuse me for a moment..I think I have something in my eye...\n\nThat was an incredibly sweet gesture that not only speaks of how he died, but how he lived. May we all leave this world with such grace and dignity and love.\n\nZach\t\t\t", "date": "2008-06-27T23:46:52+00:00", "topic": "Sad news", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI was thinking about this topic earlier today.\n\nThe last time you flew in an airplane, you might have noticed the oxygen compartment located above every seat. There are explicit instructions that say \"In case of an emergency, first secure your own oxygen mask and then, if you have children with you, secure their masks.\"  If caregivers don't take care of themselves first, they aren't doing themselves or their loved ones any real favors. There isn't of course, a magic formula that fits every situation, but please, caregivers, give yourselves a break occasionally. And a pat on the back.\t\t\t", "date": "2008-04-29T23:02:25+00:00", "topic": "Pain Management/ Direct Hospital Admission Route", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tOr... you can link there directly:\n\n\n\tDeborah Rose Stevens * May 4, 1958 - December 2, 2007\n\n\nNice site and very touching memorial. May we all be as loved and as missed.\n\nZach\n\n\n", "date": "2008-03-18T01:37:45+00:00", "topic": "Thank you", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tFrom the Meridian Medical Group FAQ:\n\"Using touch, the practitioner evaluates your energy fields and energy flow in these two positions and balances the structures as needed. He or she may focus on body, mind, or spirit, or all three, depending in where the fields are disturbed or energy is blocked. Throughout the session, attention is given to the skeleton in particular because if contains the deepest and strongest currents. \"\n\n\"Some people describe the experience as \"Expanded awareness\", others \"Pension melting away\"....\n\nThis clinic definitely sounds like a last resort for serious cancer treatment to me. Although I have no doubt many patients will see their \"Pension melt away\", I doubt their cancer will do likewise. If they have empirical evidence to the contrary--not testimonials, not claims, and not metaphysical promotional copy--I'd love to hear more about it.\n\nIf vaguely comforting messages and treatments will make someone feel better and they're okay with that, I have no problem with it. And they are very upfront--wisely--about how they are only to complement traditional treatments (surgery, chemo, radiation), not replace them.\n\nIf it made *my* mother feel better, and if conventional treatment had run its course, I'd drive her myself and bite my tongue. But if her oncologist hadn't given up realistic hope yet, I would pursue that avenue first. Without a doubt and without hesitation.\t\t\t", "date": "2008-02-24T14:39:51+00:00", "topic": "Xeloda &amp;amp;amp; Meridian Medical group", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tWhen I was in the hospital, my wife dutifully called and emailed many, many people to let them know my progress.\n\nAnother way for her to have kept in touch--and I didn't think of it at the time--was to keep a blog.\n\nStudies have shown that cancer patients actually improve when they keep a journal of their thoughts and emotions during this trying time. But since many cancer patients are older and perhaps don't think they have the computer skills to create a blog, I've written a simple step-by-step guide to creating a blog in less than five minutes.\n\n\n\tYou can download it by clicking this link. It's in pdf format.\n", "date": "2007-12-19T19:36:44+00:00", "topic": "How to make a blog in five minutes", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nWith due respect to Zach, I think that there is a difference between \"regional\" or \"local\" such as your father has had, spread going to the upper tract, and spread to distant places, nodes, other organs aside from the urinary tract.\nThat's a fact, and I was under a bit of a time constraint when I originally posted so I gave a very condensed and incomplete answer. Wendy's is not only more comprehensive, it is more correct.\n\nCaring Daughter, if you've lurked here a bit before posting, you've doubtless seen threads about the importance of treating your father at a facility that is not only familiar with bladder cancer, but is expert in treating it. Unless your local hospital is Johns Hopkins or USC/Norris or any of the other major cancer centers, it's worth a consultation with a physician who specializes in bladder cancer.\n\nOops, I see that Pat beat me to the punch on this matter. Dang, she's good.\n\nIn any event, your father may end up having a very good quality of life in spite of what you may be fearing. His life--and yours--is going to feel turned upside down for a while, and I wish you both luck and patience dealing with this.\n\nZach\t\t\t", "date": "2007-11-27T20:03:36+00:00", "topic": "Looking for Information - Cancer travels to Kidneys", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nI have to say that 8 months later my husband is a lot better off not having his bladder removed and doing the treatments necessary to kill this beast, than he would have been if he was butchered, and maimed\nKaren, if your husband had the surgery that so many of us have had, would you consider him butchered and maimed?\n\nMy 18-month follow-up is on March 12 at USC. If Dr. Stein tells us that--in spite of their best efforts--my cancer has spread, I hope no one considers me butchered and maimed. I don't feel that way now, and I won't feel that way then. I hope no one else does either.\t\t\t", "date": "2008-01-19T15:18:12+00:00", "topic": "THIS HAS HAPPENED TOO MANY TIMES!!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nI hope the treatments get easier/ or that we are able to control the side effects better.  This is really a taxing time on him, and the rest of us...I wonder sometimes if it is worth it (between me and you), what are we giving up to MAYBE gain some time?  I understand now the reason some people choose no more treatment.\nThat option is so difficult to even discuss, but I've told my wife that if my cancer spreads further that we'll discuss the situation with Dr. Stein and unless the treatment has a very good chance of success, that we'll just enjoy the time we have left.\n\nI pray that we never have to cross that bridge, and I pray that your family never sees that bridge either. One of the wonderful things about the human mind is how quickly we forget pain and suffering. When your husband's chemo is over, I think you'll be surprised how soon he regains his strength and his determination.\n\nZach\t\t\t", "date": "2007-10-24T10:58:12+00:00", "topic": "Day 6 after Starting new CHEMO regiment of CMV", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tActually I was just reading this thread and feeling that, if this is indeed the case,  there was no way I could be helpful in such an extreme and unfortunate circumstance.\n\nAside from making sure that your father was seen at a major comprehensive cancer center and not just by local doctors, I only have my good wishes and prayers to offer.\n\nSo I'll ask the obvious question--has your father been evaluated at such a facility?\n\nHere is a list of cancer centers and comprehensive cancer centers. The comprehensive cancer centers are indicated by a little blue square next to them:\n\n\ncancercenters.cancer.gov/cancer_centers/cancer-centers-names.html\n\n\nZach\t\t\t", "date": "2007-10-26T20:54:14+00:00", "topic": "Reoccuring Bladder Cancer. Cannot do Surgery. Help!", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nThanks, Zach!  How long have you been off the chemo???  My hair started to fall out about the third treatment so I shaved it and then shaved it again about a month later...now it has stopped falling out and is growing back...did yours stop falling out while you were still going thru chemo????  Did you have the cisplatin/gemzar???\nIf you click on the \"Standing on my head\" part of my signature you can read my entire chemo journal, including the part about missing treatments. I lost not only all my hair (even my chest hair), but I only had to shave every few days--that part wasn't so bad. Yes, I had cisplatin and gemzar.\nI have a lot of swelling in my right leg only and in my abdomen.  It seems to get less with each cycle in the leg...I don't notice a lot of reduction in my abdomen.  But my lymph nodes are only down about 2 cm from 8 cm so still at 6.  I suspect that is why my abdomen is still swollen. I have heard that swelling is typical with this type of chemo...is that your experience???\nMy abdominal swelling is entirely the fault of my wife's delicious cooking. The chemo had nothing to do with it....  ", "date": "2007-08-14T10:24:49+00:00", "topic": "Not sure if this is the right board", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\nMy question is -do all of these missed and reduced treatments warrant additional cycles just because I haven't had the full 100% treatment???  Anyone experience this???\nI was very concerned about this as well, since I missed several treatments due to blood tests that didn't quite make the cut.\n\nMy oncologist assured me that missed treatments are factored into the chemo equation.\n\nBy the way, as soon as the chemo ended I started feeling better almost immediately. Go thou and do likewise.\n\nZach\t\t\t", "date": "2007-08-14T10:24:49+00:00", "topic": "Not sure if this is the right board", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tBack to Pete Best...I've changed my mind.\n\nHe shouldn't kick himself.\n\nHe is/was the poster-child for the bad luck Dr. Stein referred to. And he moved on with what I hope was no regrets. Sometimes these things happen. Most of life is under our control, but occasionally we slip on a banana peel. These banana peels, whether they're cancer or getting kicked out of the Beatles, may be devastating, but we still have to get up and dust ourselves off to the best of our ability.\n\nRegret and recrimination don't work for banana peels, and they don't work for cancer.\n\nBy the way, if there's something you only do once in a blue moon \n\tthen tonight's your chance\n.\t\t\t", "date": "2007-05-30T00:02:28+00:00", "topic": "Causes of Bladder Cancer", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tI was thinking about Kim today, and about those who prey upon desperation.\n\n\n\tParasites like this\n and \n\tscammers like this\n are only too happy to sell us fake cures and miracle beans. I find these two particularly loathsome.\n\nIn our quest for a cure, let's not let our loved ones become victims as well.\t\t\t", "date": "2007-03-01T19:33:42+00:00", "topic": "Diagnosis of &amp;amp;nbsp;Metastatic Bladder Cancer", "subforum": "7-metastatic-bladder-cancer"}, {"text": "\n\t\t\t\tThat's a good question about cancer prevention.\n\nThe answer appears to be...no on really knows. According to the American Cancer Society, those cancer cases which are most preventable are those cancer cases which occur as a result of smoking, drinking alcohol, and being exposed directly to too much sunlight.  And only about one-third of all cancer cases could be prevented by making proper lifestyle choices. I'm not sure I fully believe the latter, but that's what they say.\n\nThe American Institute for Cancer Research has some very simple (and that doesn't necessarily mean easy or simplistic) guidelines for cancer prevention. Here they are:\n\nwww.aicr.org/site/PageServer?pagename=dc_home_guides\n\n\nIn a nutshell:\n1.  Choose mainly plant-based foods and limit red meat and processed meat.\n2.  Be active every day in any way for 30 minutes or more.\n3.  Aim to be a healthy weight throughout life.\n4.  Avoid sugary drinks and processed foods high in added sugar, low in fiber, or high in fat.\n5.  Do not use tobacco in any form.\n6.  Limit consumption of alcohol.\n\nI think you're better off without all the Mountain Dew caffeine, but it doesn't appear that a daily cup of coffee makes any difference.\n\nAn article on vitamins and cancer on MSNBC caught my eye a few days ago. I'm going to quote directly from the piece (which you may read in whole at \ntinyurl.com/35qqdu\n)\n\nThe notion that vitamin supplements are healthful, or at least not harmful, arises from the desire of many people to match the benefits of a healthful diet with a convenient pill, Dr. Tim Byers of the University of Colorado School of Medicine wrote in an editorial accompanying the study.\n\n“Over the past two decades, we have been repeatedly disappointed in the ability of vitamin supplements to reduce risk for cancers at several sites, including the stomach, colorectum, breast and lung,” Byers wrote.\n\n“Foods that are rich in vitamins seem to be associated with reduced risk of cancer, but vitamins packaged as pills clearly do not have the same effect,” Byers added.\n\nFood for thought.\n\nBest wishes,\n\nZach\t\t\t", "date": "2008-03-03T15:19:41+00:00", "topic": "Suggestions?", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tDorthy--as I read your post, I couldn't help but think that it sounded like copy lifted directly from a website.\n\n\"Oriental medicine helps you regain and maintain a unique feeling of health\" is meaningless and vague. Chinese medicine also suggests dried tiger penis for treating men's impotency.\n\nDo you have any thoughts or questions specifically about bladder cancer?\n\nZach\n\nAfter a bit of research, I see that \"Dorthy\" has spammed other sites with this as well, and is part of a website that sells dubious products for everything from hair loss to \"Hemorrhoids killer Pills\".\n\nI'm locking this thread. ", "date": "2008-01-30T06:25:44+00:00", "topic": "Chinese Medicine and Women's Health", "subforum": "10-women-and-bladder-cancer"}, {"text": "\n\t\t\t\tDear Concerned but Happy Daughter,\n\nYou should not have to do one second of research on this. His doctors should have laid out a schedule for follow-ups, and if they didn't, someone should get in touch with his physician and see what his schedule should be.\n\nI'm glad he's doing well!\n\nZach\t\t\t", "date": "2007-07-04T11:53:07+00:00", "topic": "Long Term Experience after Radicalsurgery/Neobladder", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nIf you have a neobladder and you never achieve continence, can you have another surgery to create an Indiana pouch or to provide for an external bag?\nYou might be interested in this thread, which is the option that I chose when I faced that very issue:\n\nbladdercancersupport.org/smf/index.php?topic=814.0\n\n\nI'm still a little surprised that I seem to be the only one here who did this.\t\t\t", "date": "2008-01-25T00:41:45+00:00", "topic": "Neobladder Continence", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nI presently rinse my bladder with salt solution once a week advised by my Urologist.\nInteresting.... haven't heard of that. Once my catheter was removed that was it for irrigation.\nOnce the catheter was removed I could see attached to the end lodged in one of the holes a stitch. It felt pretty hard to touch and each of the three strands making up the stitch was approximately a centimeter in length.\nDo follow Pat's advice--just to be on the safe side.\n\nOn my last follow-up, I was sitting next to a guy in the waiting room who had his RC five or six years ago. He told me that earlier this year, he actually passed a *staple*. During my exam, I told Dr. Stein how happy I was not to have any staples that might come loose. Rude surprise--he told me that I have *plenty* of staples inside me--and that they occasionally do come out.\n\nUsually by the time they come out, they're like pearls--coated with a protective stuff our bodies make. But still, that wasn't what I wanted to hear.\t\t\t", "date": "2008-01-11T16:29:40+00:00", "topic": "Stitch found during bladder cleanse", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nthe staff at the hospital was wonderful in explaining time voiding,kegals etc.  They did not however deal with onset of depression and sense of hopelessness.\nHello Linda,\n\nYour husband is definitely not alone in this. And I don't think you mean he's depressed about his lack of continence, although that is certainly a factor.\n\nDepression is really insidious, sort of like a low-grade infection that never goes away and just wears away at your will. I really agree with Cynthia that he needs to talk with someone about this.\n\nYou didn't really give many details about your husband--his age, his health, whether he's retired or working, what his mental state was like before the diagnosis and surgery--these are all fairly important factors.\n\nAnd right now he's in pain, incontinent, helpless, probably impotent, and feeling very mortal. It's tough to whistle a happy tune when that's the not-so-rosy lens you're looking at the world through. But, and I can't emphasize this enough, it does get better, and it can get great again. Like with any setback, your husband needs to take a long-term view of his situation. In a few months he'll be much better, he'll feel better, and much of his continence will likely be back. I'm 19 months out of my own surgery, and my life is back to where is was. Better, actually.\n\nMy advice to your husband is to focus on the good things in his life and to take a long-term view of his condition. I know that sounds simplistic, but it works. And please check your personal messages.\n\nZach\t\t\t", "date": "2008-01-03T17:20:44+00:00", "topic": "New Neobladder  Please Help", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tGeorge, what the heck does your doctor have to say about this? I'm not going to call it \"bait and switch\" until we know the whole story, but I can certainly see why you were confused.\n\nIf it helps, I had to call AMS once as well when I couldn't figure the darn thing out. But I certainly didn't have to dislocate my shoulder deflating it--that's beyond the call of duty!\n\nZach\t\t\t", "date": "2007-10-12T22:06:31+00:00", "topic": "Penile Implant", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nIrish guy\n...what's your regimen re kegels and drinking at night\nTim, in the States we'd get sued for that....  ;D\t\t\t", "date": "2007-10-27T22:20:14+00:00", "topic": "Peeing", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\t1drin,\nA while back I posted that I was actually glad my diagnosis was such that I needed an RC immediately. When I read about others on this forum having endless BCGs and always, in the back of their minds, worrying about their next cycstoscopy, I'm relieved that I got everything taken care of in one fell swoop.\n\nA year later I'm not only back to normal, I'm in better shape than I was before the surgery. I didn't qualify for nerve-sparing surgery, but other than that, I'm not impacted in any way.\n\nYou'll read lots of advice about choosing a surgeon and hospital where this surgery is routinely performed. Take that advice. I attribute almost every aspect of my success to the skill and experience and knowledge of my surgeon and the nurses who took care of me after I left the operating room. And to my wife, but I don't think I can talk her into looking after you. I was handful enough.\n\nAre there any specific questions that you have that we can help you with?\t\t\t", "date": "2007-10-20T00:06:26+00:00", "topic": "About to go Neo!", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tIt brings new meaning to the phrase \"hard of hearing\"....\t\t\t", "date": "2007-10-19T15:53:15+00:00", "topic": "FDA: Impotence drugs may cause hearing loss", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tWASHINGTON (AP) — Viagra and other impotence drugs are about to bear new warnings that users may experience sudden hearing loss.\n\n\nwww.usatoday.com/news/health/2007-10-18-viagra-hearing-loss_N.htm\n\n\nCould this be a blessing in disguise?   ;D\t\t\t", "date": "2007-10-19T15:53:15+00:00", "topic": "FDA: Impotence drugs may cause hearing loss", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Patricia,\n\nThere is bulb that you squeeze several times to inflate, and yes, you squeeze the sides of the base of the pump to deflate it.\n\nIt's definitely not the most user-friendly design. There is no user-feedback--like a click or something--when you squeeze to deflate it.\n\nWhen I pointed this out to my doctor, he said the very words I didn't want to hear: \"Well, on the new model they have that feature.\"\n\nThe new model?  :'(\n\nZach\n\n", "date": "2007-03-30T02:16:20+00:00", "topic": "My new IPP and my new I(no)PP", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tOh, and the I(no)PP brochure makes a big point that there is not enough stainless steel in the product to set off airport alarms.\n\n ", "date": "2007-03-30T02:16:20+00:00", "topic": "My new IPP and my new I(no)PP", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tHello Ann and Sam,\n\nYes, I'm still recovering from the surgery last Friday. I guess an apt analogy would be \"limping around\".  \n\nI'm going to start a new thread to discuss this further.\n\nZach\t\t\t", "date": "2007-03-28T22:37:38+00:00", "topic": "A ribald selection from the novel &amp;amp;quot;Falstaff&amp;amp;quot;", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tYou and me both, friend.\n\nI've been Superman since June 23rd!\t\t\t", "date": "2007-03-28T22:37:38+00:00", "topic": "A ribald selection from the novel &amp;amp;quot;Falstaff&amp;amp;quot;", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nDefinitely not for the prudish, but hilarious nonetheless.\n\nThis is from the novel \"Falstaff\" by the poet Robert Nye. One of my all time favorite books and one of William Shakespeare's greatest characters. I hope you find it as humorous as I do....especially considering the situation most of us find ourselves in.....\n\n\"...in those dandied days it was my duty to satisfy seven French Matrons a night, and still I couldn't get my cock down with both hands. But this is why I had you called, Friar Brackley . Father, I've a confession to make. A moment of truth. An instant of self-knowledge in an aging soul. Just yesterday, at the end of our New Year revels, I woke up in the morning and took stock of my stick and you know what? I realized that now I can push it down with both hands. Indeed, I'll tell you the truth, I can just about push it down with one hand. That's why I've called for you. A simple question.\n\nFather, do you think I'm getting stronger?\"\n\n", "date": "2007-03-28T22:37:38+00:00", "topic": "A ribald selection from the novel &amp;amp;quot;Falstaff&amp;amp;quot;", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tOuch.\n\nThat's all I have to say for now.\n\nMore to follow.\t\t\t", "date": "2007-03-11T01:24:33+00:00", "topic": "Post Cystectomy ED", "subforum": "6-men-and-bladder-cancer"}, {"text": "\n\t\t\t\tYes, it is only for nerve-spared folk. If you're like me and had your nerves snipped, an implant (or perhaps a funhouse mirror) is the only option.\n\nOff to USC tomorrow...\t\t\t", "date": "2007-03-11T01:24:33+00:00", "topic": "Post Cystectomy ED", "subforum": "6-men-and-bladder-cancer"}, {"text": "\nAnd maybe asking him to accompany you on a walk is the way to start.  You can tell him that you need to walk out some kinks, and need his company.  Some men seem to talk better while facing forward, so a walk or a car ride is an easier way to approach the issue.\nThat is so very true.\n\nI think just a change of scenery can help. I don't believe for a minute that feng shui works because of any mystical reason or because there are luckier places to put a door or window than others, but I do think that it works. Why? Because just moving things around helps. Sitting in a different chair. Reading a new book. Walking a different route. Just doing something... anything... helps with depression.\n\nOf course even though I think changing your routine and scenery can work wonders, many times professional help is needed as well. But starting with just a walk, as Stephany suggests, is a great beginning.\t\t\t", "date": "2007-11-02T19:46:27+00:00", "topic": "Advice for husband", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\nHe is depressed, angry and will not talk to anyone. We live in a rural area with no support groups or therapist.\nI've been hesitating about responding to your question because I wanted to phrase my question just right. Unfortunately I can't. So I'll just blurt it out:\n\nWhat was your husband like before the diagnosis? Did he tend towards depression and anger and silence when confronted with problems?\n\nCancer is a huge shock to the system that magnifies almost everything, but after the initial shock is over I find that most people--in time--return to their pre-diagnosis personality.\n\nIt may be difficult to deal with your husband's response to the situation, but in my opinion being angry is a habit and a choice. And it's his habit and his choice. I'm not saying he chooses being angry because he likes being angry, but only he can make the decision not to speak and act angrily.\n\nI hope that if he chooses not to get help for this that at least you will.\n\nMy best,\n\nZach\t\t\t", "date": "2007-11-02T19:46:27+00:00", "topic": "Advice for husband", "subforum": "20-caregivers-questions-and-comments"}, {"text": "\nThanks Zach...We aren't paying for it...his cousin is a distributer...he is sending it here for free...I am not falling for the \"cure\" aspect but if the juice is healthy and not harmlful...2 oz a day can't hurt...\nI have to admit, if someone gave me some I'd very happily drink them! I love juice!   ;D\n\nAs an aside, when I was first diagnosed and the news spread, we had several people come to the house trying to sell us Mangosteen, which was the cancer-killing-juice-du-jour.\n\nThey didn't bring casseroles or offer to help with house or yard work--they came to sell us MLM juice drinks!\n\nUnbelievable.... \t\t\t", "date": "2008-06-02T02:35:13+00:00", "topic": "Has Anyone Heard or Used MonaVie Juice?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tAnother actual pitch I found for it:\n\n\"All you have to do is share it with friends, family & co-workers and let the juice kick in their bodies!Most of them will ask you how to get it. The only way they can get it is through the distributors which is you and watch the orders roll. and they will tell others about it and so on and on. This juice is new in the U.S. and is going to sweep all over the world. The earlier you become a member and lock your position ahead of those who come in later allowing you to inherit 100% of the business volume and income from those enrolling later.\nThis juice helps the body fight all kinds of diseases: Cancer, Diabetes, Cholesterol, Arthritis,Alzheimer's, Back and muscular pains.\nThis is how it works : You join now for $39 as a distributor and order one case or more at wholesale and the bubble starts to grow and earn you income.\"\n\nLike I said, it may be a fine and delicious juice drink, but the claims its distributors are making are unconscionable. Cancer patients and their families are desperate for anything that may help, and these people prey on (and profit from) that fear. ", "date": "2008-06-02T02:35:13+00:00", "topic": "Has Anyone Heard or Used MonaVie Juice?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI've never heard of it before, but--in my opinion--any drink sold by multi-level-marketers that purports to cure cancer and is trying to round up distributors to sell it doesn't come close to passing the smell test.\n\nHere are some of the purported benefits:\n\n1. Extend Your Life\n2. Increase Your Energy and Strength\n3. Look and Feel Younger\n4. Maintain Healthy Blood Pressure\n5. Prevent Cancer\n6. Maintain Healthy Cholesterol Levels\n7. Promote Normal Blood Sugar and Manage Diabetes\n8. Enhance Sexual Function\n9. Help You Lose Weight\n10. Relieve Headaches and Dizziness\n11. Improve Quality of Sleep\n12. Improve Your Vision\n13. Strengthen Your Heart\n14. Inhibit Lipid Peroxidation\n15. Improve Disease Resistance\n16. Improve Immune Response\n17. Manage and Fight Cancer\n18. Protect Your Precious DNA\n19. Inhibit Tumor Growth\n20. Reduce the Toxic Effects of Chemotherapy and Radiation\n21. Build Strong Blood\n22. Help Chronic Dry Cough\n23. Fight Inflammation and Arthritis\n24. Improve Lymphocyte Count\n25. Treat Menopausal Symptoms\n26. Prevent Morning Sickness\n27. Improve Fertility\n28. Strengthen Your Muscles and Bones\n29. Support Normal Kidney Function\n30. Improve Your Memory\n31. Support Healthy Liver Function\n32. Alleviate Anxiety and Stress\n33. Brighten Your Spirit\n34. Improve Digestion\n35. Maintain Healthy Gums\n36. Fight Fibromyalgia\n37. Prevent Allergies\n38. Protect Children’s Health\n39. Promotes Overall Wellness\n\nAnd \"Doctor\" Lou Niles (N.D.), a \"cancer specialist\" has a promotional video on his site that not only gives information on MonaVie but..and I quote...\"For ONLY $39 Become a MonaVie Distributor & Purchase MonaVie at WHOLESALE HERE\".\n\nIn the promotional video, Dr. Lou has his scrubs on, just like a real doctor who just dashed in from surgery. Of course he can't actually perform surgery, but the effect is nice. And the designation of \"cancer specialist,\" meaningless as it is in his case since it is a self-proclaimed title, also adds an air of legitimacy. Much like the people on infomercials who are identified as \"health researchers\".\n\nIt may be a fine and healthy product, but I find the claims to be reprehensible. Your mileage, of course, may vary.\n", "date": "2008-06-02T02:35:13+00:00", "topic": "Has Anyone Heard or Used MonaVie Juice?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\thttp://render-2.snapfish.com/render2/is=Yup6Gn0%7C%3Dup6RKKt%3Axxr%3D0-qpDPfRt7Pf7mrPfrj7t%3DzrRfDUX%3AeQaQxg%3Dr%3F87KR6xqpxQQo0xlaJx0Jnxv8uOc5xQQQlQGP0PPoQaqpfVtB%3F*KUp7BHSHqqy7XH6gX0QPll%7CRup6aQQ%7C/of=50,328,442\n\n\n\n\n\n\n\nHas anyone ever told you that you look quite a bit like a young Bonnie Rait?\t\t\t", "date": "2008-05-30T03:29:17+00:00", "topic": "Putting a Face with a name", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI saw this posted on Craigslist the other day--thought you might get a kick out of it:\n\nOMG! I Saw My Fiancee's Name And Pic On The Sexual Predator List!\n\nI am SO hurt!! And after living with him for two years now, and having two kids by him--I find THIS out?? He even lied to me about his age--it says he's 57, when he told ME he was 30! We were supposed to be getting married next December, when I turn 18!\n\nThe wedding is OFF!\n\n\n\nNow, you know it's not real, and I know it's not real, but I still laughed out loud when I read it.\n", "date": "2008-05-18T23:05:19+00:00", "topic": "Posted on our local Craigslist", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNo, you haven't done anything wrong--as the Wizard said, \"Ignore that man behind the curtain!\" Ignore that IP number that should have stayed behind the curtain. It's internal housekeeping and a way for other members to report a potential problem post--yours are just fine.\t\t\t", "date": "2008-04-27T18:54:19+00:00", "topic": "Have I done something wrong?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\t..by the Eagle Cam at one of our local islands. She watches it for hours.\n\n\nchil.vcoe.org/eagle_cam.htm\n\n\nHere's a direct link to the live video:\n\nmedia1.vcoe.org/eaglecam1\n", "date": "2008-04-20T23:03:05+00:00", "topic": "My wife is hypnotized...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWe're probably better off drinking those 120 Olympic-sized pools than we are eating one bowl of Cool Whip.  \n\n\njonathanfields.com/blog/horrifying-12-day-cool-whip-experiment/\n\n\nI'm off to USC tomorrow for my 18-month post-RC checkup.\t\t\t", "date": "2008-03-09T22:41:27+00:00", "topic": "our water supply...this is unsettling", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJust to put it in perspective, you'd have to drink 300 million liters of water, equivalent to 120 Olympic-sized pools, just to be at the same concentration of one therapeutic dose.\n\nNot that it's a good thing--unless you believe in homeopathy and you've been prescribed those particular drugs--but there doesn't seem to be any reason to panic.\t\t\t", "date": "2008-03-09T22:41:27+00:00", "topic": "our water supply...this is unsettling", "subforum": "17-chit-chat"}, {"text": "\nThis is almost fifty years old, but some things--like Twinkies--stay fresh forever.\n\nZach\n\nBe Generous\nby W. Clement Stone\n\n\n. . .silver and gold have I none: but such as I have, give I to you . . . (Acts 3:6)\n\n\nBE GENEROUS! Give to those whom you love; give to those who love you; give to the fortunate; give to the unfortunate; yes - give especially to those to whom you don't want to give.\n\nYour most precious, valued possessions and your greatest powers are invisible and intangible. No one can take them. You, and you alone, can give them. You will receive abundance for your giving. The more you give - the more you will have!\n\nGIVE a smile to everyone you meet (smile with your eyes) - and you'll smiles and receive smiles . . .\n\nGIVE a kind word (with a kindly thought behind the word) - you will be kind and receive kind words . . .\n\nGIVE appreciation (warmth from the heart) - you will appreciate and be appreciated . . .\n\nGIVE honor, credit and applause (the victor's wreath) - you will be honorable and receive credit and applause . . .\n\nGIVE time for a worthy cause (with eagerness) - you will be worthy and richly rewarded . . .\n\nGIVE hope (the magic ingredient for success) - you will have hope and be made hopeful . . .\n\nGIVE happiness (a most treasured state of mind) - you will be happy and be made happy . . .\n\nGIVE encouragement (the incentive to action) - you will have courage and be encouraged . . .\n\nGIVE cheer (the verbal sunshine) - you'll be cheerful and cheered . . .\n\nGIVE a pleasant response (the neutralizer of irritants) - you will be pleasant and receive pleasant responses . . .\n\nGIVE good thoughts (nature's character builder) - you will be good and the world will have good thoughts for you . . .\n\nGIVE prayers (the instrument of miracles) for the godless and the godly - you will be reverent and receive blessings - more than you deserve!\n\nBe Generous! GIVE!\n\nSource: Success Unlimited. September 19, 1958, p. 2. \t\t\t", "date": "2008-03-07T21:10:42+00:00", "topic": "Thoughts on Generosity from 1958", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI work with computers and graphics for my day job, and thought I'd pass along an amazing site that can clean your monitor automatically... truly astonishing.\n\n\nwww.linein.org/media/screen_clean.swf\n", "date": "2008-02-15T18:34:51+00:00", "topic": "Amazing automatic screen cleaner", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tGordon, it looks like you're in my neck of the woods--if you're passing through Los Olivos, please let me know!\n\nZach\t\t\t", "date": "2007-07-01T22:35:42+00:00", "topic": "Photos of Nature", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI'm walking out the door in two seconds to go to a bbq, but I wanted to tell you that was the funniest thing I've read in ages.  ;D\n\nZach\t\t\t", "date": "2008-02-09T22:33:12+00:00", "topic": "anyone for haiku?", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNope--dogs, chickens, goats, dogs--one big happy animal family.\t\t\t", "date": "2008-02-11T01:23:50+00:00", "topic": "More of my wife and kids relaxing", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tMuch like Lake Wobegon, it was a beautiful day in Los Olivos today.\n\n\n\n\n\n\n", "date": "2008-02-11T01:23:50+00:00", "topic": "More of my wife and kids relaxing", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIf you can even *think* about cancer watching this video... well... just give it a peek:\n\n\n", "date": "2008-01-24T23:24:39+00:00", "topic": "Two-and-a-half minutes without cancer", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tHi Stephany--your husband can't go wrong smoking a chicken first. My mouth is watering just thinking about it!\n\nThere are some great bbq books out there if he hasn't done much grilling or smoking. I suggest almost anything by Steven Raichlen.\n\nPlease let us know how his smoking adventures turn out!\n\n(I just sold my old smoker on craigslist. The headline I wrote for it was \"Please Start Smoking\").\n\nZach\t\t\t", "date": "2007-12-31T21:05:54+00:00", "topic": "What happens when you leave the gate open", "subforum": "17-chit-chat"}, {"text": "\nMaybe they showed up for some great BBQ cooked in the Big Green Egg!  ;D\nYou have a good eye, my friend.\n\nWe had a wonderful turkey dinner that night--I used chips of apple wood, and it was delicious.\t\t\t", "date": "2007-12-31T21:05:54+00:00", "topic": "What happens when you leave the gate open", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThanks for posting that, Patricia. Gratitude, in all forms, is so often lacking in our lives.\n\nI worked in South America for seven years, and I'll never forget the time I was going to throw away a cheap pair of shoes I bought for the trip (they didn't fit because I'm a typical guy and didn't try them on first--I just held them up to my feet). As I was about to toss them, I saw one of our Ecuadorian workers watching me. I asked if he wanted them and he said yes. Then he almost started crying. He'd never had a new pair of shoes before. He was thirty years old.\n\nI don't take many things for granted anymore. Thanks for reminding me.\t\t\t", "date": "2007-11-27T03:57:19+00:00", "topic": "What happens in Heaven", "subforum": "17-chit-chat"}, {"text": "\nMakes you ponder....what kind of dyes were in the ink you used to publish?\nNone--I just wrote and edited and it was printed far away at a big printing company. I never came in contact with actual physical printing press.\n\nThe whole thing is a coincidence, but it is worthy of a House or CSI episode. We didn't socialize, eat or drink together, and our offices weren't connected. And we shared the building with another magazine, and all their employees are still alive and kicking.\t\t\t", "date": "2007-11-08T20:05:09+00:00", "topic": "My own personal cancer cluster", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tTwenty years ago I was editor of a magazine and worked with two other guys.\n\nOut of the three of us, both of the other two are dead of cancer--one from liver cancer at 47, the other from prostate cancer at 55.\n\nAnd I'm the only one left. With cancer.\n\nWhat are the odds?\n\nImage removed\t\t\t", "date": "2007-11-08T20:05:09+00:00", "topic": "My own personal cancer cluster", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tNever mind, I think I figured it out.\n\nIt started immediately after a girl selling flowers came to our table and asked me if I'd like to buy one for my sweetheart. I told her that I'd love to, but my wife would kill me.\t\t\t", "date": "2007-11-03T19:11:40+00:00", "topic": "Shin pain one year after cystectomy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLast night we were having dinner at our \n\tfavorite Friday night restaurant\n and I got a very sharp pain in my shin.\n\nHas anyone ever had this happen?\t\t\t", "date": "2007-11-03T19:11:40+00:00", "topic": "Shin pain one year after cystectomy", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tWow.\n\nJust....wow.\t\t\t", "date": "2007-10-30T00:20:57+00:00", "topic": "Fire Photo-Check It Now", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tJoe--I can't see it. I hope what Rosemary has isn't contagious...\n\nZach\t\t\t", "date": "2007-10-30T00:20:57+00:00", "topic": "Fire Photo-Check It Now", "subforum": "17-chit-chat"}, {"text": "\nYour right Zach I could not see the pics either with IE and I think this is the reason Rosemary can not view them either she is using IE.I hate to complicate things for you guys, but I use IE7 and I've seen all the pictures and the discussion. It's got to be a setting, or something. Call IT.\nYes, Rosemary, call your IT department...    ;D\n\n(I think we might be Rosemary's IT department).\n\nIt is a mystery, isn't it? If I had to guess, I would think it was either a firewall setting or one of the security settings in IE. (I just launched IE7 again and sure enough, I can't see the picture on this thread). I'm stumped. But if she can see them from work, well, that's what she has to do.\t\t\t", "date": "2007-10-28T18:28:00+00:00", "topic": "Rosemary, a couple of my photos", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIt took me a couple of days to get used to, but I like the new look.\n\nThanks to you both.\n\nZach\t\t\t", "date": "2007-08-10T18:21:50+00:00", "topic": "New look for the WebCafé forum", "subforum": "17-chit-chat"}, {"text": "\nIs DMHO a pesticide or something or a natural occuring substance?\nI suppose you could say it is a naturally occuring substance.\n\nDihydrogen Monoxide is also, except for air, the most life-giving and life-sustaining substances on earth. I make it a point to drink several cups of it every day, and I hope you do too.\n\nIt is truly a miracle product. Unfortunately, it cannot be patented, so Big Drug Companies don't tell you about the amazing product that it is.\n\nDihydrogen Monoxide is another way of saying H2O.\n\nWater.\n\nJust plain.... water.\n\nDepending on what facts you pick and choose, you can make almost anything sound like a deadly killer or a true miracle. A solid chunk of Dihydrogen Monoxide sank the Titanic, but millions die from lack of it in Africa.\n\nIn 1997, Nathan Zohner, a 14-year-old junior high student at Eagle Rock Junior High School in Idaho Falls, Idaho, gathered 43 votes to ban the chemical, out of 50 people surveyed among his classmates. Zohner received the first prize at Greater Idaho Falls Science Fair for analysis of the results of his survey. In recognition of his experiment, journalist James K. Glassman coined the term \"Zohnerism\" to refer to \"the use of a true fact to lead a scientifically and mathematically ignorant public to a false conclusion.\"\t\t\t", "date": "2007-08-13T04:48:57+00:00", "topic": "Dangers of Dihydrogen Monoxide", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tDihydrogen Monoxide (DHMO) is a colorless and odorless chemical compound, also referred to by some as Dihydrogen Oxide, Hydrogen Hydroxide, Hydronium Hydroxide, or simply Hydric acid. Its basis is the unstable radical Hydroxide, the components of which are found in a number of caustic, explosive and poisonous compounds such as Sulfuric Acid, Nitroglycerine and Ethyl Alcohol.\n\nDihydrogen Monoxide is found in detectable and biologically significant levels in virtually all tumors and other cancerous and pre-cancerous growths. Dihydrogen Monoxide itself is not believed to be carcinogenic, although it is known to be a component of a number of cancer-causing agents.\n\nThe chemical compound dihydrogen monoxide (or DHMO) has been implicated in the deaths of thousands of Americans every year, mainly through accidental ingestion. In gaseous form, it can cause severe burns. And, according to a new report, \"the dangers of this chemical do not end there.\"\n\nDHMO is so caustic that it accelerates the corrosion and rusting of many metals and is a major component of acid rain. For those who have developed a dependency on DHMO, complete withdrawal means certain death.\n\nYet the presence of the chemical has been confirmed in every river, stream, lake and reservoir in America.\n\nAlthough the U.S. Government and the Centers for Disease Control (CDC) do not classify Dihydrogen Monoxide as a toxic or carcinogenic substance (as it does with better known chemicals such as hydrochloric acid and benzene), DHMO is a constituent of many known toxic substances, diseases and disease-causing agents, environmental hazards and can even be lethal to humans in quantities as small as a thimbleful.\n\nEach year, Dihydrogen Monoxide is a known causative component in many thousands of deaths and is a major contributor to millions upon millions of dollars in damage to property and the environment. Some of the known perils of Dihydrogen Monoxide are:\n\n\n* Death due to accidental inhalation of DHMO, even in small quantities.\n* Prolonged exposure to solid DHMO causes severe tissue damage.\n* Excessive ingestion produces a number of unpleasant though not typically life-threatening side-effects.\n* DHMO is a major component of acid rain.\n* Gaseous DHMO can cause severe burns.\n\nStudies have shown that even after careful washing, food and produce that has been contaminated by DHMO remains tainted by DHMO.\n\nI believe that Immucothel might even contain a minute amount of DHMO.\t\t\t", "date": "2007-08-13T04:48:57+00:00", "topic": "Dangers of Dihydrogen Monoxide", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tIn the spirit of my philosophy that when you're doing something you love, in this case laughing, for that brief moment you don't have cancer.\n\nThis is a slideshow of when not to hyphenate your name when you get married.\n\n\n\tClick here.\n", "date": "2007-08-01T19:44:27+00:00", "topic": "Your three-minute cancer treatment", "subforum": "17-chit-chat"}, {"text": "\nZach, you quoted, \"Here--she saved it in a format (.png) that doesn't show up on some browswers.\"  What is (.png)? I had it saved as .jpg\n\nAliceYou know, I'm not positive that you did save it as a .png (a newer format than jpeg). When I saved it to my hard drive it saved it as a .png file, which I assume it was originally, even though it had an extention of .jpg.\n\nSomething was amiss; I just can't say exactly what. But I'm glad we can finally see you.   ", "date": "2007-07-01T18:15:07+00:00", "topic": "A more personal situation", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tToo late.\n\nLast picture, and my favorite. This was not staged.\n\nImage removed\t\t\t", "date": "2007-06-27T18:31:11+00:00", "topic": "When I'm not busy growing tumors....", "subforum": "17-chit-chat"}, {"text": "\nBy the way, old dogs are the sweetest. They have a very special place in my heart, and some people, God bless them, actually seek out older dogs to adopt, knowing that they are the hardest to find homes for and are usually the first that are put to sleep at the pound.\nDear Zach,\n\nDid you ever meet my \"daughter\" Ruby?\n\n\n\n\n\n\n\nWe adopted her in Nov. '04, I saw her picture and fell in love. I had no idea then what a wreck she was, poor thing, similar to your dog. She has had many litters of puppies, probably was a puppy mill refugee, found in bad shape on the street. She was bald when we got her...still pretty thin, her coat, but so much better.\n\nShe is also the BEST dog, and gets on well with the cats, the 5 of us sleep together every night.\n\nWendy\nWendy, I hadn't met Ruby, but she looks like she knows a good situation when she sees one!\n\nWe rescued a sweet girl from a puppy mill last year:\nImage removed\nAs you can see, she was probably in a similar situation to your Ruby. I could strangle these puppy mill breeders.\n\nHere's a picture of two of our dogs at our work:\nImage removed\n\nI could go on. Better stop me now while  you can.\n\nZach\t\t\t", "date": "2007-06-27T18:31:11+00:00", "topic": "When I'm not busy growing tumors....", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tI just had my oncologist write a note excusing me from jury duty permanently.\n\nThere aren't many upsides to cancer, but if you look hard enough, there is an occasional, however small, silver lining.\t\t\t", "date": "2007-04-03T20:32:42+00:00", "topic": "No more jury duty--at least that's a plus....", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tLink removed\nBack when I had a more interesting life.\n\nNot that things aren't interesting now....   ", "date": "2007-04-14T16:12:15+00:00", "topic": "An article about.....me!", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tThank you, Sandra.\n\nYou made my day.\t\t\t", "date": "2007-04-09T19:26:40+00:00", "topic": "Just to take your mind off cancer for a moment...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tSometimes, if just for a few moments, we can do something--watch something--enjoy something--and for that brief amount of time we're cancer-free.\n\n“Life consists in what a man is thinking of all day,” said Ralph Waldo Emerson.\n\nSandra, today I'm going to think about you. And I'm thinking your cystoscopy is not only going to be perfect, but it'll be just a small part of a terrific day.\t\t\t", "date": "2007-04-09T19:26:40+00:00", "topic": "Just to take your mind off cancer for a moment...", "subforum": "17-chit-chat"}, {"text": "\n\n\tI think I popped a stitch laughing at this video.\n", "date": "2007-04-09T19:26:40+00:00", "topic": "Just to take your mind off cancer for a moment...", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tOkay.\n\nI know you'd insist on seeing a chicken as well, so here is our Rhode Island Red, Lucy.\n\nImage Removed\t\t\t", "date": "2007-03-30T19:00:03+00:00", "topic": "My wife and kids", "subforum": "17-chit-chat"}, {"text": "\n\t\t\t\tEighty days after my RC, with my beautiful wife (who helped me more than any doctor).\nThis was taken at my 50th birthday party last September.\n\n\nImage removed\n\nBelow are a couple of our kids--Ginger and Maryann.\n(We have six goats, five chickens, two labradors, and two cats. No children.)\n\nImage removed\nImage removed\nImage removed\nImage removed\t\t\t", "date": "2007-03-30T19:00:03+00:00", "topic": "My wife and kids", "subforum": "17-chit-chat"}]}